; ModuleID = '3rhs6no35lzynuur'
source_filename = "3rhs6no35lzynuur"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%Screen = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }

@alloc17 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1
@alloc16 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc17, [16 x i8] c"k\00\00\00\00\00\00\00\8B\01\00\008\00\00\00" }>, align 8
@str.0 = internal constant [28 x i8] c"attempt to add with overflow"
@alloc13 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc12 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc13, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc11 = private unnamed_addr constant <{}> zeroinitializer, align 8
@alloc18 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc17, [16 x i8] c"k\00\00\00\00\00\00\00\8C\01\00\00\0D\00\00\00" }>, align 8
@alloc19 = private unnamed_addr constant <{ [111 x i8] }> <{ [111 x i8] c"unsafe precondition(s) violated: ptr::write_volatile requires that the pointer argument is aligned and non-null" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PI_CHAR_CODE", linkageName: "_ZN3vga12PI_CHAR_CODE17h4726acd58721ed35E", scope: !2, file: !3, line: 28, type: !4, isLocal: true, isDefinition: true, align: 8)
!2 = !DINamespace(name: "vga", scope: null)
!3 = !DIFile(filename: "src/lib.rs", directory: "/Users/yaw/self/theo/vga", checksumkind: CSK_MD5, checksum: "f36befb312e6cd8fb33343ba2d56aea2")
!4 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "VGA_COLOR_TEXT_MODE_ADDR", linkageName: "_ZN3vga24VGA_COLOR_TEXT_MODE_ADDR17had5bac739bdb2b16E", scope: !2, file: !3, line: 66, type: !7, isLocal: true, isDefinition: true, align: 64)
!7 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!8 = !{i32 7, !"PIC Level", i32 2}
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !12, producer: "clang LLVM (rustc version 1.68.0-nightly (0442fbabe 2023-01-10))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !13, globals: !47)
!12 = !DIFile(filename: "src/lib.rs/@/3rhs6no35lzynuur", directory: "/Users/yaw/self/theo/vga")
!13 = !{!14, !25, !43}
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !16, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!15 = !DIFile(filename: "<unknown>", directory: "")
!16 = !DINamespace(name: "v1", scope: !17)
!17 = !DINamespace(name: "rt", scope: !18)
!18 = !DINamespace(name: "fmt", scope: !19)
!19 = !DINamespace(name: "core", scope: null)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Color", scope: !2, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!27 = !DIEnumerator(name: "Black", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "Blue", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "Green", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "Cyan", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "Red", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "Magenta", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "Brown", value: 6, isUnsigned: true)
!34 = !DIEnumerator(name: "LightGray", value: 7, isUnsigned: true)
!35 = !DIEnumerator(name: "DarkGray", value: 8, isUnsigned: true)
!36 = !DIEnumerator(name: "LightBlue", value: 9, isUnsigned: true)
!37 = !DIEnumerator(name: "LightGreen", value: 10, isUnsigned: true)
!38 = !DIEnumerator(name: "LightCyan", value: 11, isUnsigned: true)
!39 = !DIEnumerator(name: "LightRed", value: 12, isUnsigned: true)
!40 = !DIEnumerator(name: "LightMagenta", value: 13, isUnsigned: true)
!41 = !DIEnumerator(name: "Yellow", value: 14, isUnsigned: true)
!42 = !DIEnumerator(name: "White", value: 15, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !2, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !44)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!47 = !{!0, !5}
!48 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h8806d94c64e59660E", scope: !50, file: !49, line: 46, type: !54, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !97, retainedNodes: !95)
!49 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "7ceb660251058cd474b170c1984cef9f")
!50 = !DINamespace(name: "{impl#1}", scope: !51)
!51 = !DINamespace(name: "copied", scope: !52)
!52 = !DINamespace(name: "adapters", scope: !53)
!53 = !DINamespace(name: "iter", scope: !19)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !71}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !57, file: !15, size: 16, align: 8, elements: !58, templateParams: !63, identifier: "96bbb6b088dfcec1d79667a1dad1c4d0")
!57 = !DINamespace(name: "option", scope: !19)
!58 = !{!59}
!59 = !DICompositeType(tag: DW_TAG_variant_part, scope: !56, file: !15, size: 16, align: 8, elements: !60, templateParams: !63, identifier: "c82f8628c73ee1c77590c892cec2825c", discriminator: !70)
!60 = !{!61, !66}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !59, file: !15, baseType: !62, size: 16, align: 8, extraData: i64 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !56, file: !15, size: 16, align: 8, elements: !63, templateParams: !64, identifier: "f8d0edc930bc7f57555fdeea5215fed6")
!63 = !{}
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !59, file: !15, baseType: !67, size: 16, align: 8, extraData: i64 1)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !56, file: !15, size: 16, align: 8, elements: !68, templateParams: !64, identifier: "7850d956dc56da9509ee4bb25d1e335")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !15, baseType: !4, size: 8, align: 8, offset: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagArtificial)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !51, file: !15, size: 128, align: 64, elements: !73, templateParams: !93, identifier: "ac69fda3cb0d9043c355366c5f27037e")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !72, file: !15, baseType: !75, size: 128, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !76, file: !15, size: 128, align: 64, elements: !78, templateParams: !64, identifier: "c0427187c4e80b0a9745f82b29ccca3c")
!76 = !DINamespace(name: "iter", scope: !77)
!77 = !DINamespace(name: "slice", scope: !19)
!78 = !{!79, !86, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !75, file: !15, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !81, file: !15, size: 64, align: 64, elements: !83, templateParams: !64, identifier: "485dee63749e12aaffe0443310e3e272")
!81 = !DINamespace(name: "non_null", scope: !82)
!82 = !DINamespace(name: "ptr", scope: !19)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !80, file: !15, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !75, file: !15, baseType: !85, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !75, file: !15, baseType: !88, align: 8)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !89, file: !15, align: 8, elements: !63, templateParams: !90, identifier: "c166d8b0272a4b4a11b8bf61103d4a5a")
!89 = !DINamespace(name: "marker", scope: !19)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !{!94}
!94 = !DITemplateTypeParameter(name: "I", type: !75)
!95 = !{!96}
!96 = !DILocalVariable(name: "self", arg: 1, scope: !48, file: !49, line: 46, type: !71)
!97 = !{!94, !65}
!98 = !DILocation(line: 46, column: 13, scope: !48)
!99 = !DILocation(line: 47, column: 9, scope: !48)
!100 = !DILocation(line: 48, column: 6, scope: !48)
!101 = distinct !DISubprogram(name: "is_aligned_and_not_null<vga::ScreenChar>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h826ffc42695a456dE", scope: !103, file: !102, line: 2239, type: !104, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !115)
!102 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "4abbeae67c6fb4d14cc68e0d4aa02635")
!103 = !DINamespace(name: "intrinsics", scope: !19)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !107}
!106 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !2, file: !15, size: 16, align: 8, elements: !109, templateParams: !63, identifier: "d9c6a767349110d6923e43ca8debf7c")
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !108, file: !15, baseType: !4, size: 8, align: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !108, file: !15, baseType: !112, size: 8, align: 8, offset: 8)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !2, file: !15, size: 8, align: 8, elements: !113, templateParams: !63, identifier: "59d3688a0d5766be2315101955c558f8")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !112, file: !15, baseType: !4, size: 8, align: 8)
!115 = !{!116}
!116 = !DILocalVariable(name: "ptr", arg: 1, scope: !101, file: !102, line: 2239, type: !107)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "T", type: !108)
!119 = !DILocation(line: 2239, column: 42, scope: !101)
!120 = !DILocation(line: 2240, column: 6, scope: !101)
!121 = !DILocation(line: 2240, column: 5, scope: !101)
!122 = !DILocation(line: 2240, column: 23, scope: !101)
!123 = !DILocation(line: 2241, column: 2, scope: !101)
!124 = !{i8 0, i8 2}
!125 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h3d8c1f4c5364b0e9E", scope: !127, file: !126, line: 394, type: !255, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !257)
!126 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1922c92fc1c52c1aaa242780ad5ab5eb")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !18, file: !15, size: 384, align: 64, elements: !128, templateParams: !63, identifier: "2999e801a3a8c4d69e3759db4fb5985")
!128 = !{!129, !141, !188}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !127, file: !15, baseType: !130, size: 128, align: 64, offset: 128)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !15, size: 128, align: 64, elements: !131, templateParams: !63, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!131 = !{!132, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !130, file: !15, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !15, size: 128, align: 64, elements: !135, templateParams: !63, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !134, file: !15, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !134, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !130, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !127, file: !15, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !57, file: !15, size: 128, align: 64, elements: !143, templateParams: !63, identifier: "e296a96678a3b9cb7cd39f197d0c40a3")
!143 = !{!144}
!144 = !DICompositeType(tag: DW_TAG_variant_part, scope: !142, file: !15, size: 128, align: 64, elements: !145, templateParams: !63, identifier: "8c08bfb4e2e0a1c4db3459d2296ced1e", discriminator: !187)
!145 = !{!146, !183}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !144, file: !15, baseType: !147, size: 128, align: 64, extraData: i64 0)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !142, file: !15, size: 128, align: 64, elements: !63, templateParams: !148, identifier: "ca0ad641e59f5c3a2db445a6e3dfa54")
!148 = !{!149}
!149 = !DITemplateTypeParameter(name: "T", type: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !15, size: 128, align: 64, elements: !151, templateParams: !63, identifier: "b4244e31fb49cb0b2216f62b7ee2cc69")
!151 = !{!152, !182}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !150, file: !15, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !16, file: !15, size: 448, align: 64, elements: !155, templateParams: !63, identifier: "1db6f8992b696b4bcc1969937cfeff4e")
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !154, file: !15, baseType: !139, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !154, file: !15, baseType: !158, size: 384, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !16, file: !15, size: 384, align: 64, elements: !159, templateParams: !63, identifier: "aa6fd283c1c505454f8f004cea98e951")
!159 = !{!160, !162, !163, !165, !181}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !158, file: !15, baseType: !161, size: 32, align: 32, offset: 288)
!161 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !158, file: !15, baseType: !14, size: 8, align: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !15, baseType: !164, size: 32, align: 32, offset: 256)
!164 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !158, file: !15, baseType: !166, size: 128, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !16, file: !15, size: 128, align: 64, elements: !167, templateParams: !63, identifier: "3ee0e41cfa4cd11135b293d1608b6350")
!167 = !{!168}
!168 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !15, size: 128, align: 64, elements: !169, templateParams: !63, identifier: "a0750ae95dc60c1bc4d4485259d9087", discriminator: !180)
!169 = !{!170, !174, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !168, file: !15, baseType: !171, size: 128, align: 64, extraData: i64 0)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !166, file: !15, size: 128, align: 64, elements: !172, templateParams: !63, identifier: "66a4ef8fd1af242f750c2e517d5f9fc5")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !168, file: !15, baseType: !175, size: 128, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !166, file: !15, size: 128, align: 64, elements: !176, templateParams: !63, identifier: "bce24283b3557c85304873f218808703")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !168, file: !15, baseType: !179, size: 128, align: 64, extraData: i64 2)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !166, file: !15, size: 128, align: 64, elements: !63, identifier: "412107e8a334ea95e1682496ddc8e1eb")
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !158, file: !15, baseType: !166, size: 128, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !150, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !144, file: !15, baseType: !184, size: 128, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !142, file: !15, size: 128, align: 64, elements: !185, templateParams: !148, identifier: "cc8145892223b06e8340fef2d442286d")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !184, file: !15, baseType: !150, size: 128, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !127, file: !15, baseType: !189, size: 128, align: 64, offset: 256)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !15, size: 128, align: 64, elements: !190, templateParams: !63, identifier: "8e58abdebb1f2cf6e9f7be432fe7fc59")
!190 = !{!191, !254}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !189, file: !15, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !18, file: !15, size: 128, align: 64, elements: !194, templateParams: !63, identifier: "884ec25ae30bc44333de168fd21f7541")
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !193, file: !15, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !198, file: !15, align: 8, elements: !63, identifier: "9d532f25790bb58a36b667abc9e6780d")
!198 = !DINamespace(name: "{extern#0}", scope: !18)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !193, file: !15, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !196, !222}
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !204, file: !15, size: 8, align: 8, elements: !205, templateParams: !63, identifier: "a94c629a81602404bbeff7937336f7a1")
!204 = !DINamespace(name: "result", scope: !19)
!205 = !{!206}
!206 = !DICompositeType(tag: DW_TAG_variant_part, scope: !203, file: !15, size: 8, align: 8, elements: !207, templateParams: !63, identifier: "6e3f708adecd739d1fb4788a0e24a02", discriminator: !221)
!207 = !{!208, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !206, file: !15, baseType: !209, size: 8, align: 8, extraData: i64 0)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !203, file: !15, size: 8, align: 8, elements: !210, templateParams: !213, identifier: "2efe3ae959db7308a6a5ec965586ce7d")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !15, baseType: !212, align: 8, offset: 8)
!212 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!213 = !{!214, !215}
!214 = !DITemplateTypeParameter(name: "T", type: !212)
!215 = !DITemplateTypeParameter(name: "E", type: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !18, file: !15, align: 8, elements: !63, identifier: "a1bb90968839157163426f7c4e984340")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !206, file: !15, baseType: !218, size: 8, align: 8, extraData: i64 1)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !203, file: !15, size: 8, align: 8, elements: !219, templateParams: !213, identifier: "acbaf1215546e8c598261efd1ae51640")
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !218, file: !15, baseType: !216, align: 8, offset: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagArtificial)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !18, file: !15, size: 512, align: 64, elements: !224, templateParams: !63, identifier: "d1bed3ab664a333148a5936aad54fb6")
!224 = !{!225, !226, !227, !228, !242, !243}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !15, baseType: !164, size: 32, align: 32, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !223, file: !15, baseType: !161, size: 32, align: 32, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !223, file: !15, baseType: !14, size: 8, align: 8, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !223, file: !15, baseType: !229, size: 128, align: 64, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !57, file: !15, size: 128, align: 64, elements: !230, templateParams: !63, identifier: "4d5884c80e38e46e05137c85105b418")
!230 = !{!231}
!231 = !DICompositeType(tag: DW_TAG_variant_part, scope: !229, file: !15, size: 128, align: 64, elements: !232, templateParams: !63, identifier: "7dd79808edf67e371bd394731e08b882", discriminator: !241)
!232 = !{!233, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !231, file: !15, baseType: !234, size: 128, align: 64, extraData: i64 0)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !229, file: !15, size: 128, align: 64, elements: !63, templateParams: !235, identifier: "d384a1ab1ce8328177076cd59470108f")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !231, file: !15, baseType: !238, size: 128, align: 64, extraData: i64 1)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !229, file: !15, size: 128, align: 64, elements: !239, templateParams: !235, identifier: "9b75fc8284830740967b75f2e5afedee")
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !238, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !223, file: !15, baseType: !229, size: 128, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !15, baseType: !244, size: 128, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !15, size: 128, align: 64, elements: !245, templateParams: !63, identifier: "db9dc4480049744d74e142fd1beb39e2")
!245 = !{!246, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !244, file: !15, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !15, align: 8, elements: !63, identifier: "b60d560f2a5a53280e45ab9b3eed701")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !244, file: !15, baseType: !250, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, align: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 3, lowerBound: 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !189, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!127, !130, !189}
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "pieces", arg: 1, scope: !125, file: !126, line: 394, type: !130)
!259 = !DILocalVariable(name: "args", arg: 2, scope: !125, file: !126, line: 394, type: !189)
!260 = !DILocation(line: 394, column: 25, scope: !125)
!261 = !DILocation(line: 394, column: 53, scope: !125)
!262 = !DILocation(line: 395, column: 12, scope: !125)
!263 = !DILocation(line: 395, column: 56, scope: !125)
!264 = !DILocation(line: 395, column: 41, scope: !125)
!265 = !DILocation(line: 398, column: 34, scope: !125)
!266 = !DILocation(line: 398, column: 9, scope: !125)
!267 = !{i64 8}
!268 = !DILocation(line: 399, column: 6, scope: !125)
!269 = !DILocation(line: 396, column: 13, scope: !125)
!270 = distinct !DISubprogram(name: "write_volatile<vga::ScreenChar>", linkageName: "_ZN4core3ptr14write_volatile17h2c8058741a8bfec9E", scope: !82, file: !271, line: 1588, type: !272, scopeLine: 1588, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !275)
!271 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5053a683de81885484ecdfafcccc282c")
!272 = !DISubroutineType(types: !273)
!273 = !{null, !274, !108}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !{!276, !277}
!276 = !DILocalVariable(name: "dst", arg: 1, scope: !270, file: !271, line: 1588, type: !274)
!277 = !DILocalVariable(name: "src", arg: 2, scope: !270, file: !271, line: 1588, type: !108)
!278 = !DILocation(line: 1588, column: 33, scope: !270)
!279 = !DILocation(line: 1588, column: 46, scope: !270)
!280 = !DILocation(line: 1591, column: 9, scope: !270)
!281 = !DILocalVariable(name: "dst", arg: 1, scope: !282, file: !102, line: 2220, type: !274)
!282 = distinct !DISubprogram(name: "runtime<vga::ScreenChar>", linkageName: "_ZN4core3ptr14write_volatile7runtime17h792a6162a25b8d49E", scope: !283, file: !102, line: 2220, type: !284, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !286)
!283 = !DINamespace(name: "write_volatile", scope: !82)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !274}
!286 = !{!281}
!287 = !DILocation(line: 2220, column: 39, scope: !282, inlinedAt: !288)
!288 = distinct !DILocation(line: 1591, column: 9, scope: !270)
!289 = !DILocation(line: 1593, column: 33, scope: !290, inlinedAt: !288)
!290 = !DILexicalBlockFile(scope: !282, file: !271, discriminator: 0)
!291 = !DILocation(line: 2221, column: 20, scope: !282, inlinedAt: !288)
!292 = !DILocation(line: 2223, column: 21, scope: !282, inlinedAt: !288)
!293 = !DILocation(line: 1595, column: 9, scope: !270)
!294 = !DILocation(line: 1597, column: 2, scope: !270)
!295 = distinct !DISubprogram(name: "is_aligned<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$10is_aligned17hac2f841be716039aE", scope: !297, file: !296, line: 1479, type: !104, scopeLine: 1479, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !299)
!296 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d28838f1d3900a938f9a4e5afeddc45")
!297 = !DINamespace(name: "{impl#0}", scope: !298)
!298 = !DINamespace(name: "const_ptr", scope: !82)
!299 = !{!300}
!300 = !DILocalVariable(name: "self", arg: 1, scope: !295, file: !296, line: 1479, type: !107)
!301 = !DILocation(line: 1479, column: 29, scope: !295)
!302 = !DILocation(line: 1483, column: 9, scope: !295)
!303 = !DILocation(line: 1484, column: 6, scope: !295)
!304 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to12runtime_impl17h580735d9a8bb6902E", scope: !305, file: !296, line: 1602, type: !306, scopeLine: 1602, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !309)
!305 = !DINamespace(name: "is_aligned_to", scope: !297)
!306 = !DISubroutineType(types: !307)
!307 = !{!106, !308, !139}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !{!310, !311}
!310 = !DILocalVariable(name: "ptr", arg: 1, scope: !304, file: !296, line: 1602, type: !308)
!311 = !DILocalVariable(name: "align", arg: 2, scope: !304, file: !296, line: 1602, type: !139)
!312 = !DILocation(line: 1602, column: 25, scope: !304)
!313 = !DILocation(line: 1602, column: 41, scope: !304)
!314 = !DILocalVariable(name: "self", arg: 1, scope: !315, file: !296, line: 205, type: !308)
!315 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h0efed735e4336bc7E", scope: !297, file: !296, line: 205, type: !316, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !319, retainedNodes: !318)
!316 = !DISubroutineType(types: !317)
!317 = !{!139, !308}
!318 = !{!314}
!319 = !{!214}
!320 = !DILocation(line: 205, column: 17, scope: !315, inlinedAt: !321)
!321 = distinct !DILocation(line: 1603, column: 13, scope: !304)
!322 = !DILocation(line: 212, column: 18, scope: !315, inlinedAt: !321)
!323 = !DILocation(line: 1603, column: 26, scope: !304)
!324 = !DILocation(line: 1603, column: 13, scope: !304)
!325 = !DILocation(line: 1604, column: 10, scope: !304)
!326 = distinct !DISubprogram(name: "is_aligned_to<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to17h1c798c928380ed18E", scope: !297, file: !296, line: 1596, type: !327, scopeLine: 1596, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !329)
!327 = !DISubroutineType(types: !328)
!328 = !{!106, !107, !139}
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "self", arg: 1, scope: !326, file: !296, line: 1596, type: !107)
!331 = !DILocalVariable(name: "align", arg: 2, scope: !326, file: !296, line: 1596, type: !139)
!332 = !DILocation(line: 1596, column: 32, scope: !326)
!333 = !DILocation(line: 1596, column: 38, scope: !326)
!334 = !DILocalVariable(name: "self", arg: 1, scope: !335, file: !336, line: 2143, type: !139)
!335 = distinct !DISubprogram(name: "is_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15is_power_of_two17h2d0efad81f01ae19E", scope: !337, file: !336, line: 2143, type: !339, scopeLine: 2143, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !341)
!336 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "262dcd21c0bc42a6f0502eabf004a344")
!337 = !DINamespace(name: "{impl#12}", scope: !338)
!338 = !DINamespace(name: "num", scope: !19)
!339 = !DISubroutineType(types: !340)
!340 = !{!106, !139}
!341 = !{!334}
!342 = !DILocation(line: 2143, column: 38, scope: !335, inlinedAt: !343)
!343 = distinct !DILocation(line: 1597, column: 13, scope: !326)
!344 = !DILocalVariable(name: "self", arg: 1, scope: !345, file: !336, line: 88, type: !139)
!345 = distinct !DISubprogram(name: "count_ones", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$10count_ones17h82c7a3b426871328E", scope: !337, file: !336, line: 88, type: !346, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!164, !139}
!348 = !{!344}
!349 = !DILocation(line: 88, column: 33, scope: !345, inlinedAt: !350)
!350 = distinct !DILocation(line: 2144, column: 13, scope: !335, inlinedAt: !343)
!351 = !DILocation(line: 89, column: 13, scope: !345, inlinedAt: !350)
!352 = !DILocation(line: 2144, column: 13, scope: !335, inlinedAt: !343)
!353 = !DILocation(line: 1597, column: 12, scope: !326)
!354 = !DILocalVariable(name: "self", arg: 1, scope: !355, file: !296, line: 60, type: !107)
!355 = distinct !DISubprogram(name: "cast<vga::ScreenChar, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hac19faefd0fabe6cE", scope: !297, file: !296, line: 60, type: !356, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !359, retainedNodes: !358)
!356 = !DISubroutineType(types: !357)
!357 = !{!308, !107}
!358 = !{!354}
!359 = !{!118, !360}
!360 = !DITemplateTypeParameter(name: "U", type: !212)
!361 = !DILocation(line: 60, column: 26, scope: !355, inlinedAt: !362)
!362 = distinct !DILocation(line: 1616, column: 37, scope: !326)
!363 = !DILocation(line: 1616, column: 36, scope: !326)
!364 = !DILocation(line: 1616, column: 18, scope: !326)
!365 = !DILocation(line: 1617, column: 6, scope: !326)
!366 = !DILocation(line: 1598, column: 13, scope: !326)
!367 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null12runtime_impl17h0f4ff55bf0a5e44cE", scope: !368, file: !296, line: 38, type: !369, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !371)
!368 = !DINamespace(name: "is_null", scope: !297)
!369 = !DISubroutineType(types: !370)
!370 = !{!106, !85}
!371 = !{!372}
!372 = !DILocalVariable(name: "ptr", arg: 1, scope: !367, file: !296, line: 38, type: !85)
!373 = !DILocation(line: 38, column: 25, scope: !367)
!374 = !DILocalVariable(name: "self", arg: 1, scope: !375, file: !296, line: 205, type: !85)
!375 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h0f5ad2cfd61db65bE", scope: !297, file: !296, line: 205, type: !376, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !64, retainedNodes: !378)
!376 = !DISubroutineType(types: !377)
!377 = !{!139, !85}
!378 = !{!374}
!379 = !DILocation(line: 205, column: 17, scope: !375, inlinedAt: !380)
!380 = distinct !DILocation(line: 39, column: 13, scope: !367)
!381 = !DILocation(line: 212, column: 18, scope: !375, inlinedAt: !380)
!382 = !DILocation(line: 39, column: 13, scope: !367)
!383 = !DILocation(line: 40, column: 10, scope: !367)
!384 = distinct !DISubprogram(name: "is_null<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h6050deeae8039c0fE", scope: !297, file: !296, line: 36, type: !104, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !385)
!385 = !{!386}
!386 = !DILocalVariable(name: "self", arg: 1, scope: !384, file: !296, line: 36, type: !107)
!387 = !DILocation(line: 36, column: 26, scope: !384)
!388 = !DILocation(line: 53, column: 36, scope: !384)
!389 = !DILocation(line: 53, column: 18, scope: !384)
!390 = !DILocation(line: 54, column: 6, scope: !384)
!391 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17h7c5866f5462d81c1E", scope: !393, file: !392, line: 864, type: !395, scopeLine: 864, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !401)
!392 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e209e33bf0cbeda8e0f6a94101e8fb52")
!393 = !DINamespace(name: "{impl#0}", scope: !394)
!394 = !DINamespace(name: "str", scope: !19)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !134}
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !398, file: !15, size: 128, align: 64, elements: !399, templateParams: !63, identifier: "809d0ba1e76cc12b4314a1d8d23f92f7")
!398 = !DINamespace(name: "iter", scope: !394)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !397, file: !15, baseType: !72, size: 128, align: 64)
!401 = !{!402}
!402 = !DILocalVariable(name: "self", arg: 1, scope: !391, file: !392, line: 864, type: !134)
!403 = !DILocation(line: 864, column: 18, scope: !391)
!404 = !DILocalVariable(name: "self", arg: 1, scope: !405, file: !392, line: 325, type: !134)
!405 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h7085ab343b5fbccdE", scope: !393, file: !392, line: 325, type: !406, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !412)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !134}
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !15, size: 128, align: 64, elements: !409, templateParams: !63, identifier: "1adda6141450f528e36794b66d53eb6c")
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !408, file: !15, baseType: !137, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !408, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!412 = !{!404}
!413 = !DILocation(line: 325, column: 27, scope: !405, inlinedAt: !414)
!414 = distinct !DILocation(line: 865, column: 15, scope: !391)
!415 = !DILocation(line: 327, column: 18, scope: !405, inlinedAt: !414)
!416 = !{i64 1}
!417 = !DILocation(line: 328, column: 6, scope: !405, inlinedAt: !414)
!418 = !DILocation(line: 865, column: 15, scope: !391)
!419 = !DILocation(line: 865, column: 9, scope: !391)
!420 = !DILocation(line: 866, column: 6, scope: !391)
!421 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17h76dfbe0253392b5cE", scope: !423, file: !422, line: 3244, type: !426, scopeLine: 3244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !430, retainedNodes: !428)
!422 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bf613b4a1cd345a3acabbe13500b6e3")
!423 = !DINamespace(name: "Iterator", scope: !424)
!424 = !DINamespace(name: "iterator", scope: !425)
!425 = !DINamespace(name: "traits", scope: !53)
!426 = !DISubroutineType(types: !427)
!427 = !{!72, !75}
!428 = !{!429}
!429 = !DILocalVariable(name: "self", arg: 1, scope: !421, file: !422, line: 3244, type: !75)
!430 = !{!431, !65}
!431 = !DITemplateTypeParameter(name: "Self", type: !75)
!432 = !DILocation(line: 3244, column: 26, scope: !421)
!433 = !DILocation(line: 3249, column: 9, scope: !421)
!434 = !DILocation(line: 3250, column: 6, scope: !421)
!435 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17h5d1a6af4d9636d9eE", scope: !72, file: !49, line: 25, type: !426, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !93, retainedNodes: !436)
!436 = !{!437}
!437 = !DILocalVariable(name: "it", arg: 1, scope: !435, file: !49, line: 25, type: !75)
!438 = !DILocation(line: 25, column: 32, scope: !435)
!439 = !DILocation(line: 26, column: 9, scope: !435)
!440 = !DILocation(line: 27, column: 6, scope: !435)
!441 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17hddc7398a69d5c176E", scope: !443, file: !442, line: 1797, type: !454, scopeLine: 1797, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !64, retainedNodes: !456)
!442 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfd297b9c6b096408864871383128e79")
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !57, file: !15, size: 64, align: 64, elements: !444, templateParams: !63, identifier: "26f9a9290037437cf5e74ea9fc8f5049")
!444 = !{!445}
!445 = !DICompositeType(tag: DW_TAG_variant_part, scope: !443, file: !15, size: 64, align: 64, elements: !446, templateParams: !63, identifier: "6873233935f20b68ef79897cb5c85352", discriminator: !453)
!446 = !{!447, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !445, file: !15, baseType: !448, size: 64, align: 64, extraData: i64 0)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !443, file: !15, size: 64, align: 64, elements: !63, templateParams: !90, identifier: "9c29e2527387e673e32f38ff62679856")
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !445, file: !15, baseType: !450, size: 64, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !443, file: !15, size: 64, align: 64, elements: !451, templateParams: !90, identifier: "c8bbcd7166d96a31a9e7312be64cf888")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !15, baseType: !92, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!454 = !DISubroutineType(types: !455)
!455 = !{!56, !443}
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !442, line: 1797, type: !443)
!458 = !DILocalVariable(name: "v", scope: !459, file: !442, line: 1804, type: !4, align: 1)
!459 = distinct !DILexicalBlock(scope: !441, file: !442, line: 1804, column: 13)
!460 = !DILocation(line: 1797, column: 25, scope: !441)
!461 = !DILocation(line: 1803, column: 15, scope: !441)
!462 = !DILocation(line: 1803, column: 9, scope: !441)
!463 = !DILocation(line: 1805, column: 21, scope: !441)
!464 = !DILocation(line: 1804, column: 19, scope: !441)
!465 = !DILocation(line: 1804, column: 19, scope: !459)
!466 = !DILocation(line: 1804, column: 25, scope: !459)
!467 = !DILocation(line: 1804, column: 31, scope: !441)
!468 = !DILocation(line: 1807, column: 6, scope: !441)
!469 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17hbaa81bb7e07e3282E", scope: !471, file: !470, line: 272, type: !473, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !477, retainedNodes: !475)
!470 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "697d559cdba63f105535b8b53d6ea422")
!471 = !DINamespace(name: "{impl#0}", scope: !472)
!472 = !DINamespace(name: "collect", scope: !425)
!473 = !DISubroutineType(types: !474)
!474 = !{!397, !397}
!475 = !{!476}
!476 = !DILocalVariable(name: "self", arg: 1, scope: !469, file: !470, line: 272, type: !397)
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "I", type: !397)
!479 = !DILocation(line: 272, column: 18, scope: !469)
!480 = !DILocation(line: 274, column: 6, scope: !469)
!481 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hb1d3584ca01abec3E", scope: !483, file: !482, line: 236, type: !484, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !487)
!482 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "8af55c0216ad1e43a6c641f383188711")
!483 = !DINamespace(name: "{impl#9}", scope: !398)
!484 = !DISubroutineType(types: !485)
!485 = !{!56, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !{!488}
!488 = !DILocalVariable(name: "self", arg: 1, scope: !481, file: !482, line: 236, type: !486)
!489 = !DILocation(line: 236, column: 13, scope: !481)
!490 = !DILocation(line: 237, column: 9, scope: !481)
!491 = !DILocation(line: 238, column: 6, scope: !481)
!492 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga9ColorCode3new17h16b97ec6d351d0ddE", scope: !112, file: !3, line: 35, type: !493, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!112, !25, !25}
!495 = !{!496, !497}
!496 = !DILocalVariable(name: "fg", arg: 1, scope: !492, file: !3, line: 35, type: !25)
!497 = !DILocalVariable(name: "bg", arg: 2, scope: !492, file: !3, line: 35, type: !25)
!498 = !DILocation(line: 35, column: 12, scope: !492)
!499 = !DILocation(line: 35, column: 23, scope: !492)
!500 = !DILocation(line: 36, column: 20, scope: !492)
!501 = !DILocation(line: 36, column: 19, scope: !492)
!502 = !{i8 0, i8 16}
!503 = !DILocation(line: 36, column: 38, scope: !492)
!504 = !DILocation(line: 36, column: 37, scope: !492)
!505 = !DILocation(line: 36, column: 9, scope: !492)
!506 = !DILocation(line: 37, column: 6, scope: !492)
!507 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga10ScreenChar3new17h03985c2798fb4da3E", scope: !108, file: !3, line: 48, type: !508, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!108, !4}
!510 = !{!511}
!511 = !DILocalVariable(name: "c", arg: 1, scope: !507, file: !3, line: 48, type: !4)
!512 = !DILocation(line: 48, column: 12, scope: !507)
!513 = !DILocation(line: 51, column: 40, scope: !507)
!514 = !DILocation(line: 51, column: 54, scope: !507)
!515 = !DILocation(line: 51, column: 25, scope: !507)
!516 = !DILocation(line: 49, column: 9, scope: !507)
!517 = !DILocation(line: 53, column: 6, scope: !507)
!518 = distinct !DISubprogram(name: "inverse", linkageName: "_ZN3vga10ScreenChar7inverse17h5488084c9160ff3bE", scope: !108, file: !3, line: 55, type: !508, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !519)
!519 = !{!520}
!520 = !DILocalVariable(name: "c", arg: 1, scope: !518, file: !3, line: 55, type: !4)
!521 = !DILocation(line: 55, column: 16, scope: !518)
!522 = !DILocation(line: 58, column: 40, scope: !518)
!523 = !DILocation(line: 58, column: 54, scope: !518)
!524 = !DILocation(line: 58, column: 25, scope: !518)
!525 = !DILocation(line: 56, column: 9, scope: !518)
!526 = !DILocation(line: 60, column: 6, scope: !518)
!527 = distinct !DISubprogram(name: "x", linkageName: "_ZN3vga6Cursor1x17hde7d91f1017a0805E", scope: !528, file: !3, line: 89, type: !535, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !538)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !2, file: !15, size: 128, align: 64, elements: !529, templateParams: !63, identifier: "fa8c7fe6a86023dde54a31a3a3a44ca0")
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !528, file: !15, baseType: !531, size: 128, align: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !2, file: !15, size: 128, align: 64, elements: !532, templateParams: !63, identifier: "5de506efaaebb77d867a38078572582d")
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !531, file: !15, baseType: !139, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !531, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!139, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&vga::Cursor", baseType: !528, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !{!539}
!539 = !DILocalVariable(name: "self", arg: 1, scope: !527, file: !3, line: 89, type: !537)
!540 = !DILocation(line: 89, column: 10, scope: !527)
!541 = !DILocation(line: 90, column: 9, scope: !527)
!542 = !DILocation(line: 91, column: 6, scope: !527)
!543 = distinct !DISubprogram(name: "y", linkageName: "_ZN3vga6Cursor1y17h84bd26043726a385E", scope: !528, file: !3, line: 92, type: !535, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !544)
!544 = !{!545}
!545 = !DILocalVariable(name: "self", arg: 1, scope: !543, file: !3, line: 92, type: !537)
!546 = !DILocation(line: 92, column: 10, scope: !543)
!547 = !DILocation(line: 93, column: 9, scope: !543)
!548 = !DILocation(line: 94, column: 6, scope: !543)
!549 = distinct !DISubprogram(name: "incr_x", linkageName: "_ZN3vga6Cursor6incr_x17h2ed1025ed77442b1E", scope: !528, file: !3, line: 96, type: !550, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !553)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Cursor", baseType: !528, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !{!554}
!554 = !DILocalVariable(name: "self", arg: 1, scope: !549, file: !3, line: 96, type: !552)
!555 = !DILocation(line: 96, column: 15, scope: !549)
!556 = !DILocation(line: 97, column: 9, scope: !549)
!557 = !DILocation(line: 98, column: 6, scope: !549)
!558 = distinct !DISubprogram(name: "width", linkageName: "_ZN3vga6Screen5width17h6a4ad53d4d85d478E", scope: !559, file: !3, line: 137, type: !577, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !580)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !2, file: !15, size: 1728, align: 64, elements: !560, templateParams: !63, identifier: "48f3688b562a6e08f146612adee49c2f")
!560 = !{!561, !562, !563, !564, !575, !576}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !559, file: !15, baseType: !139, size: 64, align: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !559, file: !15, baseType: !528, size: 128, align: 64, offset: 1280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !559, file: !15, baseType: !531, size: 128, align: 64, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !559, file: !15, baseType: !565, size: 64, align: 64, offset: 1600)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !566, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !2, file: !15, size: 32000, align: 8, elements: !567, templateParams: !63, identifier: "2d046e23d95a698c10be6c15548577a5")
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !566, file: !15, baseType: !569, size: 32000, align: 8)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 32000, align: 8, elements: !573)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1280, align: 8, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 80, lowerBound: 0)
!573 = !{!574}
!574 = !DISubrange(count: 25, lowerBound: 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !559, file: !15, baseType: !43, size: 8, align: 8, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !559, file: !15, baseType: !570, size: 1280, align: 8)
!577 = !DISubroutineType(types: !578)
!578 = !{!139, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&vga::Screen", baseType: !559, size: 64, align: 64, dwarfAddressSpace: 0)
!580 = !{!581}
!581 = !DILocalVariable(name: "self", arg: 1, scope: !558, file: !3, line: 137, type: !579)
!582 = !DILocation(line: 137, column: 14, scope: !558)
!583 = !DILocation(line: 138, column: 9, scope: !558)
!584 = !DILocation(line: 139, column: 6, scope: !558)
!585 = distinct !DISubprogram(name: "height", linkageName: "_ZN3vga6Screen6height17h70236990ac54bcecE", scope: !559, file: !3, line: 141, type: !577, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !586)
!586 = !{!587}
!587 = !DILocalVariable(name: "self", arg: 1, scope: !585, file: !3, line: 141, type: !579)
!588 = !DILocation(line: 141, column: 15, scope: !585)
!589 = !DILocation(line: 142, column: 9, scope: !585)
!590 = !DILocation(line: 143, column: 6, scope: !585)
!591 = distinct !DISubprogram(name: "top_down_flow_screen", linkageName: "_ZN3vga6Screen20top_down_flow_screen17h92a6c791eea66cb3E", scope: !559, file: !3, line: 145, type: !592, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{!559, !565, !570}
!594 = !{!595, !596, !597}
!595 = !DILocalVariable(name: "buf", arg: 1, scope: !591, file: !3, line: 145, type: !565)
!596 = !DILocalVariable(name: "blank_row", arg: 2, scope: !591, file: !3, line: 145, type: !570)
!597 = !DILocalVariable(name: "origin_dot", scope: !598, file: !3, line: 146, type: !531, align: 8)
!598 = distinct !DILexicalBlock(scope: !591, file: !3, line: 146, column: 9)
!599 = !DILocation(line: 145, column: 29, scope: !591)
!600 = !DILocation(line: 145, column: 55, scope: !591)
!601 = !DILocation(line: 146, column: 13, scope: !598)
!602 = !DILocation(line: 146, column: 26, scope: !591)
!603 = !DILocation(line: 149, column: 35, scope: !598)
!604 = !DILocation(line: 149, column: 21, scope: !598)
!605 = !DILocation(line: 150, column: 24, scope: !598)
!606 = !DILocation(line: 152, column: 21, scope: !598)
!607 = !DILocation(line: 147, column: 9, scope: !598)
!608 = !DILocation(line: 155, column: 6, scope: !591)
!609 = distinct !DISubprogram(name: "bottom_up_flow_screen", linkageName: "_ZN3vga6Screen21bottom_up_flow_screen17h9b8931c8ab3869b6E", scope: !559, file: !3, line: 157, type: !592, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !610)
!610 = !{!611, !612, !613, !615}
!611 = !DILocalVariable(name: "buf", arg: 1, scope: !609, file: !3, line: 157, type: !565)
!612 = !DILocalVariable(name: "blank_row", arg: 2, scope: !609, file: !3, line: 157, type: !570)
!613 = !DILocalVariable(name: "perceived_y", scope: !614, file: !3, line: 158, type: !139, align: 8)
!614 = distinct !DILexicalBlock(scope: !609, file: !3, line: 158, column: 9)
!615 = !DILocalVariable(name: "origin_dot", scope: !616, file: !3, line: 159, type: !531, align: 8)
!616 = distinct !DILexicalBlock(scope: !614, file: !3, line: 159, column: 9)
!617 = !DILocation(line: 157, column: 30, scope: !609)
!618 = !DILocation(line: 157, column: 56, scope: !609)
!619 = !DILocation(line: 159, column: 13, scope: !616)
!620 = !DILocation(line: 158, column: 27, scope: !609)
!621 = !DILocation(line: 158, column: 13, scope: !614)
!622 = !DILocation(line: 159, column: 26, scope: !614)
!623 = !DILocation(line: 164, column: 35, scope: !616)
!624 = !DILocation(line: 164, column: 21, scope: !616)
!625 = !DILocation(line: 165, column: 18, scope: !616)
!626 = !DILocation(line: 167, column: 21, scope: !616)
!627 = !DILocation(line: 168, column: 13, scope: !616)
!628 = !DILocation(line: 163, column: 9, scope: !616)
!629 = !DILocation(line: 171, column: 6, scope: !609)
!630 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga6Screen3new17hf10bcd0ca2f4039eE", scope: !559, file: !3, line: 173, type: !631, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!559, !43, !4}
!633 = !{!634, !635, !636, !638, !640}
!634 = !DILocalVariable(name: "tfd", arg: 1, scope: !630, file: !3, line: 173, type: !43)
!635 = !DILocalVariable(name: "blank_row_char", arg: 2, scope: !630, file: !3, line: 173, type: !4)
!636 = !DILocalVariable(name: "buf", scope: !637, file: !3, line: 174, type: !565, align: 8)
!637 = distinct !DILexicalBlock(scope: !630, file: !3, line: 174, column: 9)
!638 = !DILocalVariable(name: "blank_row", scope: !639, file: !3, line: 175, type: !570, align: 1)
!639 = distinct !DILexicalBlock(scope: !637, file: !3, line: 175, column: 9)
!640 = !DILocalVariable(name: "screen", scope: !641, file: !3, line: 176, type: !559, align: 8)
!641 = distinct !DILexicalBlock(scope: !639, file: !3, line: 176, column: 9)
!642 = !DILocation(line: 176, column: 13, scope: !641)
!643 = !DILocation(line: 173, column: 16, scope: !630)
!644 = !DILocation(line: 173, column: 40, scope: !630)
!645 = !DILocation(line: 175, column: 13, scope: !639)
!646 = !DILocation(line: 174, column: 28, scope: !630)
!647 = !DILocation(line: 174, column: 13, scope: !637)
!648 = !DILocation(line: 175, column: 26, scope: !637)
!649 = !DILocation(line: 175, column: 25, scope: !637)
!650 = !DILocation(line: 176, column: 32, scope: !639)
!651 = !DILocation(line: 176, column: 26, scope: !639)
!652 = !DILocation(line: 178, column: 77, scope: !639)
!653 = !DILocation(line: 178, column: 43, scope: !639)
!654 = !DILocation(line: 177, column: 79, scope: !639)
!655 = !DILocation(line: 177, column: 44, scope: !639)
!656 = !DILocation(line: 180, column: 9, scope: !641)
!657 = !DILocation(line: 182, column: 6, scope: !630)
!658 = distinct !DISubprogram(name: "clear", linkageName: "_ZN3vga6Screen5clear17h123502de7c884f76E", scope: !559, file: !3, line: 184, type: !659, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !662)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !559, size: 64, align: 64, dwarfAddressSpace: 0)
!662 = !{!663, !664, !674}
!663 = !DILocalVariable(name: "self", arg: 1, scope: !658, file: !3, line: 184, type: !661)
!664 = !DILocalVariable(name: "iter", scope: !665, file: !3, line: 187, type: !666, align: 8)
!665 = distinct !DILexicalBlock(scope: !658, file: !3, line: 187, column: 9)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !667, file: !15, size: 128, align: 64, elements: !669, templateParams: !672, identifier: "b3a0a0d3e666bb80ca9821c0f36db520")
!667 = !DINamespace(name: "range", scope: !668)
!668 = !DINamespace(name: "ops", scope: !19)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !666, file: !15, baseType: !139, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !666, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "Idx", type: !139)
!674 = !DILocalVariable(name: "row", scope: !675, file: !3, line: 187, type: !139, align: 8)
!675 = distinct !DILexicalBlock(scope: !665, file: !3, line: 187, column: 37)
!676 = !DILocation(line: 184, column: 14, scope: !658)
!677 = !DILocation(line: 187, column: 20, scope: !665)
!678 = !DILocation(line: 187, column: 23, scope: !658)
!679 = !DILocation(line: 187, column: 20, scope: !658)
!680 = !DILocation(line: 187, column: 9, scope: !665)
!681 = !{i64 0, i64 2}
!682 = !DILocation(line: 190, column: 6, scope: !658)
!683 = !DILocation(line: 187, column: 13, scope: !665)
!684 = !DILocation(line: 187, column: 13, scope: !675)
!685 = !DILocation(line: 188, column: 35, scope: !675)
!686 = !DILocation(line: 188, column: 13, scope: !675)
!687 = distinct !DISubprogram(name: "print_sc", linkageName: "_ZN3vga6Screen8print_sc17hafd2b46fed2700b6E", scope: !559, file: !3, line: 192, type: !688, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !661, !108}
!690 = !{!691, !692, !693}
!691 = !DILocalVariable(name: "self", arg: 1, scope: !687, file: !3, line: 192, type: !661)
!692 = !DILocalVariable(name: "sc", arg: 2, scope: !687, file: !3, line: 192, type: !108)
!693 = !DILocalVariable(name: "dst", scope: !694, file: !3, line: 193, type: !695, align: 8)
!694 = distinct !DILexicalBlock(scope: !687, file: !3, line: 193, column: 9)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!696 = !DILocation(line: 192, column: 17, scope: !687)
!697 = !DILocation(line: 192, column: 28, scope: !687)
!698 = !DILocation(line: 193, column: 39, scope: !687)
!699 = !DILocation(line: 193, column: 24, scope: !687)
!700 = !DILocation(line: 193, column: 56, scope: !687)
!701 = !DILocation(line: 193, column: 19, scope: !687)
!702 = !DILocation(line: 193, column: 13, scope: !694)
!703 = !DILocation(line: 200, column: 18, scope: !694)
!704 = !DILocation(line: 201, column: 9, scope: !694)
!705 = !DILocation(line: 202, column: 6, scope: !687)
!706 = distinct !DISubprogram(name: "should_wrap", linkageName: "_ZN3vga6Screen11should_wrap17hc440e72cc734a3fbE", scope: !559, file: !3, line: 204, type: !707, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!106, !579}
!709 = !{!710}
!710 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !3, line: 204, type: !579)
!711 = !DILocation(line: 204, column: 20, scope: !706)
!712 = !DILocation(line: 205, column: 9, scope: !706)
!713 = !DILocation(line: 205, column: 28, scope: !706)
!714 = !DILocation(line: 206, column: 6, scope: !706)
!715 = distinct !DISubprogram(name: "print", linkageName: "_ZN3vga6Screen5print17h78675b148e0187ccE", scope: !559, file: !3, line: 208, type: !716, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !661, !4}
!718 = !{!719, !720}
!719 = !DILocalVariable(name: "self", arg: 1, scope: !715, file: !3, line: 208, type: !661)
!720 = !DILocalVariable(name: "c", arg: 2, scope: !715, file: !3, line: 208, type: !4)
!721 = !DILocation(line: 208, column: 14, scope: !715)
!722 = !DILocation(line: 208, column: 25, scope: !715)
!723 = !DILocation(line: 211, column: 12, scope: !715)
!724 = !DILocation(line: 214, column: 23, scope: !715)
!725 = !DILocation(line: 214, column: 9, scope: !715)
!726 = !DILocation(line: 215, column: 6, scope: !715)
!727 = !DILocation(line: 212, column: 13, scope: !715)
