; ModuleID = 'bitflags.311ff411a6bcd713-cgu.0'
source_filename = "bitflags.311ff411a6bcd713-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::result::Result<i8, parser::ParseError>" = type { i8, [1 x i8] }
%"core::result::Result<i8, core::num::error::ParseIntError>" = type { i8, [1 x i8] }
%"core::result::Result<i8, core::num::error::ParseIntError>::Ok" = type { [1 x i8], i8 }
%"core::result::Result<i8, parser::ParseError>::Ok" = type { [1 x i8], i8 }
%"core::result::Result<i8, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<i8, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u128, parser::ParseError>" = type { i8, [23 x i8] }
%"core::result::Result<u128, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<u128, parser::ParseError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<u128, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u128, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u32, parser::ParseError>" = type { i8, [7 x i8] }
%"core::result::Result<u32, core::num::error::ParseIntError>" = type { i8, [7 x i8] }
%"core::result::Result<u32, core::num::error::ParseIntError>::Ok" = type { [1 x i32], i32 }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.77.0-nightly (bf8716f1c 2023-12-24)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.77.0-nightly (bf8716f1c 2023-12-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1/src/lib.rs/@/bitflags.311ff411a6bcd713-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "error", scope: !20)
!20 = !DINamespace(name: "num", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h218c8a1cf67b1423E", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !159, retainedNodes: !160)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !42, identifier: "5c0bf663e13aed18b42e27881fea807c")
!30 = !{!31, !44, !90}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !29, file: !8, baseType: !32, size: 128, align: 64, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !33, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!33 = !{!34, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !32, file: !8, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !37, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !36, file: !8, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!42 = !{}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !29, file: !8, baseType: !45, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !42, identifier: "256519899e0672ceeaebd48b858206cf")
!46 = !DINamespace(name: "option", scope: !11)
!47 = !{!48}
!48 = !DICompositeType(tag: DW_TAG_variant_part, scope: !45, file: !8, size: 128, align: 64, elements: !49, templateParams: !42, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !89)
!49 = !{!50, !85}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !48, file: !8, baseType: !51, size: 128, align: 64, extraData: i128 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !52, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !55, templateParams: !42, identifier: "24318146e6c8bdc87822ff535a36a389")
!55 = !{!56, !84}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !54, file: !8, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !42, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!59 = !{!60, !61, !63, !64, !66, !83}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !58, file: !8, baseType: !41, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !8, baseType: !62, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !8, baseType: !65, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !8, baseType: !67, size: 128, align: 64, flags: DIFlagPublic)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !68, templateParams: !42, identifier: "96b697dd48c62362a4fdd24d145e624f")
!68 = !{!69}
!69 = !DICompositeType(tag: DW_TAG_variant_part, scope: !67, file: !8, size: 128, align: 64, elements: !70, templateParams: !42, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !81)
!70 = !{!71, !75, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !69, file: !8, baseType: !72, size: 128, align: 64, extraData: i128 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !73, templateParams: !42, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !69, file: !8, baseType: !76, size: 128, align: 64, extraData: i128 1)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !77, templateParams: !42, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !69, file: !8, baseType: !80, size: 128, align: 64, extraData: i128 2)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, identifier: "a1add839f51aefefecdce3df6110b61f")
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!82 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !8, baseType: !67, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !48, file: !8, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !87, templateParams: !52, identifier: "f965b304662f282235bb5dc25f3fae0f")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !86, file: !8, baseType: !54, size: 128, align: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !45, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !29, file: !8, baseType: !91, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !92, templateParams: !42, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!92 = !{!93, !156}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !91, file: !8, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !96, templateParams: !42, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !8, baseType: !98, size: 64, align: 64, flags: DIFlagPrivate)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !100, file: !8, align: 8, elements: !42, identifier: "fffd88202d364d3dc6423c86977eda88")
!100 = !DINamespace(name: "{extern#0}", scope: !9)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !95, file: !8, baseType: !102, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !98, !124}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !106, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !107, templateParams: !42, identifier: "27f960845886d02861ac4e7842c7e3a5")
!106 = !DINamespace(name: "result", scope: !11)
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_variant_part, scope: !105, file: !8, size: 8, align: 8, elements: !109, templateParams: !42, identifier: "66d489f599415104a0443264f219183e", discriminator: !123)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !108, file: !8, baseType: !111, size: 8, align: 8, extraData: i128 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !112, templateParams: !115, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !111, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPublic)
!114 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!115 = !{!116, !117}
!116 = !DITemplateTypeParameter(name: "T", type: !114)
!117 = !DITemplateTypeParameter(name: "E", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !42, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !108, file: !8, baseType: !120, size: 8, align: 8, extraData: i128 1)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !121, templateParams: !115, identifier: "c5badd8093158a69d1e378abd358f888")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !8, baseType: !118, align: 8, offset: 8, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, scope: !105, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !126, templateParams: !42, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!126 = !{!127, !128, !129, !130, !144, !145}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !8, baseType: !65, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !125, file: !8, baseType: !62, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !125, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !125, file: !8, baseType: !131, size: 128, align: 64, flags: DIFlagPrivate)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !132, templateParams: !42, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !131, file: !8, size: 128, align: 64, elements: !134, templateParams: !42, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !143)
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !133, file: !8, baseType: !136, size: 128, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !137, identifier: "ae81ebe2a9866af8df117bed47adaee")
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "T", type: !41)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !133, file: !8, baseType: !140, size: 128, align: 64, extraData: i128 1)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !141, templateParams: !137, identifier: "a581ef88bb755022340fa98600955727")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !125, file: !8, baseType: !131, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !8, baseType: !146, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !147, templateParams: !42, identifier: "6607f9b055c62ce71a6a286c8014df9")
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !146, file: !8, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !42, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !146, file: !8, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 64, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3, lowerBound: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!29, !32}
!159 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h218c8a1cf67b1423E", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!160 = !{!161}
!161 = !DILocalVariable(name: "pieces", arg: 1, scope: !27, file: !28, line: 321, type: !32)
!162 = !DILocation(line: 321, column: 28, scope: !27)
!163 = !DILocation(line: 322, column: 12, scope: !27)
!164 = !DILocation(line: 325, column: 34, scope: !27)
!165 = !DILocation(line: 325, column: 9, scope: !27)
!166 = !{i64 8}
!167 = !DILocation(line: 326, column: 6, scope: !27)
!168 = !DILocation(line: 323, column: 13, scope: !27)
!169 = distinct !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h095a43f4f102be3eE", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !236, declaration: !235, retainedNodes: !239)
!170 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !172, templateParams: !42, identifier: "932800905f7cc772381b6ad2c6f24570")
!172 = !{!173}
!173 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !8, size: 16, align: 8, elements: !174, templateParams: !42, identifier: "9377b6ef5bb18cb183637e6fd83a5dfd", discriminator: !190)
!174 = !{!175, !186}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !173, file: !8, baseType: !176, size: 16, align: 8, extraData: i128 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !171, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !177, templateParams: !180, identifier: "ed56c3b301fcecd09db108e472e48ada")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !8, baseType: !179, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!179 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!180 = !{!181, !182}
!181 = !DITemplateTypeParameter(name: "T", type: !179)
!182 = !DITemplateTypeParameter(name: "E", type: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !19, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !184, templateParams: !42, identifier: "ba2611a05930c821b0ade47e36d69fa5")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !183, file: !8, baseType: !18, size: 8, align: 8, flags: DIFlagProtected)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !173, file: !8, baseType: !187, size: 16, align: 8, extraData: i128 1)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !171, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !188, templateParams: !180, identifier: "9e3df1e35bc6e0a6bead73f9fdef8dfc")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !171, !228}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !194, templateParams: !42, identifier: "9f28ee806e5671976b7a5732b7ccdf87")
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !193, file: !8, size: 16, align: 8, elements: !196, templateParams: !42, identifier: "7d7631275a51cea81ee8730f2c22aaa2", discriminator: !227)
!196 = !{!197, !223}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !8, baseType: !198, size: 16, align: 8, extraData: i128 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !193, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !199, templateParams: !201, identifier: "52ac9f1eea799411edc2d748ed0aeaac")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !8, baseType: !179, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!201 = !{!181, !202}
!202 = !DITemplateTypeParameter(name: "E", type: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseError", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !206, templateParams: !42, identifier: "9c914b0255a8847b481fc2d3f0bfcfdb")
!204 = !DINamespace(name: "parser", scope: !205)
!205 = !DINamespace(name: "bitflags", scope: null)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !203, file: !8, baseType: !208, size: 8, align: 8, flags: DIFlagPrivate)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorKind", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !209, templateParams: !42, identifier: "6670f01c715e02e133dadf66366096a6")
!209 = !{!210}
!210 = !DICompositeType(tag: DW_TAG_variant_part, scope: !208, file: !8, size: 8, align: 8, elements: !211, templateParams: !42, identifier: "3075c160a56d7d3b67bfdd2ca03dd6c9", discriminator: !222)
!211 = !{!212, !214, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "EmptyFlag", scope: !210, file: !8, baseType: !213, size: 8, align: 8, extraData: i128 0)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptyFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !42, identifier: "32c68925ef7fb67f1c8b4497955be129")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNamedFlag", scope: !210, file: !8, baseType: !215, size: 8, align: 8, extraData: i128 1)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNamedFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !216, templateParams: !42, identifier: "f073804cab626fc841f6e096d9c7d70b")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !215, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidHexFlag", scope: !210, file: !8, baseType: !219, size: 8, align: 8, extraData: i128 2)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidHexFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !220, templateParams: !42, identifier: "5ad3d6d801e327b923b6fa3d334ab321")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !219, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !8, baseType: !224, size: 16, align: 8, extraData: i128 1)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !193, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !225, templateParams: !201, identifier: "c5823c43fc1d8b2d3d982943192a0cd7")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !229, file: !8, size: 64, align: 64, elements: !232, templateParams: !42, identifier: "eba9e429f8cf4d744a92f99bebcb5a2a")
!229 = !DINamespace(name: "parse_hex", scope: !230)
!230 = !DINamespace(name: "{impl#6}", scope: !231)
!231 = !DINamespace(name: "traits", scope: !205)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !228, file: !8, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h095a43f4f102be3eE", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !236)
!236 = !{!181, !182, !237, !238}
!237 = !DITemplateTypeParameter(name: "F", type: !203)
!238 = !DITemplateTypeParameter(name: "O", type: !228)
!239 = !{!240, !241, !242, !244}
!240 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 826, type: !171)
!241 = !DILocalVariable(name: "op", arg: 2, scope: !169, file: !170, line: 826, type: !228)
!242 = !DILocalVariable(name: "t", scope: !243, file: !170, line: 828, type: !179, align: 1)
!243 = distinct !DILexicalBlock(scope: !169, file: !170, line: 828, column: 13)
!244 = !DILocalVariable(name: "e", scope: !245, file: !170, line: 829, type: !183, align: 1)
!245 = distinct !DILexicalBlock(scope: !169, file: !170, line: 829, column: 13)
!246 = !DILocation(line: 826, column: 42, scope: !169)
!247 = !DILocation(line: 826, column: 48, scope: !169)
!248 = !DILocation(line: 827, column: 15, scope: !169)
!249 = !{i8 0, i8 2}
!250 = !DILocation(line: 827, column: 9, scope: !169)
!251 = !DILocation(line: 828, column: 16, scope: !169)
!252 = !DILocation(line: 828, column: 16, scope: !243)
!253 = !DILocation(line: 828, column: 22, scope: !243)
!254 = !DILocation(line: 828, column: 26, scope: !169)
!255 = !DILocation(line: 829, column: 17, scope: !169)
!256 = !{i8 0, i8 5}
!257 = !DILocation(line: 829, column: 17, scope: !245)
!258 = !DILocation(line: 829, column: 27, scope: !245)
!259 = !{i8 0, i8 3}
!260 = !DILocation(line: 829, column: 23, scope: !245)
!261 = !DILocation(line: 829, column: 32, scope: !169)
!262 = !DILocation(line: 831, column: 5, scope: !169)
!263 = !DILocation(line: 831, column: 6, scope: !169)
!264 = distinct !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2ea994c6f98df895E", scope: !265, file: !170, line: 826, type: !281, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !303, declaration: !302, retainedNodes: !305)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !266, templateParams: !42, identifier: "2622b2c9323d9fcdf754b7409e96859d")
!266 = !{!267}
!267 = !DICompositeType(tag: DW_TAG_variant_part, scope: !265, file: !8, size: 192, align: 64, elements: !268, templateParams: !42, identifier: "d5a03bcbfb8630a35f3df825d844b158", discriminator: !280)
!268 = !{!269, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !267, file: !8, baseType: !270, size: 192, align: 64, extraData: i128 0)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !265, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !271, templateParams: !274, identifier: "f3991e147a5972a66be1b94080854dc8")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !270, file: !8, baseType: !273, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!273 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!274 = !{!275, !182}
!275 = !DITemplateTypeParameter(name: "T", type: !273)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !267, file: !8, baseType: !277, size: 192, align: 64, extraData: i128 1)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !265, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !278, templateParams: !274, identifier: "e7d5f1fc5c474b7956c09d164591182d")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !265, !297}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !284, templateParams: !42, identifier: "9b9d6b1023e7b7089715f06ac96127d4")
!284 = !{!285}
!285 = !DICompositeType(tag: DW_TAG_variant_part, scope: !283, file: !8, size: 192, align: 64, elements: !286, templateParams: !42, identifier: "5e1c0bd29057a48befed28f8a732724f", discriminator: !296)
!286 = !{!287, !292}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !285, file: !8, baseType: !288, size: 192, align: 64, extraData: i128 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !283, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !289, templateParams: !291, identifier: "70fe143e5d7aec11ca738f301e2b90b1")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !288, file: !8, baseType: !273, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!291 = !{!275, !202}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !285, file: !8, baseType: !293, size: 192, align: 64, extraData: i128 1)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !283, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !294, templateParams: !291, identifier: "1155c02d9fea003a94483e7d02ce2ecf")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !293, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !298, file: !8, size: 64, align: 64, elements: !300, templateParams: !42, identifier: "f04655c64bc1cbc433b16eebbd69ecf0")
!298 = !DINamespace(name: "parse_hex", scope: !299)
!299 = !DINamespace(name: "{impl#37}", scope: !231)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !297, file: !8, baseType: !234, size: 64, align: 64)
!302 = !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2ea994c6f98df895E", scope: !265, file: !170, line: 826, type: !281, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !303)
!303 = !{!275, !182, !237, !304}
!304 = !DITemplateTypeParameter(name: "O", type: !297)
!305 = !{!306, !307, !308, !310}
!306 = !DILocalVariable(name: "self", arg: 1, scope: !264, file: !170, line: 826, type: !265)
!307 = !DILocalVariable(name: "op", arg: 2, scope: !264, file: !170, line: 826, type: !297)
!308 = !DILocalVariable(name: "t", scope: !309, file: !170, line: 828, type: !273, align: 8)
!309 = distinct !DILexicalBlock(scope: !264, file: !170, line: 828, column: 13)
!310 = !DILocalVariable(name: "e", scope: !311, file: !170, line: 829, type: !183, align: 1)
!311 = distinct !DILexicalBlock(scope: !264, file: !170, line: 829, column: 13)
!312 = !DILocation(line: 826, column: 42, scope: !264)
!313 = !DILocation(line: 826, column: 48, scope: !264)
!314 = !DILocation(line: 827, column: 15, scope: !264)
!315 = !DILocation(line: 827, column: 9, scope: !264)
!316 = !DILocation(line: 828, column: 16, scope: !264)
!317 = !DILocation(line: 828, column: 16, scope: !309)
!318 = !DILocation(line: 828, column: 22, scope: !309)
!319 = !DILocation(line: 828, column: 26, scope: !264)
!320 = !DILocation(line: 829, column: 17, scope: !264)
!321 = !DILocation(line: 829, column: 17, scope: !311)
!322 = !DILocation(line: 829, column: 27, scope: !311)
!323 = !DILocation(line: 829, column: 23, scope: !311)
!324 = !DILocation(line: 829, column: 32, scope: !264)
!325 = !DILocation(line: 831, column: 5, scope: !264)
!326 = !DILocation(line: 831, column: 6, scope: !264)
!327 = distinct !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h352092515f54c9c4E", scope: !328, file: !170, line: 826, type: !343, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !365, declaration: !364, retainedNodes: !367)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !329, templateParams: !42, identifier: "b82585088a16ea951412a5730c447f63")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !8, size: 64, align: 32, elements: !331, templateParams: !42, identifier: "4c836ff9fd916b7d962f98fc53c9bde3", discriminator: !342)
!331 = !{!332, !338}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !330, file: !8, baseType: !333, size: 64, align: 32, extraData: i128 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !328, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !334, templateParams: !336, identifier: "eebb7368769c30c1e4236801764e2864")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!336 = !{!337, !182}
!337 = !DITemplateTypeParameter(name: "T", type: !65)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !330, file: !8, baseType: !339, size: 64, align: 32, extraData: i128 1)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !328, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !340, templateParams: !336, identifier: "562e27b7e27fe50e4ec35a29191feef1")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !339, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !328, !359}
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !346, templateParams: !42, identifier: "24a2cea9b8b496fd645ddf26a4d26e63")
!346 = !{!347}
!347 = !DICompositeType(tag: DW_TAG_variant_part, scope: !345, file: !8, size: 64, align: 32, elements: !348, templateParams: !42, identifier: "ded574a8b9f3f1c51dbdbcfc78085aa5", discriminator: !358)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !347, file: !8, baseType: !350, size: 64, align: 32, extraData: i128 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !345, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !351, templateParams: !353, identifier: "f8c21dc4e89b3c506fc9b04592a81de4")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !350, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!353 = !{!337, !202}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !347, file: !8, baseType: !355, size: 64, align: 32, extraData: i128 1)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !345, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !356, templateParams: !353, identifier: "9d80f9c63471e567e83b701f96db2463")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!358 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !360, file: !8, size: 64, align: 64, elements: !362, templateParams: !42, identifier: "83752e9ac915a99b197209cecae961")
!360 = !DINamespace(name: "parse_hex", scope: !361)
!361 = !DINamespace(name: "{impl#21}", scope: !231)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !359, file: !8, baseType: !234, size: 64, align: 64)
!364 = !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h352092515f54c9c4E", scope: !328, file: !170, line: 826, type: !343, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !365)
!365 = !{!337, !182, !237, !366}
!366 = !DITemplateTypeParameter(name: "O", type: !359)
!367 = !{!368, !369, !370, !372}
!368 = !DILocalVariable(name: "self", arg: 1, scope: !327, file: !170, line: 826, type: !328)
!369 = !DILocalVariable(name: "op", arg: 2, scope: !327, file: !170, line: 826, type: !359)
!370 = !DILocalVariable(name: "t", scope: !371, file: !170, line: 828, type: !65, align: 4)
!371 = distinct !DILexicalBlock(scope: !327, file: !170, line: 828, column: 13)
!372 = !DILocalVariable(name: "e", scope: !373, file: !170, line: 829, type: !183, align: 1)
!373 = distinct !DILexicalBlock(scope: !327, file: !170, line: 829, column: 13)
!374 = !DILocation(line: 826, column: 42, scope: !327)
!375 = !DILocation(line: 826, column: 48, scope: !327)
!376 = !DILocation(line: 827, column: 15, scope: !327)
!377 = !DILocation(line: 827, column: 9, scope: !327)
!378 = !DILocation(line: 828, column: 16, scope: !327)
!379 = !DILocation(line: 828, column: 16, scope: !371)
!380 = !DILocation(line: 828, column: 22, scope: !371)
!381 = !DILocation(line: 828, column: 26, scope: !327)
!382 = !DILocation(line: 829, column: 17, scope: !327)
!383 = !DILocation(line: 829, column: 17, scope: !373)
!384 = !DILocation(line: 829, column: 27, scope: !373)
!385 = !DILocation(line: 829, column: 23, scope: !373)
!386 = !DILocation(line: 829, column: 32, scope: !327)
!387 = !DILocation(line: 831, column: 5, scope: !327)
!388 = !DILocation(line: 831, column: 6, scope: !327)
!389 = distinct !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h72ad60f49f64e8c4E", scope: !390, file: !170, line: 826, type: !404, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !426, declaration: !425, retainedNodes: !428)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !391, templateParams: !42, identifier: "365cd9e3047f0fd5ea932564aa341085")
!391 = !{!392}
!392 = !DICompositeType(tag: DW_TAG_variant_part, scope: !390, file: !8, size: 128, align: 64, elements: !393, templateParams: !42, identifier: "3b66ecda8d556a15d0036991208b4e84", discriminator: !403)
!393 = !{!394, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !392, file: !8, baseType: !395, size: 128, align: 64, extraData: i128 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !390, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !396, templateParams: !398, identifier: "7abeb336c559c9419d6c447271834929")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!398 = !{!138, !182}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !392, file: !8, baseType: !400, size: 128, align: 64, extraData: i128 1)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !390, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !401, templateParams: !398, identifier: "9c3aed88b88d4fc27710e2c0b5beae2")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !400, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !390, !420}
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !407, templateParams: !42, identifier: "ff08b02a9ab25d3b2f97d38205531725")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_variant_part, scope: !406, file: !8, size: 128, align: 64, elements: !409, templateParams: !42, identifier: "bd455fd92879cb891f95cd138799e29d", discriminator: !419)
!409 = !{!410, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !408, file: !8, baseType: !411, size: 128, align: 64, extraData: i128 0)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !406, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !412, templateParams: !414, identifier: "45f11fdd31cfa852dde65c15d120e4ec")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !411, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!414 = !{!138, !202}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !408, file: !8, baseType: !416, size: 128, align: 64, extraData: i128 1)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !406, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !417, templateParams: !414, identifier: "84b6f27cbead9f422fdcdd60b73ecb1a")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !416, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!419 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !421, file: !8, size: 64, align: 64, elements: !423, templateParams: !42, identifier: "b59acf92fe32041f67d0fde76eab611")
!421 = !DINamespace(name: "parse_hex", scope: !422)
!422 = !DINamespace(name: "{impl#45}", scope: !231)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !420, file: !8, baseType: !234, size: 64, align: 64)
!425 = !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h72ad60f49f64e8c4E", scope: !390, file: !170, line: 826, type: !404, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !426)
!426 = !{!138, !182, !237, !427}
!427 = !DITemplateTypeParameter(name: "O", type: !420)
!428 = !{!429, !430, !431, !433}
!429 = !DILocalVariable(name: "self", arg: 1, scope: !389, file: !170, line: 826, type: !390)
!430 = !DILocalVariable(name: "op", arg: 2, scope: !389, file: !170, line: 826, type: !420)
!431 = !DILocalVariable(name: "t", scope: !432, file: !170, line: 828, type: !41, align: 8)
!432 = distinct !DILexicalBlock(scope: !389, file: !170, line: 828, column: 13)
!433 = !DILocalVariable(name: "e", scope: !434, file: !170, line: 829, type: !183, align: 1)
!434 = distinct !DILexicalBlock(scope: !389, file: !170, line: 829, column: 13)
!435 = !DILocation(line: 826, column: 42, scope: !389)
!436 = !DILocation(line: 826, column: 48, scope: !389)
!437 = !DILocation(line: 827, column: 15, scope: !389)
!438 = !DILocation(line: 827, column: 9, scope: !389)
!439 = !DILocation(line: 828, column: 16, scope: !389)
!440 = !DILocation(line: 828, column: 16, scope: !432)
!441 = !DILocation(line: 828, column: 22, scope: !432)
!442 = !DILocation(line: 828, column: 26, scope: !389)
!443 = !DILocation(line: 829, column: 17, scope: !389)
!444 = !DILocation(line: 829, column: 17, scope: !434)
!445 = !DILocation(line: 829, column: 27, scope: !434)
!446 = !DILocation(line: 829, column: 23, scope: !434)
!447 = !DILocation(line: 829, column: 32, scope: !389)
!448 = !DILocation(line: 831, column: 5, scope: !389)
!449 = !DILocation(line: 831, column: 6, scope: !389)
!450 = distinct !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h978b64d84d86eda2E", scope: !451, file: !170, line: 826, type: !467, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !489, declaration: !488, retainedNodes: !491)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !452, templateParams: !42, identifier: "f55bcebb7ef5f1099eab3a4987fc8a2")
!452 = !{!453}
!453 = !DICompositeType(tag: DW_TAG_variant_part, scope: !451, file: !8, size: 64, align: 32, elements: !454, templateParams: !42, identifier: "d837c9ab91315afd1ddec2b470db815f", discriminator: !466)
!454 = !{!455, !462}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !453, file: !8, baseType: !456, size: 64, align: 32, extraData: i128 0)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !451, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !457, templateParams: !460, identifier: "628c741b7fe29e1b015e9a25350efb8")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !456, file: !8, baseType: !459, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!459 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!460 = !{!461, !182}
!461 = !DITemplateTypeParameter(name: "T", type: !459)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !453, file: !8, baseType: !463, size: 64, align: 32, extraData: i128 1)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !451, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !464, templateParams: !460, identifier: "45dbc43e6fcd91bc4e4a5fc37ee134ce")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !463, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !451, !483}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !470, templateParams: !42, identifier: "96f48f2ecababe5ad9c4b05d220c2988")
!470 = !{!471}
!471 = !DICompositeType(tag: DW_TAG_variant_part, scope: !469, file: !8, size: 64, align: 32, elements: !472, templateParams: !42, identifier: "c66a35a5c9ab8377a5df4484fbf0a43a", discriminator: !482)
!472 = !{!473, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !471, file: !8, baseType: !474, size: 64, align: 32, extraData: i128 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !469, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !475, templateParams: !477, identifier: "7b3b33ac68a31cca5f20fb9e7f4a31a5")
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !474, file: !8, baseType: !459, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!477 = !{!461, !202}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !471, file: !8, baseType: !479, size: 64, align: 32, extraData: i128 1)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !469, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !480, templateParams: !477, identifier: "dbe34afc20ec11c6149054179f39eef4")
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !479, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !484, file: !8, size: 64, align: 64, elements: !486, templateParams: !42, identifier: "2b565488b66f83161e4d7568fc58b4b8")
!484 = !DINamespace(name: "parse_hex", scope: !485)
!485 = !DINamespace(name: "{impl#22}", scope: !231)
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !483, file: !8, baseType: !234, size: 64, align: 64)
!488 = !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h978b64d84d86eda2E", scope: !451, file: !170, line: 826, type: !467, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !489)
!489 = !{!461, !182, !237, !490}
!490 = !DITemplateTypeParameter(name: "O", type: !483)
!491 = !{!492, !493, !494, !496}
!492 = !DILocalVariable(name: "self", arg: 1, scope: !450, file: !170, line: 826, type: !451)
!493 = !DILocalVariable(name: "op", arg: 2, scope: !450, file: !170, line: 826, type: !483)
!494 = !DILocalVariable(name: "t", scope: !495, file: !170, line: 828, type: !459, align: 4)
!495 = distinct !DILexicalBlock(scope: !450, file: !170, line: 828, column: 13)
!496 = !DILocalVariable(name: "e", scope: !497, file: !170, line: 829, type: !183, align: 1)
!497 = distinct !DILexicalBlock(scope: !450, file: !170, line: 829, column: 13)
!498 = !DILocation(line: 826, column: 42, scope: !450)
!499 = !DILocation(line: 826, column: 48, scope: !450)
!500 = !DILocation(line: 827, column: 15, scope: !450)
!501 = !DILocation(line: 827, column: 9, scope: !450)
!502 = !DILocation(line: 828, column: 16, scope: !450)
!503 = !DILocation(line: 828, column: 16, scope: !495)
!504 = !DILocation(line: 828, column: 22, scope: !495)
!505 = !DILocation(line: 828, column: 26, scope: !450)
!506 = !DILocation(line: 829, column: 17, scope: !450)
!507 = !DILocation(line: 829, column: 17, scope: !497)
!508 = !DILocation(line: 829, column: 27, scope: !497)
!509 = !DILocation(line: 829, column: 23, scope: !497)
!510 = !DILocation(line: 829, column: 32, scope: !450)
!511 = !DILocation(line: 831, column: 5, scope: !450)
!512 = !DILocation(line: 831, column: 6, scope: !450)
!513 = distinct !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9f0e26524b63d7c0E", scope: !514, file: !170, line: 826, type: !530, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !552, declaration: !551, retainedNodes: !554)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !515, templateParams: !42, identifier: "863390ce401f2c59c43ea85ff450958b")
!515 = !{!516}
!516 = !DICompositeType(tag: DW_TAG_variant_part, scope: !514, file: !8, size: 128, align: 64, elements: !517, templateParams: !42, identifier: "594d9677be70216fd2d2e94a8812e92", discriminator: !529)
!517 = !{!518, !525}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !516, file: !8, baseType: !519, size: 128, align: 64, extraData: i128 0)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !514, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !520, templateParams: !523, identifier: "f6ac2443325df1cad707976ea43fbab7")
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !519, file: !8, baseType: !522, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!522 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!523 = !{!524, !182}
!524 = !DITemplateTypeParameter(name: "T", type: !522)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !516, file: !8, baseType: !526, size: 128, align: 64, extraData: i128 1)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !514, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !527, templateParams: !523, identifier: "a6637246236df87497f3fdfeffdd4c2e")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!529 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !514, !546}
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !533, templateParams: !42, identifier: "c71103dd79602cc89a036d076e57a383")
!533 = !{!534}
!534 = !DICompositeType(tag: DW_TAG_variant_part, scope: !532, file: !8, size: 128, align: 64, elements: !535, templateParams: !42, identifier: "7a664de94913e79a8275a874206c916c", discriminator: !545)
!535 = !{!536, !541}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !534, file: !8, baseType: !537, size: 128, align: 64, extraData: i128 0)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !532, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !538, templateParams: !540, identifier: "249f2e7a85ab2668b639ac9de9ab4bbc")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !537, file: !8, baseType: !522, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!540 = !{!524, !202}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !534, file: !8, baseType: !542, size: 128, align: 64, extraData: i128 1)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !532, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !543, templateParams: !540, identifier: "208839a13c4acf9e27fa6a032a576f21")
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !542, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !532, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !547, file: !8, size: 64, align: 64, elements: !549, templateParams: !42, identifier: "27ce2917aab8db7e98d4891f91442869")
!547 = !DINamespace(name: "parse_hex", scope: !548)
!548 = !DINamespace(name: "{impl#30}", scope: !231)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !546, file: !8, baseType: !234, size: 64, align: 64)
!551 = !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9f0e26524b63d7c0E", scope: !514, file: !170, line: 826, type: !530, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !552)
!552 = !{!524, !182, !237, !553}
!553 = !DITemplateTypeParameter(name: "O", type: !546)
!554 = !{!555, !556, !557, !559}
!555 = !DILocalVariable(name: "self", arg: 1, scope: !513, file: !170, line: 826, type: !514)
!556 = !DILocalVariable(name: "op", arg: 2, scope: !513, file: !170, line: 826, type: !546)
!557 = !DILocalVariable(name: "t", scope: !558, file: !170, line: 828, type: !522, align: 8)
!558 = distinct !DILexicalBlock(scope: !513, file: !170, line: 828, column: 13)
!559 = !DILocalVariable(name: "e", scope: !560, file: !170, line: 829, type: !183, align: 1)
!560 = distinct !DILexicalBlock(scope: !513, file: !170, line: 829, column: 13)
!561 = !DILocation(line: 826, column: 42, scope: !513)
!562 = !DILocation(line: 826, column: 48, scope: !513)
!563 = !DILocation(line: 827, column: 15, scope: !513)
!564 = !DILocation(line: 827, column: 9, scope: !513)
!565 = !DILocation(line: 828, column: 16, scope: !513)
!566 = !DILocation(line: 828, column: 16, scope: !558)
!567 = !DILocation(line: 828, column: 22, scope: !558)
!568 = !DILocation(line: 828, column: 26, scope: !513)
!569 = !DILocation(line: 829, column: 17, scope: !513)
!570 = !DILocation(line: 829, column: 17, scope: !560)
!571 = !DILocation(line: 829, column: 27, scope: !560)
!572 = !DILocation(line: 829, column: 23, scope: !560)
!573 = !DILocation(line: 829, column: 32, scope: !513)
!574 = !DILocation(line: 831, column: 5, scope: !513)
!575 = !DILocation(line: 831, column: 6, scope: !513)
!576 = distinct !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17ha04b5b57a01124fcE", scope: !577, file: !170, line: 826, type: !592, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !614, declaration: !613, retainedNodes: !616)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !578, templateParams: !42, identifier: "f388c52469df9b2b8ab12787b02f939c")
!578 = !{!579}
!579 = !DICompositeType(tag: DW_TAG_variant_part, scope: !577, file: !8, size: 16, align: 8, elements: !580, templateParams: !42, identifier: "f357ccffe8f40056f1c5afd6570f6f17", discriminator: !591)
!580 = !{!581, !587}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !579, file: !8, baseType: !582, size: 16, align: 8, extraData: i128 0)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !577, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !583, templateParams: !585, identifier: "343434b256948c5767f5c7e76d458785")
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !582, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!585 = !{!586, !182}
!586 = !DITemplateTypeParameter(name: "T", type: !12)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !579, file: !8, baseType: !588, size: 16, align: 8, extraData: i128 1)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !577, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !589, templateParams: !585, identifier: "ef9c6a1b8c8c59086b30f8035f3b4ce8")
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !588, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !577, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !577, !608}
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !595, templateParams: !42, identifier: "6363a2c2a117fa4bc7d61167a1c24d5d")
!595 = !{!596}
!596 = !DICompositeType(tag: DW_TAG_variant_part, scope: !594, file: !8, size: 16, align: 8, elements: !597, templateParams: !42, identifier: "c69b71c5d129f7eeae6a5cec3ae938d7", discriminator: !607)
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !596, file: !8, baseType: !599, size: 16, align: 8, extraData: i128 0)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !594, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !600, templateParams: !602, identifier: "d0806ce7480d35e021edddecf3290b53")
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !599, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!602 = !{!586, !202}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !596, file: !8, baseType: !604, size: 16, align: 8, extraData: i128 1)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !594, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !605, templateParams: !602, identifier: "b9103fb0128bc11e7f4e2af0998a6a97")
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !604, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!607 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !609, file: !8, size: 64, align: 64, elements: !611, templateParams: !42, identifier: "3719c3e27867f6473a205657038b9e10")
!609 = !DINamespace(name: "parse_hex", scope: !610)
!610 = !DINamespace(name: "{impl#5}", scope: !231)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !608, file: !8, baseType: !234, size: 64, align: 64)
!613 = !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17ha04b5b57a01124fcE", scope: !577, file: !170, line: 826, type: !592, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !614)
!614 = !{!586, !182, !237, !615}
!615 = !DITemplateTypeParameter(name: "O", type: !608)
!616 = !{!617, !618, !619, !621}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !576, file: !170, line: 826, type: !577)
!618 = !DILocalVariable(name: "op", arg: 2, scope: !576, file: !170, line: 826, type: !608)
!619 = !DILocalVariable(name: "t", scope: !620, file: !170, line: 828, type: !12, align: 1)
!620 = distinct !DILexicalBlock(scope: !576, file: !170, line: 828, column: 13)
!621 = !DILocalVariable(name: "e", scope: !622, file: !170, line: 829, type: !183, align: 1)
!622 = distinct !DILexicalBlock(scope: !576, file: !170, line: 829, column: 13)
!623 = !DILocation(line: 826, column: 42, scope: !576)
!624 = !DILocation(line: 826, column: 48, scope: !576)
!625 = !DILocation(line: 827, column: 15, scope: !576)
!626 = !DILocation(line: 827, column: 9, scope: !576)
!627 = !DILocation(line: 828, column: 16, scope: !576)
!628 = !DILocation(line: 828, column: 16, scope: !620)
!629 = !DILocation(line: 828, column: 22, scope: !620)
!630 = !DILocation(line: 828, column: 26, scope: !576)
!631 = !DILocation(line: 829, column: 17, scope: !576)
!632 = !DILocation(line: 829, column: 17, scope: !622)
!633 = !DILocation(line: 829, column: 27, scope: !622)
!634 = !DILocation(line: 829, column: 23, scope: !622)
!635 = !DILocation(line: 829, column: 32, scope: !576)
!636 = !DILocation(line: 831, column: 5, scope: !576)
!637 = !DILocation(line: 831, column: 6, scope: !576)
!638 = distinct !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb50f30082a1922d1E", scope: !639, file: !170, line: 826, type: !655, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !677, declaration: !676, retainedNodes: !679)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !640, templateParams: !42, identifier: "5d8a64e4273863532f8370cd5e65580f")
!640 = !{!641}
!641 = !DICompositeType(tag: DW_TAG_variant_part, scope: !639, file: !8, size: 192, align: 64, elements: !642, templateParams: !42, identifier: "ab639b6cca81a5528c370fc8bf0c9a4c", discriminator: !654)
!642 = !{!643, !650}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !641, file: !8, baseType: !644, size: 192, align: 64, extraData: i128 0)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !639, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !645, templateParams: !648, identifier: "d31414c0778abfc28aae2e6e4c9687d6")
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !644, file: !8, baseType: !647, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!647 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!648 = !{!649, !182}
!649 = !DITemplateTypeParameter(name: "T", type: !647)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !641, file: !8, baseType: !651, size: 192, align: 64, extraData: i128 1)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !639, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !652, templateParams: !648, identifier: "9a763a0c790d6f86f6f103f92b1a9f13")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !639, !671}
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !658, templateParams: !42, identifier: "d71e31ce94ab5fde913c9c48c97da6c")
!658 = !{!659}
!659 = !DICompositeType(tag: DW_TAG_variant_part, scope: !657, file: !8, size: 192, align: 64, elements: !660, templateParams: !42, identifier: "eb18017f5ea21cfbb99c8b0f416ca218", discriminator: !670)
!660 = !{!661, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !659, file: !8, baseType: !662, size: 192, align: 64, extraData: i128 0)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !657, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !663, templateParams: !665, identifier: "e440086a401b39e0f7b7980869a60f6b")
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !662, file: !8, baseType: !647, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!665 = !{!649, !202}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !659, file: !8, baseType: !667, size: 192, align: 64, extraData: i128 1)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !657, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !668, templateParams: !665, identifier: "488dc6e540a25038fefc1f996236469d")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !667, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!670 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !672, file: !8, size: 64, align: 64, elements: !674, templateParams: !42, identifier: "b3fdeffa53f700d2fec9d20a404e6d3d")
!672 = !DINamespace(name: "parse_hex", scope: !673)
!673 = !DINamespace(name: "{impl#38}", scope: !231)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !671, file: !8, baseType: !234, size: 64, align: 64)
!676 = !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb50f30082a1922d1E", scope: !639, file: !170, line: 826, type: !655, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !677)
!677 = !{!649, !182, !237, !678}
!678 = !DITemplateTypeParameter(name: "O", type: !671)
!679 = !{!680, !681, !682, !684}
!680 = !DILocalVariable(name: "self", arg: 1, scope: !638, file: !170, line: 826, type: !639)
!681 = !DILocalVariable(name: "op", arg: 2, scope: !638, file: !170, line: 826, type: !671)
!682 = !DILocalVariable(name: "t", scope: !683, file: !170, line: 828, type: !647, align: 8)
!683 = distinct !DILexicalBlock(scope: !638, file: !170, line: 828, column: 13)
!684 = !DILocalVariable(name: "e", scope: !685, file: !170, line: 829, type: !183, align: 1)
!685 = distinct !DILexicalBlock(scope: !638, file: !170, line: 829, column: 13)
!686 = !DILocation(line: 826, column: 42, scope: !638)
!687 = !DILocation(line: 826, column: 48, scope: !638)
!688 = !DILocation(line: 827, column: 15, scope: !638)
!689 = !DILocation(line: 827, column: 9, scope: !638)
!690 = !DILocation(line: 828, column: 16, scope: !638)
!691 = !DILocation(line: 828, column: 16, scope: !683)
!692 = !DILocation(line: 828, column: 22, scope: !683)
!693 = !DILocation(line: 828, column: 26, scope: !638)
!694 = !DILocation(line: 829, column: 17, scope: !638)
!695 = !DILocation(line: 829, column: 17, scope: !685)
!696 = !DILocation(line: 829, column: 27, scope: !685)
!697 = !DILocation(line: 829, column: 23, scope: !685)
!698 = !DILocation(line: 829, column: 32, scope: !638)
!699 = !DILocation(line: 831, column: 5, scope: !638)
!700 = !DILocation(line: 831, column: 6, scope: !638)
!701 = distinct !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd1fb40f6c9b36735E", scope: !702, file: !170, line: 826, type: !717, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !739, declaration: !738, retainedNodes: !741)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !703, templateParams: !42, identifier: "4604aad8c095164b3559edeb713efbeb")
!703 = !{!704}
!704 = !DICompositeType(tag: DW_TAG_variant_part, scope: !702, file: !8, size: 128, align: 64, elements: !705, templateParams: !42, identifier: "1590f14a94460745b68477d5c5b7e25c", discriminator: !716)
!705 = !{!706, !712}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !704, file: !8, baseType: !707, size: 128, align: 64, extraData: i128 0)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !702, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !708, templateParams: !710, identifier: "341bf17fe8f0cbb1fd78e5682248a441")
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !707, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!710 = !{!711, !182}
!711 = !DITemplateTypeParameter(name: "T", type: !82)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !704, file: !8, baseType: !713, size: 128, align: 64, extraData: i128 1)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !702, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !714, templateParams: !710, identifier: "e0876f21fdbc7d8d9f0d3c90a987857e")
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !713, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!716 = !DIDerivedType(tag: DW_TAG_member, scope: !702, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!717 = !DISubroutineType(types: !718)
!718 = !{!719, !702, !733}
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !720, templateParams: !42, identifier: "5972e4616ac0ee1fd8b5469302e8e6c4")
!720 = !{!721}
!721 = !DICompositeType(tag: DW_TAG_variant_part, scope: !719, file: !8, size: 128, align: 64, elements: !722, templateParams: !42, identifier: "1ee245bcca4cb3d299f702e1c51d69a", discriminator: !732)
!722 = !{!723, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !721, file: !8, baseType: !724, size: 128, align: 64, extraData: i128 0)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !719, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !725, templateParams: !727, identifier: "b622b9427234d6fac9e0dd4355ed751e")
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!727 = !{!711, !202}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !721, file: !8, baseType: !729, size: 128, align: 64, extraData: i128 1)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !719, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !730, templateParams: !727, identifier: "8a53a6618b1295e11b8307d2a29db5cb")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!732 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !734, file: !8, size: 64, align: 64, elements: !736, templateParams: !42, identifier: "f53dce500b5145143bcacf8962914d0d")
!734 = !DINamespace(name: "parse_hex", scope: !735)
!735 = !DINamespace(name: "{impl#29}", scope: !231)
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !733, file: !8, baseType: !234, size: 64, align: 64)
!738 = !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd1fb40f6c9b36735E", scope: !702, file: !170, line: 826, type: !717, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !739)
!739 = !{!711, !182, !237, !740}
!740 = !DITemplateTypeParameter(name: "O", type: !733)
!741 = !{!742, !743, !744, !746}
!742 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !170, line: 826, type: !702)
!743 = !DILocalVariable(name: "op", arg: 2, scope: !701, file: !170, line: 826, type: !733)
!744 = !DILocalVariable(name: "t", scope: !745, file: !170, line: 828, type: !82, align: 8)
!745 = distinct !DILexicalBlock(scope: !701, file: !170, line: 828, column: 13)
!746 = !DILocalVariable(name: "e", scope: !747, file: !170, line: 829, type: !183, align: 1)
!747 = distinct !DILexicalBlock(scope: !701, file: !170, line: 829, column: 13)
!748 = !DILocation(line: 826, column: 42, scope: !701)
!749 = !DILocation(line: 826, column: 48, scope: !701)
!750 = !DILocation(line: 827, column: 15, scope: !701)
!751 = !DILocation(line: 827, column: 9, scope: !701)
!752 = !DILocation(line: 828, column: 16, scope: !701)
!753 = !DILocation(line: 828, column: 16, scope: !745)
!754 = !DILocation(line: 828, column: 22, scope: !745)
!755 = !DILocation(line: 828, column: 26, scope: !701)
!756 = !DILocation(line: 829, column: 17, scope: !701)
!757 = !DILocation(line: 829, column: 17, scope: !747)
!758 = !DILocation(line: 829, column: 27, scope: !747)
!759 = !DILocation(line: 829, column: 23, scope: !747)
!760 = !DILocation(line: 829, column: 32, scope: !701)
!761 = !DILocation(line: 831, column: 5, scope: !701)
!762 = !DILocation(line: 831, column: 6, scope: !701)
!763 = distinct !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd2ecab0a78a83a30E", scope: !764, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !802, declaration: !801, retainedNodes: !804)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !765, templateParams: !42, identifier: "4f2521fd3d92e5dc66501df81191c5cb")
!765 = !{!766}
!766 = !DICompositeType(tag: DW_TAG_variant_part, scope: !764, file: !8, size: 128, align: 64, elements: !767, templateParams: !42, identifier: "ba32220fce6cfc6246a5719432212992", discriminator: !779)
!767 = !{!768, !775}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !766, file: !8, baseType: !769, size: 128, align: 64, extraData: i128 0)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !764, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !770, templateParams: !773, identifier: "e68987501ee76af3a289794ac9c34c31")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !769, file: !8, baseType: !772, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!772 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!773 = !{!774, !182}
!774 = !DITemplateTypeParameter(name: "T", type: !772)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !766, file: !8, baseType: !776, size: 128, align: 64, extraData: i128 1)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !764, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !777, templateParams: !773, identifier: "ceecb61367f9ae66d1f622c961b06309")
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !776, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!780 = !DISubroutineType(types: !781)
!781 = !{!782, !764, !796}
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !783, templateParams: !42, identifier: "da21e4aa9ca4001e3363aae58b6be61")
!783 = !{!784}
!784 = !DICompositeType(tag: DW_TAG_variant_part, scope: !782, file: !8, size: 128, align: 64, elements: !785, templateParams: !42, identifier: "52bf06c9f41bc702f4110cbc213d59f7", discriminator: !795)
!785 = !{!786, !791}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !784, file: !8, baseType: !787, size: 128, align: 64, extraData: i128 0)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !782, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !788, templateParams: !790, identifier: "a05df04643eab63ed15f536b2b531902")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !8, baseType: !772, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!790 = !{!774, !202}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !784, file: !8, baseType: !792, size: 128, align: 64, extraData: i128 1)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !782, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !793, templateParams: !790, identifier: "6780fc33bcf11ec5227100ea05e09e40")
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !792, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !797, file: !8, size: 64, align: 64, elements: !799, templateParams: !42, identifier: "cec11d5d377322080ccd40be7e36d9")
!797 = !DINamespace(name: "parse_hex", scope: !798)
!798 = !DINamespace(name: "{impl#46}", scope: !231)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !796, file: !8, baseType: !234, size: 64, align: 64)
!801 = !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd2ecab0a78a83a30E", scope: !764, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !802)
!802 = !{!774, !182, !237, !803}
!803 = !DITemplateTypeParameter(name: "O", type: !796)
!804 = !{!805, !806, !807, !809}
!805 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !170, line: 826, type: !764)
!806 = !DILocalVariable(name: "op", arg: 2, scope: !763, file: !170, line: 826, type: !796)
!807 = !DILocalVariable(name: "t", scope: !808, file: !170, line: 828, type: !772, align: 8)
!808 = distinct !DILexicalBlock(scope: !763, file: !170, line: 828, column: 13)
!809 = !DILocalVariable(name: "e", scope: !810, file: !170, line: 829, type: !183, align: 1)
!810 = distinct !DILexicalBlock(scope: !763, file: !170, line: 829, column: 13)
!811 = !DILocation(line: 826, column: 42, scope: !763)
!812 = !DILocation(line: 826, column: 48, scope: !763)
!813 = !DILocation(line: 827, column: 15, scope: !763)
!814 = !DILocation(line: 827, column: 9, scope: !763)
!815 = !DILocation(line: 828, column: 16, scope: !763)
!816 = !DILocation(line: 828, column: 16, scope: !808)
!817 = !DILocation(line: 828, column: 22, scope: !808)
!818 = !DILocation(line: 828, column: 26, scope: !763)
!819 = !DILocation(line: 829, column: 17, scope: !763)
!820 = !DILocation(line: 829, column: 17, scope: !810)
!821 = !DILocation(line: 829, column: 27, scope: !810)
!822 = !DILocation(line: 829, column: 23, scope: !810)
!823 = !DILocation(line: 829, column: 32, scope: !763)
!824 = !DILocation(line: 831, column: 5, scope: !763)
!825 = !DILocation(line: 831, column: 6, scope: !763)
!826 = distinct !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hdf9e058c210f5f62E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !865, declaration: !864, retainedNodes: !867)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !828, templateParams: !42, identifier: "779c8a91bd5d1b536b8c532385e1a99e")
!828 = !{!829}
!829 = !DICompositeType(tag: DW_TAG_variant_part, scope: !827, file: !8, size: 32, align: 16, elements: !830, templateParams: !42, identifier: "7792d17f4f7a53e84e64ef70b8a44273", discriminator: !842)
!830 = !{!831, !838}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !829, file: !8, baseType: !832, size: 32, align: 16, extraData: i128 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !827, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !833, templateParams: !836, identifier: "b3bad92dd1f31a7768c7d5342172923e")
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !8, baseType: !835, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!835 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!836 = !{!837, !182}
!837 = !DITemplateTypeParameter(name: "T", type: !835)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !829, file: !8, baseType: !839, size: 32, align: 16, extraData: i128 1)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !827, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !840, templateParams: !836, identifier: "5e8e93b5f4fcccdeec5e04daf277df80")
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !827, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !827, !859}
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !846, templateParams: !42, identifier: "1e5abe57bea6ce1e643c5170920a33d7")
!846 = !{!847}
!847 = !DICompositeType(tag: DW_TAG_variant_part, scope: !845, file: !8, size: 32, align: 16, elements: !848, templateParams: !42, identifier: "64bb43f2412962d24160901f69d7967e", discriminator: !858)
!848 = !{!849, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !847, file: !8, baseType: !850, size: 32, align: 16, extraData: i128 0)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !845, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !851, templateParams: !853, identifier: "87c1057d92857bf598feffc8b1bbc620")
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !850, file: !8, baseType: !835, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!853 = !{!837, !202}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !847, file: !8, baseType: !855, size: 32, align: 16, extraData: i128 1)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !845, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !856, templateParams: !853, identifier: "7e9730b42ca554e16ec7da3372620d65")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !845, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !860, file: !8, size: 64, align: 64, elements: !862, templateParams: !42, identifier: "7e38eddaefe2b0858e518e652283437")
!860 = !DINamespace(name: "parse_hex", scope: !861)
!861 = !DINamespace(name: "{impl#14}", scope: !231)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !859, file: !8, baseType: !234, size: 64, align: 64)
!864 = !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hdf9e058c210f5f62E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !865)
!865 = !{!837, !182, !237, !866}
!866 = !DITemplateTypeParameter(name: "O", type: !859)
!867 = !{!868, !869, !870, !872}
!868 = !DILocalVariable(name: "self", arg: 1, scope: !826, file: !170, line: 826, type: !827)
!869 = !DILocalVariable(name: "op", arg: 2, scope: !826, file: !170, line: 826, type: !859)
!870 = !DILocalVariable(name: "t", scope: !871, file: !170, line: 828, type: !835, align: 2)
!871 = distinct !DILexicalBlock(scope: !826, file: !170, line: 828, column: 13)
!872 = !DILocalVariable(name: "e", scope: !873, file: !170, line: 829, type: !183, align: 1)
!873 = distinct !DILexicalBlock(scope: !826, file: !170, line: 829, column: 13)
!874 = !DILocation(line: 826, column: 42, scope: !826)
!875 = !DILocation(line: 826, column: 48, scope: !826)
!876 = !DILocation(line: 827, column: 15, scope: !826)
!877 = !DILocation(line: 827, column: 9, scope: !826)
!878 = !DILocation(line: 828, column: 16, scope: !826)
!879 = !DILocation(line: 828, column: 16, scope: !871)
!880 = !DILocation(line: 828, column: 22, scope: !871)
!881 = !DILocation(line: 828, column: 26, scope: !826)
!882 = !DILocation(line: 829, column: 17, scope: !826)
!883 = !DILocation(line: 829, column: 17, scope: !873)
!884 = !DILocation(line: 829, column: 27, scope: !873)
!885 = !DILocation(line: 829, column: 23, scope: !873)
!886 = !DILocation(line: 829, column: 32, scope: !826)
!887 = !DILocation(line: 831, column: 5, scope: !826)
!888 = !DILocation(line: 831, column: 6, scope: !826)
!889 = distinct !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hf6f81de670f7e421E", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !928, declaration: !927, retainedNodes: !930)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !891, templateParams: !42, identifier: "7b4793b675f8ef9ff923c9ab6ecef9c0")
!891 = !{!892}
!892 = !DICompositeType(tag: DW_TAG_variant_part, scope: !890, file: !8, size: 32, align: 16, elements: !893, templateParams: !42, identifier: "9b2b138167a4adde89cfde28969910e9", discriminator: !905)
!893 = !{!894, !901}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !892, file: !8, baseType: !895, size: 32, align: 16, extraData: i128 0)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !890, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !896, templateParams: !899, identifier: "46f4e73c54132f232525cb2d0704beb8")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !895, file: !8, baseType: !898, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!898 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!899 = !{!900, !182}
!900 = !DITemplateTypeParameter(name: "T", type: !898)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !892, file: !8, baseType: !902, size: 32, align: 16, extraData: i128 1)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !890, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !903, templateParams: !899, identifier: "9c71e620105b3ad5467ae47fbfee2837")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !890, !922}
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !909, templateParams: !42, identifier: "a6f172ea5b0e204a2fd9046f8457cafd")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !8, size: 32, align: 16, elements: !911, templateParams: !42, identifier: "94dfbc9fc7cbe04b3bf692f8d0dc8845", discriminator: !921)
!911 = !{!912, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !910, file: !8, baseType: !913, size: 32, align: 16, extraData: i128 0)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !908, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !914, templateParams: !916, identifier: "242f247d3de3d9fe306a1999ee5393e7")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !913, file: !8, baseType: !898, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!916 = !{!900, !202}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !910, file: !8, baseType: !918, size: 32, align: 16, extraData: i128 1)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !908, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !919, templateParams: !916, identifier: "23348ffc7daa696cb2feb6e7c9368abd")
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !918, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !923, file: !8, size: 64, align: 64, elements: !925, templateParams: !42, identifier: "75db97a04770cde53914d21c7ea39cae")
!923 = !DINamespace(name: "parse_hex", scope: !924)
!924 = !DINamespace(name: "{impl#13}", scope: !231)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !922, file: !8, baseType: !234, size: 64, align: 64)
!927 = !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hf6f81de670f7e421E", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !928)
!928 = !{!900, !182, !237, !929}
!929 = !DITemplateTypeParameter(name: "O", type: !922)
!930 = !{!931, !932, !933, !935}
!931 = !DILocalVariable(name: "self", arg: 1, scope: !889, file: !170, line: 826, type: !890)
!932 = !DILocalVariable(name: "op", arg: 2, scope: !889, file: !170, line: 826, type: !922)
!933 = !DILocalVariable(name: "t", scope: !934, file: !170, line: 828, type: !898, align: 2)
!934 = distinct !DILexicalBlock(scope: !889, file: !170, line: 828, column: 13)
!935 = !DILocalVariable(name: "e", scope: !936, file: !170, line: 829, type: !183, align: 1)
!936 = distinct !DILexicalBlock(scope: !889, file: !170, line: 829, column: 13)
!937 = !DILocation(line: 826, column: 42, scope: !889)
!938 = !DILocation(line: 826, column: 48, scope: !889)
!939 = !DILocation(line: 827, column: 15, scope: !889)
!940 = !DILocation(line: 827, column: 9, scope: !889)
!941 = !DILocation(line: 828, column: 16, scope: !889)
!942 = !DILocation(line: 828, column: 16, scope: !934)
!943 = !DILocation(line: 828, column: 22, scope: !934)
!944 = !DILocation(line: 828, column: 26, scope: !889)
!945 = !DILocation(line: 829, column: 17, scope: !889)
!946 = !DILocation(line: 829, column: 17, scope: !936)
!947 = !DILocation(line: 829, column: 27, scope: !936)
!948 = !DILocation(line: 829, column: 23, scope: !936)
!949 = !DILocation(line: 829, column: 32, scope: !889)
!950 = !DILocation(line: 831, column: 5, scope: !889)
!951 = !DILocation(line: 831, column: 6, scope: !889)
!952 = distinct !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17hebdd16def67d5569E", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !957, declaration: !956, retainedNodes: !959)
!953 = !DIFile(filename: "src/parser.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1", checksumkind: CSK_MD5, checksum: "2e786373a5103ab0379604d86533efec")
!954 = !DISubroutineType(types: !955)
!955 = !{!203, !36}
!956 = !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17hebdd16def67d5569E", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !957)
!957 = !{!958}
!958 = !DITemplateTypeParameter(name: "impl fmt::Display", type: !36)
!959 = !{!960, !961, !963}
!960 = !DILocalVariable(name: "flag", arg: 1, scope: !952, file: !953, line: 181, type: !36)
!961 = !DILocalVariable(name: "_flag", scope: !962, file: !953, line: 182, type: !36, align: 8)
!962 = distinct !DILexicalBlock(scope: !952, file: !953, line: 182, column: 9)
!963 = !DILocalVariable(name: "got", scope: !964, file: !953, line: 184, type: !114, align: 1)
