; ModuleID = 'bitflags.725c289215a3917e-cgu.0'
source_filename = "bitflags.725c289215a3917e-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::result::Result<u128, parser::ParseError>" = type { i8, [23 x i8] }
%"core::result::Result<u128, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<u128, parser::ParseError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<u128, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u128, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<i128, parser::ParseError>" = type { i8, [23 x i8] }
%"core::result::Result<i128, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<i128, parser::ParseError>::Ok" = type { [1 x i64], i128 }
%"core::result::Result<i128, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<i128, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<usize, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<usize, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i64 }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.77.0-nightly (2319be8e2 2024-01-12)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.77.0-nightly (2319be8e2 2024-01-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1/src/lib.rs/@/bitflags.725c289215a3917e-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "error", scope: !20)
!20 = !DINamespace(name: "num", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h093be96c02a3ca0bE", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !159, retainedNodes: !160)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !42, identifier: "86d983b481df04f01f2caf98ecdb573e")
!30 = !{!31, !44, !90}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !29, file: !8, baseType: !32, size: 128, align: 64, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !33, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!33 = !{!34, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !32, file: !8, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !37, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !36, file: !8, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!42 = !{}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !29, file: !8, baseType: !45, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !42, identifier: "e48718f86166d54d77f059ca0b0a6c98")
!46 = !DINamespace(name: "option", scope: !11)
!47 = !{!48}
!48 = !DICompositeType(tag: DW_TAG_variant_part, scope: !45, file: !8, size: 128, align: 64, elements: !49, templateParams: !42, identifier: "afffb15192482d728253b8f8d2472e72", discriminator: !89)
!49 = !{!50, !85}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !48, file: !8, baseType: !51, size: 128, align: 64, extraData: i128 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !52, identifier: "1d9e634e4d5498a7ee96fb2809d07bf0")
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !55, templateParams: !42, identifier: "10cafd0b6708f7074105ffbf9866f638")
!55 = !{!56, !84}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !54, file: !8, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !42, identifier: "28b92f1394f76687eb8e9c560ca51a4c")
!59 = !{!60, !61, !63, !64, !66, !83}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !58, file: !8, baseType: !41, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !8, baseType: !62, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !8, baseType: !65, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !8, baseType: !67, size: 128, align: 64, flags: DIFlagPublic)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !68, templateParams: !42, identifier: "481d968305f18fdf8ffdc763003c88c2")
!68 = !{!69}
!69 = !DICompositeType(tag: DW_TAG_variant_part, scope: !67, file: !8, size: 128, align: 64, elements: !70, templateParams: !42, identifier: "24e90591fade26729409e3a20be2092f", discriminator: !81)
!70 = !{!71, !75, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !69, file: !8, baseType: !72, size: 128, align: 64, extraData: i128 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !73, templateParams: !42, identifier: "4f0d326e575be30f2fd639a109ec9636")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !69, file: !8, baseType: !76, size: 128, align: 64, extraData: i128 1)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !77, templateParams: !42, identifier: "3ef2efa2febef674f3c7a1d1edeb2d4")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !69, file: !8, baseType: !80, size: 128, align: 64, extraData: i128 2)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, identifier: "9632846e4fadf93ac045eb7d766a59de")
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!82 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !8, baseType: !67, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !48, file: !8, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !87, templateParams: !52, identifier: "bc059b01ff1bb2971a2574564a359fd")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !86, file: !8, baseType: !54, size: 128, align: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !45, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !29, file: !8, baseType: !91, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !92, templateParams: !42, identifier: "721bb03f9dbcb87965e2bb40d9a20f3b")
!92 = !{!93, !156}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !91, file: !8, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !96, templateParams: !42, identifier: "c21ebc23867bf4144aa11e8b76b9019b")
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !8, baseType: !98, size: 64, align: 64, flags: DIFlagPrivate)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !100, file: !8, align: 8, elements: !42, identifier: "7fd454df0a480bb0c65b40675d1838be")
!100 = !DINamespace(name: "{extern#0}", scope: !9)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !95, file: !8, baseType: !102, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !98, !124}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !106, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !107, templateParams: !42, identifier: "22edf1bd3971db6bd2ad32a9daa6f6ca")
!106 = !DINamespace(name: "result", scope: !11)
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_variant_part, scope: !105, file: !8, size: 8, align: 8, elements: !109, templateParams: !42, identifier: "adcad2b9c0ff448fdc0c8b7762234780", discriminator: !123)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !108, file: !8, baseType: !111, size: 8, align: 8, extraData: i128 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !112, templateParams: !115, identifier: "929502afbf827051526e72098b2bdef3")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !111, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPublic)
!114 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!115 = !{!116, !117}
!116 = !DITemplateTypeParameter(name: "T", type: !114)
!117 = !DITemplateTypeParameter(name: "E", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !42, identifier: "3069877aff233c82ff5ca4b40585f280")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !108, file: !8, baseType: !120, size: 8, align: 8, extraData: i128 1)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !121, templateParams: !115, identifier: "d8692c9ed1a95c26749ce8856cf20e6b")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !8, baseType: !118, align: 8, offset: 8, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, scope: !105, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !126, templateParams: !42, identifier: "69fb35bbf13c50dad131588c55e1a73e")
!126 = !{!127, !128, !129, !130, !144, !145}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !8, baseType: !65, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !125, file: !8, baseType: !62, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !125, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !125, file: !8, baseType: !131, size: 128, align: 64, flags: DIFlagPrivate)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !132, templateParams: !42, identifier: "e35d24df7864ff75c56a1be902455ff")
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !131, file: !8, size: 128, align: 64, elements: !134, templateParams: !42, identifier: "e387b39c7264d58d894a5d68f142d3c6", discriminator: !143)
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !133, file: !8, baseType: !136, size: 128, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !137, identifier: "c5e7f26fad88e7e95a61499e645aaa4c")
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "T", type: !41)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !133, file: !8, baseType: !140, size: 128, align: 64, extraData: i128 1)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !141, templateParams: !137, identifier: "d7d153280913c68b726880f10c7f2f12")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !125, file: !8, baseType: !131, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !8, baseType: !146, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !147, templateParams: !42, identifier: "8f6e1dba3018d5fd2b6a6d5825b494f5")
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !146, file: !8, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !42, identifier: "b8b42c4b4ac43cfb69c8ca498cfba042")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !146, file: !8, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 64, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3, lowerBound: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!29, !32}
!159 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h093be96c02a3ca0bE", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!160 = !{!161}
!161 = !DILocalVariable(name: "pieces", arg: 1, scope: !27, file: !28, line: 321, type: !32)
!162 = !DILocation(line: 321, column: 28, scope: !27)
!163 = !DILocation(line: 322, column: 12, scope: !27)
!164 = !DILocation(line: 325, column: 34, scope: !27)
!165 = !DILocation(line: 325, column: 9, scope: !27)
!166 = !{i64 8}
!167 = !DILocation(line: 326, column: 6, scope: !27)
!168 = !DILocation(line: 323, column: 13, scope: !27)
!169 = distinct !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0ef55dd41a4df74bE", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !236, declaration: !235, retainedNodes: !239)
!170 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !172, templateParams: !42, identifier: "af9649d861e77b12c5b1e5d3f7e47b13")
!172 = !{!173}
!173 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !8, size: 192, align: 64, elements: !174, templateParams: !42, identifier: "dae398f7267065f83b294b293e863e5", discriminator: !190)
!174 = !{!175, !186}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !173, file: !8, baseType: !176, size: 192, align: 64, extraData: i128 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !171, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !177, templateParams: !180, identifier: "f3fe5243f231cc99c0bd70bd1c337a95")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !8, baseType: !179, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!179 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!180 = !{!181, !182}
!181 = !DITemplateTypeParameter(name: "T", type: !179)
!182 = !DITemplateTypeParameter(name: "E", type: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !19, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !184, templateParams: !42, identifier: "fd04ce4ad704c4de945992a9464fdb6f")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !183, file: !8, baseType: !18, size: 8, align: 8, flags: DIFlagProtected)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !173, file: !8, baseType: !187, size: 192, align: 64, extraData: i128 1)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !171, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !188, templateParams: !180, identifier: "e2f1719a9c2f993dd9aa8b0f1a7d566")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !171, !228}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !194, templateParams: !42, identifier: "fdc93803131f331c4ed08cfee2a66ceb")
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !193, file: !8, size: 192, align: 64, elements: !196, templateParams: !42, identifier: "b33484b2bdd0c85c5fdb6b7c42ebaf13", discriminator: !227)
!196 = !{!197, !223}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !8, baseType: !198, size: 192, align: 64, extraData: i128 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !193, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !199, templateParams: !201, identifier: "e780785e5d5f041a350bd36eb0f40ac5")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !8, baseType: !179, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!201 = !{!181, !202}
!202 = !DITemplateTypeParameter(name: "E", type: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseError", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !206, templateParams: !42, identifier: "637d9748740e244e8e55dda7171c64bd")
!204 = !DINamespace(name: "parser", scope: !205)
!205 = !DINamespace(name: "bitflags", scope: null)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !203, file: !8, baseType: !208, size: 8, align: 8, flags: DIFlagPrivate)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorKind", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !209, templateParams: !42, identifier: "5687b87887aadb177f638b9b0624df16")
!209 = !{!210}
!210 = !DICompositeType(tag: DW_TAG_variant_part, scope: !208, file: !8, size: 8, align: 8, elements: !211, templateParams: !42, identifier: "e47ee5abc80b68e48208473f9c46959a", discriminator: !222)
!211 = !{!212, !214, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "EmptyFlag", scope: !210, file: !8, baseType: !213, size: 8, align: 8, extraData: i128 0)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptyFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !42, identifier: "1a267f95952e3544f5119657ce799408")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNamedFlag", scope: !210, file: !8, baseType: !215, size: 8, align: 8, extraData: i128 1)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNamedFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !216, templateParams: !42, identifier: "965fb56d3272a1bd4581640ee9562b63")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !215, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidHexFlag", scope: !210, file: !8, baseType: !219, size: 8, align: 8, extraData: i128 2)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidHexFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !220, templateParams: !42, identifier: "45e658553e2889147f87bbab49c8ff26")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !219, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !8, baseType: !224, size: 192, align: 64, extraData: i128 1)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !193, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !225, templateParams: !201, identifier: "f800f5fe176315d360180e5f569a1a03")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !229, file: !8, size: 64, align: 64, elements: !232, templateParams: !42, identifier: "5a4c8faeb1aec6898f58f7692286ac65")
!229 = !DINamespace(name: "parse_hex", scope: !230)
!230 = !DINamespace(name: "{impl#37}", scope: !231)
!231 = !DINamespace(name: "traits", scope: !205)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !228, file: !8, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0ef55dd41a4df74bE", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !236)
!236 = !{!181, !182, !237, !238}
!237 = !DITemplateTypeParameter(name: "F", type: !203)
!238 = !DITemplateTypeParameter(name: "O", type: !228)
!239 = !{!240, !241, !242, !244}
!240 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 826, type: !171)
!241 = !DILocalVariable(name: "op", arg: 2, scope: !169, file: !170, line: 826, type: !228)
!242 = !DILocalVariable(name: "t", scope: !243, file: !170, line: 828, type: !179, align: 8)
!243 = distinct !DILexicalBlock(scope: !169, file: !170, line: 828, column: 13)
!244 = !DILocalVariable(name: "e", scope: !245, file: !170, line: 829, type: !183, align: 1)
!245 = distinct !DILexicalBlock(scope: !169, file: !170, line: 829, column: 13)
!246 = !DILocation(line: 826, column: 42, scope: !169)
!247 = !DILocation(line: 826, column: 48, scope: !169)
!248 = !DILocation(line: 827, column: 15, scope: !169)
!249 = !{i8 0, i8 2}
!250 = !DILocation(line: 827, column: 9, scope: !169)
!251 = !DILocation(line: 828, column: 16, scope: !169)
!252 = !DILocation(line: 828, column: 16, scope: !243)
!253 = !DILocation(line: 828, column: 22, scope: !243)
!254 = !DILocation(line: 828, column: 26, scope: !169)
!255 = !DILocation(line: 829, column: 17, scope: !169)
!256 = !{i8 0, i8 5}
!257 = !DILocation(line: 829, column: 17, scope: !245)
!258 = !DILocation(line: 829, column: 27, scope: !245)
!259 = !{i8 0, i8 3}
!260 = !DILocation(line: 829, column: 23, scope: !245)
!261 = !DILocation(line: 829, column: 32, scope: !169)
!262 = !DILocation(line: 831, column: 5, scope: !169)
!263 = !DILocation(line: 831, column: 6, scope: !169)
!264 = distinct !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h125fbb1ece6e4982E", scope: !265, file: !170, line: 826, type: !281, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !303, declaration: !302, retainedNodes: !305)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !266, templateParams: !42, identifier: "3ceb3cfcd5d88f41e93eb57c660ecbee")
!266 = !{!267}
!267 = !DICompositeType(tag: DW_TAG_variant_part, scope: !265, file: !8, size: 192, align: 64, elements: !268, templateParams: !42, identifier: "dbc648704d816407b203bbb927ec8779", discriminator: !280)
!268 = !{!269, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !267, file: !8, baseType: !270, size: 192, align: 64, extraData: i128 0)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !265, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !271, templateParams: !274, identifier: "a9476a22fd77b9ca1a0a393e14c652ae")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !270, file: !8, baseType: !273, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!273 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!274 = !{!275, !182}
!275 = !DITemplateTypeParameter(name: "T", type: !273)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !267, file: !8, baseType: !277, size: 192, align: 64, extraData: i128 1)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !265, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !278, templateParams: !274, identifier: "d094f89c6848273b40f4891369c5659c")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !265, !297}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !284, templateParams: !42, identifier: "2d5cd6a680a6fd86babc77835be9d789")
!284 = !{!285}
!285 = !DICompositeType(tag: DW_TAG_variant_part, scope: !283, file: !8, size: 192, align: 64, elements: !286, templateParams: !42, identifier: "844241685c2fe694a80bdc571a798d04", discriminator: !296)
!286 = !{!287, !292}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !285, file: !8, baseType: !288, size: 192, align: 64, extraData: i128 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !283, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !289, templateParams: !291, identifier: "54b46b76cce5163f7963184c4e482109")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !288, file: !8, baseType: !273, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!291 = !{!275, !202}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !285, file: !8, baseType: !293, size: 192, align: 64, extraData: i128 1)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !283, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !294, templateParams: !291, identifier: "ac1865312c9457888654fd0b4999d826")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !293, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !298, file: !8, size: 64, align: 64, elements: !300, templateParams: !42, identifier: "938a4c74161e02396a1b3ebaa30933b1")
!298 = !DINamespace(name: "parse_hex", scope: !299)
!299 = !DINamespace(name: "{impl#38}", scope: !231)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !297, file: !8, baseType: !234, size: 64, align: 64)
!302 = !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h125fbb1ece6e4982E", scope: !265, file: !170, line: 826, type: !281, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !303)
!303 = !{!275, !182, !237, !304}
!304 = !DITemplateTypeParameter(name: "O", type: !297)
!305 = !{!306, !307, !308, !310}
!306 = !DILocalVariable(name: "self", arg: 1, scope: !264, file: !170, line: 826, type: !265)
!307 = !DILocalVariable(name: "op", arg: 2, scope: !264, file: !170, line: 826, type: !297)
!308 = !DILocalVariable(name: "t", scope: !309, file: !170, line: 828, type: !273, align: 8)
!309 = distinct !DILexicalBlock(scope: !264, file: !170, line: 828, column: 13)
!310 = !DILocalVariable(name: "e", scope: !311, file: !170, line: 829, type: !183, align: 1)
!311 = distinct !DILexicalBlock(scope: !264, file: !170, line: 829, column: 13)
!312 = !DILocation(line: 826, column: 42, scope: !264)
!313 = !DILocation(line: 826, column: 48, scope: !264)
!314 = !DILocation(line: 827, column: 15, scope: !264)
!315 = !DILocation(line: 827, column: 9, scope: !264)
!316 = !DILocation(line: 828, column: 16, scope: !264)
!317 = !DILocation(line: 828, column: 16, scope: !309)
!318 = !DILocation(line: 828, column: 22, scope: !309)
!319 = !DILocation(line: 828, column: 26, scope: !264)
!320 = !DILocation(line: 829, column: 17, scope: !264)
!321 = !DILocation(line: 829, column: 17, scope: !311)
!322 = !DILocation(line: 829, column: 27, scope: !311)
!323 = !DILocation(line: 829, column: 23, scope: !311)
!324 = !DILocation(line: 829, column: 32, scope: !264)
!325 = !DILocation(line: 831, column: 5, scope: !264)
!326 = !DILocation(line: 831, column: 6, scope: !264)
!327 = distinct !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h401e60fec0781fcdE", scope: !328, file: !170, line: 826, type: !342, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !364, declaration: !363, retainedNodes: !366)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !329, templateParams: !42, identifier: "1a387a32d41c7f4c531493cefc711685")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !8, size: 128, align: 64, elements: !331, templateParams: !42, identifier: "b40505bbd5a676566c8078c400dcf471", discriminator: !341)
!331 = !{!332, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !330, file: !8, baseType: !333, size: 128, align: 64, extraData: i128 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !328, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !334, templateParams: !336, identifier: "ea73cbe64ba0bfd72ff3fc834d4dea5b")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!336 = !{!138, !182}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !330, file: !8, baseType: !338, size: 128, align: 64, extraData: i128 1)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !328, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !339, templateParams: !336, identifier: "92d3128e98a3db8750a5c23fb1372696")
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !338, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !328, !358}
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !345, templateParams: !42, identifier: "7da66cc47db12d7040e9f72d668bc28e")
!345 = !{!346}
!346 = !DICompositeType(tag: DW_TAG_variant_part, scope: !344, file: !8, size: 128, align: 64, elements: !347, templateParams: !42, identifier: "b7c68e517aa969b528a4c713ce822650", discriminator: !357)
!347 = !{!348, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !346, file: !8, baseType: !349, size: 128, align: 64, extraData: i128 0)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !344, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !350, templateParams: !352, identifier: "b9f06121cbd7197b71208728a5890988")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !349, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!352 = !{!138, !202}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !346, file: !8, baseType: !354, size: 128, align: 64, extraData: i128 1)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !344, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !355, templateParams: !352, identifier: "2bd04e0e1057627840f09c5f5cb81670")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !354, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!357 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !359, file: !8, size: 64, align: 64, elements: !361, templateParams: !42, identifier: "6c243600018e8a5f672173bea7e17f14")
!359 = !DINamespace(name: "parse_hex", scope: !360)
!360 = !DINamespace(name: "{impl#45}", scope: !231)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !358, file: !8, baseType: !234, size: 64, align: 64)
!363 = !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h401e60fec0781fcdE", scope: !328, file: !170, line: 826, type: !342, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !364)
!364 = !{!138, !182, !237, !365}
!365 = !DITemplateTypeParameter(name: "O", type: !358)
!366 = !{!367, !368, !369, !371}
!367 = !DILocalVariable(name: "self", arg: 1, scope: !327, file: !170, line: 826, type: !328)
!368 = !DILocalVariable(name: "op", arg: 2, scope: !327, file: !170, line: 826, type: !358)
!369 = !DILocalVariable(name: "t", scope: !370, file: !170, line: 828, type: !41, align: 8)
!370 = distinct !DILexicalBlock(scope: !327, file: !170, line: 828, column: 13)
!371 = !DILocalVariable(name: "e", scope: !372, file: !170, line: 829, type: !183, align: 1)
!372 = distinct !DILexicalBlock(scope: !327, file: !170, line: 829, column: 13)
!373 = !DILocation(line: 826, column: 42, scope: !327)
!374 = !DILocation(line: 826, column: 48, scope: !327)
!375 = !DILocation(line: 827, column: 15, scope: !327)
!376 = !DILocation(line: 827, column: 9, scope: !327)
!377 = !DILocation(line: 828, column: 16, scope: !327)
!378 = !DILocation(line: 828, column: 16, scope: !370)
!379 = !DILocation(line: 828, column: 22, scope: !370)
!380 = !DILocation(line: 828, column: 26, scope: !327)
!381 = !DILocation(line: 829, column: 17, scope: !327)
!382 = !DILocation(line: 829, column: 17, scope: !372)
!383 = !DILocation(line: 829, column: 27, scope: !372)
!384 = !DILocation(line: 829, column: 23, scope: !372)
!385 = !DILocation(line: 829, column: 32, scope: !327)
!386 = !DILocation(line: 831, column: 5, scope: !327)
!387 = !DILocation(line: 831, column: 6, scope: !327)
!388 = distinct !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h4286b87b3469e450E", scope: !389, file: !170, line: 826, type: !405, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !427, declaration: !426, retainedNodes: !429)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !390, templateParams: !42, identifier: "efc8a3a65ac9872a1dbad83c4ed4bf94")
!390 = !{!391}
!391 = !DICompositeType(tag: DW_TAG_variant_part, scope: !389, file: !8, size: 128, align: 64, elements: !392, templateParams: !42, identifier: "f03f70dcaa4cd985fa5817643d8d512", discriminator: !404)
!392 = !{!393, !400}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !391, file: !8, baseType: !394, size: 128, align: 64, extraData: i128 0)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !389, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !395, templateParams: !398, identifier: "2a8a31ce3b8677f76db0a0378768e170")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !394, file: !8, baseType: !397, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!397 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!398 = !{!399, !182}
!399 = !DITemplateTypeParameter(name: "T", type: !397)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !391, file: !8, baseType: !401, size: 128, align: 64, extraData: i128 1)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !389, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !398, identifier: "2ed5b5b0dcdc557a46d3c58c34a1fc34")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !389, !421}
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !408, templateParams: !42, identifier: "ac2b3d4690c81406f191ecb2695a7be3")
!408 = !{!409}
!409 = !DICompositeType(tag: DW_TAG_variant_part, scope: !407, file: !8, size: 128, align: 64, elements: !410, templateParams: !42, identifier: "d38c54a2dd463c453a939f849a5e7935", discriminator: !420)
!410 = !{!411, !416}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !409, file: !8, baseType: !412, size: 128, align: 64, extraData: i128 0)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !407, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !413, templateParams: !415, identifier: "c15de0232848e6d9da4ab43cd79a2cd7")
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !412, file: !8, baseType: !397, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!415 = !{!399, !202}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !409, file: !8, baseType: !417, size: 128, align: 64, extraData: i128 1)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !407, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !418, templateParams: !415, identifier: "abecc8e76f16f0fb377bd4060ddd3819")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !422, file: !8, size: 64, align: 64, elements: !424, templateParams: !42, identifier: "f8123b58372f0ad04a8bb0fa3d097dbc")
!422 = !DINamespace(name: "parse_hex", scope: !423)
!423 = !DINamespace(name: "{impl#30}", scope: !231)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !421, file: !8, baseType: !234, size: 64, align: 64)
!426 = !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h4286b87b3469e450E", scope: !389, file: !170, line: 826, type: !405, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !427)
!427 = !{!399, !182, !237, !428}
!428 = !DITemplateTypeParameter(name: "O", type: !421)
!429 = !{!430, !431, !432, !434}
!430 = !DILocalVariable(name: "self", arg: 1, scope: !388, file: !170, line: 826, type: !389)
!431 = !DILocalVariable(name: "op", arg: 2, scope: !388, file: !170, line: 826, type: !421)
!432 = !DILocalVariable(name: "t", scope: !433, file: !170, line: 828, type: !397, align: 8)
!433 = distinct !DILexicalBlock(scope: !388, file: !170, line: 828, column: 13)
!434 = !DILocalVariable(name: "e", scope: !435, file: !170, line: 829, type: !183, align: 1)
!435 = distinct !DILexicalBlock(scope: !388, file: !170, line: 829, column: 13)
!436 = !DILocation(line: 826, column: 42, scope: !388)
!437 = !DILocation(line: 826, column: 48, scope: !388)
!438 = !DILocation(line: 827, column: 15, scope: !388)
!439 = !DILocation(line: 827, column: 9, scope: !388)
!440 = !DILocation(line: 828, column: 16, scope: !388)
!441 = !DILocation(line: 828, column: 16, scope: !433)
!442 = !DILocation(line: 828, column: 22, scope: !433)
!443 = !DILocation(line: 828, column: 26, scope: !388)
!444 = !DILocation(line: 829, column: 17, scope: !388)
!445 = !DILocation(line: 829, column: 17, scope: !435)
!446 = !DILocation(line: 829, column: 27, scope: !435)
!447 = !DILocation(line: 829, column: 23, scope: !435)
!448 = !DILocation(line: 829, column: 32, scope: !388)
!449 = !DILocation(line: 831, column: 5, scope: !388)
!450 = !DILocation(line: 831, column: 6, scope: !388)
!451 = distinct !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h64bce674d50f0e4dE", scope: !452, file: !170, line: 826, type: !468, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !490, declaration: !489, retainedNodes: !492)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !453, templateParams: !42, identifier: "f1382e8c7f8d0713307b7463155999c4")
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_variant_part, scope: !452, file: !8, size: 32, align: 16, elements: !455, templateParams: !42, identifier: "f81ad2c4794f17d7a76324cb224ea3f0", discriminator: !467)
!455 = !{!456, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !454, file: !8, baseType: !457, size: 32, align: 16, extraData: i128 0)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !452, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !458, templateParams: !461, identifier: "7156e2b6f060a56457542b4cd3219e54")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !457, file: !8, baseType: !460, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!460 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!461 = !{!462, !182}
!462 = !DITemplateTypeParameter(name: "T", type: !460)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !454, file: !8, baseType: !464, size: 32, align: 16, extraData: i128 1)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !452, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !465, templateParams: !461, identifier: "370ae2b29403d5bf461a2d449163d7d4")
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !464, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!467 = !DIDerivedType(tag: DW_TAG_member, scope: !452, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !452, !484}
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !471, templateParams: !42, identifier: "bb687181b60b7aac426899e9d41581d4")
!471 = !{!472}
!472 = !DICompositeType(tag: DW_TAG_variant_part, scope: !470, file: !8, size: 32, align: 16, elements: !473, templateParams: !42, identifier: "2f99b2185d9686dc39d6b1939773798c", discriminator: !483)
!473 = !{!474, !479}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !472, file: !8, baseType: !475, size: 32, align: 16, extraData: i128 0)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !470, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !476, templateParams: !478, identifier: "e1cf7bf821edb83f3bed841e58c23c3f")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !475, file: !8, baseType: !460, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!478 = !{!462, !202}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !472, file: !8, baseType: !480, size: 32, align: 16, extraData: i128 1)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !470, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !481, templateParams: !478, identifier: "4583fbc76faed91fed4cde7dd1adfcc5")
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !480, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !470, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !485, file: !8, size: 64, align: 64, elements: !487, templateParams: !42, identifier: "b084e7ff82794b8c2eba2d568df42f06")
!485 = !DINamespace(name: "parse_hex", scope: !486)
!486 = !DINamespace(name: "{impl#13}", scope: !231)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !484, file: !8, baseType: !234, size: 64, align: 64)
!489 = !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h64bce674d50f0e4dE", scope: !452, file: !170, line: 826, type: !468, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !490)
!490 = !{!462, !182, !237, !491}
!491 = !DITemplateTypeParameter(name: "O", type: !484)
!492 = !{!493, !494, !495, !497}
!493 = !DILocalVariable(name: "self", arg: 1, scope: !451, file: !170, line: 826, type: !452)
!494 = !DILocalVariable(name: "op", arg: 2, scope: !451, file: !170, line: 826, type: !484)
!495 = !DILocalVariable(name: "t", scope: !496, file: !170, line: 828, type: !460, align: 2)
!496 = distinct !DILexicalBlock(scope: !451, file: !170, line: 828, column: 13)
!497 = !DILocalVariable(name: "e", scope: !498, file: !170, line: 829, type: !183, align: 1)
!498 = distinct !DILexicalBlock(scope: !451, file: !170, line: 829, column: 13)
!499 = !DILocation(line: 826, column: 42, scope: !451)
!500 = !DILocation(line: 826, column: 48, scope: !451)
!501 = !DILocation(line: 827, column: 15, scope: !451)
!502 = !DILocation(line: 827, column: 9, scope: !451)
!503 = !DILocation(line: 828, column: 16, scope: !451)
!504 = !DILocation(line: 828, column: 16, scope: !496)
!505 = !DILocation(line: 828, column: 22, scope: !496)
!506 = !DILocation(line: 828, column: 26, scope: !451)
!507 = !DILocation(line: 829, column: 17, scope: !451)
!508 = !DILocation(line: 829, column: 17, scope: !498)
!509 = !DILocation(line: 829, column: 27, scope: !498)
!510 = !DILocation(line: 829, column: 23, scope: !498)
!511 = !DILocation(line: 829, column: 32, scope: !451)
!512 = !DILocation(line: 831, column: 5, scope: !451)
!513 = !DILocation(line: 831, column: 6, scope: !451)
!514 = distinct !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h791dbd5fa75f559dE", scope: !515, file: !170, line: 826, type: !531, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !553, declaration: !552, retainedNodes: !555)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !516, templateParams: !42, identifier: "6413ae9243d7d63913e43aff16424cff")
!516 = !{!517}
!517 = !DICompositeType(tag: DW_TAG_variant_part, scope: !515, file: !8, size: 32, align: 16, elements: !518, templateParams: !42, identifier: "c8b2a7fc1206e2c2899a2a7082700ac4", discriminator: !530)
!518 = !{!519, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !517, file: !8, baseType: !520, size: 32, align: 16, extraData: i128 0)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !515, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !521, templateParams: !524, identifier: "e4523d61b1c6ffd87e7c27eb69a5759f")
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !520, file: !8, baseType: !523, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!523 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!524 = !{!525, !182}
!525 = !DITemplateTypeParameter(name: "T", type: !523)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !517, file: !8, baseType: !527, size: 32, align: 16, extraData: i128 1)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !515, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !528, templateParams: !524, identifier: "3935a1a9ba767cf3b4c92cf6a4750b6b")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !527, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!530 = !DIDerivedType(tag: DW_TAG_member, scope: !515, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !515, !547}
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !534, templateParams: !42, identifier: "4882742a1fada78998872acecf28cc01")
!534 = !{!535}
!535 = !DICompositeType(tag: DW_TAG_variant_part, scope: !533, file: !8, size: 32, align: 16, elements: !536, templateParams: !42, identifier: "ef5e5921f0503b0fd6dda3a917efd0bc", discriminator: !546)
!536 = !{!537, !542}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !535, file: !8, baseType: !538, size: 32, align: 16, extraData: i128 0)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !533, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !539, templateParams: !541, identifier: "c765638f56cda8e960703505b404c91e")
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !538, file: !8, baseType: !523, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!541 = !{!525, !202}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !535, file: !8, baseType: !543, size: 32, align: 16, extraData: i128 1)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !533, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !544, templateParams: !541, identifier: "c126b323dd8b3d5b43d07fcae4256974")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !543, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !548, file: !8, size: 64, align: 64, elements: !550, templateParams: !42, identifier: "4363e80b1fb3eee95190e8bb735ba619")
!548 = !DINamespace(name: "parse_hex", scope: !549)
!549 = !DINamespace(name: "{impl#14}", scope: !231)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !547, file: !8, baseType: !234, size: 64, align: 64)
!552 = !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h791dbd5fa75f559dE", scope: !515, file: !170, line: 826, type: !531, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !553)
!553 = !{!525, !182, !237, !554}
!554 = !DITemplateTypeParameter(name: "O", type: !547)
!555 = !{!556, !557, !558, !560}
!556 = !DILocalVariable(name: "self", arg: 1, scope: !514, file: !170, line: 826, type: !515)
!557 = !DILocalVariable(name: "op", arg: 2, scope: !514, file: !170, line: 826, type: !547)
!558 = !DILocalVariable(name: "t", scope: !559, file: !170, line: 828, type: !523, align: 2)
!559 = distinct !DILexicalBlock(scope: !514, file: !170, line: 828, column: 13)
!560 = !DILocalVariable(name: "e", scope: !561, file: !170, line: 829, type: !183, align: 1)
!561 = distinct !DILexicalBlock(scope: !514, file: !170, line: 829, column: 13)
!562 = !DILocation(line: 826, column: 42, scope: !514)
!563 = !DILocation(line: 826, column: 48, scope: !514)
!564 = !DILocation(line: 827, column: 15, scope: !514)
!565 = !DILocation(line: 827, column: 9, scope: !514)
!566 = !DILocation(line: 828, column: 16, scope: !514)
!567 = !DILocation(line: 828, column: 16, scope: !559)
!568 = !DILocation(line: 828, column: 22, scope: !559)
!569 = !DILocation(line: 828, column: 26, scope: !514)
!570 = !DILocation(line: 829, column: 17, scope: !514)
!571 = !DILocation(line: 829, column: 17, scope: !561)
!572 = !DILocation(line: 829, column: 27, scope: !561)
!573 = !DILocation(line: 829, column: 23, scope: !561)
!574 = !DILocation(line: 829, column: 32, scope: !514)
!575 = !DILocation(line: 831, column: 5, scope: !514)
!576 = !DILocation(line: 831, column: 6, scope: !514)
!577 = distinct !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9cffb79a8d766450E", scope: !578, file: !170, line: 826, type: !593, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !615, declaration: !614, retainedNodes: !617)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !579, templateParams: !42, identifier: "41c63229caf2261b17a388f1794c4414")
!579 = !{!580}
!580 = !DICompositeType(tag: DW_TAG_variant_part, scope: !578, file: !8, size: 16, align: 8, elements: !581, templateParams: !42, identifier: "d0ebcc80d221c2e1c1ae3fe60b587c54", discriminator: !592)
!581 = !{!582, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !580, file: !8, baseType: !583, size: 16, align: 8, extraData: i128 0)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !578, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !584, templateParams: !586, identifier: "b76a0ffe39b2e6a1497057fca5f9590a")
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !583, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!586 = !{!587, !182}
!587 = !DITemplateTypeParameter(name: "T", type: !12)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !580, file: !8, baseType: !589, size: 16, align: 8, extraData: i128 1)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !578, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !590, templateParams: !586, identifier: "85a02444041f42d4d4da1b55fc7fa33c")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !589, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!592 = !DIDerivedType(tag: DW_TAG_member, scope: !578, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !578, !609}
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !596, templateParams: !42, identifier: "79a48eaf7ec10fcfc2d0683f2db3de1d")
!596 = !{!597}
!597 = !DICompositeType(tag: DW_TAG_variant_part, scope: !595, file: !8, size: 16, align: 8, elements: !598, templateParams: !42, identifier: "1f33b60f3db979403d928e5a026a6714", discriminator: !608)
!598 = !{!599, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !597, file: !8, baseType: !600, size: 16, align: 8, extraData: i128 0)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !595, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !601, templateParams: !603, identifier: "6398945f002a9008451b327963541f26")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !600, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!603 = !{!587, !202}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !597, file: !8, baseType: !605, size: 16, align: 8, extraData: i128 1)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !595, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !606, templateParams: !603, identifier: "cf4c6bc4d47e82a3d407ce92d2fefe52")
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !605, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!608 = !DIDerivedType(tag: DW_TAG_member, scope: !595, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !610, file: !8, size: 64, align: 64, elements: !612, templateParams: !42, identifier: "5317ae6bdbdfef57c8fa74c547ce157a")
!610 = !DINamespace(name: "parse_hex", scope: !611)
!611 = !DINamespace(name: "{impl#5}", scope: !231)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !609, file: !8, baseType: !234, size: 64, align: 64)
!614 = !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h9cffb79a8d766450E", scope: !578, file: !170, line: 826, type: !593, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !615)
!615 = !{!587, !182, !237, !616}
!616 = !DITemplateTypeParameter(name: "O", type: !609)
!617 = !{!618, !619, !620, !622}
!618 = !DILocalVariable(name: "self", arg: 1, scope: !577, file: !170, line: 826, type: !578)
!619 = !DILocalVariable(name: "op", arg: 2, scope: !577, file: !170, line: 826, type: !609)
!620 = !DILocalVariable(name: "t", scope: !621, file: !170, line: 828, type: !12, align: 1)
!621 = distinct !DILexicalBlock(scope: !577, file: !170, line: 828, column: 13)
!622 = !DILocalVariable(name: "e", scope: !623, file: !170, line: 829, type: !183, align: 1)
!623 = distinct !DILexicalBlock(scope: !577, file: !170, line: 829, column: 13)
!624 = !DILocation(line: 826, column: 42, scope: !577)
!625 = !DILocation(line: 826, column: 48, scope: !577)
!626 = !DILocation(line: 827, column: 15, scope: !577)
!627 = !DILocation(line: 827, column: 9, scope: !577)
!628 = !DILocation(line: 828, column: 16, scope: !577)
!629 = !DILocation(line: 828, column: 16, scope: !621)
!630 = !DILocation(line: 828, column: 22, scope: !621)
!631 = !DILocation(line: 828, column: 26, scope: !577)
!632 = !DILocation(line: 829, column: 17, scope: !577)
!633 = !DILocation(line: 829, column: 17, scope: !623)
!634 = !DILocation(line: 829, column: 27, scope: !623)
!635 = !DILocation(line: 829, column: 23, scope: !623)
!636 = !DILocation(line: 829, column: 32, scope: !577)
!637 = !DILocation(line: 831, column: 5, scope: !577)
!638 = !DILocation(line: 831, column: 6, scope: !577)
!639 = distinct !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17haf953e8d000054a6E", scope: !640, file: !170, line: 826, type: !656, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !678, declaration: !677, retainedNodes: !680)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !641, templateParams: !42, identifier: "1d41c9a405138e710a6066e08623434")
!641 = !{!642}
!642 = !DICompositeType(tag: DW_TAG_variant_part, scope: !640, file: !8, size: 64, align: 32, elements: !643, templateParams: !42, identifier: "59a676d486d386238b991f73e30b545a", discriminator: !655)
!643 = !{!644, !651}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !642, file: !8, baseType: !645, size: 64, align: 32, extraData: i128 0)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !640, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !646, templateParams: !649, identifier: "21ba9974eda1d7905c1b32895a7a860a")
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !645, file: !8, baseType: !648, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!648 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!649 = !{!650, !182}
!650 = !DITemplateTypeParameter(name: "T", type: !648)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !642, file: !8, baseType: !652, size: 64, align: 32, extraData: i128 1)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !640, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !653, templateParams: !649, identifier: "564f7b78e152c9d8dfd66c990d88c1db")
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !652, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !640, !672}
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !659, templateParams: !42, identifier: "b5848f1fc3427ea887d629981d0d1d8a")
!659 = !{!660}
!660 = !DICompositeType(tag: DW_TAG_variant_part, scope: !658, file: !8, size: 64, align: 32, elements: !661, templateParams: !42, identifier: "acca58fca9111970ee4262a82ebc9cdc", discriminator: !671)
!661 = !{!662, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !660, file: !8, baseType: !663, size: 64, align: 32, extraData: i128 0)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !658, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !664, templateParams: !666, identifier: "dffd06e9c9ed248b4e1a293e3081bb2c")
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !663, file: !8, baseType: !648, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!666 = !{!650, !202}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !660, file: !8, baseType: !668, size: 64, align: 32, extraData: i128 1)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !658, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !669, templateParams: !666, identifier: "9c9c703920f847ccbe2ec543df47233")
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !668, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!671 = !DIDerivedType(tag: DW_TAG_member, scope: !658, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !673, file: !8, size: 64, align: 64, elements: !675, templateParams: !42, identifier: "a0f039cc0fc15eee23e91d2179a75cbb")
!673 = !DINamespace(name: "parse_hex", scope: !674)
!674 = !DINamespace(name: "{impl#22}", scope: !231)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !672, file: !8, baseType: !234, size: 64, align: 64)
!677 = !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17haf953e8d000054a6E", scope: !640, file: !170, line: 826, type: !656, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !678)
!678 = !{!650, !182, !237, !679}
!679 = !DITemplateTypeParameter(name: "O", type: !672)
!680 = !{!681, !682, !683, !685}
!681 = !DILocalVariable(name: "self", arg: 1, scope: !639, file: !170, line: 826, type: !640)
!682 = !DILocalVariable(name: "op", arg: 2, scope: !639, file: !170, line: 826, type: !672)
!683 = !DILocalVariable(name: "t", scope: !684, file: !170, line: 828, type: !648, align: 4)
!684 = distinct !DILexicalBlock(scope: !639, file: !170, line: 828, column: 13)
!685 = !DILocalVariable(name: "e", scope: !686, file: !170, line: 829, type: !183, align: 1)
!686 = distinct !DILexicalBlock(scope: !639, file: !170, line: 829, column: 13)
!687 = !DILocation(line: 826, column: 42, scope: !639)
!688 = !DILocation(line: 826, column: 48, scope: !639)
!689 = !DILocation(line: 827, column: 15, scope: !639)
!690 = !DILocation(line: 827, column: 9, scope: !639)
!691 = !DILocation(line: 828, column: 16, scope: !639)
!692 = !DILocation(line: 828, column: 16, scope: !684)
!693 = !DILocation(line: 828, column: 22, scope: !684)
!694 = !DILocation(line: 828, column: 26, scope: !639)
!695 = !DILocation(line: 829, column: 17, scope: !639)
!696 = !DILocation(line: 829, column: 17, scope: !686)
!697 = !DILocation(line: 829, column: 27, scope: !686)
!698 = !DILocation(line: 829, column: 23, scope: !686)
!699 = !DILocation(line: 829, column: 32, scope: !639)
!700 = !DILocation(line: 831, column: 5, scope: !639)
!701 = !DILocation(line: 831, column: 6, scope: !639)
!702 = distinct !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb5c717667d88c724E", scope: !703, file: !170, line: 826, type: !718, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !740, declaration: !739, retainedNodes: !742)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !704, templateParams: !42, identifier: "99f55940fbc4c0c21f2830e9296af681")
!704 = !{!705}
!705 = !DICompositeType(tag: DW_TAG_variant_part, scope: !703, file: !8, size: 64, align: 32, elements: !706, templateParams: !42, identifier: "13b84c19a5930963f4e1b551f74c7543", discriminator: !717)
!706 = !{!707, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !705, file: !8, baseType: !708, size: 64, align: 32, extraData: i128 0)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !703, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !709, templateParams: !711, identifier: "24f2c72ce3c2fb517e1aae233502980d")
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !708, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!711 = !{!712, !182}
!712 = !DITemplateTypeParameter(name: "T", type: !65)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !705, file: !8, baseType: !714, size: 64, align: 32, extraData: i128 1)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !703, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !715, templateParams: !711, identifier: "d96e5d79eead3290566d558306673409")
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !714, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!717 = !DIDerivedType(tag: DW_TAG_member, scope: !703, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !703, !734}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !721, templateParams: !42, identifier: "b40ee903fedb32eb7010ad47c210e53c")
!721 = !{!722}
!722 = !DICompositeType(tag: DW_TAG_variant_part, scope: !720, file: !8, size: 64, align: 32, elements: !723, templateParams: !42, identifier: "65855f9e4662568bca0407f48911a2ba", discriminator: !733)
!723 = !{!724, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !722, file: !8, baseType: !725, size: 64, align: 32, extraData: i128 0)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !720, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !726, templateParams: !728, identifier: "f221cde1f73e46091276c90fb8c4f0d")
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !725, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!728 = !{!712, !202}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !722, file: !8, baseType: !730, size: 64, align: 32, extraData: i128 1)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !720, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !731, templateParams: !728, identifier: "cf9d9252f6b7f2b0c466607656137d07")
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !730, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!733 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !735, file: !8, size: 64, align: 64, elements: !737, templateParams: !42, identifier: "4ff83d6c924e43b3a0202abf6f11f5e7")
!735 = !DINamespace(name: "parse_hex", scope: !736)
!736 = !DINamespace(name: "{impl#21}", scope: !231)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !734, file: !8, baseType: !234, size: 64, align: 64)
!739 = !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb5c717667d88c724E", scope: !703, file: !170, line: 826, type: !718, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !740)
!740 = !{!712, !182, !237, !741}
!741 = !DITemplateTypeParameter(name: "O", type: !734)
!742 = !{!743, !744, !745, !747}
!743 = !DILocalVariable(name: "self", arg: 1, scope: !702, file: !170, line: 826, type: !703)
!744 = !DILocalVariable(name: "op", arg: 2, scope: !702, file: !170, line: 826, type: !734)
!745 = !DILocalVariable(name: "t", scope: !746, file: !170, line: 828, type: !65, align: 4)
!746 = distinct !DILexicalBlock(scope: !702, file: !170, line: 828, column: 13)
!747 = !DILocalVariable(name: "e", scope: !748, file: !170, line: 829, type: !183, align: 1)
!748 = distinct !DILexicalBlock(scope: !702, file: !170, line: 829, column: 13)
!749 = !DILocation(line: 826, column: 42, scope: !702)
!750 = !DILocation(line: 826, column: 48, scope: !702)
!751 = !DILocation(line: 827, column: 15, scope: !702)
!752 = !DILocation(line: 827, column: 9, scope: !702)
!753 = !DILocation(line: 828, column: 16, scope: !702)
!754 = !DILocation(line: 828, column: 16, scope: !746)
!755 = !DILocation(line: 828, column: 22, scope: !746)
!756 = !DILocation(line: 828, column: 26, scope: !702)
!757 = !DILocation(line: 829, column: 17, scope: !702)
!758 = !DILocation(line: 829, column: 17, scope: !748)
!759 = !DILocation(line: 829, column: 27, scope: !748)
!760 = !DILocation(line: 829, column: 23, scope: !748)
!761 = !DILocation(line: 829, column: 32, scope: !702)
!762 = !DILocation(line: 831, column: 5, scope: !702)
!763 = !DILocation(line: 831, column: 6, scope: !702)
!764 = distinct !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hbf2c988073cb8351E", scope: !765, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !802, declaration: !801, retainedNodes: !804)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !766, templateParams: !42, identifier: "a6b4c165d6936c6f3c37cb52e84d0e70")
!766 = !{!767}
!767 = !DICompositeType(tag: DW_TAG_variant_part, scope: !765, file: !8, size: 128, align: 64, elements: !768, templateParams: !42, identifier: "efef28a22448d7c35148896963590e18", discriminator: !779)
!768 = !{!769, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !767, file: !8, baseType: !770, size: 128, align: 64, extraData: i128 0)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !765, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !771, templateParams: !773, identifier: "2c6b8b413fb19162d9e62253bebeb6db")
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !770, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!773 = !{!774, !182}
!774 = !DITemplateTypeParameter(name: "T", type: !82)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !767, file: !8, baseType: !776, size: 128, align: 64, extraData: i128 1)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !765, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !777, templateParams: !773, identifier: "a0f0251a5a86cb07a2b74a94e99deb6b")
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !776, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!780 = !DISubroutineType(types: !781)
!781 = !{!782, !765, !796}
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !783, templateParams: !42, identifier: "fc1ee3f192783967324c569cb9f64857")
!783 = !{!784}
!784 = !DICompositeType(tag: DW_TAG_variant_part, scope: !782, file: !8, size: 128, align: 64, elements: !785, templateParams: !42, identifier: "72bf24af8280a9c1e932811fa09e056b", discriminator: !795)
!785 = !{!786, !791}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !784, file: !8, baseType: !787, size: 128, align: 64, extraData: i128 0)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !782, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !788, templateParams: !790, identifier: "be1ddd37b5c7f33f9ffedf31801616f0")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!790 = !{!774, !202}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !784, file: !8, baseType: !792, size: 128, align: 64, extraData: i128 1)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !782, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !793, templateParams: !790, identifier: "d4ead6c41a7c094b3e57b5dd1056d94f")
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !792, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !797, file: !8, size: 64, align: 64, elements: !799, templateParams: !42, identifier: "d0d7a82c73f05a34a79e6c5fefbd47a2")
!797 = !DINamespace(name: "parse_hex", scope: !798)
!798 = !DINamespace(name: "{impl#29}", scope: !231)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !796, file: !8, baseType: !234, size: 64, align: 64)
!801 = !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hbf2c988073cb8351E", scope: !765, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !802)
!802 = !{!774, !182, !237, !803}
!803 = !DITemplateTypeParameter(name: "O", type: !796)
!804 = !{!805, !806, !807, !809}
!805 = !DILocalVariable(name: "self", arg: 1, scope: !764, file: !170, line: 826, type: !765)
!806 = !DILocalVariable(name: "op", arg: 2, scope: !764, file: !170, line: 826, type: !796)
!807 = !DILocalVariable(name: "t", scope: !808, file: !170, line: 828, type: !82, align: 8)
!808 = distinct !DILexicalBlock(scope: !764, file: !170, line: 828, column: 13)
!809 = !DILocalVariable(name: "e", scope: !810, file: !170, line: 829, type: !183, align: 1)
!810 = distinct !DILexicalBlock(scope: !764, file: !170, line: 829, column: 13)
!811 = !DILocation(line: 826, column: 42, scope: !764)
!812 = !DILocation(line: 826, column: 48, scope: !764)
!813 = !DILocation(line: 827, column: 15, scope: !764)
!814 = !DILocation(line: 827, column: 9, scope: !764)
!815 = !DILocation(line: 828, column: 16, scope: !764)
!816 = !DILocation(line: 828, column: 16, scope: !808)
!817 = !DILocation(line: 828, column: 22, scope: !808)
!818 = !DILocation(line: 828, column: 26, scope: !764)
!819 = !DILocation(line: 829, column: 17, scope: !764)
!820 = !DILocation(line: 829, column: 17, scope: !810)
!821 = !DILocation(line: 829, column: 27, scope: !810)
!822 = !DILocation(line: 829, column: 23, scope: !810)
!823 = !DILocation(line: 829, column: 32, scope: !764)
!824 = !DILocation(line: 831, column: 5, scope: !764)
!825 = !DILocation(line: 831, column: 6, scope: !764)
!826 = distinct !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc2939c86c2cd0c81E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !865, declaration: !864, retainedNodes: !867)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !828, templateParams: !42, identifier: "7e7a4e42d5ca80df8f6247ff60985cf7")
!828 = !{!829}
!829 = !DICompositeType(tag: DW_TAG_variant_part, scope: !827, file: !8, size: 128, align: 64, elements: !830, templateParams: !42, identifier: "1bdd2dd4deb49c97b12f96560e5b1211", discriminator: !842)
!830 = !{!831, !838}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !829, file: !8, baseType: !832, size: 128, align: 64, extraData: i128 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !827, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !833, templateParams: !836, identifier: "b964540dc23e4c7db0d1d2355f1a2f01")
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !8, baseType: !835, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!835 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!836 = !{!837, !182}
!837 = !DITemplateTypeParameter(name: "T", type: !835)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !829, file: !8, baseType: !839, size: 128, align: 64, extraData: i128 1)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !827, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !840, templateParams: !836, identifier: "8b48b8ba8fe945065ca037be5f26bb71")
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !827, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !827, !859}
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !846, templateParams: !42, identifier: "90e84f6434d4526f936012bd253a74e1")
!846 = !{!847}
!847 = !DICompositeType(tag: DW_TAG_variant_part, scope: !845, file: !8, size: 128, align: 64, elements: !848, templateParams: !42, identifier: "a36610263f1e672c2e3a8fce7bdeb390", discriminator: !858)
!848 = !{!849, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !847, file: !8, baseType: !850, size: 128, align: 64, extraData: i128 0)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !845, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !851, templateParams: !853, identifier: "5d4e681ae8fc7999789eb6c4ab2b7d19")
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !850, file: !8, baseType: !835, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!853 = !{!837, !202}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !847, file: !8, baseType: !855, size: 128, align: 64, extraData: i128 1)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !845, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !856, templateParams: !853, identifier: "5d5fdcffbbae801fe5428cda7272a9f")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !845, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !860, file: !8, size: 64, align: 64, elements: !862, templateParams: !42, identifier: "e17e3584a5026cfd2a95c6a77343a85d")
!860 = !DINamespace(name: "parse_hex", scope: !861)
!861 = !DINamespace(name: "{impl#46}", scope: !231)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !859, file: !8, baseType: !234, size: 64, align: 64)
!864 = !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc2939c86c2cd0c81E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !865)
!865 = !{!837, !182, !237, !866}
!866 = !DITemplateTypeParameter(name: "O", type: !859)
!867 = !{!868, !869, !870, !872}
!868 = !DILocalVariable(name: "self", arg: 1, scope: !826, file: !170, line: 826, type: !827)
!869 = !DILocalVariable(name: "op", arg: 2, scope: !826, file: !170, line: 826, type: !859)
!870 = !DILocalVariable(name: "t", scope: !871, file: !170, line: 828, type: !835, align: 8)
!871 = distinct !DILexicalBlock(scope: !826, file: !170, line: 828, column: 13)
!872 = !DILocalVariable(name: "e", scope: !873, file: !170, line: 829, type: !183, align: 1)
!873 = distinct !DILexicalBlock(scope: !826, file: !170, line: 829, column: 13)
!874 = !DILocation(line: 826, column: 42, scope: !826)
!875 = !DILocation(line: 826, column: 48, scope: !826)
!876 = !DILocation(line: 827, column: 15, scope: !826)
!877 = !DILocation(line: 827, column: 9, scope: !826)
!878 = !DILocation(line: 828, column: 16, scope: !826)
!879 = !DILocation(line: 828, column: 16, scope: !871)
!880 = !DILocation(line: 828, column: 22, scope: !871)
!881 = !DILocation(line: 828, column: 26, scope: !826)
!882 = !DILocation(line: 829, column: 17, scope: !826)
!883 = !DILocation(line: 829, column: 17, scope: !873)
!884 = !DILocation(line: 829, column: 27, scope: !873)
!885 = !DILocation(line: 829, column: 23, scope: !873)
!886 = !DILocation(line: 829, column: 32, scope: !826)
!887 = !DILocation(line: 831, column: 5, scope: !826)
!888 = !DILocation(line: 831, column: 6, scope: !826)
!889 = distinct !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd435d0d2cc15df35E", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !928, declaration: !927, retainedNodes: !930)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !891, templateParams: !42, identifier: "19a2b376ac9e6d9c822057f39a013ae")
!891 = !{!892}
!892 = !DICompositeType(tag: DW_TAG_variant_part, scope: !890, file: !8, size: 16, align: 8, elements: !893, templateParams: !42, identifier: "fe256c81fee04f782c8d1ac9f3cd7ddd", discriminator: !905)
!893 = !{!894, !901}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !892, file: !8, baseType: !895, size: 16, align: 8, extraData: i128 0)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !890, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !896, templateParams: !899, identifier: "8924f96c9707fd9145fc1eff0c8728a8")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !895, file: !8, baseType: !898, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!898 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!899 = !{!900, !182}
!900 = !DITemplateTypeParameter(name: "T", type: !898)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !892, file: !8, baseType: !902, size: 16, align: 8, extraData: i128 1)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !890, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !903, templateParams: !899, identifier: "c95f38262c2b060d564d8e95841b1a3a")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !890, !922}
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !909, templateParams: !42, identifier: "dadd6813602b03ff8bbb6f15fadf4ad4")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !8, size: 16, align: 8, elements: !911, templateParams: !42, identifier: "a2bf5f66dd5d137172ede2101b5b7da4", discriminator: !921)
!911 = !{!912, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !910, file: !8, baseType: !913, size: 16, align: 8, extraData: i128 0)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !908, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !914, templateParams: !916, identifier: "e6c8dd28a0a25a73ddafb1ce86254d48")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !913, file: !8, baseType: !898, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!916 = !{!900, !202}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !910, file: !8, baseType: !918, size: 16, align: 8, extraData: i128 1)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !908, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !919, templateParams: !916, identifier: "ecb6fcbc049a24dc7c0603f942af2c1a")
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !918, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !923, file: !8, size: 64, align: 64, elements: !925, templateParams: !42, identifier: "e17724b50c0a95d588038ca10311e3ae")
!923 = !DINamespace(name: "parse_hex", scope: !924)
!924 = !DINamespace(name: "{impl#6}", scope: !231)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !922, file: !8, baseType: !234, size: 64, align: 64)
!927 = !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hd435d0d2cc15df35E", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !928)
!928 = !{!900, !182, !237, !929}
!929 = !DITemplateTypeParameter(name: "O", type: !922)
!930 = !{!931, !932, !933, !935}
!931 = !DILocalVariable(name: "self", arg: 1, scope: !889, file: !170, line: 826, type: !890)
!932 = !DILocalVariable(name: "op", arg: 2, scope: !889, file: !170, line: 826, type: !922)
!933 = !DILocalVariable(name: "t", scope: !934, file: !170, line: 828, type: !898, align: 1)
!934 = distinct !DILexicalBlock(scope: !889, file: !170, line: 828, column: 13)
!935 = !DILocalVariable(name: "e", scope: !936, file: !170, line: 829, type: !183, align: 1)
!936 = distinct !DILexicalBlock(scope: !889, file: !170, line: 829, column: 13)
!937 = !DILocation(line: 826, column: 42, scope: !889)
!938 = !DILocation(line: 826, column: 48, scope: !889)
!939 = !DILocation(line: 827, column: 15, scope: !889)
!940 = !DILocation(line: 827, column: 9, scope: !889)
!941 = !DILocation(line: 828, column: 16, scope: !889)
!942 = !DILocation(line: 828, column: 16, scope: !934)
!943 = !DILocation(line: 828, column: 22, scope: !934)
!944 = !DILocation(line: 828, column: 26, scope: !889)
!945 = !DILocation(line: 829, column: 17, scope: !889)
!946 = !DILocation(line: 829, column: 17, scope: !936)
!947 = !DILocation(line: 829, column: 27, scope: !936)
!948 = !DILocation(line: 829, column: 23, scope: !936)
!949 = !DILocation(line: 829, column: 32, scope: !889)
!950 = !DILocation(line: 831, column: 5, scope: !889)
!951 = !DILocation(line: 831, column: 6, scope: !889)
!952 = distinct !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h9d00ad59714990a0E", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !957, declaration: !956, retainedNodes: !959)
!953 = !DIFile(filename: "src/parser.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1", checksumkind: CSK_MD5, checksum: "2e786373a5103ab0379604d86533efec")
!954 = !DISubroutineType(types: !955)
!955 = !{!203, !36}
!956 = !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h9d00ad59714990a0E", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !957)
!957 = !{!958}
!958 = !DITemplateTypeParameter(name: "impl fmt::Display", type: !36)
!959 = !{!960, !961, !963}
!960 = !DILocalVariable(name: "flag", arg: 1, scope: !952, file: !953, line: 181, type: !36)
!961 = !DILocalVariable(name: "_flag", scope: !962, file: !953, line: 182, type: !36, align: 8)
!962 = distinct !DILexicalBlock(scope: !952, file: !953, line: 182, column: 9)
!963 = !DILocalVariable(name: "got", scope: !964, file: !953, line: 184, type: !114, align: 1)
