; ModuleID = 'bitflags.d2c08ecd17fc4560-cgu.0'
source_filename = "bitflags.d2c08ecd17fc4560-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::result::Result<usize, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<usize, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<usize, parser::ParseError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<usize, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<usize, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u64, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<u64, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<u64, parser::ParseError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<u64, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u64, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<i8, parser::ParseError>" = type { i8, [1 x i8] }
%"core::result::Result<i8, core::num::error::ParseIntError>" = type { i8, [1 x i8] }
%"core::result::Result<i8, core::num::error::ParseIntError>::Ok" = type { [1 x i8], i8 }
%"core::result::Result<i8, parser::ParseError>::Ok" = type { [1 x i8], i8 }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.77.0-nightly (bf8716f1c 2023-12-24)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.77.0-nightly (bf8716f1c 2023-12-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1/src/lib.rs/@/bitflags.d2c08ecd17fc4560-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "error", scope: !20)
!20 = !DINamespace(name: "num", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h63a4c215903e7092E", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !159, retainedNodes: !160)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !42, identifier: "5c0bf663e13aed18b42e27881fea807c")
!30 = !{!31, !44, !90}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !29, file: !8, baseType: !32, size: 128, align: 64, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !33, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!33 = !{!34, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !32, file: !8, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !37, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !36, file: !8, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!42 = !{}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !29, file: !8, baseType: !45, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !42, identifier: "256519899e0672ceeaebd48b858206cf")
!46 = !DINamespace(name: "option", scope: !11)
!47 = !{!48}
!48 = !DICompositeType(tag: DW_TAG_variant_part, scope: !45, file: !8, size: 128, align: 64, elements: !49, templateParams: !42, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !89)
!49 = !{!50, !85}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !48, file: !8, baseType: !51, size: 128, align: 64, extraData: i128 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !52, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !55, templateParams: !42, identifier: "24318146e6c8bdc87822ff535a36a389")
!55 = !{!56, !84}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !54, file: !8, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !42, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!59 = !{!60, !61, !63, !64, !66, !83}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !58, file: !8, baseType: !41, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !8, baseType: !62, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !8, baseType: !65, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !8, baseType: !67, size: 128, align: 64, flags: DIFlagPublic)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !68, templateParams: !42, identifier: "96b697dd48c62362a4fdd24d145e624f")
!68 = !{!69}
!69 = !DICompositeType(tag: DW_TAG_variant_part, scope: !67, file: !8, size: 128, align: 64, elements: !70, templateParams: !42, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !81)
!70 = !{!71, !75, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !69, file: !8, baseType: !72, size: 128, align: 64, extraData: i128 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !73, templateParams: !42, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !69, file: !8, baseType: !76, size: 128, align: 64, extraData: i128 1)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !77, templateParams: !42, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !69, file: !8, baseType: !80, size: 128, align: 64, extraData: i128 2)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, identifier: "a1add839f51aefefecdce3df6110b61f")
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!82 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !8, baseType: !67, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !48, file: !8, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !87, templateParams: !52, identifier: "f965b304662f282235bb5dc25f3fae0f")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !86, file: !8, baseType: !54, size: 128, align: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !45, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !29, file: !8, baseType: !91, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !92, templateParams: !42, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!92 = !{!93, !156}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !91, file: !8, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !96, templateParams: !42, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !8, baseType: !98, size: 64, align: 64, flags: DIFlagPrivate)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !100, file: !8, align: 8, elements: !42, identifier: "fffd88202d364d3dc6423c86977eda88")
!100 = !DINamespace(name: "{extern#0}", scope: !9)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !95, file: !8, baseType: !102, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !98, !124}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !106, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !107, templateParams: !42, identifier: "27f960845886d02861ac4e7842c7e3a5")
!106 = !DINamespace(name: "result", scope: !11)
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_variant_part, scope: !105, file: !8, size: 8, align: 8, elements: !109, templateParams: !42, identifier: "66d489f599415104a0443264f219183e", discriminator: !123)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !108, file: !8, baseType: !111, size: 8, align: 8, extraData: i128 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !112, templateParams: !115, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !111, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPublic)
!114 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!115 = !{!116, !117}
!116 = !DITemplateTypeParameter(name: "T", type: !114)
!117 = !DITemplateTypeParameter(name: "E", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !42, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !108, file: !8, baseType: !120, size: 8, align: 8, extraData: i128 1)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !121, templateParams: !115, identifier: "c5badd8093158a69d1e378abd358f888")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !8, baseType: !118, align: 8, offset: 8, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, scope: !105, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !126, templateParams: !42, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!126 = !{!127, !128, !129, !130, !144, !145}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !8, baseType: !65, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !125, file: !8, baseType: !62, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !125, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !125, file: !8, baseType: !131, size: 128, align: 64, flags: DIFlagPrivate)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !132, templateParams: !42, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !131, file: !8, size: 128, align: 64, elements: !134, templateParams: !42, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !143)
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !133, file: !8, baseType: !136, size: 128, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !137, identifier: "ae81ebe2a9866af8df117bed47adaee")
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "T", type: !41)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !133, file: !8, baseType: !140, size: 128, align: 64, extraData: i128 1)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !141, templateParams: !137, identifier: "a581ef88bb755022340fa98600955727")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !125, file: !8, baseType: !131, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !8, baseType: !146, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !147, templateParams: !42, identifier: "6607f9b055c62ce71a6a286c8014df9")
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !146, file: !8, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !42, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !146, file: !8, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 64, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3, lowerBound: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!29, !32}
!159 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h63a4c215903e7092E", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!160 = !{!161}
!161 = !DILocalVariable(name: "pieces", arg: 1, scope: !27, file: !28, line: 321, type: !32)
!162 = !DILocation(line: 321, column: 28, scope: !27)
!163 = !DILocation(line: 322, column: 12, scope: !27)
!164 = !DILocation(line: 325, column: 34, scope: !27)
!165 = !DILocation(line: 325, column: 9, scope: !27)
!166 = !{i64 8}
!167 = !DILocation(line: 326, column: 6, scope: !27)
!168 = !DILocation(line: 323, column: 13, scope: !27)
!169 = distinct !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0fd7be854103cef0E", scope: !171, file: !170, line: 826, type: !189, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !234, declaration: !233, retainedNodes: !237)
!170 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !172, templateParams: !42, identifier: "365cd9e3047f0fd5ea932564aa341085")
!172 = !{!173}
!173 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !8, size: 128, align: 64, elements: !174, templateParams: !42, identifier: "3b66ecda8d556a15d0036991208b4e84", discriminator: !188)
!174 = !{!175, !184}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !173, file: !8, baseType: !176, size: 128, align: 64, extraData: i128 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !171, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !177, templateParams: !179, identifier: "7abeb336c559c9419d6c447271834929")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!179 = !{!138, !180}
!180 = !DITemplateTypeParameter(name: "E", type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !19, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !182, templateParams: !42, identifier: "ba2611a05930c821b0ade47e36d69fa5")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !181, file: !8, baseType: !18, size: 8, align: 8, flags: DIFlagProtected)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !173, file: !8, baseType: !185, size: 128, align: 64, extraData: i128 1)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !171, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !186, templateParams: !179, identifier: "9c3aed88b88d4fc27710e2c0b5beae2")
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !185, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !171, !226}
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !192, templateParams: !42, identifier: "3b0f173ad459d02a7b400aff793c6983")
!192 = !{!193}
!193 = !DICompositeType(tag: DW_TAG_variant_part, scope: !191, file: !8, size: 128, align: 64, elements: !194, templateParams: !42, identifier: "90f4af7dd40f2b19139d66fd6c4aab8d", discriminator: !225)
!194 = !{!195, !221}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !193, file: !8, baseType: !196, size: 128, align: 64, extraData: i128 0)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !191, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !199, identifier: "a0f98e5134b8619313cf9bdceaa7f294")
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !196, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!199 = !{!138, !200}
!200 = !DITemplateTypeParameter(name: "E", type: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseError", scope: !202, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !204, templateParams: !42, identifier: "6cf01680dafc8a4674c4a0ca57e3fd4f")
!202 = !DINamespace(name: "parser", scope: !203)
!203 = !DINamespace(name: "bitflags", scope: null)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !201, file: !8, baseType: !206, size: 8, align: 8, flags: DIFlagPrivate)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorKind", scope: !202, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !207, templateParams: !42, identifier: "bfa694be7c7512371c95f5947326b647")
!207 = !{!208}
!208 = !DICompositeType(tag: DW_TAG_variant_part, scope: !206, file: !8, size: 8, align: 8, elements: !209, templateParams: !42, identifier: "3680be801a3838d15a9ff3e30bbd47a4", discriminator: !220)
!209 = !{!210, !212, !216}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "EmptyFlag", scope: !208, file: !8, baseType: !211, size: 8, align: 8, extraData: i128 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptyFlag", scope: !206, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !42, identifier: "b85c49747a343e8541512c771e12223")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNamedFlag", scope: !208, file: !8, baseType: !213, size: 8, align: 8, extraData: i128 1)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNamedFlag", scope: !206, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !214, templateParams: !42, identifier: "572fbcedb108f4d1c7bca1cbe7de6cef")
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !213, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidHexFlag", scope: !208, file: !8, baseType: !217, size: 8, align: 8, extraData: i128 2)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidHexFlag", scope: !206, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !218, templateParams: !42, identifier: "90cf171cd62b2c2ba8d6bf8501a5778b")
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !217, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!220 = !DIDerivedType(tag: DW_TAG_member, scope: !206, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !193, file: !8, baseType: !222, size: 128, align: 64, extraData: i128 1)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !191, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !223, templateParams: !199, identifier: "25178fab13187188d84f9f8a71aec94")
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !222, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !191, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !227, file: !8, size: 64, align: 64, elements: !230, templateParams: !42, identifier: "34d17131003e69bdf2c9fb29c8135796")
!227 = !DINamespace(name: "parse_hex", scope: !228)
!228 = !DINamespace(name: "{impl#45}", scope: !229)
!229 = !DINamespace(name: "traits", scope: !203)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !226, file: !8, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0fd7be854103cef0E", scope: !171, file: !170, line: 826, type: !189, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !234)
!234 = !{!138, !180, !235, !236}
!235 = !DITemplateTypeParameter(name: "F", type: !201)
!236 = !DITemplateTypeParameter(name: "O", type: !226)
!237 = !{!238, !239, !240, !242}
!238 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 826, type: !171)
!239 = !DILocalVariable(name: "op", arg: 2, scope: !169, file: !170, line: 826, type: !226)
!240 = !DILocalVariable(name: "t", scope: !241, file: !170, line: 828, type: !41, align: 8)
!241 = distinct !DILexicalBlock(scope: !169, file: !170, line: 828, column: 13)
!242 = !DILocalVariable(name: "e", scope: !243, file: !170, line: 829, type: !181, align: 1)
!243 = distinct !DILexicalBlock(scope: !169, file: !170, line: 829, column: 13)
!244 = !DILocation(line: 826, column: 42, scope: !169)
!245 = !DILocation(line: 826, column: 48, scope: !169)
!246 = !DILocation(line: 827, column: 15, scope: !169)
!247 = !{i8 0, i8 2}
!248 = !DILocation(line: 827, column: 9, scope: !169)
!249 = !DILocation(line: 828, column: 16, scope: !169)
!250 = !DILocation(line: 828, column: 16, scope: !241)
!251 = !DILocation(line: 828, column: 22, scope: !241)
!252 = !DILocation(line: 828, column: 26, scope: !169)
!253 = !DILocation(line: 829, column: 17, scope: !169)
!254 = !{i8 0, i8 5}
!255 = !DILocation(line: 829, column: 17, scope: !243)
!256 = !DILocation(line: 829, column: 27, scope: !243)
!257 = !{i8 0, i8 3}
!258 = !DILocation(line: 829, column: 23, scope: !243)
!259 = !DILocation(line: 829, column: 32, scope: !169)
!260 = !DILocation(line: 831, column: 5, scope: !169)
!261 = !DILocation(line: 831, column: 6, scope: !169)
!262 = distinct !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h52c41b1979dcca8eE", scope: !263, file: !170, line: 826, type: !278, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !300, declaration: !299, retainedNodes: !302)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !264, templateParams: !42, identifier: "4604aad8c095164b3559edeb713efbeb")
!264 = !{!265}
!265 = !DICompositeType(tag: DW_TAG_variant_part, scope: !263, file: !8, size: 128, align: 64, elements: !266, templateParams: !42, identifier: "1590f14a94460745b68477d5c5b7e25c", discriminator: !277)
!266 = !{!267, !273}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !265, file: !8, baseType: !268, size: 128, align: 64, extraData: i128 0)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !263, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !269, templateParams: !271, identifier: "341bf17fe8f0cbb1fd78e5682248a441")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !268, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!271 = !{!272, !180}
!272 = !DITemplateTypeParameter(name: "T", type: !82)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !265, file: !8, baseType: !274, size: 128, align: 64, extraData: i128 1)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !263, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !275, templateParams: !271, identifier: "e0876f21fdbc7d8d9f0d3c90a987857e")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !274, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!277 = !DIDerivedType(tag: DW_TAG_member, scope: !263, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !263, !294}
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !281, templateParams: !42, identifier: "62310ca89d910907e733da0618f991c6")
!281 = !{!282}
!282 = !DICompositeType(tag: DW_TAG_variant_part, scope: !280, file: !8, size: 128, align: 64, elements: !283, templateParams: !42, identifier: "44a773d3e3a6dab4701bac9b35f89f75", discriminator: !293)
!283 = !{!284, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !282, file: !8, baseType: !285, size: 128, align: 64, extraData: i128 0)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !280, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !286, templateParams: !288, identifier: "1b425d10dedc613bbbf67aba5aa8732")
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !285, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!288 = !{!272, !200}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !282, file: !8, baseType: !290, size: 128, align: 64, extraData: i128 1)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !280, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !291, templateParams: !288, identifier: "b9a4034889e4cb33bf0745f7e1091b9b")
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !290, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !280, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !295, file: !8, size: 64, align: 64, elements: !297, templateParams: !42, identifier: "599df663edd1160145032c6dfbc06c8b")
!295 = !DINamespace(name: "parse_hex", scope: !296)
!296 = !DINamespace(name: "{impl#29}", scope: !229)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !294, file: !8, baseType: !232, size: 64, align: 64)
!299 = !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h52c41b1979dcca8eE", scope: !263, file: !170, line: 826, type: !278, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !300)
!300 = !{!272, !180, !235, !301}
!301 = !DITemplateTypeParameter(name: "O", type: !294)
!302 = !{!303, !304, !305, !307}
!303 = !DILocalVariable(name: "self", arg: 1, scope: !262, file: !170, line: 826, type: !263)
!304 = !DILocalVariable(name: "op", arg: 2, scope: !262, file: !170, line: 826, type: !294)
!305 = !DILocalVariable(name: "t", scope: !306, file: !170, line: 828, type: !82, align: 8)
!306 = distinct !DILexicalBlock(scope: !262, file: !170, line: 828, column: 13)
!307 = !DILocalVariable(name: "e", scope: !308, file: !170, line: 829, type: !181, align: 1)
!308 = distinct !DILexicalBlock(scope: !262, file: !170, line: 829, column: 13)
!309 = !DILocation(line: 826, column: 42, scope: !262)
!310 = !DILocation(line: 826, column: 48, scope: !262)
!311 = !DILocation(line: 827, column: 15, scope: !262)
!312 = !DILocation(line: 827, column: 9, scope: !262)
!313 = !DILocation(line: 828, column: 16, scope: !262)
!314 = !DILocation(line: 828, column: 16, scope: !306)
!315 = !DILocation(line: 828, column: 22, scope: !306)
!316 = !DILocation(line: 828, column: 26, scope: !262)
!317 = !DILocation(line: 829, column: 17, scope: !262)
!318 = !DILocation(line: 829, column: 17, scope: !308)
!319 = !DILocation(line: 829, column: 27, scope: !308)
!320 = !DILocation(line: 829, column: 23, scope: !308)
!321 = !DILocation(line: 829, column: 32, scope: !262)
!322 = !DILocation(line: 831, column: 5, scope: !262)
!323 = !DILocation(line: 831, column: 6, scope: !262)
!324 = distinct !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h5601fd43a06782ecE", scope: !325, file: !170, line: 826, type: !341, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !363, declaration: !362, retainedNodes: !365)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !326, templateParams: !42, identifier: "932800905f7cc772381b6ad2c6f24570")
!326 = !{!327}
!327 = !DICompositeType(tag: DW_TAG_variant_part, scope: !325, file: !8, size: 16, align: 8, elements: !328, templateParams: !42, identifier: "9377b6ef5bb18cb183637e6fd83a5dfd", discriminator: !340)
!328 = !{!329, !336}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !327, file: !8, baseType: !330, size: 16, align: 8, extraData: i128 0)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !325, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !331, templateParams: !334, identifier: "ed56c3b301fcecd09db108e472e48ada")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !330, file: !8, baseType: !333, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!333 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!334 = !{!335, !180}
!335 = !DITemplateTypeParameter(name: "T", type: !333)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !327, file: !8, baseType: !337, size: 16, align: 8, extraData: i128 1)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !325, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !338, templateParams: !334, identifier: "9e3df1e35bc6e0a6bead73f9fdef8dfc")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !337, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !325, !357}
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !344, templateParams: !42, identifier: "e10ca77dfd9c4f5228989da6dc0fddee")
!344 = !{!345}
!345 = !DICompositeType(tag: DW_TAG_variant_part, scope: !343, file: !8, size: 16, align: 8, elements: !346, templateParams: !42, identifier: "8ae9946d372fe6ae87899537036b2bc6", discriminator: !356)
!346 = !{!347, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !345, file: !8, baseType: !348, size: 16, align: 8, extraData: i128 0)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !343, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !349, templateParams: !351, identifier: "68e6821a7af2b598d29417c1c70ad5cb")
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !348, file: !8, baseType: !333, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!351 = !{!335, !200}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !345, file: !8, baseType: !353, size: 16, align: 8, extraData: i128 1)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !343, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !354, templateParams: !351, identifier: "f2c7a1f27e3af795eec8e4b7425d2858")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !353, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, scope: !343, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !358, file: !8, size: 64, align: 64, elements: !360, templateParams: !42, identifier: "d41f9c9c0d112d2bb50170409832f68c")
!358 = !DINamespace(name: "parse_hex", scope: !359)
!359 = !DINamespace(name: "{impl#6}", scope: !229)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !357, file: !8, baseType: !232, size: 64, align: 64)
!362 = !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h5601fd43a06782ecE", scope: !325, file: !170, line: 826, type: !341, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !363)
!363 = !{!335, !180, !235, !364}
!364 = !DITemplateTypeParameter(name: "O", type: !357)
!365 = !{!366, !367, !368, !370}
!366 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !170, line: 826, type: !325)
!367 = !DILocalVariable(name: "op", arg: 2, scope: !324, file: !170, line: 826, type: !357)
!368 = !DILocalVariable(name: "t", scope: !369, file: !170, line: 828, type: !333, align: 1)
!369 = distinct !DILexicalBlock(scope: !324, file: !170, line: 828, column: 13)
!370 = !DILocalVariable(name: "e", scope: !371, file: !170, line: 829, type: !181, align: 1)
!371 = distinct !DILexicalBlock(scope: !324, file: !170, line: 829, column: 13)
!372 = !DILocation(line: 826, column: 42, scope: !324)
!373 = !DILocation(line: 826, column: 48, scope: !324)
!374 = !DILocation(line: 827, column: 15, scope: !324)
!375 = !DILocation(line: 827, column: 9, scope: !324)
!376 = !DILocation(line: 828, column: 16, scope: !324)
!377 = !DILocation(line: 828, column: 16, scope: !369)
!378 = !DILocation(line: 828, column: 22, scope: !369)
!379 = !DILocation(line: 828, column: 26, scope: !324)
!380 = !DILocation(line: 829, column: 17, scope: !324)
!381 = !DILocation(line: 829, column: 17, scope: !371)
!382 = !DILocation(line: 829, column: 27, scope: !371)
!383 = !DILocation(line: 829, column: 23, scope: !371)
!384 = !DILocation(line: 829, column: 32, scope: !324)
!385 = !DILocation(line: 831, column: 5, scope: !324)
!386 = !DILocation(line: 831, column: 6, scope: !324)
!387 = distinct !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h59736c53621847ceE", scope: !388, file: !170, line: 826, type: !404, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !426, declaration: !425, retainedNodes: !428)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !389, templateParams: !42, identifier: "779c8a91bd5d1b536b8c532385e1a99e")
!389 = !{!390}
!390 = !DICompositeType(tag: DW_TAG_variant_part, scope: !388, file: !8, size: 32, align: 16, elements: !391, templateParams: !42, identifier: "7792d17f4f7a53e84e64ef70b8a44273", discriminator: !403)
!391 = !{!392, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !390, file: !8, baseType: !393, size: 32, align: 16, extraData: i128 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !388, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !394, templateParams: !397, identifier: "b3bad92dd1f31a7768c7d5342172923e")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !393, file: !8, baseType: !396, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!396 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!397 = !{!398, !180}
!398 = !DITemplateTypeParameter(name: "T", type: !396)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !390, file: !8, baseType: !400, size: 32, align: 16, extraData: i128 1)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !388, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !401, templateParams: !397, identifier: "5e8e93b5f4fcccdeec5e04daf277df80")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !400, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !388, !420}
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !407, templateParams: !42, identifier: "f0f6e32a93975ef8c7fe4f9a2e7e7c36")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_variant_part, scope: !406, file: !8, size: 32, align: 16, elements: !409, templateParams: !42, identifier: "d90d3412aafc37412c010351a02618da", discriminator: !419)
!409 = !{!410, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !408, file: !8, baseType: !411, size: 32, align: 16, extraData: i128 0)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !406, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !412, templateParams: !414, identifier: "24558acbe5a31264c23d9bc80cf92dc2")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !411, file: !8, baseType: !396, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!414 = !{!398, !200}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !408, file: !8, baseType: !416, size: 32, align: 16, extraData: i128 1)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !406, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !417, templateParams: !414, identifier: "51cabc6556a114ffe9b9c3ae81f29ebd")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !416, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!419 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !421, file: !8, size: 64, align: 64, elements: !423, templateParams: !42, identifier: "d47fecf6bd999c3b5df904d60b959226")
!421 = !DINamespace(name: "parse_hex", scope: !422)
!422 = !DINamespace(name: "{impl#14}", scope: !229)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !420, file: !8, baseType: !232, size: 64, align: 64)
!425 = !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h59736c53621847ceE", scope: !388, file: !170, line: 826, type: !404, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !426)
!426 = !{!398, !180, !235, !427}
!427 = !DITemplateTypeParameter(name: "O", type: !420)
!428 = !{!429, !430, !431, !433}
!429 = !DILocalVariable(name: "self", arg: 1, scope: !387, file: !170, line: 826, type: !388)
!430 = !DILocalVariable(name: "op", arg: 2, scope: !387, file: !170, line: 826, type: !420)
!431 = !DILocalVariable(name: "t", scope: !432, file: !170, line: 828, type: !396, align: 2)
!432 = distinct !DILexicalBlock(scope: !387, file: !170, line: 828, column: 13)
!433 = !DILocalVariable(name: "e", scope: !434, file: !170, line: 829, type: !181, align: 1)
!434 = distinct !DILexicalBlock(scope: !387, file: !170, line: 829, column: 13)
!435 = !DILocation(line: 826, column: 42, scope: !387)
!436 = !DILocation(line: 826, column: 48, scope: !387)
!437 = !DILocation(line: 827, column: 15, scope: !387)
!438 = !DILocation(line: 827, column: 9, scope: !387)
!439 = !DILocation(line: 828, column: 16, scope: !387)
!440 = !DILocation(line: 828, column: 16, scope: !432)
!441 = !DILocation(line: 828, column: 22, scope: !432)
!442 = !DILocation(line: 828, column: 26, scope: !387)
!443 = !DILocation(line: 829, column: 17, scope: !387)
!444 = !DILocation(line: 829, column: 17, scope: !434)
!445 = !DILocation(line: 829, column: 27, scope: !434)
!446 = !DILocation(line: 829, column: 23, scope: !434)
!447 = !DILocation(line: 829, column: 32, scope: !387)
!448 = !DILocation(line: 831, column: 5, scope: !387)
!449 = !DILocation(line: 831, column: 6, scope: !387)
!450 = distinct !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h67e17f229ff7a198E", scope: !451, file: !170, line: 826, type: !467, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !489, declaration: !488, retainedNodes: !491)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !452, templateParams: !42, identifier: "863390ce401f2c59c43ea85ff450958b")
!452 = !{!453}
!453 = !DICompositeType(tag: DW_TAG_variant_part, scope: !451, file: !8, size: 128, align: 64, elements: !454, templateParams: !42, identifier: "594d9677be70216fd2d2e94a8812e92", discriminator: !466)
!454 = !{!455, !462}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !453, file: !8, baseType: !456, size: 128, align: 64, extraData: i128 0)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !451, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !457, templateParams: !460, identifier: "f6ac2443325df1cad707976ea43fbab7")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !456, file: !8, baseType: !459, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!459 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!460 = !{!461, !180}
!461 = !DITemplateTypeParameter(name: "T", type: !459)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !453, file: !8, baseType: !463, size: 128, align: 64, extraData: i128 1)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !451, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !464, templateParams: !460, identifier: "a6637246236df87497f3fdfeffdd4c2e")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !463, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !451, !483}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !470, templateParams: !42, identifier: "4a1e4fff6c722ff6688652a81539e3a4")
!470 = !{!471}
!471 = !DICompositeType(tag: DW_TAG_variant_part, scope: !469, file: !8, size: 128, align: 64, elements: !472, templateParams: !42, identifier: "bf7d6b9db745baf1d5cc6ca15fa1e12", discriminator: !482)
!472 = !{!473, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !471, file: !8, baseType: !474, size: 128, align: 64, extraData: i128 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !469, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !475, templateParams: !477, identifier: "f687e1e8d72a85d0772659d015fd9b37")
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !474, file: !8, baseType: !459, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!477 = !{!461, !200}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !471, file: !8, baseType: !479, size: 128, align: 64, extraData: i128 1)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !469, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !480, templateParams: !477, identifier: "3b25db6711c15a8275724d89768902f6")
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !479, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !484, file: !8, size: 64, align: 64, elements: !486, templateParams: !42, identifier: "44aa4ea35b4194c4b0b160d0af681e27")
!484 = !DINamespace(name: "parse_hex", scope: !485)
!485 = !DINamespace(name: "{impl#30}", scope: !229)
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !483, file: !8, baseType: !232, size: 64, align: 64)
!488 = !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h67e17f229ff7a198E", scope: !451, file: !170, line: 826, type: !467, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !489)
!489 = !{!461, !180, !235, !490}
!490 = !DITemplateTypeParameter(name: "O", type: !483)
!491 = !{!492, !493, !494, !496}
!492 = !DILocalVariable(name: "self", arg: 1, scope: !450, file: !170, line: 826, type: !451)
!493 = !DILocalVariable(name: "op", arg: 2, scope: !450, file: !170, line: 826, type: !483)
!494 = !DILocalVariable(name: "t", scope: !495, file: !170, line: 828, type: !459, align: 8)
!495 = distinct !DILexicalBlock(scope: !450, file: !170, line: 828, column: 13)
!496 = !DILocalVariable(name: "e", scope: !497, file: !170, line: 829, type: !181, align: 1)
!497 = distinct !DILexicalBlock(scope: !450, file: !170, line: 829, column: 13)
!498 = !DILocation(line: 826, column: 42, scope: !450)
!499 = !DILocation(line: 826, column: 48, scope: !450)
!500 = !DILocation(line: 827, column: 15, scope: !450)
!501 = !DILocation(line: 827, column: 9, scope: !450)
!502 = !DILocation(line: 828, column: 16, scope: !450)
!503 = !DILocation(line: 828, column: 16, scope: !495)
!504 = !DILocation(line: 828, column: 22, scope: !495)
!505 = !DILocation(line: 828, column: 26, scope: !450)
!506 = !DILocation(line: 829, column: 17, scope: !450)
!507 = !DILocation(line: 829, column: 17, scope: !497)
!508 = !DILocation(line: 829, column: 27, scope: !497)
!509 = !DILocation(line: 829, column: 23, scope: !497)
!510 = !DILocation(line: 829, column: 32, scope: !450)
!511 = !DILocation(line: 831, column: 5, scope: !450)
!512 = !DILocation(line: 831, column: 6, scope: !450)
!513 = distinct !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h956767f5cb28b191E", scope: !514, file: !170, line: 826, type: !529, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !551, declaration: !550, retainedNodes: !553)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !515, templateParams: !42, identifier: "b82585088a16ea951412a5730c447f63")
!515 = !{!516}
!516 = !DICompositeType(tag: DW_TAG_variant_part, scope: !514, file: !8, size: 64, align: 32, elements: !517, templateParams: !42, identifier: "4c836ff9fd916b7d962f98fc53c9bde3", discriminator: !528)
!517 = !{!518, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !516, file: !8, baseType: !519, size: 64, align: 32, extraData: i128 0)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !514, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !520, templateParams: !522, identifier: "eebb7368769c30c1e4236801764e2864")
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !519, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!522 = !{!523, !180}
!523 = !DITemplateTypeParameter(name: "T", type: !65)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !516, file: !8, baseType: !525, size: 64, align: 32, extraData: i128 1)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !514, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !526, templateParams: !522, identifier: "562e27b7e27fe50e4ec35a29191feef1")
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !525, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!529 = !DISubroutineType(types: !530)
!530 = !{!531, !514, !545}
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !532, templateParams: !42, identifier: "8036165f42ab3108ac8fc08a69fb6c68")
!532 = !{!533}
!533 = !DICompositeType(tag: DW_TAG_variant_part, scope: !531, file: !8, size: 64, align: 32, elements: !534, templateParams: !42, identifier: "e470f36240ff1f15b1d765dc2731e83c", discriminator: !544)
!534 = !{!535, !540}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !533, file: !8, baseType: !536, size: 64, align: 32, extraData: i128 0)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !531, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !537, templateParams: !539, identifier: "16b6186d1b1d356641496277796caf5d")
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !536, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!539 = !{!523, !200}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !533, file: !8, baseType: !541, size: 64, align: 32, extraData: i128 1)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !531, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !542, templateParams: !539, identifier: "ad4cb8addf88e17b9308412417bb3d98")
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !541, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !531, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !546, file: !8, size: 64, align: 64, elements: !548, templateParams: !42, identifier: "2b93dd9f2ec9cbf08863c6cf8bc038d9")
!546 = !DINamespace(name: "parse_hex", scope: !547)
!547 = !DINamespace(name: "{impl#21}", scope: !229)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !545, file: !8, baseType: !232, size: 64, align: 64)
!550 = !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h956767f5cb28b191E", scope: !514, file: !170, line: 826, type: !529, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !551)
!551 = !{!523, !180, !235, !552}
!552 = !DITemplateTypeParameter(name: "O", type: !545)
!553 = !{!554, !555, !556, !558}
!554 = !DILocalVariable(name: "self", arg: 1, scope: !513, file: !170, line: 826, type: !514)
!555 = !DILocalVariable(name: "op", arg: 2, scope: !513, file: !170, line: 826, type: !545)
!556 = !DILocalVariable(name: "t", scope: !557, file: !170, line: 828, type: !65, align: 4)
!557 = distinct !DILexicalBlock(scope: !513, file: !170, line: 828, column: 13)
!558 = !DILocalVariable(name: "e", scope: !559, file: !170, line: 829, type: !181, align: 1)
!559 = distinct !DILexicalBlock(scope: !513, file: !170, line: 829, column: 13)
!560 = !DILocation(line: 826, column: 42, scope: !513)
!561 = !DILocation(line: 826, column: 48, scope: !513)
!562 = !DILocation(line: 827, column: 15, scope: !513)
!563 = !DILocation(line: 827, column: 9, scope: !513)
!564 = !DILocation(line: 828, column: 16, scope: !513)
!565 = !DILocation(line: 828, column: 16, scope: !557)
!566 = !DILocation(line: 828, column: 22, scope: !557)
!567 = !DILocation(line: 828, column: 26, scope: !513)
!568 = !DILocation(line: 829, column: 17, scope: !513)
!569 = !DILocation(line: 829, column: 17, scope: !559)
!570 = !DILocation(line: 829, column: 27, scope: !559)
!571 = !DILocation(line: 829, column: 23, scope: !559)
!572 = !DILocation(line: 829, column: 32, scope: !513)
!573 = !DILocation(line: 831, column: 5, scope: !513)
!574 = !DILocation(line: 831, column: 6, scope: !513)
!575 = distinct !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb01df3d5939de834E", scope: !576, file: !170, line: 826, type: !592, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !614, declaration: !613, retainedNodes: !616)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !577, templateParams: !42, identifier: "5d8a64e4273863532f8370cd5e65580f")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_variant_part, scope: !576, file: !8, size: 192, align: 64, elements: !579, templateParams: !42, identifier: "ab639b6cca81a5528c370fc8bf0c9a4c", discriminator: !591)
!579 = !{!580, !587}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !578, file: !8, baseType: !581, size: 192, align: 64, extraData: i128 0)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !576, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !582, templateParams: !585, identifier: "d31414c0778abfc28aae2e6e4c9687d6")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !8, baseType: !584, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!584 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!585 = !{!586, !180}
!586 = !DITemplateTypeParameter(name: "T", type: !584)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !578, file: !8, baseType: !588, size: 192, align: 64, extraData: i128 1)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !576, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !589, templateParams: !585, identifier: "9a763a0c790d6f86f6f103f92b1a9f13")
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !588, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !576, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !576, !608}
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !595, templateParams: !42, identifier: "3bb17017ef94265be9a613aac06ffd37")
!595 = !{!596}
!596 = !DICompositeType(tag: DW_TAG_variant_part, scope: !594, file: !8, size: 192, align: 64, elements: !597, templateParams: !42, identifier: "a4446509529ca6f29dc5d956954e7b27", discriminator: !607)
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !596, file: !8, baseType: !599, size: 192, align: 64, extraData: i128 0)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !594, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !600, templateParams: !602, identifier: "62334ec49165c7ea235676483a0ccacc")
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !599, file: !8, baseType: !584, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!602 = !{!586, !200}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !596, file: !8, baseType: !604, size: 192, align: 64, extraData: i128 1)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !594, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !605, templateParams: !602, identifier: "bd0970eadfbd2e1df384e812459d1683")
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !604, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!607 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !609, file: !8, size: 64, align: 64, elements: !611, templateParams: !42, identifier: "ac289fc5550a6a6c84b0a1ce96207a1e")
!609 = !DINamespace(name: "parse_hex", scope: !610)
!610 = !DINamespace(name: "{impl#38}", scope: !229)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !608, file: !8, baseType: !232, size: 64, align: 64)
!613 = !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hb01df3d5939de834E", scope: !576, file: !170, line: 826, type: !592, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !614)
!614 = !{!586, !180, !235, !615}
!615 = !DITemplateTypeParameter(name: "O", type: !608)
!616 = !{!617, !618, !619, !621}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !575, file: !170, line: 826, type: !576)
!618 = !DILocalVariable(name: "op", arg: 2, scope: !575, file: !170, line: 826, type: !608)
!619 = !DILocalVariable(name: "t", scope: !620, file: !170, line: 828, type: !584, align: 8)
!620 = distinct !DILexicalBlock(scope: !575, file: !170, line: 828, column: 13)
!621 = !DILocalVariable(name: "e", scope: !622, file: !170, line: 829, type: !181, align: 1)
!622 = distinct !DILexicalBlock(scope: !575, file: !170, line: 829, column: 13)
!623 = !DILocation(line: 826, column: 42, scope: !575)
!624 = !DILocation(line: 826, column: 48, scope: !575)
!625 = !DILocation(line: 827, column: 15, scope: !575)
!626 = !DILocation(line: 827, column: 9, scope: !575)
!627 = !DILocation(line: 828, column: 16, scope: !575)
!628 = !DILocation(line: 828, column: 16, scope: !620)
!629 = !DILocation(line: 828, column: 22, scope: !620)
!630 = !DILocation(line: 828, column: 26, scope: !575)
!631 = !DILocation(line: 829, column: 17, scope: !575)
!632 = !DILocation(line: 829, column: 17, scope: !622)
!633 = !DILocation(line: 829, column: 27, scope: !622)
!634 = !DILocation(line: 829, column: 23, scope: !622)
!635 = !DILocation(line: 829, column: 32, scope: !575)
!636 = !DILocation(line: 831, column: 5, scope: !575)
!637 = !DILocation(line: 831, column: 6, scope: !575)
!638 = distinct !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc507cb28a9877367E", scope: !639, file: !170, line: 826, type: !654, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !676, declaration: !675, retainedNodes: !678)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !640, templateParams: !42, identifier: "f388c52469df9b2b8ab12787b02f939c")
!640 = !{!641}
!641 = !DICompositeType(tag: DW_TAG_variant_part, scope: !639, file: !8, size: 16, align: 8, elements: !642, templateParams: !42, identifier: "f357ccffe8f40056f1c5afd6570f6f17", discriminator: !653)
!642 = !{!643, !649}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !641, file: !8, baseType: !644, size: 16, align: 8, extraData: i128 0)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !639, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !645, templateParams: !647, identifier: "343434b256948c5767f5c7e76d458785")
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !644, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!647 = !{!648, !180}
!648 = !DITemplateTypeParameter(name: "T", type: !12)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !641, file: !8, baseType: !650, size: 16, align: 8, extraData: i128 1)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !639, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !651, templateParams: !647, identifier: "ef9c6a1b8c8c59086b30f8035f3b4ce8")
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !650, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !639, !670}
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !657, templateParams: !42, identifier: "2b5c9b898058be2cd7a8c9caee791ad7")
!657 = !{!658}
!658 = !DICompositeType(tag: DW_TAG_variant_part, scope: !656, file: !8, size: 16, align: 8, elements: !659, templateParams: !42, identifier: "408c0599763fe2691129ea53c15795d0", discriminator: !669)
!659 = !{!660, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !658, file: !8, baseType: !661, size: 16, align: 8, extraData: i128 0)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !656, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !662, templateParams: !664, identifier: "f3691a5dc494097b6f9abf8c02079ebc")
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !661, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!664 = !{!648, !200}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !658, file: !8, baseType: !666, size: 16, align: 8, extraData: i128 1)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !656, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !667, templateParams: !664, identifier: "98f2f96e34a9045fe32483d70a50ebd0")
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !666, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!669 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !671, file: !8, size: 64, align: 64, elements: !673, templateParams: !42, identifier: "82d28c1bb90c8a296ab413a1ac08154b")
!671 = !DINamespace(name: "parse_hex", scope: !672)
!672 = !DINamespace(name: "{impl#5}", scope: !229)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !670, file: !8, baseType: !232, size: 64, align: 64)
!675 = !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc507cb28a9877367E", scope: !639, file: !170, line: 826, type: !654, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !676)
!676 = !{!648, !180, !235, !677}
!677 = !DITemplateTypeParameter(name: "O", type: !670)
!678 = !{!679, !680, !681, !683}
!679 = !DILocalVariable(name: "self", arg: 1, scope: !638, file: !170, line: 826, type: !639)
!680 = !DILocalVariable(name: "op", arg: 2, scope: !638, file: !170, line: 826, type: !670)
!681 = !DILocalVariable(name: "t", scope: !682, file: !170, line: 828, type: !12, align: 1)
!682 = distinct !DILexicalBlock(scope: !638, file: !170, line: 828, column: 13)
!683 = !DILocalVariable(name: "e", scope: !684, file: !170, line: 829, type: !181, align: 1)
!684 = distinct !DILexicalBlock(scope: !638, file: !170, line: 829, column: 13)
!685 = !DILocation(line: 826, column: 42, scope: !638)
!686 = !DILocation(line: 826, column: 48, scope: !638)
!687 = !DILocation(line: 827, column: 15, scope: !638)
!688 = !DILocation(line: 827, column: 9, scope: !638)
!689 = !DILocation(line: 828, column: 16, scope: !638)
!690 = !DILocation(line: 828, column: 16, scope: !682)
!691 = !DILocation(line: 828, column: 22, scope: !682)
!692 = !DILocation(line: 828, column: 26, scope: !638)
!693 = !DILocation(line: 829, column: 17, scope: !638)
!694 = !DILocation(line: 829, column: 17, scope: !684)
!695 = !DILocation(line: 829, column: 27, scope: !684)
!696 = !DILocation(line: 829, column: 23, scope: !684)
!697 = !DILocation(line: 829, column: 32, scope: !638)
!698 = !DILocation(line: 831, column: 5, scope: !638)
!699 = !DILocation(line: 831, column: 6, scope: !638)
!700 = distinct !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he0b5ab6dc1d66a94E", scope: !701, file: !170, line: 826, type: !717, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !739, declaration: !738, retainedNodes: !741)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !702, templateParams: !42, identifier: "7b4793b675f8ef9ff923c9ab6ecef9c0")
!702 = !{!703}
!703 = !DICompositeType(tag: DW_TAG_variant_part, scope: !701, file: !8, size: 32, align: 16, elements: !704, templateParams: !42, identifier: "9b2b138167a4adde89cfde28969910e9", discriminator: !716)
!704 = !{!705, !712}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !703, file: !8, baseType: !706, size: 32, align: 16, extraData: i128 0)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !701, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !707, templateParams: !710, identifier: "46f4e73c54132f232525cb2d0704beb8")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !8, baseType: !709, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!709 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!710 = !{!711, !180}
!711 = !DITemplateTypeParameter(name: "T", type: !709)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !703, file: !8, baseType: !713, size: 32, align: 16, extraData: i128 1)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !701, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !714, templateParams: !710, identifier: "9c71e620105b3ad5467ae47fbfee2837")
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !713, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!716 = !DIDerivedType(tag: DW_TAG_member, scope: !701, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!717 = !DISubroutineType(types: !718)
!718 = !{!719, !701, !733}
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !720, templateParams: !42, identifier: "9135168485d6a395923a0618347ffc86")
!720 = !{!721}
!721 = !DICompositeType(tag: DW_TAG_variant_part, scope: !719, file: !8, size: 32, align: 16, elements: !722, templateParams: !42, identifier: "3454b363490c1d451bd248d56ea5e51e", discriminator: !732)
!722 = !{!723, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !721, file: !8, baseType: !724, size: 32, align: 16, extraData: i128 0)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !719, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !725, templateParams: !727, identifier: "c14d61b1a95a074b4f4753727cabac93")
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !8, baseType: !709, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!727 = !{!711, !200}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !721, file: !8, baseType: !729, size: 32, align: 16, extraData: i128 1)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !719, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !730, templateParams: !727, identifier: "16df26c74fa4ad0d10219c963c084ac6")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!732 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !734, file: !8, size: 64, align: 64, elements: !736, templateParams: !42, identifier: "3ddaa7c1cf3526d58e3c2db7632ef11")
!734 = !DINamespace(name: "parse_hex", scope: !735)
!735 = !DINamespace(name: "{impl#13}", scope: !229)
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !733, file: !8, baseType: !232, size: 64, align: 64)
!738 = !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he0b5ab6dc1d66a94E", scope: !701, file: !170, line: 826, type: !717, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !739)
!739 = !{!711, !180, !235, !740}
!740 = !DITemplateTypeParameter(name: "O", type: !733)
!741 = !{!742, !743, !744, !746}
!742 = !DILocalVariable(name: "self", arg: 1, scope: !700, file: !170, line: 826, type: !701)
!743 = !DILocalVariable(name: "op", arg: 2, scope: !700, file: !170, line: 826, type: !733)
!744 = !DILocalVariable(name: "t", scope: !745, file: !170, line: 828, type: !709, align: 2)
!745 = distinct !DILexicalBlock(scope: !700, file: !170, line: 828, column: 13)
!746 = !DILocalVariable(name: "e", scope: !747, file: !170, line: 829, type: !181, align: 1)
!747 = distinct !DILexicalBlock(scope: !700, file: !170, line: 829, column: 13)
!748 = !DILocation(line: 826, column: 42, scope: !700)
!749 = !DILocation(line: 826, column: 48, scope: !700)
!750 = !DILocation(line: 827, column: 15, scope: !700)
!751 = !DILocation(line: 827, column: 9, scope: !700)
!752 = !DILocation(line: 828, column: 16, scope: !700)
!753 = !DILocation(line: 828, column: 16, scope: !745)
!754 = !DILocation(line: 828, column: 22, scope: !745)
!755 = !DILocation(line: 828, column: 26, scope: !700)
!756 = !DILocation(line: 829, column: 17, scope: !700)
!757 = !DILocation(line: 829, column: 17, scope: !747)
!758 = !DILocation(line: 829, column: 27, scope: !747)
!759 = !DILocation(line: 829, column: 23, scope: !747)
!760 = !DILocation(line: 829, column: 32, scope: !700)
!761 = !DILocation(line: 831, column: 5, scope: !700)
!762 = !DILocation(line: 831, column: 6, scope: !700)
!763 = distinct !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he135416521f33c7aE", scope: !764, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !802, declaration: !801, retainedNodes: !804)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !765, templateParams: !42, identifier: "f55bcebb7ef5f1099eab3a4987fc8a2")
!765 = !{!766}
!766 = !DICompositeType(tag: DW_TAG_variant_part, scope: !764, file: !8, size: 64, align: 32, elements: !767, templateParams: !42, identifier: "d837c9ab91315afd1ddec2b470db815f", discriminator: !779)
!767 = !{!768, !775}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !766, file: !8, baseType: !769, size: 64, align: 32, extraData: i128 0)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !764, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !770, templateParams: !773, identifier: "628c741b7fe29e1b015e9a25350efb8")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !769, file: !8, baseType: !772, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!772 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!773 = !{!774, !180}
!774 = !DITemplateTypeParameter(name: "T", type: !772)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !766, file: !8, baseType: !776, size: 64, align: 32, extraData: i128 1)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !764, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !777, templateParams: !773, identifier: "45dbc43e6fcd91bc4e4a5fc37ee134ce")
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !776, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!780 = !DISubroutineType(types: !781)
!781 = !{!782, !764, !796}
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !783, templateParams: !42, identifier: "377b3df82f97de71883aeafbabd37754")
!783 = !{!784}
!784 = !DICompositeType(tag: DW_TAG_variant_part, scope: !782, file: !8, size: 64, align: 32, elements: !785, templateParams: !42, identifier: "d5a426d931942adf3694ff68aed69f67", discriminator: !795)
!785 = !{!786, !791}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !784, file: !8, baseType: !787, size: 64, align: 32, extraData: i128 0)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !782, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !788, templateParams: !790, identifier: "857a060b45886b09fef46d9227621177")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !8, baseType: !772, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!790 = !{!774, !200}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !784, file: !8, baseType: !792, size: 64, align: 32, extraData: i128 1)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !782, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !793, templateParams: !790, identifier: "23f99d3b740db4fdc9c1bd6b2a063d10")
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !792, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !797, file: !8, size: 64, align: 64, elements: !799, templateParams: !42, identifier: "db5e21d9ddf60141cc6126cfc86bd8")
!797 = !DINamespace(name: "parse_hex", scope: !798)
!798 = !DINamespace(name: "{impl#22}", scope: !229)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !796, file: !8, baseType: !232, size: 64, align: 64)
!801 = !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he135416521f33c7aE", scope: !764, file: !170, line: 826, type: !780, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !802)
!802 = !{!774, !180, !235, !803}
!803 = !DITemplateTypeParameter(name: "O", type: !796)
!804 = !{!805, !806, !807, !809}
!805 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !170, line: 826, type: !764)
!806 = !DILocalVariable(name: "op", arg: 2, scope: !763, file: !170, line: 826, type: !796)
!807 = !DILocalVariable(name: "t", scope: !808, file: !170, line: 828, type: !772, align: 4)
!808 = distinct !DILexicalBlock(scope: !763, file: !170, line: 828, column: 13)
!809 = !DILocalVariable(name: "e", scope: !810, file: !170, line: 829, type: !181, align: 1)
!810 = distinct !DILexicalBlock(scope: !763, file: !170, line: 829, column: 13)
!811 = !DILocation(line: 826, column: 42, scope: !763)
!812 = !DILocation(line: 826, column: 48, scope: !763)
!813 = !DILocation(line: 827, column: 15, scope: !763)
!814 = !DILocation(line: 827, column: 9, scope: !763)
!815 = !DILocation(line: 828, column: 16, scope: !763)
!816 = !DILocation(line: 828, column: 16, scope: !808)
!817 = !DILocation(line: 828, column: 22, scope: !808)
!818 = !DILocation(line: 828, column: 26, scope: !763)
!819 = !DILocation(line: 829, column: 17, scope: !763)
!820 = !DILocation(line: 829, column: 17, scope: !810)
!821 = !DILocation(line: 829, column: 27, scope: !810)
!822 = !DILocation(line: 829, column: 23, scope: !810)
!823 = !DILocation(line: 829, column: 32, scope: !763)
!824 = !DILocation(line: 831, column: 5, scope: !763)
!825 = !DILocation(line: 831, column: 6, scope: !763)
!826 = distinct !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hef7b04e0ff20d5c6E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !865, declaration: !864, retainedNodes: !867)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !828, templateParams: !42, identifier: "4f2521fd3d92e5dc66501df81191c5cb")
!828 = !{!829}
!829 = !DICompositeType(tag: DW_TAG_variant_part, scope: !827, file: !8, size: 128, align: 64, elements: !830, templateParams: !42, identifier: "ba32220fce6cfc6246a5719432212992", discriminator: !842)
!830 = !{!831, !838}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !829, file: !8, baseType: !832, size: 128, align: 64, extraData: i128 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !827, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !833, templateParams: !836, identifier: "e68987501ee76af3a289794ac9c34c31")
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !8, baseType: !835, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!835 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!836 = !{!837, !180}
!837 = !DITemplateTypeParameter(name: "T", type: !835)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !829, file: !8, baseType: !839, size: 128, align: 64, extraData: i128 1)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !827, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !840, templateParams: !836, identifier: "ceecb61367f9ae66d1f622c961b06309")
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !827, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !827, !859}
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !846, templateParams: !42, identifier: "d6bedce96bb07263b0428d07883f552a")
!846 = !{!847}
!847 = !DICompositeType(tag: DW_TAG_variant_part, scope: !845, file: !8, size: 128, align: 64, elements: !848, templateParams: !42, identifier: "463f9b5888af85f770b6d80c59e7b375", discriminator: !858)
!848 = !{!849, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !847, file: !8, baseType: !850, size: 128, align: 64, extraData: i128 0)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !845, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !851, templateParams: !853, identifier: "b271c713da5185ce1109c76968573b7a")
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !850, file: !8, baseType: !835, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!853 = !{!837, !200}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !847, file: !8, baseType: !855, size: 128, align: 64, extraData: i128 1)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !845, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !856, templateParams: !853, identifier: "17b962ad4db87aae86bd80ac856ed8ff")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !845, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !860, file: !8, size: 64, align: 64, elements: !862, templateParams: !42, identifier: "730c6d2c21323f039b98cd6959a7c987")
!860 = !DINamespace(name: "parse_hex", scope: !861)
!861 = !DINamespace(name: "{impl#46}", scope: !229)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !859, file: !8, baseType: !232, size: 64, align: 64)
!864 = !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hef7b04e0ff20d5c6E", scope: !827, file: !170, line: 826, type: !843, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !865)
!865 = !{!837, !180, !235, !866}
!866 = !DITemplateTypeParameter(name: "O", type: !859)
!867 = !{!868, !869, !870, !872}
!868 = !DILocalVariable(name: "self", arg: 1, scope: !826, file: !170, line: 826, type: !827)
!869 = !DILocalVariable(name: "op", arg: 2, scope: !826, file: !170, line: 826, type: !859)
!870 = !DILocalVariable(name: "t", scope: !871, file: !170, line: 828, type: !835, align: 8)
!871 = distinct !DILexicalBlock(scope: !826, file: !170, line: 828, column: 13)
!872 = !DILocalVariable(name: "e", scope: !873, file: !170, line: 829, type: !181, align: 1)
!873 = distinct !DILexicalBlock(scope: !826, file: !170, line: 829, column: 13)
!874 = !DILocation(line: 826, column: 42, scope: !826)
!875 = !DILocation(line: 826, column: 48, scope: !826)
!876 = !DILocation(line: 827, column: 15, scope: !826)
!877 = !DILocation(line: 827, column: 9, scope: !826)
!878 = !DILocation(line: 828, column: 16, scope: !826)
!879 = !DILocation(line: 828, column: 16, scope: !871)
!880 = !DILocation(line: 828, column: 22, scope: !871)
!881 = !DILocation(line: 828, column: 26, scope: !826)
!882 = !DILocation(line: 829, column: 17, scope: !826)
!883 = !DILocation(line: 829, column: 17, scope: !873)
!884 = !DILocation(line: 829, column: 27, scope: !873)
!885 = !DILocation(line: 829, column: 23, scope: !873)
!886 = !DILocation(line: 829, column: 32, scope: !826)
!887 = !DILocation(line: 831, column: 5, scope: !826)
!888 = !DILocation(line: 831, column: 6, scope: !826)
!889 = distinct !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hfe786682696e9decE", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !928, declaration: !927, retainedNodes: !930)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !891, templateParams: !42, identifier: "2622b2c9323d9fcdf754b7409e96859d")
!891 = !{!892}
!892 = !DICompositeType(tag: DW_TAG_variant_part, scope: !890, file: !8, size: 192, align: 64, elements: !893, templateParams: !42, identifier: "d5a03bcbfb8630a35f3df825d844b158", discriminator: !905)
!893 = !{!894, !901}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !892, file: !8, baseType: !895, size: 192, align: 64, extraData: i128 0)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !890, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !896, templateParams: !899, identifier: "f3991e147a5972a66be1b94080854dc8")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !895, file: !8, baseType: !898, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!898 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!899 = !{!900, !180}
!900 = !DITemplateTypeParameter(name: "T", type: !898)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !892, file: !8, baseType: !902, size: 192, align: 64, extraData: i128 1)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !890, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !903, templateParams: !899, identifier: "e7d5f1fc5c474b7956c09d164591182d")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !8, baseType: !181, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !890, !922}
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !909, templateParams: !42, identifier: "b3b9c7d458770254654f8223301b18dd")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !8, size: 192, align: 64, elements: !911, templateParams: !42, identifier: "a181a6a908dc54b0fe5c528aabc7fc78", discriminator: !921)
!911 = !{!912, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !910, file: !8, baseType: !913, size: 192, align: 64, extraData: i128 0)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !908, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !914, templateParams: !916, identifier: "ec959ba0050cf99a17b6123c389cad0b")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !913, file: !8, baseType: !898, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!916 = !{!900, !200}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !910, file: !8, baseType: !918, size: 192, align: 64, extraData: i128 1)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !908, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !919, templateParams: !916, identifier: "414eb0318ac68cf4dd19147a068b3121")
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !918, file: !8, baseType: !201, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !923, file: !8, size: 64, align: 64, elements: !925, templateParams: !42, identifier: "a00a7e259dcd540727273b31fa04aabd")
!923 = !DINamespace(name: "parse_hex", scope: !924)
!924 = !DINamespace(name: "{impl#37}", scope: !229)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !922, file: !8, baseType: !232, size: 64, align: 64)
!927 = !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hfe786682696e9decE", scope: !890, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !928)
!928 = !{!900, !180, !235, !929}
!929 = !DITemplateTypeParameter(name: "O", type: !922)
!930 = !{!931, !932, !933, !935}
!931 = !DILocalVariable(name: "self", arg: 1, scope: !889, file: !170, line: 826, type: !890)
!932 = !DILocalVariable(name: "op", arg: 2, scope: !889, file: !170, line: 826, type: !922)
!933 = !DILocalVariable(name: "t", scope: !934, file: !170, line: 828, type: !898, align: 8)
!934 = distinct !DILexicalBlock(scope: !889, file: !170, line: 828, column: 13)
!935 = !DILocalVariable(name: "e", scope: !936, file: !170, line: 829, type: !181, align: 1)
!936 = distinct !DILexicalBlock(scope: !889, file: !170, line: 829, column: 13)
!937 = !DILocation(line: 826, column: 42, scope: !889)
!938 = !DILocation(line: 826, column: 48, scope: !889)
!939 = !DILocation(line: 827, column: 15, scope: !889)
!940 = !DILocation(line: 827, column: 9, scope: !889)
!941 = !DILocation(line: 828, column: 16, scope: !889)
!942 = !DILocation(line: 828, column: 16, scope: !934)
!943 = !DILocation(line: 828, column: 22, scope: !934)
!944 = !DILocation(line: 828, column: 26, scope: !889)
!945 = !DILocation(line: 829, column: 17, scope: !889)
!946 = !DILocation(line: 829, column: 17, scope: !936)
!947 = !DILocation(line: 829, column: 27, scope: !936)
!948 = !DILocation(line: 829, column: 23, scope: !936)
!949 = !DILocation(line: 829, column: 32, scope: !889)
!950 = !DILocation(line: 831, column: 5, scope: !889)
!951 = !DILocation(line: 831, column: 6, scope: !889)
!952 = distinct !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h5b606249c895baedE", scope: !201, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !957, declaration: !956, retainedNodes: !959)
!953 = !DIFile(filename: "src/parser.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1", checksumkind: CSK_MD5, checksum: "2e786373a5103ab0379604d86533efec")
!954 = !DISubroutineType(types: !955)
!955 = !{!201, !36}
!956 = !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h5b606249c895baedE", scope: !201, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !957)
!957 = !{!958}
!958 = !DITemplateTypeParameter(name: "impl fmt::Display", type: !36)
!959 = !{!960, !961, !963}
!960 = !DILocalVariable(name: "flag", arg: 1, scope: !952, file: !953, line: 181, type: !36)
!961 = !DILocalVariable(name: "_flag", scope: !962, file: !953, line: 182, type: !36, align: 8)
!962 = distinct !DILexicalBlock(scope: !952, file: !953, line: 182, column: 9)
!963 = !DILocalVariable(name: "got", scope: !964, file: !953, line: 184, type: !114, align: 1)
