; ModuleID = 'bitflags.6c8d1490e0fad4c-cgu.0'
source_filename = "bitflags.6c8d1490e0fad4c-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::result::Result<u16, parser::ParseError>" = type { i8, [3 x i8] }
%"core::result::Result<u16, core::num::error::ParseIntError>" = type { i8, [3 x i8] }
%"core::result::Result<u16, core::num::error::ParseIntError>::Ok" = type { [1 x i16], i16 }
%"core::result::Result<u16, parser::ParseError>::Ok" = type { [1 x i16], i16 }
%"core::result::Result<u16, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u16, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u64, parser::ParseError>" = type { i8, [15 x i8] }
%"core::result::Result<u64, core::num::error::ParseIntError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<u64, parser::ParseError>::Ok" = type { [1 x i64], i64 }
%"core::result::Result<u64, core::num::error::ParseIntError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<u64, parser::ParseError>::Err" = type { [1 x i8], i8 }
%"core::result::Result<i16, parser::ParseError>" = type { i8, [3 x i8] }
%"core::result::Result<i16, core::num::error::ParseIntError>" = type { i8, [3 x i8] }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.77.0-nightly (2319be8e2 2024-01-12)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.77.0-nightly (2319be8e2 2024-01-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1/src/lib.rs/@/bitflags.6c8d1490e0fad4c-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "error", scope: !20)
!20 = !DINamespace(name: "num", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h60c25c736398359bE", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !159, retainedNodes: !160)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !42, identifier: "86d983b481df04f01f2caf98ecdb573e")
!30 = !{!31, !44, !90}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !29, file: !8, baseType: !32, size: 128, align: 64, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !33, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!33 = !{!34, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !32, file: !8, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !37, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !36, file: !8, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!42 = !{}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !29, file: !8, baseType: !45, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !42, identifier: "e48718f86166d54d77f059ca0b0a6c98")
!46 = !DINamespace(name: "option", scope: !11)
!47 = !{!48}
!48 = !DICompositeType(tag: DW_TAG_variant_part, scope: !45, file: !8, size: 128, align: 64, elements: !49, templateParams: !42, identifier: "afffb15192482d728253b8f8d2472e72", discriminator: !89)
!49 = !{!50, !85}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !48, file: !8, baseType: !51, size: 128, align: 64, extraData: i128 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !52, identifier: "1d9e634e4d5498a7ee96fb2809d07bf0")
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !55, templateParams: !42, identifier: "10cafd0b6708f7074105ffbf9866f638")
!55 = !{!56, !84}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !54, file: !8, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !42, identifier: "28b92f1394f76687eb8e9c560ca51a4c")
!59 = !{!60, !61, !63, !64, !66, !83}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !58, file: !8, baseType: !41, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !8, baseType: !62, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !8, baseType: !65, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!65 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !8, baseType: !67, size: 128, align: 64, flags: DIFlagPublic)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !68, templateParams: !42, identifier: "481d968305f18fdf8ffdc763003c88c2")
!68 = !{!69}
!69 = !DICompositeType(tag: DW_TAG_variant_part, scope: !67, file: !8, size: 128, align: 64, elements: !70, templateParams: !42, identifier: "24e90591fade26729409e3a20be2092f", discriminator: !81)
!70 = !{!71, !75, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !69, file: !8, baseType: !72, size: 128, align: 64, extraData: i128 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !73, templateParams: !42, identifier: "4f0d326e575be30f2fd639a109ec9636")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !69, file: !8, baseType: !76, size: 128, align: 64, extraData: i128 1)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !77, templateParams: !42, identifier: "3ef2efa2febef674f3c7a1d1edeb2d4")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !76, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !69, file: !8, baseType: !80, size: 128, align: 64, extraData: i128 2)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, identifier: "9632846e4fadf93ac045eb7d766a59de")
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !67, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!82 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !8, baseType: !67, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !48, file: !8, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !45, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !87, templateParams: !52, identifier: "bc059b01ff1bb2971a2574564a359fd")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !86, file: !8, baseType: !54, size: 128, align: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !45, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !29, file: !8, baseType: !91, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !92, templateParams: !42, identifier: "721bb03f9dbcb87965e2bb40d9a20f3b")
!92 = !{!93, !156}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !91, file: !8, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !96, templateParams: !42, identifier: "c21ebc23867bf4144aa11e8b76b9019b")
!96 = !{!97, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !8, baseType: !98, size: 64, align: 64, flags: DIFlagPrivate)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !100, file: !8, align: 8, elements: !42, identifier: "7fd454df0a480bb0c65b40675d1838be")
!100 = !DINamespace(name: "{extern#0}", scope: !9)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !95, file: !8, baseType: !102, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !98, !124}
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !106, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !107, templateParams: !42, identifier: "22edf1bd3971db6bd2ad32a9daa6f6ca")
!106 = !DINamespace(name: "result", scope: !11)
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_variant_part, scope: !105, file: !8, size: 8, align: 8, elements: !109, templateParams: !42, identifier: "adcad2b9c0ff448fdc0c8b7762234780", discriminator: !123)
!109 = !{!110, !119}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !108, file: !8, baseType: !111, size: 8, align: 8, extraData: i128 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !112, templateParams: !115, identifier: "929502afbf827051526e72098b2bdef3")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !111, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPublic)
!114 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!115 = !{!116, !117}
!116 = !DITemplateTypeParameter(name: "T", type: !114)
!117 = !DITemplateTypeParameter(name: "E", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !42, identifier: "3069877aff233c82ff5ca4b40585f280")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !108, file: !8, baseType: !120, size: 8, align: 8, extraData: i128 1)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !105, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !121, templateParams: !115, identifier: "d8692c9ed1a95c26749ce8856cf20e6b")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !8, baseType: !118, align: 8, offset: 8, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, scope: !105, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !126, templateParams: !42, identifier: "69fb35bbf13c50dad131588c55e1a73e")
!126 = !{!127, !128, !129, !130, !144, !145}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !8, baseType: !65, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !125, file: !8, baseType: !62, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !125, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !125, file: !8, baseType: !131, size: 128, align: 64, flags: DIFlagPrivate)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !46, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !132, templateParams: !42, identifier: "e35d24df7864ff75c56a1be902455ff")
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !131, file: !8, size: 128, align: 64, elements: !134, templateParams: !42, identifier: "e387b39c7264d58d894a5d68f142d3c6", discriminator: !143)
!134 = !{!135, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !133, file: !8, baseType: !136, size: 128, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !137, identifier: "c5e7f26fad88e7e95a61499e645aaa4c")
!137 = !{!138}
!138 = !DITemplateTypeParameter(name: "T", type: !41)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !133, file: !8, baseType: !140, size: 128, align: 64, extraData: i128 1)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !131, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !141, templateParams: !137, identifier: "d7d153280913c68b726880f10c7f2f12")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !8, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !125, file: !8, baseType: !131, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !8, baseType: !146, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !147, templateParams: !42, identifier: "8f6e1dba3018d5fd2b6a6d5825b494f5")
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !146, file: !8, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !42, identifier: "b8b42c4b4ac43cfb69c8ca498cfba042")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !146, file: !8, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 64, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3, lowerBound: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !8, baseType: !41, size: 64, align: 64, offset: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!29, !32}
!159 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h60c25c736398359bE", scope: !29, file: !28, line: 321, type: !157, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!160 = !{!161}
!161 = !DILocalVariable(name: "pieces", arg: 1, scope: !27, file: !28, line: 321, type: !32)
!162 = !DILocation(line: 321, column: 28, scope: !27)
!163 = !DILocation(line: 322, column: 12, scope: !27)
!164 = !DILocation(line: 325, column: 34, scope: !27)
!165 = !DILocation(line: 325, column: 9, scope: !27)
!166 = !{i64 8}
!167 = !DILocation(line: 326, column: 6, scope: !27)
!168 = !DILocation(line: 323, column: 13, scope: !27)
!169 = distinct !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0ce151dc5fe39c39E", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !236, declaration: !235, retainedNodes: !239)
!170 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !172, templateParams: !42, identifier: "f1382e8c7f8d0713307b7463155999c4")
!172 = !{!173}
!173 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !8, size: 32, align: 16, elements: !174, templateParams: !42, identifier: "f81ad2c4794f17d7a76324cb224ea3f0", discriminator: !190)
!174 = !{!175, !186}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !173, file: !8, baseType: !176, size: 32, align: 16, extraData: i128 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !171, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !177, templateParams: !180, identifier: "7156e2b6f060a56457542b4cd3219e54")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !8, baseType: !179, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!179 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!180 = !{!181, !182}
!181 = !DITemplateTypeParameter(name: "T", type: !179)
!182 = !DITemplateTypeParameter(name: "E", type: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !19, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !184, templateParams: !42, identifier: "fd04ce4ad704c4de945992a9464fdb6f")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !183, file: !8, baseType: !18, size: 8, align: 8, flags: DIFlagProtected)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !173, file: !8, baseType: !187, size: 32, align: 16, extraData: i128 1)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !171, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !188, templateParams: !180, identifier: "370ae2b29403d5bf461a2d449163d7d4")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !171, !228}
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !194, templateParams: !42, identifier: "f5941d5c5fadb25a6e63a863c327378d")
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !193, file: !8, size: 32, align: 16, elements: !196, templateParams: !42, identifier: "34147f08c9b808708437276ea72543a0", discriminator: !227)
!196 = !{!197, !223}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !8, baseType: !198, size: 32, align: 16, extraData: i128 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !193, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !199, templateParams: !201, identifier: "d1614f0d80dc99e5a063404dc1eb178e")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !8, baseType: !179, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!201 = !{!181, !202}
!202 = !DITemplateTypeParameter(name: "E", type: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseError", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !206, templateParams: !42, identifier: "60f83a0b0986f5dbd5803b8721cc291f")
!204 = !DINamespace(name: "parser", scope: !205)
!205 = !DINamespace(name: "bitflags", scope: null)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !203, file: !8, baseType: !208, size: 8, align: 8, flags: DIFlagPrivate)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseErrorKind", scope: !204, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !209, templateParams: !42, identifier: "5137246ec8479f6765d0dfe30d1ba8")
!209 = !{!210}
!210 = !DICompositeType(tag: DW_TAG_variant_part, scope: !208, file: !8, size: 8, align: 8, elements: !211, templateParams: !42, identifier: "b7a0f50105eaf8b15413ea8dc641235f", discriminator: !222)
!211 = !{!212, !214, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "EmptyFlag", scope: !210, file: !8, baseType: !213, size: 8, align: 8, extraData: i128 0)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "EmptyFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !42, identifier: "5d1645db8185c9104fc9aefd271daa4d")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNamedFlag", scope: !210, file: !8, baseType: !215, size: 8, align: 8, extraData: i128 1)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNamedFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !216, templateParams: !42, identifier: "f4cd2f468f99fd012e27e69bb2ab9fa")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !215, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidHexFlag", scope: !210, file: !8, baseType: !219, size: 8, align: 8, extraData: i128 2)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidHexFlag", scope: !208, file: !8, size: 8, align: 8, flags: DIFlagPrivate, elements: !220, templateParams: !42, identifier: "e239a8cc63685991b21ed15f5b970e11")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "got", scope: !219, file: !8, baseType: !114, align: 8, offset: 8, flags: DIFlagPrivate)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !8, baseType: !224, size: 32, align: 16, extraData: i128 1)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !193, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !225, templateParams: !201, identifier: "63ee1515a3f81e74f2ba84f0a3845f95")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !229, file: !8, size: 64, align: 64, elements: !232, templateParams: !42, identifier: "a3639ddea1aad4e0a99f595d89cee8a7")
!229 = !DINamespace(name: "parse_hex", scope: !230)
!230 = !DINamespace(name: "{impl#13}", scope: !231)
!231 = !DINamespace(name: "traits", scope: !205)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !228, file: !8, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DISubprogram(name: "map_err<u16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#13}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h0ce151dc5fe39c39E", scope: !171, file: !170, line: 826, type: !191, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !236)
!236 = !{!181, !182, !237, !238}
!237 = !DITemplateTypeParameter(name: "F", type: !203)
!238 = !DITemplateTypeParameter(name: "O", type: !228)
!239 = !{!240, !241, !242, !244}
!240 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 826, type: !171)
!241 = !DILocalVariable(name: "op", arg: 2, scope: !169, file: !170, line: 826, type: !228)
!242 = !DILocalVariable(name: "t", scope: !243, file: !170, line: 828, type: !179, align: 2)
!243 = distinct !DILexicalBlock(scope: !169, file: !170, line: 828, column: 13)
!244 = !DILocalVariable(name: "e", scope: !245, file: !170, line: 829, type: !183, align: 1)
!245 = distinct !DILexicalBlock(scope: !169, file: !170, line: 829, column: 13)
!246 = !DILocation(line: 826, column: 42, scope: !169)
!247 = !DILocation(line: 826, column: 48, scope: !169)
!248 = !DILocation(line: 827, column: 15, scope: !169)
!249 = !{i8 0, i8 2}
!250 = !DILocation(line: 827, column: 9, scope: !169)
!251 = !DILocation(line: 828, column: 16, scope: !169)
!252 = !DILocation(line: 828, column: 16, scope: !243)
!253 = !DILocation(line: 828, column: 22, scope: !243)
!254 = !DILocation(line: 828, column: 26, scope: !169)
!255 = !DILocation(line: 829, column: 17, scope: !169)
!256 = !{i8 0, i8 5}
!257 = !DILocation(line: 829, column: 17, scope: !245)
!258 = !DILocation(line: 829, column: 27, scope: !245)
!259 = !{i8 0, i8 3}
!260 = !DILocation(line: 829, column: 23, scope: !245)
!261 = !DILocation(line: 829, column: 32, scope: !169)
!262 = !DILocation(line: 831, column: 5, scope: !169)
!263 = !DILocation(line: 831, column: 6, scope: !169)
!264 = distinct !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2b29097f4a933e9dE", scope: !265, file: !170, line: 826, type: !280, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !302, declaration: !301, retainedNodes: !304)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !266, templateParams: !42, identifier: "a6b4c165d6936c6f3c37cb52e84d0e70")
!266 = !{!267}
!267 = !DICompositeType(tag: DW_TAG_variant_part, scope: !265, file: !8, size: 128, align: 64, elements: !268, templateParams: !42, identifier: "efef28a22448d7c35148896963590e18", discriminator: !279)
!268 = !{!269, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !267, file: !8, baseType: !270, size: 128, align: 64, extraData: i128 0)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !265, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !271, templateParams: !273, identifier: "2c6b8b413fb19162d9e62253bebeb6db")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !270, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!273 = !{!274, !182}
!274 = !DITemplateTypeParameter(name: "T", type: !82)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !267, file: !8, baseType: !276, size: 128, align: 64, extraData: i128 1)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !265, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !277, templateParams: !273, identifier: "a0f0251a5a86cb07a2b74a94e99deb6b")
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !276, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!279 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !265, !296}
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !283, templateParams: !42, identifier: "15de7144b276f739ba5e66692baa5ba")
!283 = !{!284}
!284 = !DICompositeType(tag: DW_TAG_variant_part, scope: !282, file: !8, size: 128, align: 64, elements: !285, templateParams: !42, identifier: "e4031ebadd8abe307627c671e9856f93", discriminator: !295)
!285 = !{!286, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !284, file: !8, baseType: !287, size: 128, align: 64, extraData: i128 0)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !282, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !288, templateParams: !290, identifier: "3b786f69f046937a1d992060b43016fc")
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !287, file: !8, baseType: !82, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!290 = !{!274, !202}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !284, file: !8, baseType: !292, size: 128, align: 64, extraData: i128 1)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !282, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !293, templateParams: !290, identifier: "3f25474c9c786f68815d8c45d08c14d4")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !292, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !282, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !297, file: !8, size: 64, align: 64, elements: !299, templateParams: !42, identifier: "3f258bbd56bf4bac7df491bf17e20b34")
!297 = !DINamespace(name: "parse_hex", scope: !298)
!298 = !DINamespace(name: "{impl#29}", scope: !231)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !296, file: !8, baseType: !234, size: 64, align: 64)
!301 = !DISubprogram(name: "map_err<u64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#29}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2b29097f4a933e9dE", scope: !265, file: !170, line: 826, type: !280, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !302)
!302 = !{!274, !182, !237, !303}
!303 = !DITemplateTypeParameter(name: "O", type: !296)
!304 = !{!305, !306, !307, !309}
!305 = !DILocalVariable(name: "self", arg: 1, scope: !264, file: !170, line: 826, type: !265)
!306 = !DILocalVariable(name: "op", arg: 2, scope: !264, file: !170, line: 826, type: !296)
!307 = !DILocalVariable(name: "t", scope: !308, file: !170, line: 828, type: !82, align: 8)
!308 = distinct !DILexicalBlock(scope: !264, file: !170, line: 828, column: 13)
!309 = !DILocalVariable(name: "e", scope: !310, file: !170, line: 829, type: !183, align: 1)
!310 = distinct !DILexicalBlock(scope: !264, file: !170, line: 829, column: 13)
!311 = !DILocation(line: 826, column: 42, scope: !264)
!312 = !DILocation(line: 826, column: 48, scope: !264)
!313 = !DILocation(line: 827, column: 15, scope: !264)
!314 = !DILocation(line: 827, column: 9, scope: !264)
!315 = !DILocation(line: 828, column: 16, scope: !264)
!316 = !DILocation(line: 828, column: 16, scope: !308)
!317 = !DILocation(line: 828, column: 22, scope: !308)
!318 = !DILocation(line: 828, column: 26, scope: !264)
!319 = !DILocation(line: 829, column: 17, scope: !264)
!320 = !DILocation(line: 829, column: 17, scope: !310)
!321 = !DILocation(line: 829, column: 27, scope: !310)
!322 = !DILocation(line: 829, column: 23, scope: !310)
!323 = !DILocation(line: 829, column: 32, scope: !264)
!324 = !DILocation(line: 831, column: 5, scope: !264)
!325 = !DILocation(line: 831, column: 6, scope: !264)
!326 = distinct !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2cef8fb389bf882dE", scope: !327, file: !170, line: 826, type: !343, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !365, declaration: !364, retainedNodes: !367)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, core::num::error::ParseIntError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !328, templateParams: !42, identifier: "6413ae9243d7d63913e43aff16424cff")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_variant_part, scope: !327, file: !8, size: 32, align: 16, elements: !330, templateParams: !42, identifier: "c8b2a7fc1206e2c2899a2a7082700ac4", discriminator: !342)
!330 = !{!331, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !329, file: !8, baseType: !332, size: 32, align: 16, extraData: i128 0)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !327, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !333, templateParams: !336, identifier: "e4523d61b1c6ffd87e7c27eb69a5759f")
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !332, file: !8, baseType: !335, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!335 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!336 = !{!337, !182}
!337 = !DITemplateTypeParameter(name: "T", type: !335)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !329, file: !8, baseType: !339, size: 32, align: 16, extraData: i128 1)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !327, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !340, templateParams: !336, identifier: "3935a1a9ba767cf3b4c92cf6a4750b6b")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !339, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !327, !359}
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i16, bitflags::parser::ParseError>", scope: !106, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !346, templateParams: !42, identifier: "edc5fce2732045143e8f29c3b7fe97b6")
!346 = !{!347}
!347 = !DICompositeType(tag: DW_TAG_variant_part, scope: !345, file: !8, size: 32, align: 16, elements: !348, templateParams: !42, identifier: "ff11f9dbed041b8d823539c820de0d47", discriminator: !358)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !347, file: !8, baseType: !350, size: 32, align: 16, extraData: i128 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !345, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !351, templateParams: !353, identifier: "2d77c4c12d6aa68a6c18671b2c7eee22")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !350, file: !8, baseType: !335, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!353 = !{!337, !202}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !347, file: !8, baseType: !355, size: 32, align: 16, extraData: i128 1)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !345, file: !8, size: 32, align: 16, flags: DIFlagPublic, elements: !356, templateParams: !353, identifier: "a62f15c50ad6f571d216fd1d75e6d88b")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!358 = !DIDerivedType(tag: DW_TAG_member, scope: !345, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !360, file: !8, size: 64, align: 64, elements: !362, templateParams: !42, identifier: "fc823eac63c42c6f97451be57a74dd3")
!360 = !DINamespace(name: "parse_hex", scope: !361)
!361 = !DINamespace(name: "{impl#14}", scope: !231)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !359, file: !8, baseType: !234, size: 64, align: 64)
!364 = !DISubprogram(name: "map_err<i16, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#14}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h2cef8fb389bf882dE", scope: !327, file: !170, line: 826, type: !343, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !365)
!365 = !{!337, !182, !237, !366}
!366 = !DITemplateTypeParameter(name: "O", type: !359)
!367 = !{!368, !369, !370, !372}
!368 = !DILocalVariable(name: "self", arg: 1, scope: !326, file: !170, line: 826, type: !327)
!369 = !DILocalVariable(name: "op", arg: 2, scope: !326, file: !170, line: 826, type: !359)
!370 = !DILocalVariable(name: "t", scope: !371, file: !170, line: 828, type: !335, align: 2)
!371 = distinct !DILexicalBlock(scope: !326, file: !170, line: 828, column: 13)
!372 = !DILocalVariable(name: "e", scope: !373, file: !170, line: 829, type: !183, align: 1)
!373 = distinct !DILexicalBlock(scope: !326, file: !170, line: 829, column: 13)
!374 = !DILocation(line: 826, column: 42, scope: !326)
!375 = !DILocation(line: 826, column: 48, scope: !326)
!376 = !DILocation(line: 827, column: 15, scope: !326)
!377 = !DILocation(line: 827, column: 9, scope: !326)
!378 = !DILocation(line: 828, column: 16, scope: !326)
!379 = !DILocation(line: 828, column: 16, scope: !371)
!380 = !DILocation(line: 828, column: 22, scope: !371)
!381 = !DILocation(line: 828, column: 26, scope: !326)
!382 = !DILocation(line: 829, column: 17, scope: !326)
!383 = !DILocation(line: 829, column: 17, scope: !373)
!384 = !DILocation(line: 829, column: 27, scope: !373)
!385 = !DILocation(line: 829, column: 23, scope: !373)
!386 = !DILocation(line: 829, column: 32, scope: !326)
!387 = !DILocation(line: 831, column: 5, scope: !326)
!388 = !DILocation(line: 831, column: 6, scope: !326)
!389 = distinct !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h38a4059d7602ea03E", scope: !390, file: !170, line: 826, type: !406, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !428, declaration: !427, retainedNodes: !430)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !391, templateParams: !42, identifier: "7e7a4e42d5ca80df8f6247ff60985cf7")
!391 = !{!392}
!392 = !DICompositeType(tag: DW_TAG_variant_part, scope: !390, file: !8, size: 128, align: 64, elements: !393, templateParams: !42, identifier: "1bdd2dd4deb49c97b12f96560e5b1211", discriminator: !405)
!393 = !{!394, !401}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !392, file: !8, baseType: !395, size: 128, align: 64, extraData: i128 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !390, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !396, templateParams: !399, identifier: "b964540dc23e4c7db0d1d2355f1a2f01")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !8, baseType: !398, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!398 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!399 = !{!400, !182}
!400 = !DITemplateTypeParameter(name: "T", type: !398)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !392, file: !8, baseType: !402, size: 128, align: 64, extraData: i128 1)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !390, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !403, templateParams: !399, identifier: "8b48b8ba8fe945065ca037be5f26bb71")
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !402, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !390, !422}
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<isize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !409, templateParams: !42, identifier: "3e1a9469850dd47cb228c7bdcf11a543")
!409 = !{!410}
!410 = !DICompositeType(tag: DW_TAG_variant_part, scope: !408, file: !8, size: 128, align: 64, elements: !411, templateParams: !42, identifier: "e7f86ae61474018bc8ad407a7728026a", discriminator: !421)
!411 = !{!412, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !410, file: !8, baseType: !413, size: 128, align: 64, extraData: i128 0)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !408, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !414, templateParams: !416, identifier: "fd77539acff9c25f980c19ef48344f5d")
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !413, file: !8, baseType: !398, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!416 = !{!400, !202}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !410, file: !8, baseType: !418, size: 128, align: 64, extraData: i128 1)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !408, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !419, templateParams: !416, identifier: "3b17bbe12e4f875dfa723861475eea77")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !418, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !408, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !423, file: !8, size: 64, align: 64, elements: !425, templateParams: !42, identifier: "7529cd82750f58ee149bdb5dc0677705")
!423 = !DINamespace(name: "parse_hex", scope: !424)
!424 = !DINamespace(name: "{impl#46}", scope: !231)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !422, file: !8, baseType: !234, size: 64, align: 64)
!427 = !DISubprogram(name: "map_err<isize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#46}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h38a4059d7602ea03E", scope: !390, file: !170, line: 826, type: !406, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !428)
!428 = !{!400, !182, !237, !429}
!429 = !DITemplateTypeParameter(name: "O", type: !422)
!430 = !{!431, !432, !433, !435}
!431 = !DILocalVariable(name: "self", arg: 1, scope: !389, file: !170, line: 826, type: !390)
!432 = !DILocalVariable(name: "op", arg: 2, scope: !389, file: !170, line: 826, type: !422)
!433 = !DILocalVariable(name: "t", scope: !434, file: !170, line: 828, type: !398, align: 8)
!434 = distinct !DILexicalBlock(scope: !389, file: !170, line: 828, column: 13)
!435 = !DILocalVariable(name: "e", scope: !436, file: !170, line: 829, type: !183, align: 1)
!436 = distinct !DILexicalBlock(scope: !389, file: !170, line: 829, column: 13)
!437 = !DILocation(line: 826, column: 42, scope: !389)
!438 = !DILocation(line: 826, column: 48, scope: !389)
!439 = !DILocation(line: 827, column: 15, scope: !389)
!440 = !DILocation(line: 827, column: 9, scope: !389)
!441 = !DILocation(line: 828, column: 16, scope: !389)
!442 = !DILocation(line: 828, column: 16, scope: !434)
!443 = !DILocation(line: 828, column: 22, scope: !434)
!444 = !DILocation(line: 828, column: 26, scope: !389)
!445 = !DILocation(line: 829, column: 17, scope: !389)
!446 = !DILocation(line: 829, column: 17, scope: !436)
!447 = !DILocation(line: 829, column: 27, scope: !436)
!448 = !DILocation(line: 829, column: 23, scope: !436)
!449 = !DILocation(line: 829, column: 32, scope: !389)
!450 = !DILocation(line: 831, column: 5, scope: !389)
!451 = !DILocation(line: 831, column: 6, scope: !389)
!452 = distinct !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h3f9d897e60d35347E", scope: !453, file: !170, line: 826, type: !469, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !491, declaration: !490, retainedNodes: !493)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !454, templateParams: !42, identifier: "19a2b376ac9e6d9c822057f39a013ae")
!454 = !{!455}
!455 = !DICompositeType(tag: DW_TAG_variant_part, scope: !453, file: !8, size: 16, align: 8, elements: !456, templateParams: !42, identifier: "fe256c81fee04f782c8d1ac9f3cd7ddd", discriminator: !468)
!456 = !{!457, !464}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !455, file: !8, baseType: !458, size: 16, align: 8, extraData: i128 0)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !453, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !459, templateParams: !462, identifier: "8924f96c9707fd9145fc1eff0c8728a8")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !458, file: !8, baseType: !461, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!461 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!462 = !{!463, !182}
!463 = !DITemplateTypeParameter(name: "T", type: !461)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !455, file: !8, baseType: !465, size: 16, align: 8, extraData: i128 1)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !453, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !466, templateParams: !462, identifier: "c95f38262c2b060d564d8e95841b1a3a")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !465, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !453, !485}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !472, templateParams: !42, identifier: "f918391fed67e3ebe8da28d8ad452b4f")
!472 = !{!473}
!473 = !DICompositeType(tag: DW_TAG_variant_part, scope: !471, file: !8, size: 16, align: 8, elements: !474, templateParams: !42, identifier: "d7bd13750b0bd19f9f9d8d5b7a53aa19", discriminator: !484)
!474 = !{!475, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !473, file: !8, baseType: !476, size: 16, align: 8, extraData: i128 0)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !471, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !477, templateParams: !479, identifier: "7247dabcec5ec33565a157d01bc10c0c")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !8, baseType: !461, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!479 = !{!463, !202}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !473, file: !8, baseType: !481, size: 16, align: 8, extraData: i128 1)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !471, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !482, templateParams: !479, identifier: "ac5c34d069fe0d7195efc526b9dfa646")
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !481, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!484 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !486, file: !8, size: 64, align: 64, elements: !488, templateParams: !42, identifier: "52d725bbf16f46eb5d0390c1aecf2e58")
!486 = !DINamespace(name: "parse_hex", scope: !487)
!487 = !DINamespace(name: "{impl#6}", scope: !231)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !485, file: !8, baseType: !234, size: 64, align: 64)
!490 = !DISubprogram(name: "map_err<i8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#6}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h3f9d897e60d35347E", scope: !453, file: !170, line: 826, type: !469, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !491)
!491 = !{!463, !182, !237, !492}
!492 = !DITemplateTypeParameter(name: "O", type: !485)
!493 = !{!494, !495, !496, !498}
!494 = !DILocalVariable(name: "self", arg: 1, scope: !452, file: !170, line: 826, type: !453)
!495 = !DILocalVariable(name: "op", arg: 2, scope: !452, file: !170, line: 826, type: !485)
!496 = !DILocalVariable(name: "t", scope: !497, file: !170, line: 828, type: !461, align: 1)
!497 = distinct !DILexicalBlock(scope: !452, file: !170, line: 828, column: 13)
!498 = !DILocalVariable(name: "e", scope: !499, file: !170, line: 829, type: !183, align: 1)
!499 = distinct !DILexicalBlock(scope: !452, file: !170, line: 829, column: 13)
!500 = !DILocation(line: 826, column: 42, scope: !452)
!501 = !DILocation(line: 826, column: 48, scope: !452)
!502 = !DILocation(line: 827, column: 15, scope: !452)
!503 = !DILocation(line: 827, column: 9, scope: !452)
!504 = !DILocation(line: 828, column: 16, scope: !452)
!505 = !DILocation(line: 828, column: 16, scope: !497)
!506 = !DILocation(line: 828, column: 22, scope: !497)
!507 = !DILocation(line: 828, column: 26, scope: !452)
!508 = !DILocation(line: 829, column: 17, scope: !452)
!509 = !DILocation(line: 829, column: 17, scope: !499)
!510 = !DILocation(line: 829, column: 27, scope: !499)
!511 = !DILocation(line: 829, column: 23, scope: !499)
!512 = !DILocation(line: 829, column: 32, scope: !452)
!513 = !DILocation(line: 831, column: 5, scope: !452)
!514 = !DILocation(line: 831, column: 6, scope: !452)
!515 = distinct !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h41da6e15e02a4ddbE", scope: !516, file: !170, line: 826, type: !532, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !554, declaration: !553, retainedNodes: !556)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !517, templateParams: !42, identifier: "3ceb3cfcd5d88f41e93eb57c660ecbee")
!517 = !{!518}
!518 = !DICompositeType(tag: DW_TAG_variant_part, scope: !516, file: !8, size: 192, align: 64, elements: !519, templateParams: !42, identifier: "dbc648704d816407b203bbb927ec8779", discriminator: !531)
!519 = !{!520, !527}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !518, file: !8, baseType: !521, size: 192, align: 64, extraData: i128 0)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !516, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !522, templateParams: !525, identifier: "a9476a22fd77b9ca1a0a393e14c652ae")
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !521, file: !8, baseType: !524, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!524 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!525 = !{!526, !182}
!526 = !DITemplateTypeParameter(name: "T", type: !524)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !518, file: !8, baseType: !528, size: 192, align: 64, extraData: i128 1)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !516, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !529, templateParams: !525, identifier: "d094f89c6848273b40f4891369c5659c")
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !528, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!531 = !DIDerivedType(tag: DW_TAG_member, scope: !516, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !516, !548}
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !535, templateParams: !42, identifier: "6f37c9a6f7d203914e6b86bfa78d132f")
!535 = !{!536}
!536 = !DICompositeType(tag: DW_TAG_variant_part, scope: !534, file: !8, size: 192, align: 64, elements: !537, templateParams: !42, identifier: "673ce23a4e051c07b1be3c5d75eed09b", discriminator: !547)
!537 = !{!538, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !536, file: !8, baseType: !539, size: 192, align: 64, extraData: i128 0)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !534, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !540, templateParams: !542, identifier: "2aab6516ab826628d465439f4c87fec5")
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !539, file: !8, baseType: !524, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!542 = !{!526, !202}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !536, file: !8, baseType: !544, size: 192, align: 64, extraData: i128 1)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !534, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !545, templateParams: !542, identifier: "771c8f06667d7487f0cb5f77691edd92")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!547 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !549, file: !8, size: 64, align: 64, elements: !551, templateParams: !42, identifier: "a1c46759a60dc427664496fe7d218e6a")
!549 = !DINamespace(name: "parse_hex", scope: !550)
!550 = !DINamespace(name: "{impl#38}", scope: !231)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !548, file: !8, baseType: !234, size: 64, align: 64)
!553 = !DISubprogram(name: "map_err<i128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#38}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h41da6e15e02a4ddbE", scope: !516, file: !170, line: 826, type: !532, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !554)
!554 = !{!526, !182, !237, !555}
!555 = !DITemplateTypeParameter(name: "O", type: !548)
!556 = !{!557, !558, !559, !561}
!557 = !DILocalVariable(name: "self", arg: 1, scope: !515, file: !170, line: 826, type: !516)
!558 = !DILocalVariable(name: "op", arg: 2, scope: !515, file: !170, line: 826, type: !548)
!559 = !DILocalVariable(name: "t", scope: !560, file: !170, line: 828, type: !524, align: 8)
!560 = distinct !DILexicalBlock(scope: !515, file: !170, line: 828, column: 13)
!561 = !DILocalVariable(name: "e", scope: !562, file: !170, line: 829, type: !183, align: 1)
!562 = distinct !DILexicalBlock(scope: !515, file: !170, line: 829, column: 13)
!563 = !DILocation(line: 826, column: 42, scope: !515)
!564 = !DILocation(line: 826, column: 48, scope: !515)
!565 = !DILocation(line: 827, column: 15, scope: !515)
!566 = !DILocation(line: 827, column: 9, scope: !515)
!567 = !DILocation(line: 828, column: 16, scope: !515)
!568 = !DILocation(line: 828, column: 16, scope: !560)
!569 = !DILocation(line: 828, column: 22, scope: !560)
!570 = !DILocation(line: 828, column: 26, scope: !515)
!571 = !DILocation(line: 829, column: 17, scope: !515)
!572 = !DILocation(line: 829, column: 17, scope: !562)
!573 = !DILocation(line: 829, column: 27, scope: !562)
!574 = !DILocation(line: 829, column: 23, scope: !562)
!575 = !DILocation(line: 829, column: 32, scope: !515)
!576 = !DILocation(line: 831, column: 5, scope: !515)
!577 = !DILocation(line: 831, column: 6, scope: !515)
!578 = distinct !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h5e4c8afe50185a61E", scope: !579, file: !170, line: 826, type: !594, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !616, declaration: !615, retainedNodes: !618)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, core::num::error::ParseIntError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !580, templateParams: !42, identifier: "41c63229caf2261b17a388f1794c4414")
!580 = !{!581}
!581 = !DICompositeType(tag: DW_TAG_variant_part, scope: !579, file: !8, size: 16, align: 8, elements: !582, templateParams: !42, identifier: "d0ebcc80d221c2e1c1ae3fe60b587c54", discriminator: !593)
!582 = !{!583, !589}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !581, file: !8, baseType: !584, size: 16, align: 8, extraData: i128 0)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !579, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !585, templateParams: !587, identifier: "b76a0ffe39b2e6a1497057fca5f9590a")
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !584, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!587 = !{!588, !182}
!588 = !DITemplateTypeParameter(name: "T", type: !12)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !581, file: !8, baseType: !590, size: 16, align: 8, extraData: i128 1)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !579, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !591, templateParams: !587, identifier: "85a02444041f42d4d4da1b55fc7fa33c")
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !590, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!593 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !579, !610}
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, bitflags::parser::ParseError>", scope: !106, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !597, templateParams: !42, identifier: "5cb19d3e6eb4c52b3ef765a39d5fbf53")
!597 = !{!598}
!598 = !DICompositeType(tag: DW_TAG_variant_part, scope: !596, file: !8, size: 16, align: 8, elements: !599, templateParams: !42, identifier: "24e6d3588e9d9b971d80e70fbe13807f", discriminator: !609)
!599 = !{!600, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !598, file: !8, baseType: !601, size: 16, align: 8, extraData: i128 0)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !596, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !602, templateParams: !604, identifier: "bbb301bc53e1d629158d4c1b4e00ad28")
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !601, file: !8, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!604 = !{!588, !202}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !598, file: !8, baseType: !606, size: 16, align: 8, extraData: i128 1)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !596, file: !8, size: 16, align: 8, flags: DIFlagPublic, elements: !607, templateParams: !604, identifier: "5e9637ffbc1eef588ccf1f4b79b10649")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !606, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !596, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !611, file: !8, size: 64, align: 64, elements: !613, templateParams: !42, identifier: "35723ea6b8ba61e3d3535babe62acba6")
!611 = !DINamespace(name: "parse_hex", scope: !612)
!612 = !DINamespace(name: "{impl#5}", scope: !231)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !610, file: !8, baseType: !234, size: 64, align: 64)
!615 = !DISubprogram(name: "map_err<u8, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#5}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h5e4c8afe50185a61E", scope: !579, file: !170, line: 826, type: !594, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !616)
!616 = !{!588, !182, !237, !617}
!617 = !DITemplateTypeParameter(name: "O", type: !610)
!618 = !{!619, !620, !621, !623}
!619 = !DILocalVariable(name: "self", arg: 1, scope: !578, file: !170, line: 826, type: !579)
!620 = !DILocalVariable(name: "op", arg: 2, scope: !578, file: !170, line: 826, type: !610)
!621 = !DILocalVariable(name: "t", scope: !622, file: !170, line: 828, type: !12, align: 1)
!622 = distinct !DILexicalBlock(scope: !578, file: !170, line: 828, column: 13)
!623 = !DILocalVariable(name: "e", scope: !624, file: !170, line: 829, type: !183, align: 1)
!624 = distinct !DILexicalBlock(scope: !578, file: !170, line: 829, column: 13)
!625 = !DILocation(line: 826, column: 42, scope: !578)
!626 = !DILocation(line: 826, column: 48, scope: !578)
!627 = !DILocation(line: 827, column: 15, scope: !578)
!628 = !DILocation(line: 827, column: 9, scope: !578)
!629 = !DILocation(line: 828, column: 16, scope: !578)
!630 = !DILocation(line: 828, column: 16, scope: !622)
!631 = !DILocation(line: 828, column: 22, scope: !622)
!632 = !DILocation(line: 828, column: 26, scope: !578)
!633 = !DILocation(line: 829, column: 17, scope: !578)
!634 = !DILocation(line: 829, column: 17, scope: !624)
!635 = !DILocation(line: 829, column: 27, scope: !624)
!636 = !DILocation(line: 829, column: 23, scope: !624)
!637 = !DILocation(line: 829, column: 32, scope: !578)
!638 = !DILocation(line: 831, column: 5, scope: !578)
!639 = !DILocation(line: 831, column: 6, scope: !578)
!640 = distinct !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h8dae1b1764db41bdE", scope: !641, file: !170, line: 826, type: !655, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !677, declaration: !676, retainedNodes: !679)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !642, templateParams: !42, identifier: "1a387a32d41c7f4c531493cefc711685")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_variant_part, scope: !641, file: !8, size: 128, align: 64, elements: !644, templateParams: !42, identifier: "b40505bbd5a676566c8078c400dcf471", discriminator: !654)
!644 = !{!645, !650}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !643, file: !8, baseType: !646, size: 128, align: 64, extraData: i128 0)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !641, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !647, templateParams: !649, identifier: "ea73cbe64ba0bfd72ff3fc834d4dea5b")
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !646, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!649 = !{!138, !182}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !643, file: !8, baseType: !651, size: 128, align: 64, extraData: i128 1)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !641, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !652, templateParams: !649, identifier: "92d3128e98a3db8750a5c23fb1372696")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !641, !671}
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !658, templateParams: !42, identifier: "eb12622b548af291785bb2699a15b1ad")
!658 = !{!659}
!659 = !DICompositeType(tag: DW_TAG_variant_part, scope: !657, file: !8, size: 128, align: 64, elements: !660, templateParams: !42, identifier: "f8653d9ca67761f7e71f86692444917", discriminator: !670)
!660 = !{!661, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !659, file: !8, baseType: !662, size: 128, align: 64, extraData: i128 0)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !657, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !663, templateParams: !665, identifier: "d8286db78a3d24998631d0e85d85333d")
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !662, file: !8, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!665 = !{!138, !202}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !659, file: !8, baseType: !667, size: 128, align: 64, extraData: i128 1)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !657, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !668, templateParams: !665, identifier: "66f2fb7bb8e81a365b8723c6cc191b19")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !667, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!670 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !672, file: !8, size: 64, align: 64, elements: !674, templateParams: !42, identifier: "9cb3deac1cef9ddebfaee30dc6c55c4a")
!672 = !DINamespace(name: "parse_hex", scope: !673)
!673 = !DINamespace(name: "{impl#45}", scope: !231)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !671, file: !8, baseType: !234, size: 64, align: 64)
!676 = !DISubprogram(name: "map_err<usize, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#45}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17h8dae1b1764db41bdE", scope: !641, file: !170, line: 826, type: !655, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !677)
!677 = !{!138, !182, !237, !678}
!678 = !DITemplateTypeParameter(name: "O", type: !671)
!679 = !{!680, !681, !682, !684}
!680 = !DILocalVariable(name: "self", arg: 1, scope: !640, file: !170, line: 826, type: !641)
!681 = !DILocalVariable(name: "op", arg: 2, scope: !640, file: !170, line: 826, type: !671)
!682 = !DILocalVariable(name: "t", scope: !683, file: !170, line: 828, type: !41, align: 8)
!683 = distinct !DILexicalBlock(scope: !640, file: !170, line: 828, column: 13)
!684 = !DILocalVariable(name: "e", scope: !685, file: !170, line: 829, type: !183, align: 1)
!685 = distinct !DILexicalBlock(scope: !640, file: !170, line: 829, column: 13)
!686 = !DILocation(line: 826, column: 42, scope: !640)
!687 = !DILocation(line: 826, column: 48, scope: !640)
!688 = !DILocation(line: 827, column: 15, scope: !640)
!689 = !DILocation(line: 827, column: 9, scope: !640)
!690 = !DILocation(line: 828, column: 16, scope: !640)
!691 = !DILocation(line: 828, column: 16, scope: !683)
!692 = !DILocation(line: 828, column: 22, scope: !683)
!693 = !DILocation(line: 828, column: 26, scope: !640)
!694 = !DILocation(line: 829, column: 17, scope: !640)
!695 = !DILocation(line: 829, column: 17, scope: !685)
!696 = !DILocation(line: 829, column: 27, scope: !685)
!697 = !DILocation(line: 829, column: 23, scope: !685)
!698 = !DILocation(line: 829, column: 32, scope: !640)
!699 = !DILocation(line: 831, column: 5, scope: !640)
!700 = !DILocation(line: 831, column: 6, scope: !640)
!701 = distinct !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hab8c23c0d58bee7bE", scope: !702, file: !170, line: 826, type: !718, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !740, declaration: !739, retainedNodes: !742)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, core::num::error::ParseIntError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !703, templateParams: !42, identifier: "efc8a3a65ac9872a1dbad83c4ed4bf94")
!703 = !{!704}
!704 = !DICompositeType(tag: DW_TAG_variant_part, scope: !702, file: !8, size: 128, align: 64, elements: !705, templateParams: !42, identifier: "f03f70dcaa4cd985fa5817643d8d512", discriminator: !717)
!705 = !{!706, !713}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !704, file: !8, baseType: !707, size: 128, align: 64, extraData: i128 0)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !702, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !708, templateParams: !711, identifier: "2a8a31ce3b8677f76db0a0378768e170")
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !707, file: !8, baseType: !710, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!710 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!711 = !{!712, !182}
!712 = !DITemplateTypeParameter(name: "T", type: !710)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !704, file: !8, baseType: !714, size: 128, align: 64, extraData: i128 1)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !702, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !715, templateParams: !711, identifier: "2ed5b5b0dcdc557a46d3c58c34a1fc34")
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !714, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!717 = !DIDerivedType(tag: DW_TAG_member, scope: !702, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !702, !734}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i64, bitflags::parser::ParseError>", scope: !106, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !721, templateParams: !42, identifier: "cf55707a843538589b3c81e54384600")
!721 = !{!722}
!722 = !DICompositeType(tag: DW_TAG_variant_part, scope: !720, file: !8, size: 128, align: 64, elements: !723, templateParams: !42, identifier: "6e2284801e3affee1fdb325c580c485", discriminator: !733)
!723 = !{!724, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !722, file: !8, baseType: !725, size: 128, align: 64, extraData: i128 0)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !720, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !726, templateParams: !728, identifier: "88563a6017a3c6dc1a73ccc23f054707")
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !725, file: !8, baseType: !710, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!728 = !{!712, !202}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !722, file: !8, baseType: !730, size: 128, align: 64, extraData: i128 1)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !720, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !731, templateParams: !728, identifier: "5a6521d70ebcb39f327052bbf106dfec")
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !730, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!733 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !735, file: !8, size: 64, align: 64, elements: !737, templateParams: !42, identifier: "c9a26aa9e5361d7288404011daf75b1b")
!735 = !DINamespace(name: "parse_hex", scope: !736)
!736 = !DINamespace(name: "{impl#30}", scope: !231)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !734, file: !8, baseType: !234, size: 64, align: 64)
!739 = !DISubprogram(name: "map_err<i64, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#30}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hab8c23c0d58bee7bE", scope: !702, file: !170, line: 826, type: !718, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !740)
!740 = !{!712, !182, !237, !741}
!741 = !DITemplateTypeParameter(name: "O", type: !734)
!742 = !{!743, !744, !745, !747}
!743 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !170, line: 826, type: !702)
!744 = !DILocalVariable(name: "op", arg: 2, scope: !701, file: !170, line: 826, type: !734)
!745 = !DILocalVariable(name: "t", scope: !746, file: !170, line: 828, type: !710, align: 8)
!746 = distinct !DILexicalBlock(scope: !701, file: !170, line: 828, column: 13)
!747 = !DILocalVariable(name: "e", scope: !748, file: !170, line: 829, type: !183, align: 1)
!748 = distinct !DILexicalBlock(scope: !701, file: !170, line: 829, column: 13)
!749 = !DILocation(line: 826, column: 42, scope: !701)
!750 = !DILocation(line: 826, column: 48, scope: !701)
!751 = !DILocation(line: 827, column: 15, scope: !701)
!752 = !DILocation(line: 827, column: 9, scope: !701)
!753 = !DILocation(line: 828, column: 16, scope: !701)
!754 = !DILocation(line: 828, column: 16, scope: !746)
!755 = !DILocation(line: 828, column: 22, scope: !746)
!756 = !DILocation(line: 828, column: 26, scope: !701)
!757 = !DILocation(line: 829, column: 17, scope: !701)
!758 = !DILocation(line: 829, column: 17, scope: !748)
!759 = !DILocation(line: 829, column: 27, scope: !748)
!760 = !DILocation(line: 829, column: 23, scope: !748)
!761 = !DILocation(line: 829, column: 32, scope: !701)
!762 = !DILocation(line: 831, column: 5, scope: !701)
!763 = !DILocation(line: 831, column: 6, scope: !701)
!764 = distinct !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc145dcbc35b10d54E", scope: !765, file: !170, line: 826, type: !781, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !803, declaration: !802, retainedNodes: !805)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, core::num::error::ParseIntError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !766, templateParams: !42, identifier: "af9649d861e77b12c5b1e5d3f7e47b13")
!766 = !{!767}
!767 = !DICompositeType(tag: DW_TAG_variant_part, scope: !765, file: !8, size: 192, align: 64, elements: !768, templateParams: !42, identifier: "dae398f7267065f83b294b293e863e5", discriminator: !780)
!768 = !{!769, !776}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !767, file: !8, baseType: !770, size: 192, align: 64, extraData: i128 0)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !765, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !771, templateParams: !774, identifier: "f3fe5243f231cc99c0bd70bd1c337a95")
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !770, file: !8, baseType: !773, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!773 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!774 = !{!775, !182}
!775 = !DITemplateTypeParameter(name: "T", type: !773)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !767, file: !8, baseType: !777, size: 192, align: 64, extraData: i128 1)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !765, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !778, templateParams: !774, identifier: "e2f1719a9c2f993dd9aa8b0f1a7d566")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !777, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !765, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !765, !797}
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u128, bitflags::parser::ParseError>", scope: !106, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !784, templateParams: !42, identifier: "d9a187af6e0ec36ad7f298c527bfe3cf")
!784 = !{!785}
!785 = !DICompositeType(tag: DW_TAG_variant_part, scope: !783, file: !8, size: 192, align: 64, elements: !786, templateParams: !42, identifier: "67897d7faa6b369f2a603dc424e45c5", discriminator: !796)
!786 = !{!787, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !785, file: !8, baseType: !788, size: 192, align: 64, extraData: i128 0)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !783, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !789, templateParams: !791, identifier: "130e92bd803b66f2bf97e87d98334773")
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !788, file: !8, baseType: !773, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!791 = !{!775, !202}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !785, file: !8, baseType: !793, size: 192, align: 64, extraData: i128 1)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !783, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !794, templateParams: !791, identifier: "5d2ebd7d960e24701ab1713a3af60873")
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !793, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!796 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !798, file: !8, size: 64, align: 64, elements: !800, templateParams: !42, identifier: "40bf0da5d02affaf7242703fa3d3d8e7")
!798 = !DINamespace(name: "parse_hex", scope: !799)
!799 = !DINamespace(name: "{impl#37}", scope: !231)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !797, file: !8, baseType: !234, size: 64, align: 64)
!802 = !DISubprogram(name: "map_err<u128, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#37}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hc145dcbc35b10d54E", scope: !765, file: !170, line: 826, type: !781, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !803)
!803 = !{!775, !182, !237, !804}
!804 = !DITemplateTypeParameter(name: "O", type: !797)
!805 = !{!806, !807, !808, !810}
!806 = !DILocalVariable(name: "self", arg: 1, scope: !764, file: !170, line: 826, type: !765)
!807 = !DILocalVariable(name: "op", arg: 2, scope: !764, file: !170, line: 826, type: !797)
!808 = !DILocalVariable(name: "t", scope: !809, file: !170, line: 828, type: !773, align: 8)
!809 = distinct !DILexicalBlock(scope: !764, file: !170, line: 828, column: 13)
!810 = !DILocalVariable(name: "e", scope: !811, file: !170, line: 829, type: !183, align: 1)
!811 = distinct !DILexicalBlock(scope: !764, file: !170, line: 829, column: 13)
!812 = !DILocation(line: 826, column: 42, scope: !764)
!813 = !DILocation(line: 826, column: 48, scope: !764)
!814 = !DILocation(line: 827, column: 15, scope: !764)
!815 = !DILocation(line: 827, column: 9, scope: !764)
!816 = !DILocation(line: 828, column: 16, scope: !764)
!817 = !DILocation(line: 828, column: 16, scope: !809)
!818 = !DILocation(line: 828, column: 22, scope: !809)
!819 = !DILocation(line: 828, column: 26, scope: !764)
!820 = !DILocation(line: 829, column: 17, scope: !764)
!821 = !DILocation(line: 829, column: 17, scope: !811)
!822 = !DILocation(line: 829, column: 27, scope: !811)
!823 = !DILocation(line: 829, column: 23, scope: !811)
!824 = !DILocation(line: 829, column: 32, scope: !764)
!825 = !DILocation(line: 831, column: 5, scope: !764)
!826 = !DILocation(line: 831, column: 6, scope: !764)
!827 = distinct !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he73ea7935bcfc80aE", scope: !828, file: !170, line: 826, type: !844, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !866, declaration: !865, retainedNodes: !868)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !829, templateParams: !42, identifier: "1d41c9a405138e710a6066e08623434")
!829 = !{!830}
!830 = !DICompositeType(tag: DW_TAG_variant_part, scope: !828, file: !8, size: 64, align: 32, elements: !831, templateParams: !42, identifier: "59a676d486d386238b991f73e30b545a", discriminator: !843)
!831 = !{!832, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !830, file: !8, baseType: !833, size: 64, align: 32, extraData: i128 0)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !828, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !834, templateParams: !837, identifier: "21ba9974eda1d7905c1b32895a7a860a")
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !833, file: !8, baseType: !836, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!836 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!837 = !{!838, !182}
!838 = !DITemplateTypeParameter(name: "T", type: !836)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !830, file: !8, baseType: !840, size: 64, align: 32, extraData: i128 1)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !828, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !841, templateParams: !837, identifier: "564f7b78e152c9d8dfd66c990d88c1db")
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !840, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!843 = !DIDerivedType(tag: DW_TAG_member, scope: !828, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !828, !860}
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<i32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !847, templateParams: !42, identifier: "f6acd88ae1156cf9fc8a853de622df46")
!847 = !{!848}
!848 = !DICompositeType(tag: DW_TAG_variant_part, scope: !846, file: !8, size: 64, align: 32, elements: !849, templateParams: !42, identifier: "cd5f9964a587d70c6b441f0f4d0d4198", discriminator: !859)
!849 = !{!850, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !848, file: !8, baseType: !851, size: 64, align: 32, extraData: i128 0)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !846, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !852, templateParams: !854, identifier: "e8aa34a14926e56a6c28d1bb66d983b7")
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !851, file: !8, baseType: !836, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!854 = !{!838, !202}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !848, file: !8, baseType: !856, size: 64, align: 32, extraData: i128 1)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !846, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !857, templateParams: !854, identifier: "8a88ecc0fe2920f19106b10686d6be08")
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !856, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!859 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !861, file: !8, size: 64, align: 64, elements: !863, templateParams: !42, identifier: "832b2cd197b88630f7ad45a5c3321739")
!861 = !DINamespace(name: "parse_hex", scope: !862)
!862 = !DINamespace(name: "{impl#22}", scope: !231)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !860, file: !8, baseType: !234, size: 64, align: 64)
!865 = !DISubprogram(name: "map_err<i32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#22}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17he73ea7935bcfc80aE", scope: !828, file: !170, line: 826, type: !844, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !866)
!866 = !{!838, !182, !237, !867}
!867 = !DITemplateTypeParameter(name: "O", type: !860)
!868 = !{!869, !870, !871, !873}
!869 = !DILocalVariable(name: "self", arg: 1, scope: !827, file: !170, line: 826, type: !828)
!870 = !DILocalVariable(name: "op", arg: 2, scope: !827, file: !170, line: 826, type: !860)
!871 = !DILocalVariable(name: "t", scope: !872, file: !170, line: 828, type: !836, align: 4)
!872 = distinct !DILexicalBlock(scope: !827, file: !170, line: 828, column: 13)
!873 = !DILocalVariable(name: "e", scope: !874, file: !170, line: 829, type: !183, align: 1)
!874 = distinct !DILexicalBlock(scope: !827, file: !170, line: 829, column: 13)
!875 = !DILocation(line: 826, column: 42, scope: !827)
!876 = !DILocation(line: 826, column: 48, scope: !827)
!877 = !DILocation(line: 827, column: 15, scope: !827)
!878 = !DILocation(line: 827, column: 9, scope: !827)
!879 = !DILocation(line: 828, column: 16, scope: !827)
!880 = !DILocation(line: 828, column: 16, scope: !872)
!881 = !DILocation(line: 828, column: 22, scope: !872)
!882 = !DILocation(line: 828, column: 26, scope: !827)
!883 = !DILocation(line: 829, column: 17, scope: !827)
!884 = !DILocation(line: 829, column: 17, scope: !874)
!885 = !DILocation(line: 829, column: 27, scope: !874)
!886 = !DILocation(line: 829, column: 23, scope: !874)
!887 = !DILocation(line: 829, column: 32, scope: !827)
!888 = !DILocation(line: 831, column: 5, scope: !827)
!889 = !DILocation(line: 831, column: 6, scope: !827)
!890 = distinct !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hf58ffa8771b74279E", scope: !891, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !928, declaration: !927, retainedNodes: !930)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, core::num::error::ParseIntError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !892, templateParams: !42, identifier: "99f55940fbc4c0c21f2830e9296af681")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_variant_part, scope: !891, file: !8, size: 64, align: 32, elements: !894, templateParams: !42, identifier: "13b84c19a5930963f4e1b551f74c7543", discriminator: !905)
!894 = !{!895, !901}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !893, file: !8, baseType: !896, size: 64, align: 32, extraData: i128 0)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !891, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !897, templateParams: !899, identifier: "24f2c72ce3c2fb517e1aae233502980d")
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !896, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!899 = !{!900, !182}
!900 = !DITemplateTypeParameter(name: "T", type: !65)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !893, file: !8, baseType: !902, size: 64, align: 32, extraData: i128 1)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !891, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !903, templateParams: !899, identifier: "d96e5d79eead3290566d558306673409")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !8, baseType: !183, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !891, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !891, !922}
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, bitflags::parser::ParseError>", scope: !106, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !909, templateParams: !42, identifier: "fe29a5a3029fc98f4c2f31d1f089ee6")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !8, size: 64, align: 32, elements: !911, templateParams: !42, identifier: "e23e0e4bca8a2e9ef1a4fa0f29fa30ce", discriminator: !921)
!911 = !{!912, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !910, file: !8, baseType: !913, size: 64, align: 32, extraData: i128 0)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !908, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !914, templateParams: !916, identifier: "78e350660bcf11a311b92d6854acd91f")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !913, file: !8, baseType: !65, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!916 = !{!900, !202}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !910, file: !8, baseType: !918, size: 64, align: 32, extraData: i128 1)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !908, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !919, templateParams: !916, identifier: "e1f766c2c4f6d6f57e6782e97835a14f")
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !918, file: !8, baseType: !203, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !923, file: !8, size: 64, align: 64, elements: !925, templateParams: !42, identifier: "5d403126bbe7af7c61ee1a273c68db09")
!923 = !DINamespace(name: "parse_hex", scope: !924)
!924 = !DINamespace(name: "{impl#21}", scope: !231)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input", scope: !922, file: !8, baseType: !234, size: 64, align: 64)
!927 = !DISubprogram(name: "map_err<u32, core::num::error::ParseIntError, bitflags::parser::ParseError, bitflags::traits::{impl#21}::parse_hex::{closure_env#0}>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$7map_err17hf58ffa8771b74279E", scope: !891, file: !170, line: 826, type: !906, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !928)
!928 = !{!900, !182, !237, !929}
!929 = !DITemplateTypeParameter(name: "O", type: !922)
!930 = !{!931, !932, !933, !935}
!931 = !DILocalVariable(name: "self", arg: 1, scope: !890, file: !170, line: 826, type: !891)
!932 = !DILocalVariable(name: "op", arg: 2, scope: !890, file: !170, line: 826, type: !922)
!933 = !DILocalVariable(name: "t", scope: !934, file: !170, line: 828, type: !65, align: 4)
!934 = distinct !DILexicalBlock(scope: !890, file: !170, line: 828, column: 13)
!935 = !DILocalVariable(name: "e", scope: !936, file: !170, line: 829, type: !183, align: 1)
!936 = distinct !DILexicalBlock(scope: !890, file: !170, line: 829, column: 13)
!937 = !DILocation(line: 826, column: 42, scope: !890)
!938 = !DILocation(line: 826, column: 48, scope: !890)
!939 = !DILocation(line: 827, column: 15, scope: !890)
!940 = !DILocation(line: 827, column: 9, scope: !890)
!941 = !DILocation(line: 828, column: 16, scope: !890)
!942 = !DILocation(line: 828, column: 16, scope: !934)
!943 = !DILocation(line: 828, column: 22, scope: !934)
!944 = !DILocation(line: 828, column: 26, scope: !890)
!945 = !DILocation(line: 829, column: 17, scope: !890)
!946 = !DILocation(line: 829, column: 17, scope: !936)
!947 = !DILocation(line: 829, column: 27, scope: !936)
!948 = !DILocation(line: 829, column: 23, scope: !936)
!949 = !DILocation(line: 829, column: 32, scope: !890)
!950 = !DILocation(line: 831, column: 5, scope: !890)
!951 = !DILocation(line: 831, column: 6, scope: !890)
!952 = distinct !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h9a66ac8d043f6b9cE", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !957, declaration: !956, retainedNodes: !959)
!953 = !DIFile(filename: "src/parser.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-2.4.1", checksumkind: CSK_MD5, checksum: "2e786373a5103ab0379604d86533efec")
!954 = !DISubroutineType(types: !955)
!955 = !{!203, !36}
!956 = !DISubprogram(name: "invalid_hex_flag<&str>", linkageName: "_ZN8bitflags6parser10ParseError16invalid_hex_flag17h9a66ac8d043f6b9cE", scope: !203, file: !953, line: 181, type: !954, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !957)
!957 = !{!958}
!958 = !DITemplateTypeParameter(name: "impl fmt::Display", type: !36)
!959 = !{!960, !961, !963}
!960 = !DILocalVariable(name: "flag", arg: 1, scope: !952, file: !953, line: 181, type: !36)
!961 = !DILocalVariable(name: "_flag", scope: !962, file: !953, line: 182, type: !36, align: 8)
!962 = distinct !DILexicalBlock(scope: !952, file: !953, line: 182, column: 9)
!963 = !DILocalVariable(name: "got", scope: !964, file: !953, line: 184, type: !114, align: 1)
