; ModuleID = 'bootloader.b5fc60e9-cgu.0'
source_filename = "bootloader.b5fc60e9-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::mem::manually_drop::ManuallyDrop<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { %"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" }
%"core::mem::maybe_uninit::MaybeUninit<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { [3 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "50fcf4f4802876ccd2020600e6ab4f6")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "5b8e7a7277a940b9821cb824828069bc")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "b6935490e4793276c909ae4470277240")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "bcb347169890930790358f4e398b86c")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "682169dc9aab9d9830d3355b64461b91")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "cbeb207c526e867d954b6cc3781c88ca")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "b03c3bb75ca136e114d2a8d8e93fd6e5")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "ea6d7db7a7f5a0f03f08c00aaf1dc1f6")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "915a2500b15e099c728650e514e0a217")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "bb593dcd33e19f677da12837eccf743a")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "f55f2c781e0a45c54f43eb13170bf240")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "acda5d8b4554c44b890a93713de02d3b")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "ee5912f134b94a2515cc48d1eee005e3")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "184ea5feff67ba3cb05a7c6730c8c0d0")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 7, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.69.0-nightly (5b8f28453 2023-02-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !162, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/lib.rs/@/bootloader.b5fc60e9-cgu.0", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23")
!138 = !{!26, !139, !149, !156}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!140 = !DINamespace(name: "v1", scope: !141)
!141 = !DINamespace(name: "rt", scope: !142)
!142 = !DINamespace(name: "fmt", scope: !143)
!143 = !DINamespace(name: "core", scope: null)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !150, file: !2, baseType: !151, size: 8, align: 8, flags: DIFlagEnumClass, elements: !152)
!150 = !DINamespace(name: "cmp", scope: !143)
!151 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "Less", value: -1)
!154 = !DIEnumerator(name: "Equal", value: 0)
!155 = !DIEnumerator(name: "Greater", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !157, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !158)
!157 = !DINamespace(name: "panicking", scope: !143)
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!162 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!163 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17hab03da79861379f0E", scope: !165, file: !164, line: 373, type: !168, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !183)
!164 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "afd2e83bc7b2acdd8fe6c036dd45a95e")
!165 = !DINamespace(name: "{impl#4}", scope: !166)
!166 = !DINamespace(name: "index", scope: !167)
!167 = !DINamespace(name: "slice", scope: !143)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !175, !170}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !171, templateParams: !24, identifier: "34b58d530ba9c7c83b28599fa6619a2")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !176, file: !2, size: 128, align: 64, elements: !178, templateParams: !181, identifier: "6c5e034b2cb99fd7f6abc335931669bb")
!176 = !DINamespace(name: "range", scope: !177)
!177 = !DINamespace(name: "ops", scope: !143)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "Idx", type: !9)
!183 = !{!184, !185, !186}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !164, line: 373, type: !175)
!185 = !DILocalVariable(name: "slice", arg: 2, scope: !163, file: !164, line: 373, type: !170)
!186 = !DILocalVariable(name: "this", scope: !187, file: !164, line: 374, type: !175, align: 8)
!187 = distinct !DILexicalBlock(scope: !163, file: !164, line: 374, column: 9)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !13)
!190 = !DILocation(line: 373, column: 29, scope: !163)
!191 = !DILocation(line: 373, column: 35, scope: !163)
!192 = !DILocation(line: 374, column: 13, scope: !187)
!193 = !DILocation(line: 374, column: 20, scope: !163)
!194 = !DILocation(line: 381, column: 13, scope: !187)
!195 = !DILocalVariable(name: "this", arg: 1, scope: !196, file: !197, line: 2218, type: !175)
!196 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17h3238d887dd3bdeeeE", scope: !198, file: !197, line: 2218, type: !199, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !201)
!197 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "9636877b7f12d537541e2836c747da25")
!198 = !DINamespace(name: "get_unchecked", scope: !165)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !175, !170}
!201 = !{!195, !202}
!202 = !DILocalVariable(name: "slice", arg: 2, scope: !196, file: !197, line: 2218, type: !170)
!203 = !DILocation(line: 2218, column: 39, scope: !196, inlinedAt: !204)
!204 = distinct !DILocation(line: 381, column: 13, scope: !187)
!205 = !DILocation(line: 384, column: 17, scope: !206, inlinedAt: !204)
!206 = !DILexicalBlockFile(scope: !196, file: !164, discriminator: 0)
!207 = !DILocation(line: 384, column: 55, scope: !206, inlinedAt: !204)
!208 = !DILocation(line: 384, column: 43, scope: !206, inlinedAt: !204)
!209 = !DILocation(line: 2219, column: 20, scope: !196, inlinedAt: !204)
!210 = !{i8 0, i8 2}
!211 = !DILocation(line: 2221, column: 21, scope: !196, inlinedAt: !204)
!212 = !DILocation(line: 386, column: 39, scope: !187)
!213 = !DILocalVariable(name: "self", arg: 1, scope: !214, file: !215, line: 927, type: !221)
!214 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h88e59246fb87e768E", scope: !216, file: !215, line: 927, type: !219, scopeLine: 927, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !222)
!215 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6cb3aa868e58a15d57a0da081c28bf30")
!216 = !DINamespace(name: "{impl#0}", scope: !217)
!217 = !DINamespace(name: "const_ptr", scope: !218)
!218 = !DINamespace(name: "ptr", scope: !143)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !221, !9}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!222 = !{!213, !223}
!223 = !DILocalVariable(name: "count", arg: 2, scope: !214, file: !215, line: 927, type: !9)
!224 = !DILocation(line: 927, column: 29, scope: !214, inlinedAt: !225)
!225 = distinct !DILocation(line: 386, column: 39, scope: !187)
!226 = !DILocation(line: 927, column: 35, scope: !214, inlinedAt: !225)
!227 = !DILocalVariable(name: "self", arg: 1, scope: !228, file: !215, line: 468, type: !221)
!228 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17hcf34e4f0c46cfb85E", scope: !216, file: !215, line: 468, type: !229, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{!221, !221, !231}
!231 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!232 = !{!227, !233}
!233 = !DILocalVariable(name: "count", arg: 2, scope: !228, file: !215, line: 468, type: !231)
!234 = !DILocation(line: 468, column: 32, scope: !228, inlinedAt: !235)
!235 = distinct !DILocation(line: 932, column: 18, scope: !214, inlinedAt: !225)
!236 = !DILocation(line: 468, column: 38, scope: !228, inlinedAt: !235)
!237 = !DILocation(line: 473, column: 18, scope: !228, inlinedAt: !235)
!238 = !DILocation(line: 386, column: 71, scope: !187)
!239 = !DILocation(line: 386, column: 13, scope: !187)
!240 = !DILocation(line: 388, column: 6, scope: !163)
!241 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h0e983f1fc3aad9fbE", scope: !165, file: !164, line: 391, type: !242, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !248)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !175, !244}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !245, templateParams: !24, identifier: "929f04d0f74224aaee9e4628ee8f198")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !244, file: !2, baseType: !173, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !244, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !{!249, !250, !251}
!249 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !164, line: 391, type: !175)
!250 = !DILocalVariable(name: "slice", arg: 2, scope: !241, file: !164, line: 391, type: !244)
!251 = !DILocalVariable(name: "this", scope: !252, file: !164, line: 392, type: !175, align: 8)
!252 = distinct !DILexicalBlock(scope: !241, file: !164, line: 392, column: 9)
!253 = !DILocation(line: 391, column: 33, scope: !241)
!254 = !DILocation(line: 391, column: 39, scope: !241)
!255 = !DILocation(line: 392, column: 13, scope: !252)
!256 = !DILocation(line: 392, column: 20, scope: !241)
!257 = !DILocation(line: 395, column: 13, scope: !252)
!258 = !DILocalVariable(name: "this", arg: 1, scope: !259, file: !197, line: 2218, type: !175)
!259 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17h768ad12ded3f796eE", scope: !260, file: !197, line: 2218, type: !261, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !263)
!260 = !DINamespace(name: "get_unchecked_mut", scope: !165)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !175, !244}
!263 = !{!258, !264}
!264 = !DILocalVariable(name: "slice", arg: 2, scope: !259, file: !197, line: 2218, type: !244)
!265 = !DILocation(line: 2218, column: 39, scope: !259, inlinedAt: !266)
!266 = distinct !DILocation(line: 395, column: 13, scope: !252)
!267 = !DILocation(line: 398, column: 17, scope: !268, inlinedAt: !266)
!268 = !DILexicalBlockFile(scope: !259, file: !164, discriminator: 0)
!269 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !271, line: 1900, type: !244)
!270 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h0a4c74f2a60f13feE", scope: !272, file: !271, line: 1900, type: !274, scopeLine: 1900, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !276)
!271 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ae0dfef55d0b113ecf8d41d1efcd51f")
!272 = !DINamespace(name: "{impl#1}", scope: !273)
!273 = !DINamespace(name: "mut_ptr", scope: !218)
!274 = !DISubroutineType(types: !275)
!275 = !{!9, !244}
!276 = !{!269}
!277 = !DILocation(line: 1900, column: 22, scope: !270, inlinedAt: !278)
!278 = distinct !DILocation(line: 398, column: 55, scope: !268, inlinedAt: !266)
!279 = !DILocation(line: 1901, column: 9, scope: !270, inlinedAt: !278)
!280 = !DILocation(line: 398, column: 43, scope: !268, inlinedAt: !266)
!281 = !DILocation(line: 2219, column: 20, scope: !259, inlinedAt: !266)
!282 = !DILocation(line: 2221, column: 21, scope: !259, inlinedAt: !266)
!283 = !DILocalVariable(name: "self", arg: 1, scope: !284, file: !271, line: 2036, type: !244)
!284 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h1a9ea7dad533c628E", scope: !272, file: !271, line: 2036, type: !285, scopeLine: 2036, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !288)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !244}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !{!283}
!289 = !DILocation(line: 2036, column: 29, scope: !284, inlinedAt: !290)
!290 = distinct !DILocation(line: 400, column: 43, scope: !252)
!291 = !DILocalVariable(name: "self", arg: 1, scope: !292, file: !271, line: 1029, type: !287)
!292 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hfc790c7f74823a4aE", scope: !293, file: !271, line: 1029, type: !294, scopeLine: 1029, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !296)
!293 = !DINamespace(name: "{impl#0}", scope: !273)
!294 = !DISubroutineType(types: !295)
!295 = !{!287, !287, !9}
!296 = !{!291, !297}
!297 = !DILocalVariable(name: "count", arg: 2, scope: !292, file: !271, line: 1029, type: !9)
!298 = !DILocation(line: 1029, column: 29, scope: !292, inlinedAt: !299)
!299 = distinct !DILocation(line: 400, column: 43, scope: !252)
!300 = !DILocation(line: 1029, column: 35, scope: !292, inlinedAt: !299)
!301 = !DILocalVariable(name: "self", arg: 1, scope: !302, file: !271, line: 480, type: !287)
!302 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17hfb962a83fbf91ceaE", scope: !293, file: !271, line: 480, type: !303, scopeLine: 480, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !305)
!303 = !DISubroutineType(types: !304)
!304 = !{!287, !287, !231}
!305 = !{!301, !306}
!306 = !DILocalVariable(name: "count", arg: 2, scope: !302, file: !271, line: 480, type: !231)
!307 = !DILocation(line: 480, column: 32, scope: !302, inlinedAt: !308)
!308 = distinct !DILocation(line: 1034, column: 18, scope: !292, inlinedAt: !299)
!309 = !DILocation(line: 480, column: 38, scope: !302, inlinedAt: !308)
!310 = !DILocation(line: 487, column: 18, scope: !302, inlinedAt: !308)
!311 = !DILocation(line: 400, column: 79, scope: !252)
!312 = !DILocation(line: 400, column: 13, scope: !252)
!313 = !DILocation(line: 402, column: 6, scope: !241)
!314 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h0cb3025d8b848950E", scope: !165, file: !164, line: 405, type: !315, scopeLine: 405, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !334)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !175, !317, !321}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !318, templateParams: !24, identifier: "2b5f9ab4b8a834059f791c9ebb1a935e")
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !317, file: !2, baseType: !173, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !317, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !323, file: !2, size: 192, align: 64, elements: !325, templateParams: !24, identifier: "bba63b46120dd64776bc3bc3b13a6ca8")
!323 = !DINamespace(name: "location", scope: !324)
!324 = !DINamespace(name: "panic", scope: !143)
!325 = !{!326, !332, !333}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !322, file: !2, baseType: !327, size: 128, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !328, templateParams: !24, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !327, file: !2, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !327, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !322, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !322, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!334 = !{!335, !336}
!335 = !DILocalVariable(name: "self", arg: 1, scope: !314, file: !164, line: 405, type: !175)
!336 = !DILocalVariable(name: "slice", arg: 2, scope: !314, file: !164, line: 405, type: !317)
!337 = !DILocation(line: 405, column: 14, scope: !314)
!338 = !DILocation(line: 405, column: 20, scope: !314)
!339 = !DILocation(line: 406, column: 12, scope: !314)
!340 = !DILocation(line: 408, column: 19, scope: !314)
!341 = !DILocation(line: 407, column: 13, scope: !314)
!342 = !DILocation(line: 412, column: 20, scope: !314)
!343 = !DILocation(line: 413, column: 6, scope: !314)
!344 = !DILocation(line: 409, column: 13, scope: !314)
!345 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hd3f0c326d2e168baE", scope: !165, file: !164, line: 416, type: !346, scopeLine: 416, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !352)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !175, !348, !321}
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !349, templateParams: !24, identifier: "d422805865a5579711da0f66ac84fcef")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !348, file: !2, baseType: !173, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !348, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "self", arg: 1, scope: !345, file: !164, line: 416, type: !175)
!354 = !DILocalVariable(name: "slice", arg: 2, scope: !345, file: !164, line: 416, type: !348)
!355 = !DILocation(line: 416, column: 18, scope: !345)
!356 = !DILocation(line: 416, column: 24, scope: !345)
!357 = !DILocation(line: 417, column: 12, scope: !345)
!358 = !DILocation(line: 419, column: 19, scope: !345)
!359 = !DILocation(line: 418, column: 13, scope: !345)
!360 = !DILocation(line: 423, column: 24, scope: !345)
!361 = !DILocation(line: 424, column: 6, scope: !345)
!362 = !DILocation(line: 420, column: 13, scope: !345)
!363 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17he86c827a971faccbE", scope: !364, file: !164, line: 460, type: !365, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !370)
!364 = !DINamespace(name: "{impl#5}", scope: !166)
!365 = !DISubroutineType(types: !366)
!366 = !{!348, !367, !348, !321}
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !368, templateParams: !181, identifier: "b7e1b54aa9164b7a269202c1f0981f7a")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !367, file: !2, baseType: !9, size: 64, align: 64)
!370 = !{!371, !372}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !363, file: !164, line: 460, type: !367)
!372 = !DILocalVariable(name: "slice", arg: 2, scope: !363, file: !164, line: 460, type: !348)
!373 = !DILocation(line: 460, column: 18, scope: !363)
!374 = !DILocation(line: 460, column: 24, scope: !363)
!375 = !DILocation(line: 461, column: 9, scope: !363)
!376 = !DILocation(line: 462, column: 6, scope: !363)
!377 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h1f150b9d5dc91b37E", scope: !378, file: !164, line: 487, type: !379, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !384)
!378 = !DINamespace(name: "{impl#6}", scope: !166)
!379 = !DISubroutineType(types: !380)
!380 = !{!244, !381, !244}
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !382, templateParams: !181, identifier: "11aa38eac75d395d8df4674c172dd53")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !381, file: !2, baseType: !9, size: 64, align: 64)
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "self", arg: 1, scope: !377, file: !164, line: 487, type: !381)
!386 = !DILocalVariable(name: "slice", arg: 2, scope: !377, file: !164, line: 487, type: !244)
!387 = !DILocation(line: 487, column: 33, scope: !377)
!388 = !DILocation(line: 487, column: 39, scope: !377)
!389 = !DILocation(line: 1900, column: 22, scope: !270, inlinedAt: !390)
!390 = distinct !DILocation(line: 489, column: 31, scope: !377)
!391 = !DILocation(line: 1901, column: 9, scope: !270, inlinedAt: !390)
!392 = !DILocation(line: 489, column: 18, scope: !377)
!393 = !DILocation(line: 490, column: 6, scope: !377)
!394 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h41b75ed56b0f6775E", scope: !378, file: !164, line: 502, type: !395, scopeLine: 502, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!348, !381, !348, !321}
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "self", arg: 1, scope: !394, file: !164, line: 502, type: !381)
!399 = !DILocalVariable(name: "slice", arg: 2, scope: !394, file: !164, line: 502, type: !348)
!400 = !DILocation(line: 502, column: 18, scope: !394)
!401 = !DILocation(line: 502, column: 24, scope: !394)
!402 = !DILocation(line: 503, column: 12, scope: !394)
!403 = !DILocation(line: 507, column: 24, scope: !394)
!404 = !DILocation(line: 508, column: 6, scope: !394)
!405 = !DILocation(line: 504, column: 13, scope: !394)
!406 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4543de548036e0abE", scope: !408, file: !407, line: 2396, type: !409, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !467, retainedNodes: !464)
!407 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!408 = !DINamespace(name: "{impl#59}", scope: !142)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !429, !430}
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !412, file: !2, size: 8, align: 8, elements: !413, templateParams: !24, identifier: "439b0028cce69ada54f55b3e334b6ecd")
!412 = !DINamespace(name: "result", scope: !143)
!413 = !{!414}
!414 = !DICompositeType(tag: DW_TAG_variant_part, scope: !411, file: !2, size: 8, align: 8, elements: !415, templateParams: !24, identifier: "be95a66ec545b971daf5682acfef386a", discriminator: !428)
!415 = !{!416, !424}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !414, file: !2, baseType: !417, size: 8, align: 8, extraData: i64 0)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !411, file: !2, size: 8, align: 8, elements: !418, templateParams: !420, identifier: "970917c63ec9d7b58016c128bd3204c")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !2, baseType: !7, align: 8, offset: 8)
!420 = !{!421, !422}
!421 = !DITemplateTypeParameter(name: "T", type: !7)
!422 = !DITemplateTypeParameter(name: "E", type: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !142, file: !2, align: 8, elements: !24, identifier: "ba7ee7bf0217687128c0134bf159d064")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !414, file: !2, baseType: !425, size: 8, align: 8, extraData: i64 1)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !411, file: !2, size: 8, align: 8, elements: !426, templateParams: !420, identifier: "277298c56e69e6ae4141f3824479ae34")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !2, baseType: !423, align: 8, offset: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !411, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !431, size: 64, align: 64, dwarfAddressSpace: 0)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !142, file: !2, size: 512, align: 64, elements: !432, templateParams: !24, identifier: "a90501ff6e2f2af5c6a6372291169d97")
!432 = !{!433, !434, !436, !437, !452, !453}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !431, file: !2, baseType: !435, size: 32, align: 32, offset: 416)
!435 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !431, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !431, file: !2, baseType: !438, size: 128, align: 64, offset: 128)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !439, file: !2, size: 128, align: 64, elements: !440, templateParams: !24, identifier: "a061711948cade3933e2c15b599cef32")
!439 = !DINamespace(name: "option", scope: !143)
!440 = !{!441}
!441 = !DICompositeType(tag: DW_TAG_variant_part, scope: !438, file: !2, size: 128, align: 64, elements: !442, templateParams: !24, identifier: "a12832ba19fc53c9fdb0c372f0b3354e", discriminator: !451)
!442 = !{!443, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !441, file: !2, baseType: !444, size: 128, align: 64, extraData: i64 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !438, file: !2, size: 128, align: 64, elements: !24, templateParams: !445, identifier: "c3705e48f19ae18cdc2a5519f6e6f5cb")
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !9)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !441, file: !2, baseType: !448, size: 128, align: 64, extraData: i64 1)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !438, file: !2, size: 128, align: 64, elements: !449, templateParams: !445, identifier: "be8b31308e3e31c866943c8d7b3fd52a")
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !448, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !438, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !431, file: !2, baseType: !438, size: 128, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !431, file: !2, baseType: !454, size: 128, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !455, templateParams: !24, identifier: "a3f442e004e09e017868002c1c14e7e3")
!455 = !{!456, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !454, file: !2, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "fad07e960ab186f2781ffe1a5cde3e23")
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !454, file: !2, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !461, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 3, lowerBound: 0)
!464 = !{!465, !466}
!465 = !DILocalVariable(name: "self", arg: 1, scope: !406, file: !407, line: 2396, type: !429)
!466 = !DILocalVariable(name: "f", arg: 2, scope: !406, file: !407, line: 2396, type: !430)
!467 = !{!468}
!468 = !DITemplateTypeParameter(name: "T", type: !26)
!469 = !DILocation(line: 2396, column: 20, scope: !406)
!470 = !DILocation(line: 2396, column: 27, scope: !406)
!471 = !DILocation(line: 2396, column: 71, scope: !406)
!472 = !{i64 4}
!473 = !DILocation(line: 2396, column: 62, scope: !406)
!474 = !DILocation(line: 2396, column: 84, scope: !406)
!475 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hed44b9bd8ee3dbdeE", scope: !408, file: !407, line: 2396, type: !476, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !479)
!476 = !DISubroutineType(types: !477)
!477 = !{!411, !478, !430}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!479 = !{!480, !481}
!480 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !407, line: 2396, type: !478)
!481 = !DILocalVariable(name: "f", arg: 2, scope: !475, file: !407, line: 2396, type: !430)
!482 = !DILocation(line: 2396, column: 20, scope: !475)
!483 = !DILocation(line: 2396, column: 27, scope: !475)
!484 = !DILocation(line: 2396, column: 71, scope: !475)
!485 = !{i64 8}
!486 = !DILocation(line: 2396, column: 62, scope: !475)
!487 = !DILocation(line: 2396, column: 84, scope: !475)
!488 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h67a70de23783f4c9E", scope: !489, file: !197, line: 2253, type: !490, scopeLine: 2253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !493)
!489 = !DINamespace(name: "intrinsics", scope: !143)
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !221, !221, !9}
!492 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!493 = !{!494, !495, !496, !497, !499, !501, !503}
!494 = !DILocalVariable(name: "src", arg: 1, scope: !488, file: !197, line: 2253, type: !221)
!495 = !DILocalVariable(name: "dst", arg: 2, scope: !488, file: !197, line: 2253, type: !221)
!496 = !DILocalVariable(name: "count", arg: 3, scope: !488, file: !197, line: 2253, type: !9)
!497 = !DILocalVariable(name: "src_usize", scope: !498, file: !197, line: 2254, type: !9, align: 8)
!498 = distinct !DILexicalBlock(scope: !488, file: !197, line: 2254, column: 5)
!499 = !DILocalVariable(name: "dst_usize", scope: !500, file: !197, line: 2255, type: !9, align: 8)
!500 = distinct !DILexicalBlock(scope: !498, file: !197, line: 2255, column: 5)
!501 = !DILocalVariable(name: "size", scope: !502, file: !197, line: 2256, type: !9, align: 8)
!502 = distinct !DILexicalBlock(scope: !500, file: !197, line: 2256, column: 5)
!503 = !DILocalVariable(name: "diff", scope: !504, file: !197, line: 2257, type: !9, align: 8)
!504 = distinct !DILexicalBlock(scope: !502, file: !197, line: 2257, column: 5)
!505 = !DILocation(line: 2253, column: 36, scope: !488)
!506 = !DILocation(line: 2253, column: 51, scope: !488)
!507 = !DILocation(line: 2253, column: 66, scope: !488)
!508 = !DILocation(line: 2257, column: 9, scope: !504)
!509 = !DILocalVariable(name: "self", arg: 1, scope: !510, file: !215, line: 205, type: !221)
!510 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h3702b13764ca4b67E", scope: !216, file: !215, line: 205, type: !511, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!9, !221}
!513 = !{!509}
!514 = !DILocation(line: 205, column: 17, scope: !510, inlinedAt: !515)
!515 = distinct !DILocation(line: 2254, column: 21, scope: !488)
!516 = !DILocalVariable(name: "self", arg: 1, scope: !517, file: !215, line: 60, type: !221)
!517 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h14509cc7e7792a7eE", scope: !216, file: !215, line: 60, type: !518, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !521, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!6, !221}
!520 = !{!516}
!521 = !{!189, !522}
!522 = !DITemplateTypeParameter(name: "U", type: !7)
!523 = !DILocation(line: 60, column: 26, scope: !517, inlinedAt: !524)
!524 = distinct !DILocation(line: 209, column: 33, scope: !510, inlinedAt: !515)
!525 = !DILocation(line: 209, column: 18, scope: !510, inlinedAt: !515)
!526 = !DILocation(line: 2254, column: 21, scope: !488)
!527 = !DILocation(line: 2254, column: 9, scope: !498)
!528 = !DILocation(line: 205, column: 17, scope: !510, inlinedAt: !529)
!529 = distinct !DILocation(line: 2255, column: 21, scope: !498)
!530 = !DILocation(line: 60, column: 26, scope: !517, inlinedAt: !531)
!531 = distinct !DILocation(line: 209, column: 33, scope: !510, inlinedAt: !529)
!532 = !DILocation(line: 209, column: 18, scope: !510, inlinedAt: !529)
!533 = !DILocation(line: 2255, column: 21, scope: !498)
!534 = !DILocation(line: 2255, column: 9, scope: !500)
!535 = !DILocation(line: 2256, column: 16, scope: !500)
!536 = !DILocation(line: 2256, column: 9, scope: !502)
!537 = !DILocation(line: 2257, column: 19, scope: !502)
!538 = !DILocation(line: 2257, column: 74, scope: !502)
!539 = !DILocation(line: 2257, column: 43, scope: !502)
!540 = !DILocation(line: 2257, column: 16, scope: !502)
!541 = !DILocation(line: 2260, column: 5, scope: !504)
!542 = !DILocation(line: 2261, column: 2, scope: !488)
!543 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h9ead4453d546b160E", scope: !489, file: !197, line: 2353, type: !544, scopeLine: 2353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !445, retainedNodes: !548)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546, !547, !9}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!548 = !{!549, !550, !551}
!549 = !DILocalVariable(name: "src", arg: 1, scope: !543, file: !197, line: 2353, type: !546)
!550 = !DILocalVariable(name: "dst", arg: 2, scope: !543, file: !197, line: 2353, type: !547)
!551 = !DILocalVariable(name: "count", arg: 3, scope: !543, file: !197, line: 2353, type: !9)
!552 = !DILocation(line: 2353, column: 44, scope: !543)
!553 = !DILocation(line: 2353, column: 59, scope: !543)
!554 = !DILocation(line: 2353, column: 72, scope: !543)
!555 = !DILocation(line: 2362, column: 9, scope: !543)
!556 = !DILocalVariable(name: "src", arg: 1, scope: !557, file: !197, line: 2218, type: !546)
!557 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h2a6a5684b595de1cE", scope: !558, file: !197, line: 2218, type: !544, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !445, retainedNodes: !559)
!558 = !DINamespace(name: "copy_nonoverlapping", scope: !489)
!559 = !{!556, !560, !561}
!560 = !DILocalVariable(name: "dst", arg: 2, scope: !557, file: !197, line: 2218, type: !547)
!561 = !DILocalVariable(name: "count", arg: 3, scope: !557, file: !197, line: 2218, type: !9)
!562 = !DILocation(line: 2218, column: 39, scope: !557, inlinedAt: !563)
!563 = distinct !DILocation(line: 2362, column: 9, scope: !543)
!564 = !DILocation(line: 2366, column: 13, scope: !557, inlinedAt: !563)
!565 = !DILocation(line: 2367, column: 20, scope: !557, inlinedAt: !563)
!566 = !DILocation(line: 2368, column: 20, scope: !557, inlinedAt: !563)
!567 = !DILocation(line: 2219, column: 20, scope: !557, inlinedAt: !563)
!568 = !DILocation(line: 2221, column: 21, scope: !557, inlinedAt: !563)
!569 = !DILocation(line: 2370, column: 9, scope: !543)
!570 = !DILocation(line: 2372, column: 2, scope: !543)
!571 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17he223bf532b273cfaE", scope: !489, file: !197, line: 2353, type: !572, scopeLine: 2353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !221, !287, !9}
!574 = !{!575, !576, !577}
!575 = !DILocalVariable(name: "src", arg: 1, scope: !571, file: !197, line: 2353, type: !221)
!576 = !DILocalVariable(name: "dst", arg: 2, scope: !571, file: !197, line: 2353, type: !287)
!577 = !DILocalVariable(name: "count", arg: 3, scope: !571, file: !197, line: 2353, type: !9)
!578 = !DILocation(line: 2353, column: 44, scope: !571)
!579 = !DILocation(line: 2353, column: 59, scope: !571)
!580 = !DILocation(line: 2353, column: 72, scope: !571)
!581 = !DILocation(line: 2362, column: 9, scope: !571)
!582 = !DILocalVariable(name: "src", arg: 1, scope: !583, file: !197, line: 2218, type: !221)
!583 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h334f7888b614e832E", scope: !558, file: !197, line: 2218, type: !572, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !584)
!584 = !{!582, !585, !586}
!585 = !DILocalVariable(name: "dst", arg: 2, scope: !583, file: !197, line: 2218, type: !287)
!586 = !DILocalVariable(name: "count", arg: 3, scope: !583, file: !197, line: 2218, type: !9)
!587 = !DILocation(line: 2218, column: 39, scope: !583, inlinedAt: !588)
!588 = distinct !DILocation(line: 2362, column: 9, scope: !571)
!589 = !DILocation(line: 2366, column: 13, scope: !583, inlinedAt: !588)
!590 = !DILocation(line: 2367, column: 20, scope: !583, inlinedAt: !588)
!591 = !DILocation(line: 2368, column: 20, scope: !583, inlinedAt: !588)
!592 = !DILocation(line: 2219, column: 20, scope: !583, inlinedAt: !588)
!593 = !DILocation(line: 2221, column: 21, scope: !583, inlinedAt: !588)
!594 = !DILocation(line: 2370, column: 9, scope: !571)
!595 = !DILocation(line: 2372, column: 2, scope: !571)
!596 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h6d98e974457e292fE", scope: !489, file: !197, line: 2237, type: !597, scopeLine: 2237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!492, !221}
!599 = !{!600}
!600 = !DILocalVariable(name: "ptr", arg: 1, scope: !596, file: !197, line: 2237, type: !221)
!601 = !DILocation(line: 2237, column: 42, scope: !596)
!602 = !DILocation(line: 2238, column: 6, scope: !596)
!603 = !DILocation(line: 2238, column: 5, scope: !596)
!604 = !DILocation(line: 2238, column: 23, scope: !596)
!605 = !DILocation(line: 2239, column: 2, scope: !596)
!606 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17he9a8a4309f67475aE", scope: !489, file: !197, line: 2237, type: !607, scopeLine: 2237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !622, retainedNodes: !620)
!607 = !DISubroutineType(types: !608)
!608 = !{!492, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !610, size: 64, align: 64, dwarfAddressSpace: 0)
!610 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !611, file: !2, size: 192, align: 64, elements: !613, templateParams: !188, identifier: "5808f83fd3bda603187add001caa4c87")
!611 = !DINamespace(name: "maybe_uninit", scope: !612)
!612 = !DINamespace(name: "mem", scope: !143)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !610, file: !2, baseType: !7, align: 8)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !2, baseType: !616, size: 192, align: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !617, file: !2, size: 192, align: 64, elements: !618, templateParams: !188, identifier: "c1abe23777885e7bdf244798ee0b1245")
!617 = !DINamespace(name: "manually_drop", scope: !612)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !616, file: !2, baseType: !13, size: 192, align: 64)
!620 = !{!621}
!621 = !DILocalVariable(name: "ptr", arg: 1, scope: !606, file: !197, line: 2237, type: !609)
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "T", type: !610)
!624 = !DILocation(line: 2237, column: 42, scope: !606)
!625 = !DILocation(line: 2238, column: 6, scope: !606)
!626 = !DILocation(line: 2238, column: 5, scope: !606)
!627 = !DILocation(line: 2238, column: 23, scope: !606)
!628 = !DILocation(line: 2239, column: 2, scope: !606)
!629 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17h85946175719219c1E", scope: !489, file: !197, line: 2243, type: !630, scopeLine: 2243, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!492, !9}
!632 = !{!633, !634}
!633 = !DILocalVariable(name: "len", arg: 1, scope: !629, file: !197, line: 2243, type: !9)
!634 = !DILocalVariable(name: "max_len", scope: !635, file: !197, line: 2244, type: !9, align: 8)
!635 = distinct !DILexicalBlock(scope: !629, file: !197, line: 2244, column: 5)
!636 = !DILocation(line: 2243, column: 43, scope: !629)
!637 = !DILocation(line: 2244, column: 19, scope: !629)
!638 = !DILocation(line: 2244, column: 9, scope: !635)
!639 = !DILocation(line: 2248, column: 5, scope: !635)
!640 = !DILocation(line: 2249, column: 2, scope: !629)
!641 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17h1991c7115bfb052dE", scope: !489, file: !197, line: 2443, type: !572, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !642)
!642 = !{!643, !644, !645}
!643 = !DILocalVariable(name: "src", arg: 1, scope: !641, file: !197, line: 2443, type: !221)
!644 = !DILocalVariable(name: "dst", arg: 2, scope: !641, file: !197, line: 2443, type: !287)
!645 = !DILocalVariable(name: "count", arg: 3, scope: !641, file: !197, line: 2443, type: !9)
!646 = !DILocation(line: 2443, column: 29, scope: !641)
!647 = !DILocation(line: 2443, column: 44, scope: !641)
!648 = !DILocation(line: 2443, column: 57, scope: !641)
!649 = !DILocation(line: 2451, column: 9, scope: !641)
!650 = !DILocalVariable(name: "src", arg: 1, scope: !651, file: !197, line: 2218, type: !221)
!651 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17hc51c423a0f6b78b0E", scope: !652, file: !197, line: 2218, type: !653, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !655)
!652 = !DINamespace(name: "copy", scope: !489)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !221, !287}
!655 = !{!650, !656}
!656 = !DILocalVariable(name: "dst", arg: 2, scope: !651, file: !197, line: 2218, type: !287)
!657 = !DILocation(line: 2218, column: 39, scope: !651, inlinedAt: !658)
!658 = distinct !DILocation(line: 2451, column: 9, scope: !641)
!659 = !DILocation(line: 2454, column: 13, scope: !651, inlinedAt: !658)
!660 = !DILocation(line: 2454, column: 45, scope: !651, inlinedAt: !658)
!661 = !DILocation(line: 2219, column: 20, scope: !651, inlinedAt: !658)
!662 = !DILocation(line: 2221, column: 21, scope: !651, inlinedAt: !658)
!663 = !DILocation(line: 2456, column: 9, scope: !641)
!664 = !DILocation(line: 2458, column: 2, scope: !641)
!665 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h80e229bb7edd8b1cE", scope: !489, file: !197, line: 2443, type: !544, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !445, retainedNodes: !666)
!666 = !{!667, !668, !669}
!667 = !DILocalVariable(name: "src", arg: 1, scope: !665, file: !197, line: 2443, type: !546)
!668 = !DILocalVariable(name: "dst", arg: 2, scope: !665, file: !197, line: 2443, type: !547)
!669 = !DILocalVariable(name: "count", arg: 3, scope: !665, file: !197, line: 2443, type: !9)
!670 = !DILocation(line: 2443, column: 29, scope: !665)
!671 = !DILocation(line: 2443, column: 44, scope: !665)
!672 = !DILocation(line: 2443, column: 57, scope: !665)
!673 = !DILocation(line: 2451, column: 9, scope: !665)
!674 = !DILocalVariable(name: "src", arg: 1, scope: !675, file: !197, line: 2218, type: !546)
!675 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17h5bbf02e52fc312f9E", scope: !652, file: !197, line: 2218, type: !676, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !445, retainedNodes: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !546, !547}
!678 = !{!674, !679}
!679 = !DILocalVariable(name: "dst", arg: 2, scope: !675, file: !197, line: 2218, type: !547)
!680 = !DILocation(line: 2218, column: 39, scope: !675, inlinedAt: !681)
!681 = distinct !DILocation(line: 2451, column: 9, scope: !665)
!682 = !DILocation(line: 2454, column: 13, scope: !675, inlinedAt: !681)
!683 = !DILocation(line: 2454, column: 45, scope: !675, inlinedAt: !681)
!684 = !DILocation(line: 2219, column: 20, scope: !675, inlinedAt: !681)
!685 = !DILocation(line: 2221, column: 21, scope: !675, inlinedAt: !681)
!686 = !DILocation(line: 2456, column: 9, scope: !665)
!687 = !DILocation(line: 2458, column: 2, scope: !665)
!688 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17h7c7142be27ed0ddeE", scope: !690, file: !689, line: 1409, type: !692, scopeLine: 1409, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !694)
!689 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "cb5406da3ed1af32df9b51a7db30ff71")
!690 = !DINamespace(name: "{impl#63}", scope: !691)
!691 = !DINamespace(name: "impls", scope: !150)
!692 = !DISubroutineType(types: !693)
!693 = !{!149, !132, !132}
!694 = !{!695, !696}
!695 = !DILocalVariable(name: "self", arg: 1, scope: !688, file: !689, line: 1409, type: !132)
!696 = !DILocalVariable(name: "other", arg: 2, scope: !688, file: !689, line: 1409, type: !132)
!697 = !DILocation(line: 1409, column: 24, scope: !688)
!698 = !DILocation(line: 1409, column: 31, scope: !688)
!699 = !DILocation(line: 1412, column: 24, scope: !688)
!700 = !DILocation(line: 1412, column: 32, scope: !688)
!701 = !DILocation(line: 1413, column: 29, scope: !688)
!702 = !DILocation(line: 1413, column: 38, scope: !688)
!703 = !DILocation(line: 1412, column: 41, scope: !688)
!704 = !DILocation(line: 1412, column: 21, scope: !688)
!705 = !DILocation(line: 1415, column: 18, scope: !688)
!706 = !{i8 -1, i8 2}
!707 = !DILocation(line: 1414, column: 28, scope: !688)
!708 = !DILocation(line: 1413, column: 26, scope: !688)
!709 = !DILocation(line: 1413, column: 47, scope: !688)
!710 = distinct !DISubprogram(name: "new_lower_hex<u64>", linkageName: "_ZN4core3fmt10ArgumentV113new_lower_hex17h97e11d00abe93197E", scope: !711, file: !407, line: 329, type: !721, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !725, retainedNodes: !723)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !142, file: !2, size: 128, align: 64, elements: !712, templateParams: !24, identifier: "71f0688e928e59cfa8d2e89ebf7ebc37")
!712 = !{!713, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !711, file: !2, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !715, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !716, file: !2, align: 8, elements: !24, identifier: "8ad1d27c01883c0662373925bfb88afd")
!716 = !DINamespace(name: "{extern#0}", scope: !142)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !711, file: !2, baseType: !718, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !719, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!411, !714, !430}
!721 = !DISubroutineType(types: !722)
!722 = !{!711, !132}
!723 = !{!724}
!724 = !DILocalVariable(name: "x", arg: 1, scope: !710, file: !407, line: 329, type: !132)
!725 = !{!726}
!726 = !DITemplateTypeParameter(name: "T", type: !22)
!727 = !DILocation(line: 329, column: 30, scope: !710)
!728 = !DILocation(line: 330, column: 13, scope: !710)
!729 = !DILocation(line: 331, column: 10, scope: !710)
!730 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf78279371511cc61E", scope: !732, file: !731, line: 185, type: !734, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !736)
!731 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!732 = !DINamespace(name: "{impl#86}", scope: !733)
!733 = !DINamespace(name: "num", scope: !142)
!734 = !DISubroutineType(types: !735)
!735 = !{!411, !85, !430}
!736 = !{!737, !738}
!737 = !DILocalVariable(name: "self", arg: 1, scope: !730, file: !731, line: 185, type: !85)
!738 = !DILocalVariable(name: "f", arg: 2, scope: !730, file: !731, line: 185, type: !430)
!739 = !DILocation(line: 185, column: 20, scope: !730)
!740 = !DILocation(line: 185, column: 27, scope: !730)
!741 = !DILocation(line: 186, column: 20, scope: !730)
!742 = !DILocation(line: 188, column: 27, scope: !730)
!743 = !DILocation(line: 187, column: 21, scope: !730)
!744 = !DILocation(line: 193, column: 14, scope: !730)
!745 = !DILocation(line: 191, column: 21, scope: !730)
!746 = !DILocation(line: 189, column: 21, scope: !730)
!747 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17h0d3cb66510b449e7E", scope: !748, file: !731, line: 185, type: !749, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !751)
!748 = !DINamespace(name: "{impl#87}", scope: !733)
!749 = !DISubroutineType(types: !750)
!750 = !{!411, !132, !430}
!751 = !{!752, !753}
!752 = !DILocalVariable(name: "self", arg: 1, scope: !747, file: !731, line: 185, type: !132)
!753 = !DILocalVariable(name: "f", arg: 2, scope: !747, file: !731, line: 185, type: !430)
!754 = !DILocation(line: 185, column: 20, scope: !747)
!755 = !DILocation(line: 185, column: 27, scope: !747)
!756 = !DILocation(line: 186, column: 20, scope: !747)
!757 = !DILocation(line: 188, column: 27, scope: !747)
!758 = !DILocation(line: 187, column: 21, scope: !747)
!759 = !DILocation(line: 193, column: 14, scope: !747)
!760 = !DILocation(line: 191, column: 21, scope: !747)
!761 = !DILocation(line: 189, column: 21, scope: !747)
!762 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h56f7e9ea079df9daE", scope: !764, file: !763, line: 627, type: !773, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !797, retainedNodes: !790)
!763 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a909d1cde985fb0d953605fd1b0e0e2")
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !765, file: !2, size: 128, align: 64, elements: !766, templateParams: !24, identifier: "fb919eefa8e2183a117071eb3076d93f")
!765 = !DINamespace(name: "builders", scope: !142)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !764, file: !2, baseType: !768, size: 128, align: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !765, file: !2, size: 128, align: 64, elements: !769, templateParams: !24, identifier: "71f0f21112627938dadddd482e720046")
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !768, file: !2, baseType: !430, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !768, file: !2, baseType: !411, size: 8, align: 8, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !768, file: !2, baseType: !492, size: 8, align: 8, offset: 72)
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !775, !776}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !764, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !777, file: !2, size: 128, align: 64, elements: !778, templateParams: !188, identifier: "f795d040a45157bd8fe6165e1bee")
!777 = !DINamespace(name: "iter", scope: !167)
!778 = !{!779, !784, !785}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !776, file: !2, baseType: !780, size: 64, align: 64, offset: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !781, file: !2, size: 64, align: 64, elements: !782, templateParams: !188, identifier: "69535ff36fedd3d997f624f726222ee2")
!781 = !DINamespace(name: "non_null", scope: !218)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !780, file: !2, baseType: !221, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !776, file: !2, baseType: !221, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !776, file: !2, baseType: !786, align: 8)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !787, file: !2, align: 8, elements: !24, templateParams: !788, identifier: "c0bc50f94b4a2afffc8d458126ba3efc")
!787 = !DINamespace(name: "marker", scope: !143)
!788 = !{!789}
!789 = !DITemplateTypeParameter(name: "T", type: !12)
!790 = !{!791, !792, !793, !795}
!791 = !DILocalVariable(name: "self", arg: 1, scope: !762, file: !763, line: 627, type: !775)
!792 = !DILocalVariable(name: "entries", arg: 2, scope: !762, file: !763, line: 627, type: !776)
!793 = !DILocalVariable(name: "iter", scope: !794, file: !763, line: 632, type: !776, align: 8)
!794 = distinct !DILexicalBlock(scope: !762, file: !763, line: 632, column: 9)
!795 = !DILocalVariable(name: "entry", scope: !796, file: !763, line: 632, type: !12, align: 8)
!796 = distinct !DILexicalBlock(scope: !794, file: !763, line: 632, column: 30)
!797 = !{!798, !799}
!798 = !DITemplateTypeParameter(name: "D", type: !12)
!799 = !DITemplateTypeParameter(name: "I", type: !776)
!800 = !DILocation(line: 627, column: 26, scope: !762)
!801 = !DILocation(line: 627, column: 37, scope: !762)
!802 = !DILocation(line: 632, column: 22, scope: !794)
!803 = !DILocation(line: 632, column: 13, scope: !796)
!804 = !DILocation(line: 632, column: 22, scope: !762)
!805 = !DILocation(line: 632, column: 9, scope: !794)
!806 = !DILocation(line: 636, column: 6, scope: !762)
!807 = !DILocation(line: 632, column: 13, scope: !794)
!808 = !DILocation(line: 633, column: 13, scope: !796)
!809 = !DILocation(line: 634, column: 9, scope: !794)
!810 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h858bc03e28592ca2E", scope: !811, file: !407, line: 421, type: !870, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !875)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !142, file: !2, size: 384, align: 64, elements: !812, templateParams: !24, identifier: "aa4495e11001eeb7a8dec7abda538011")
!812 = !{!813, !819, !864}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !811, file: !2, baseType: !814, size: 128, align: 64, offset: 128)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !815, templateParams: !24, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!815 = !{!816, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !814, file: !2, baseType: !817, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !814, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !811, file: !2, baseType: !820, size: 128, align: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !439, file: !2, size: 128, align: 64, elements: !821, templateParams: !24, identifier: "f20f93edc9b6759569bd27834bca2867")
!821 = !{!822}
!822 = !DICompositeType(tag: DW_TAG_variant_part, scope: !820, file: !2, size: 128, align: 64, elements: !823, templateParams: !24, identifier: "4c2bc57bba010026e96c6b272990e455", discriminator: !863)
!823 = !{!824, !859}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !822, file: !2, baseType: !825, size: 128, align: 64, extraData: i64 0)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !820, file: !2, size: 128, align: 64, elements: !24, templateParams: !826, identifier: "b03d968f2fa497fccf294fb725789344")
!826 = !{!827}
!827 = !DITemplateTypeParameter(name: "T", type: !828)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !829, templateParams: !24, identifier: "fbc7473a1424cb3193ffa7a7ee24653a")
!829 = !{!830, !858}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !828, file: !2, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64, dwarfAddressSpace: 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 448, align: 64, elements: !833, templateParams: !24, identifier: "5baa9876693e95e5feb1bff2f29eab42")
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !832, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !832, file: !2, baseType: !836, size: 384, align: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !140, file: !2, size: 384, align: 64, elements: !837, templateParams: !24, identifier: "af655e92005115efb855d950904d628d")
!837 = !{!838, !839, !840, !841, !857}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !836, file: !2, baseType: !435, size: 32, align: 32, offset: 288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !836, file: !2, baseType: !139, size: 8, align: 8, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !2, baseType: !27, size: 32, align: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !836, file: !2, baseType: !842, size: 128, align: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !843, templateParams: !24, identifier: "bb4b398e5f72abfe68675895ae5e57c7")
!843 = !{!844}
!844 = !DICompositeType(tag: DW_TAG_variant_part, scope: !842, file: !2, size: 128, align: 64, elements: !845, templateParams: !24, identifier: "9d0217852ba0cec4f3ca8286384a753f", discriminator: !856)
!845 = !{!846, !850, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !844, file: !2, baseType: !847, size: 128, align: 64, extraData: i64 0)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !842, file: !2, size: 128, align: 64, elements: !848, templateParams: !24, identifier: "1bffdda99d4ba93b3632eb9b10e0d6c2")
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !847, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !844, file: !2, baseType: !851, size: 128, align: 64, extraData: i64 1)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !842, file: !2, size: 128, align: 64, elements: !852, templateParams: !24, identifier: "93a126390616414615f290788924acea")
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !851, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !844, file: !2, baseType: !855, size: 128, align: 64, extraData: i64 2)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !842, file: !2, size: 128, align: 64, elements: !24, identifier: "bee9d1aff1e2e0def3297d379f780bc3")
!856 = !DIDerivedType(tag: DW_TAG_member, scope: !842, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !836, file: !2, baseType: !842, size: 128, align: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !828, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !822, file: !2, baseType: !860, size: 128, align: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !820, file: !2, size: 128, align: 64, elements: !861, templateParams: !826, identifier: "76c5d43fc2261c18f3f3f9fcdeb1ea19")
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !860, file: !2, baseType: !828, size: 128, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, scope: !820, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !811, file: !2, baseType: !865, size: 128, align: 64, offset: 256)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !866, templateParams: !24, identifier: "7fd253a118f8ffbba43d5247c666a8bb")
!866 = !{!867, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !865, file: !2, baseType: !868, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64, dwarfAddressSpace: 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !865, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!811, !814, !865, !828, !872}
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !142, file: !2, align: 8, elements: !873, templateParams: !24, identifier: "48d3faea63f21d23fea6805f3d697a9e")
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !872, file: !2, baseType: !7, align: 8)
!875 = !{!876, !877, !878, !879}
!876 = !DILocalVariable(name: "pieces", arg: 1, scope: !810, file: !407, line: 422, type: !814)
!877 = !DILocalVariable(name: "args", arg: 2, scope: !810, file: !407, line: 423, type: !865)
!878 = !DILocalVariable(name: "fmt", arg: 3, scope: !810, file: !407, line: 424, type: !828)
!879 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !810, file: !407, line: 425, type: !872)
!880 = !DILocation(line: 422, column: 9, scope: !810)
!881 = !DILocation(line: 423, column: 9, scope: !810)
!882 = !DILocation(line: 424, column: 9, scope: !810)
!883 = !DILocation(line: 425, column: 9, scope: !810)
!884 = !DILocation(line: 427, column: 34, scope: !810)
!885 = !DILocation(line: 427, column: 9, scope: !810)
!886 = !DILocation(line: 428, column: 6, scope: !810)
!887 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h8f458a1f5ca8d89bE", scope: !811, file: !407, line: 401, type: !888, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{!811, !814, !865}
!890 = !{!891, !892}
!891 = !DILocalVariable(name: "pieces", arg: 1, scope: !887, file: !407, line: 401, type: !814)
!892 = !DILocalVariable(name: "args", arg: 2, scope: !887, file: !407, line: 401, type: !865)
!893 = !DILocation(line: 401, column: 25, scope: !887)
!894 = !DILocation(line: 401, column: 53, scope: !887)
!895 = !DILocation(line: 402, column: 12, scope: !887)
!896 = !DILocation(line: 402, column: 56, scope: !887)
!897 = !DILocation(line: 402, column: 41, scope: !887)
!898 = !DILocation(line: 405, column: 34, scope: !887)
!899 = !DILocation(line: 405, column: 9, scope: !887)
!900 = !DILocation(line: 406, column: 6, scope: !887)
!901 = !DILocation(line: 403, column: 13, scope: !887)
!902 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17h6dee9e3aa4b71bd1E", scope: !612, file: !903, line: 756, type: !904, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !622, retainedNodes: !907)
!903 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2818803a2f5479a3883c65b3bb9963fd")
!904 = !DISubroutineType(types: !905)
!905 = !{null, !906, !906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !610, size: 64, align: 64, dwarfAddressSpace: 0)
!907 = !{!908, !909, !910, !912}
!908 = !DILocalVariable(name: "x", arg: 1, scope: !902, file: !903, line: 756, type: !906)
!909 = !DILocalVariable(name: "y", arg: 2, scope: !902, file: !903, line: 756, type: !906)
!910 = !DILocalVariable(name: "a", scope: !911, file: !903, line: 773, type: !610, align: 8)
!911 = distinct !DILexicalBlock(scope: !902, file: !903, line: 773, column: 9)
!912 = !DILocalVariable(name: "b", scope: !913, file: !903, line: 774, type: !610, align: 8)
!913 = distinct !DILexicalBlock(scope: !911, file: !903, line: 774, column: 9)
!914 = !DILocation(line: 756, column: 36, scope: !902)
!915 = !DILocation(line: 756, column: 47, scope: !902)
!916 = !DILocation(line: 773, column: 13, scope: !911)
!917 = !DILocation(line: 774, column: 13, scope: !913)
!918 = !DILocation(line: 773, column: 17, scope: !902)
!919 = !DILocation(line: 774, column: 17, scope: !911)
!920 = !DILocation(line: 775, column: 23, scope: !913)
!921 = !DILocation(line: 775, column: 9, scope: !913)
!922 = !DILocation(line: 776, column: 23, scope: !913)
!923 = !DILocation(line: 776, column: 9, scope: !913)
!924 = !DILocation(line: 778, column: 2, scope: !902)
!925 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17heac569bdee2dd6ebE", scope: !612, file: !903, line: 756, type: !926, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !929)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !928, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!929 = !{!930, !931, !932, !934}
!930 = !DILocalVariable(name: "x", arg: 1, scope: !925, file: !903, line: 756, type: !928)
!931 = !DILocalVariable(name: "y", arg: 2, scope: !925, file: !903, line: 756, type: !928)
!932 = !DILocalVariable(name: "a", scope: !933, file: !903, line: 773, type: !13, align: 8)
!933 = distinct !DILexicalBlock(scope: !925, file: !903, line: 773, column: 9)
!934 = !DILocalVariable(name: "b", scope: !935, file: !903, line: 774, type: !13, align: 8)
!935 = distinct !DILexicalBlock(scope: !933, file: !903, line: 774, column: 9)
!936 = !DILocation(line: 756, column: 36, scope: !925)
!937 = !DILocation(line: 756, column: 47, scope: !925)
!938 = !DILocation(line: 773, column: 13, scope: !933)
!939 = !DILocation(line: 774, column: 13, scope: !935)
!940 = !DILocation(line: 773, column: 17, scope: !925)
!941 = !DILocation(line: 774, column: 17, scope: !933)
!942 = !DILocation(line: 775, column: 23, scope: !935)
!943 = !DILocation(line: 775, column: 9, scope: !935)
!944 = !DILocation(line: 776, column: 23, scope: !935)
!945 = !DILocation(line: 776, column: 9, scope: !935)
!946 = !DILocation(line: 778, column: 2, scope: !925)
!947 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17hb2be4dcaffb5f0ffE", scope: !612, file: !903, line: 719, type: !926, scopeLine: 719, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !948)
!948 = !{!949, !950}
!949 = !DILocalVariable(name: "x", arg: 1, scope: !947, file: !903, line: 719, type: !928)
!950 = !DILocalVariable(name: "y", arg: 2, scope: !947, file: !903, line: 719, type: !928)
!951 = !DILocation(line: 719, column: 22, scope: !947)
!952 = !DILocation(line: 719, column: 33, scope: !947)
!953 = !DILocation(line: 734, column: 12, scope: !947)
!954 = !DILocation(line: 748, column: 5, scope: !947)
!955 = !DILocation(line: 737, column: 29, scope: !947)
!956 = !DILocation(line: 749, column: 2, scope: !947)
!957 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17hfec392ff4fc11a00E", scope: !612, file: !903, line: 148, type: !958, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !13}
!960 = !{!961}
!961 = !DILocalVariable(name: "t", arg: 1, scope: !957, file: !903, line: 148, type: !13)
!962 = !DILocation(line: 148, column: 24, scope: !957)
!963 = !DILocation(line: 149, column: 31, scope: !957)
!964 = !DILocalVariable(name: "value", arg: 1, scope: !965, file: !966, line: 70, type: !13)
!965 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17h8f9a858743cbdc65E", scope: !616, file: !966, line: 70, type: !967, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !969)
!966 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!967 = !DISubroutineType(types: !968)
!968 = !{!616, !13}
!969 = !{!964}
!970 = !DILocation(line: 70, column: 22, scope: !965, inlinedAt: !971)
!971 = distinct !DILocation(line: 149, column: 13, scope: !957)
!972 = !DILocation(line: 71, column: 24, scope: !965, inlinedAt: !971)
!973 = !DILocation(line: 71, column: 9, scope: !965, inlinedAt: !971)
!974 = !DILocation(line: 150, column: 2, scope: !957)
!975 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17hc1f85385c153f8faE", scope: !977, file: !976, line: 558, type: !979, scopeLine: 558, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !981)
!976 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "e04d62c2de015c656853e72a35c78655")
!977 = !DINamespace(name: "{impl#11}", scope: !978)
!978 = !DINamespace(name: "num", scope: !143)
!979 = !DISubroutineType(types: !980)
!980 = !{!438, !9, !9}
!981 = !{!982, !983, !984, !986}
!982 = !DILocalVariable(name: "self", arg: 1, scope: !975, file: !976, line: 558, type: !9)
!983 = !DILocalVariable(name: "rhs", arg: 2, scope: !975, file: !976, line: 558, type: !9)
!984 = !DILocalVariable(name: "a", scope: !985, file: !976, line: 559, type: !9, align: 8)
!985 = distinct !DILexicalBlock(scope: !975, file: !976, line: 559, column: 13)
!986 = !DILocalVariable(name: "b", scope: !985, file: !976, line: 559, type: !492, align: 1)
!987 = !DILocation(line: 558, column: 34, scope: !975)
!988 = !DILocation(line: 558, column: 40, scope: !975)
!989 = !DILocalVariable(name: "self", arg: 1, scope: !990, file: !976, line: 1676, type: !9)
!990 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17ha83d112b51dd6b8aE", scope: !977, file: !976, line: 1676, type: !991, scopeLine: 1676, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !997)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !9, !9}
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !994, templateParams: !24, identifier: "5d4cb4b3e2da4aeebd47965411ffedac")
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !993, file: !2, baseType: !9, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !993, file: !2, baseType: !492, size: 8, align: 8, offset: 64)
!997 = !{!989, !998, !999, !1001}
!998 = !DILocalVariable(name: "rhs", arg: 2, scope: !990, file: !976, line: 1676, type: !9)
!999 = !DILocalVariable(name: "a", scope: !1000, file: !976, line: 1677, type: !22, align: 8)
!1000 = distinct !DILexicalBlock(scope: !990, file: !976, line: 1677, column: 13)
!1001 = !DILocalVariable(name: "b", scope: !1000, file: !976, line: 1677, type: !492, align: 1)
!1002 = !DILocation(line: 1676, column: 38, scope: !990, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 559, column: 26, scope: !975)
!1004 = !DILocation(line: 1676, column: 44, scope: !990, inlinedAt: !1003)
!1005 = !DILocation(line: 1677, column: 26, scope: !990, inlinedAt: !1003)
!1006 = !DILocation(line: 1677, column: 18, scope: !990, inlinedAt: !1003)
!1007 = !DILocation(line: 1677, column: 18, scope: !1000, inlinedAt: !1003)
!1008 = !DILocation(line: 1677, column: 21, scope: !990, inlinedAt: !1003)
!1009 = !DILocation(line: 1677, column: 21, scope: !1000, inlinedAt: !1003)
!1010 = !DILocation(line: 1678, column: 13, scope: !1000, inlinedAt: !1003)
!1011 = !DILocation(line: 1679, column: 10, scope: !990, inlinedAt: !1003)
!1012 = !DILocation(line: 559, column: 26, scope: !975)
!1013 = !DILocation(line: 559, column: 18, scope: !975)
!1014 = !DILocation(line: 559, column: 18, scope: !985)
!1015 = !DILocation(line: 559, column: 21, scope: !975)
!1016 = !DILocation(line: 559, column: 21, scope: !985)
!1017 = !DILocation(line: 560, column: 16, scope: !985)
!1018 = !DILocation(line: 560, column: 42, scope: !985)
!1019 = !DILocation(line: 560, column: 13, scope: !985)
!1020 = !DILocation(line: 560, column: 30, scope: !985)
!1021 = !DILocation(line: 561, column: 10, scope: !975)
!1022 = !{i64 0, i64 2}
!1023 = distinct !DISubprogram(name: "next_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$17next_power_of_two17hd6961dc7d8bc41d9E", scope: !977, file: !976, line: 2190, type: !1024, scopeLine: 2190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!9, !9}
!1026 = !{!1027}
!1027 = !DILocalVariable(name: "self", arg: 1, scope: !1023, file: !976, line: 2190, type: !9)
!1028 = !DILocation(line: 2190, column: 40, scope: !1023)
!1029 = !DILocation(line: 2191, column: 13, scope: !1023)
!1030 = !DILocation(line: 2192, column: 10, scope: !1023)
!1031 = distinct !DISubprogram(name: "one_less_than_next_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$31one_less_than_next_power_of_two17hdb5033648451c355E", scope: !977, file: !976, line: 2158, type: !1024, scopeLine: 2158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1032)
!1032 = !{!1033, !1034, !1036}
!1033 = !DILocalVariable(name: "self", arg: 1, scope: !1031, file: !976, line: 2158, type: !9)
!1034 = !DILocalVariable(name: "p", scope: !1035, file: !976, line: 2161, type: !9, align: 8)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !976, line: 2161, column: 13)
!1036 = !DILocalVariable(name: "z", scope: !1037, file: !976, line: 2166, type: !9, align: 8)
!1037 = distinct !DILexicalBlock(scope: !1035, file: !976, line: 2166, column: 13)
!1038 = !DILocation(line: 2158, column: 50, scope: !1031)
!1039 = !DILocation(line: 2159, column: 16, scope: !1031)
!1040 = !DILocation(line: 2161, column: 21, scope: !1031)
!1041 = !DILocation(line: 2159, column: 35, scope: !1031)
!1042 = !DILocation(line: 2168, column: 10, scope: !1031)
!1043 = !DILocation(line: 2161, column: 17, scope: !1035)
!1044 = !DILocation(line: 2166, column: 30, scope: !1035)
!1045 = !DILocation(line: 2166, column: 17, scope: !1037)
!1046 = !DILocation(line: 2167, column: 13, scope: !1037)
