; ModuleID = 'bootloader.dd1f7e83ceca872c-cgu.0'
source_filename = "bootloader.dd1f7e83ceca872c-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::ops::range::RangeInclusive<usize>" = type { i64, i64, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"core::ptr::metadata::PtrComponents<u8>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}
%"[closure@core::slice::sort::choose_pivot<bootinfo::memory_map::MemoryRegion, [closure@core::slice::<impl [bootinfo::memory_map::MemoryRegion]>::sort_unstable_by<[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]>::{closure#0}]>::{closure#0}]" = type { ptr, { ptr, i64 }, ptr }
%"core::option::Option<core::fmt::Arguments<'_>>" = type { ptr, [5 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "d338a3c456565b9f94bd9ae2bcc38dfe")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "f0528f709a6ad67947690eb30dd02688")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "a1dc4b4abf9583d027336f6bfa7a291e")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "39f07cf84e498bbefa75f9081bef9b98")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "d6faa0dd6a491d661a24d71375576beb")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "43ac3c47b15bc2bea988afcce061857a")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "628fbe63c6e26fc61e4c1617fd00d1c")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "3203d7256f2bb169fa787e8debf6a410")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "77f2d477e5d708c8638932eadf3683d0")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "5c67e83b94cfbfae793b30b5cd61017d")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "7faa38b0edbee9a6366305feab823b65")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "ead8a49ffd209c5edded7b9b6264030")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "d69a1af1af19a66bd483394c940e3e1a")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "382f3634b96fdc3281a0e72c9b4e4b43")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 8, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.71.0-nightly (5ea3f0ae0 2023-05-23))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !161, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/lib.rs/@/bootloader.dd1f7e83ceca872c-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23")
!138 = !{!26, !139, !148, !155}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !143)
!140 = !DINamespace(name: "rt", scope: !141)
!141 = !DINamespace(name: "fmt", scope: !142)
!142 = !DINamespace(name: "core", scope: null)
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !149, file: !2, baseType: !150, size: 8, align: 8, flags: DIFlagEnumClass, elements: !151)
!149 = !DINamespace(name: "cmp", scope: !142)
!150 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "Less", value: -1)
!153 = !DIEnumerator(name: "Equal", value: 0)
!154 = !DIEnumerator(name: "Greater", value: 1)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !156, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !157)
!156 = !DINamespace(name: "panicking", scope: !142)
!157 = !{!158, !159, !160}
!158 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!159 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!160 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!161 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!162 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h7e7668d57ecf7c1cE", scope: !164, file: !163, line: 371, type: !167, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !182)
!163 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "d107e626d2145c8c7d098a7b217e6306")
!164 = !DINamespace(name: "{impl#4}", scope: !165)
!165 = !DINamespace(name: "index", scope: !166)
!166 = !DINamespace(name: "slice", scope: !142)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !174, !169}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !170, templateParams: !24, identifier: "ed9f34e5f5a827d7e4f8933d51b1607d")
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !169, file: !2, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !169, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !175, file: !2, size: 128, align: 64, elements: !177, templateParams: !180, identifier: "1f8bc2272e64a96da1c0d704b5981322")
!175 = !DINamespace(name: "range", scope: !176)
!176 = !DINamespace(name: "ops", scope: !142)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !174, file: !2, baseType: !9, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!180 = !{!181}
!181 = !DITemplateTypeParameter(name: "Idx", type: !9)
!182 = !{!183, !184, !185, !187}
!183 = !DILocalVariable(name: "self", arg: 1, scope: !162, file: !163, line: 371, type: !174)
!184 = !DILocalVariable(name: "slice", arg: 2, scope: !162, file: !163, line: 371, type: !169)
!185 = !DILocalVariable(name: "this", scope: !186, file: !163, line: 372, type: !174, align: 8)
!186 = distinct !DILexicalBlock(scope: !162, file: !163, line: 372, column: 9)
!187 = !DILocalVariable(name: "new_len", scope: !188, file: !163, line: 383, type: !9, align: 8)
!188 = distinct !DILexicalBlock(scope: !186, file: !163, line: 383, column: 13)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "T", type: !13)
!191 = !DILocation(line: 371, column: 29, scope: !162)
!192 = !DILocation(line: 371, column: 35, scope: !162)
!193 = !DILocation(line: 372, column: 13, scope: !186)
!194 = !DILocation(line: 372, column: 20, scope: !162)
!195 = !DILocation(line: 378, column: 13, scope: !186)
!196 = !DILocation(line: 383, column: 27, scope: !186)
!197 = !DILocation(line: 383, column: 17, scope: !188)
!198 = !DILocation(line: 384, column: 39, scope: !188)
!199 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !201, line: 915, type: !207)
!200 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h0ddf10eff83ee4e5E", scope: !202, file: !201, line: 915, type: !205, scopeLine: 915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !208)
!201 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "9d2fad04a90e20289542de49bd178aec")
!202 = !DINamespace(name: "{impl#0}", scope: !203)
!203 = !DINamespace(name: "const_ptr", scope: !204)
!204 = !DINamespace(name: "ptr", scope: !142)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !207, !9}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !{!199, !209}
!209 = !DILocalVariable(name: "count", arg: 2, scope: !200, file: !201, line: 915, type: !9)
!210 = !DILocation(line: 915, column: 29, scope: !200, inlinedAt: !211)
!211 = distinct !DILocation(line: 384, column: 39, scope: !188)
!212 = !DILocation(line: 915, column: 35, scope: !200, inlinedAt: !211)
!213 = !DILocation(line: 927, column: 13, scope: !200, inlinedAt: !211)
!214 = !DILocation(line: 384, column: 13, scope: !188)
!215 = !DILocation(line: 386, column: 6, scope: !162)
!216 = !DILocalVariable(name: "this", arg: 1, scope: !217, file: !218, line: 2517, type: !174)
!217 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17h1119e31b604a5b7dE", scope: !219, file: !218, line: 2517, type: !220, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !222)
!218 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "056d7d4c1b797c272c70fdc2c35793d9")
!219 = !DINamespace(name: "get_unchecked", scope: !164)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !174, !169}
!222 = !{!216, !223}
!223 = !DILocalVariable(name: "slice", arg: 2, scope: !217, file: !218, line: 2517, type: !169)
!224 = !DILocation(line: 2517, column: 39, scope: !217, inlinedAt: !225)
!225 = distinct !DILocation(line: 378, column: 13, scope: !186)
!226 = !DILocation(line: 381, column: 17, scope: !227, inlinedAt: !225)
!227 = !DILexicalBlockFile(scope: !217, file: !163, discriminator: 0)
!228 = !DILocation(line: 381, column: 55, scope: !227, inlinedAt: !225)
!229 = !DILocation(line: 381, column: 43, scope: !227, inlinedAt: !225)
!230 = !DILocation(line: 2518, column: 20, scope: !217, inlinedAt: !225)
!231 = !{i8 0, i8 2}
!232 = !DILocation(line: 2520, column: 21, scope: !217, inlinedAt: !225)
!233 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17hc050f2c8a207f4a1E", scope: !164, file: !163, line: 389, type: !234, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !240)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !174, !236}
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !237, templateParams: !24, identifier: "fcba9ba56e590367da4706e9f89ee07c")
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !236, file: !2, baseType: !172, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!240 = !{!241, !242, !243, !245}
!241 = !DILocalVariable(name: "self", arg: 1, scope: !233, file: !163, line: 389, type: !174)
!242 = !DILocalVariable(name: "slice", arg: 2, scope: !233, file: !163, line: 389, type: !236)
!243 = !DILocalVariable(name: "this", scope: !244, file: !163, line: 390, type: !174, align: 8)
!244 = distinct !DILexicalBlock(scope: !233, file: !163, line: 390, column: 9)
!245 = !DILocalVariable(name: "new_len", scope: !246, file: !163, line: 398, type: !9, align: 8)
!246 = distinct !DILexicalBlock(scope: !244, file: !163, line: 398, column: 13)
!247 = !DILocation(line: 389, column: 33, scope: !233)
!248 = !DILocation(line: 389, column: 39, scope: !233)
!249 = !DILocation(line: 390, column: 13, scope: !244)
!250 = !DILocation(line: 390, column: 20, scope: !233)
!251 = !DILocation(line: 393, column: 13, scope: !244)
!252 = !DILocation(line: 398, column: 27, scope: !244)
!253 = !DILocation(line: 398, column: 17, scope: !246)
!254 = !DILocalVariable(name: "self", arg: 1, scope: !255, file: !256, line: 2032, type: !236)
!255 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h3f6cc3e4800437cdE", scope: !257, file: !256, line: 2032, type: !259, scopeLine: 2032, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !262)
!256 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "e30cd97e1a51e29e3c486707e67aff9a")
!257 = !DINamespace(name: "{impl#1}", scope: !258)
!258 = !DINamespace(name: "mut_ptr", scope: !204)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !236}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !{!254}
!263 = !DILocation(line: 2032, column: 29, scope: !255, inlinedAt: !264)
!264 = distinct !DILocation(line: 399, column: 43, scope: !246)
!265 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !256, line: 1025, type: !261)
!266 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hf9ffa31e3f9e6673E", scope: !267, file: !256, line: 1025, type: !268, scopeLine: 1025, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !270)
!267 = !DINamespace(name: "{impl#0}", scope: !258)
!268 = !DISubroutineType(types: !269)
!269 = !{!261, !261, !9}
!270 = !{!265, !271}
!271 = !DILocalVariable(name: "count", arg: 2, scope: !266, file: !256, line: 1025, type: !9)
!272 = !DILocation(line: 1025, column: 29, scope: !266, inlinedAt: !273)
!273 = distinct !DILocation(line: 399, column: 43, scope: !246)
!274 = !DILocation(line: 1025, column: 35, scope: !266, inlinedAt: !273)
!275 = !DILocation(line: 1037, column: 13, scope: !266, inlinedAt: !273)
!276 = !DILocation(line: 399, column: 13, scope: !246)
!277 = !DILocation(line: 401, column: 6, scope: !233)
!278 = !DILocalVariable(name: "this", arg: 1, scope: !279, file: !218, line: 2517, type: !174)
!279 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17hca9f376a8cd4e937E", scope: !280, file: !218, line: 2517, type: !281, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !283)
!280 = !DINamespace(name: "get_unchecked_mut", scope: !164)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !174, !236}
!283 = !{!278, !284}
!284 = !DILocalVariable(name: "slice", arg: 2, scope: !279, file: !218, line: 2517, type: !236)
!285 = !DILocation(line: 2517, column: 39, scope: !279, inlinedAt: !286)
!286 = distinct !DILocation(line: 393, column: 13, scope: !244)
!287 = !DILocation(line: 396, column: 17, scope: !288, inlinedAt: !286)
!288 = !DILexicalBlockFile(scope: !279, file: !163, discriminator: 0)
!289 = !DILocalVariable(name: "self", arg: 1, scope: !290, file: !256, line: 1896, type: !236)
!290 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h726a9b87ea12e028E", scope: !257, file: !256, line: 1896, type: !291, scopeLine: 1896, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{!9, !236}
!293 = !{!289}
!294 = !DILocation(line: 1896, column: 22, scope: !290, inlinedAt: !295)
!295 = distinct !DILocation(line: 396, column: 55, scope: !288, inlinedAt: !286)
!296 = !DILocation(line: 1897, column: 9, scope: !290, inlinedAt: !295)
!297 = !DILocation(line: 396, column: 43, scope: !288, inlinedAt: !286)
!298 = !DILocation(line: 2518, column: 20, scope: !279, inlinedAt: !286)
!299 = !DILocation(line: 2520, column: 21, scope: !279, inlinedAt: !286)
!300 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h67b1c80919143750E", scope: !164, file: !163, line: 404, type: !301, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !320)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !174, !303, !307}
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !304, templateParams: !24, identifier: "58be6fa269f20a39d2112c35cb80771")
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !303, file: !2, baseType: !172, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !303, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !308, size: 64, align: 64, dwarfAddressSpace: 0)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !309, file: !2, size: 192, align: 64, elements: !311, templateParams: !24, identifier: "20ef1a484ea0863fc9e4151fe212b612")
!309 = !DINamespace(name: "location", scope: !310)
!310 = !DINamespace(name: "panic", scope: !142)
!311 = !{!312, !318, !319}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !308, file: !2, baseType: !313, size: 128, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !314, templateParams: !24, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !313, file: !2, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !308, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !308, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!320 = !{!321, !322}
!321 = !DILocalVariable(name: "self", arg: 1, scope: !300, file: !163, line: 404, type: !174)
!322 = !DILocalVariable(name: "slice", arg: 2, scope: !300, file: !163, line: 404, type: !303)
!323 = !DILocation(line: 404, column: 14, scope: !300)
!324 = !DILocation(line: 404, column: 20, scope: !300)
!325 = !DILocation(line: 405, column: 12, scope: !300)
!326 = !DILocation(line: 407, column: 19, scope: !300)
!327 = !DILocation(line: 406, column: 13, scope: !300)
!328 = !DILocation(line: 411, column: 20, scope: !300)
!329 = !DILocation(line: 412, column: 6, scope: !300)
!330 = !DILocation(line: 408, column: 13, scope: !300)
!331 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17ha10120fffeb1e562E", scope: !164, file: !163, line: 415, type: !332, scopeLine: 415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !338)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !174, !334, !307}
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !335, templateParams: !24, identifier: "9580a2b2ed58752e7a9e0764a361e463")
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !334, file: !2, baseType: !172, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!338 = !{!339, !340}
!339 = !DILocalVariable(name: "self", arg: 1, scope: !331, file: !163, line: 415, type: !174)
!340 = !DILocalVariable(name: "slice", arg: 2, scope: !331, file: !163, line: 415, type: !334)
!341 = !DILocation(line: 415, column: 18, scope: !331)
!342 = !DILocation(line: 415, column: 24, scope: !331)
!343 = !DILocation(line: 416, column: 12, scope: !331)
!344 = !DILocation(line: 418, column: 19, scope: !331)
!345 = !DILocation(line: 417, column: 13, scope: !331)
!346 = !DILocation(line: 422, column: 24, scope: !331)
!347 = !DILocation(line: 423, column: 6, scope: !331)
!348 = !DILocation(line: 419, column: 13, scope: !331)
!349 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hbf77088feacd268fE", scope: !350, file: !163, line: 459, type: !351, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !356)
!350 = !DINamespace(name: "{impl#5}", scope: !165)
!351 = !DISubroutineType(types: !352)
!352 = !{!334, !353, !334, !307}
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !354, templateParams: !180, identifier: "d2d2efee66a1da732fca0ce30ce5af17")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !353, file: !2, baseType: !9, size: 64, align: 64)
!356 = !{!357, !358}
!357 = !DILocalVariable(name: "self", arg: 1, scope: !349, file: !163, line: 459, type: !353)
!358 = !DILocalVariable(name: "slice", arg: 2, scope: !349, file: !163, line: 459, type: !334)
!359 = !DILocation(line: 459, column: 18, scope: !349)
!360 = !DILocation(line: 459, column: 24, scope: !349)
!361 = !DILocation(line: 460, column: 9, scope: !349)
!362 = !DILocation(line: 461, column: 6, scope: !349)
!363 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17hf70100c103a4d15fE", scope: !364, file: !163, line: 486, type: !365, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !370)
!364 = !DINamespace(name: "{impl#6}", scope: !165)
!365 = !DISubroutineType(types: !366)
!366 = !{!236, !367, !236}
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !368, templateParams: !180, identifier: "5a2a83acfc798cb3412d13212fa7637d")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !367, file: !2, baseType: !9, size: 64, align: 64)
!370 = !{!371, !372}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !363, file: !163, line: 486, type: !367)
!372 = !DILocalVariable(name: "slice", arg: 2, scope: !363, file: !163, line: 486, type: !236)
!373 = !DILocation(line: 486, column: 33, scope: !363)
!374 = !DILocation(line: 486, column: 39, scope: !363)
!375 = !DILocation(line: 1896, column: 22, scope: !290, inlinedAt: !376)
!376 = distinct !DILocation(line: 488, column: 31, scope: !363)
!377 = !DILocation(line: 1897, column: 9, scope: !290, inlinedAt: !376)
!378 = !DILocation(line: 488, column: 18, scope: !363)
!379 = !DILocation(line: 489, column: 6, scope: !363)
!380 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h269e9f2975c5869eE", scope: !364, file: !163, line: 501, type: !381, scopeLine: 501, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!334, !367, !334, !307}
!383 = !{!384, !385}
!384 = !DILocalVariable(name: "self", arg: 1, scope: !380, file: !163, line: 501, type: !367)
!385 = !DILocalVariable(name: "slice", arg: 2, scope: !380, file: !163, line: 501, type: !334)
!386 = !DILocation(line: 501, column: 18, scope: !380)
!387 = !DILocation(line: 501, column: 24, scope: !380)
!388 = !DILocation(line: 502, column: 12, scope: !380)
!389 = !DILocation(line: 506, column: 24, scope: !380)
!390 = !DILocation(line: 507, column: 6, scope: !380)
!391 = !DILocation(line: 503, column: 13, scope: !380)
!392 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN115_$LT$core..ops..range..RangeInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h4c1974e2bc7c8e54E", scope: !393, file: !163, line: 582, type: !394, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !402)
!393 = !DINamespace(name: "{impl#8}", scope: !165)
!394 = !DISubroutineType(types: !395)
!395 = !{!334, !396, !334, !307}
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !175, file: !2, size: 192, align: 64, elements: !397, templateParams: !180, identifier: "9b9ea0a06138ca3c8e73c7e7c6639237")
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !396, file: !2, baseType: !9, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !396, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !396, file: !2, baseType: !401, size: 8, align: 8, offset: 128)
!401 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "self", arg: 1, scope: !392, file: !163, line: 582, type: !396)
!404 = !DILocalVariable(name: "slice", arg: 2, scope: !392, file: !163, line: 582, type: !334)
!405 = !DILocation(line: 582, column: 18, scope: !392)
!406 = !DILocation(line: 582, column: 24, scope: !392)
!407 = !DILocation(line: 583, column: 13, scope: !392)
!408 = !DILocation(line: 583, column: 12, scope: !392)
!409 = !DILocation(line: 586, column: 9, scope: !392)
!410 = !DILocation(line: 587, column: 6, scope: !392)
!411 = !DILocation(line: 584, column: 13, scope: !392)
!412 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN117_$LT$core..ops..range..RangeToInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h8e26a6a69cc33cafE", scope: !413, file: !163, line: 623, type: !414, scopeLine: 623, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !419)
!413 = !DINamespace(name: "{impl#9}", scope: !165)
!414 = !DISubroutineType(types: !415)
!415 = !{!334, !416, !334, !307}
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeToInclusive<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !417, templateParams: !180, identifier: "39b15bafee014b512d194feea4d4371")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !416, file: !2, baseType: !9, size: 64, align: 64)
!419 = !{!420, !421}
!420 = !DILocalVariable(name: "self", arg: 1, scope: !412, file: !163, line: 623, type: !416)
!421 = !DILocalVariable(name: "slice", arg: 2, scope: !412, file: !163, line: 623, type: !334)
!422 = !DILocation(line: 623, column: 18, scope: !412)
!423 = !DILocation(line: 623, column: 24, scope: !412)
!424 = !DILocation(line: 624, column: 9, scope: !412)
!425 = !DILocation(line: 625, column: 6, scope: !412)
!426 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h0403dbc38cd8bbbdE", scope: !428, file: !427, line: 2268, type: !429, scopeLine: 2268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !484)
!427 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a732c99c57cb2d76a548fb6f43c5e00")
!428 = !DINamespace(name: "{impl#53}", scope: !141)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !449, !450}
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !432, file: !2, size: 8, align: 8, elements: !433, templateParams: !24, identifier: "22c75a34514fa785fe8d5e5737b404a")
!432 = !DINamespace(name: "result", scope: !142)
!433 = !{!434}
!434 = !DICompositeType(tag: DW_TAG_variant_part, scope: !431, file: !2, size: 8, align: 8, elements: !435, templateParams: !24, identifier: "318b8b14c370a5a4f50890e5a30a4497", discriminator: !448)
!435 = !{!436, !444}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !434, file: !2, baseType: !437, size: 8, align: 8, extraData: i64 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !431, file: !2, size: 8, align: 8, elements: !438, templateParams: !440, identifier: "5b323728d71ad8b54f91e8647fb6c225")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !437, file: !2, baseType: !7, align: 8, offset: 8)
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "T", type: !7)
!442 = !DITemplateTypeParameter(name: "E", type: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !141, file: !2, align: 8, elements: !24, identifier: "fc30e04e843f09017d3a1f431d2f6e0c")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !434, file: !2, baseType: !445, size: 8, align: 8, extraData: i64 1)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !431, file: !2, size: 8, align: 8, elements: !446, templateParams: !440, identifier: "a4826728ee7be77ec8568eb24e01c72")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !443, align: 8, offset: 8)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !431, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !141, file: !2, size: 512, align: 64, elements: !452, templateParams: !24, identifier: "a84a5bdbf0499ca1d68196c4b862c039")
!452 = !{!453, !454, !456, !457, !472, !473}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !2, baseType: !27, size: 32, align: 32, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !451, file: !2, baseType: !455, size: 32, align: 32, offset: 384)
!455 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !451, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !451, file: !2, baseType: !458, size: 128, align: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !459, file: !2, size: 128, align: 64, elements: !460, templateParams: !24, identifier: "9ff7c8d78ada7de0ac9d763d1c46855f")
!459 = !DINamespace(name: "option", scope: !142)
!460 = !{!461}
!461 = !DICompositeType(tag: DW_TAG_variant_part, scope: !458, file: !2, size: 128, align: 64, elements: !462, templateParams: !24, identifier: "4121c4c375fd14965cbbd4a52ee80751", discriminator: !471)
!462 = !{!463, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !461, file: !2, baseType: !464, size: 128, align: 64, extraData: i64 0)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !458, file: !2, size: 128, align: 64, elements: !24, templateParams: !465, identifier: "2820df4bdcb3911085cbffae781ae71")
!465 = !{!466}
!466 = !DITemplateTypeParameter(name: "T", type: !9)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !461, file: !2, baseType: !468, size: 128, align: 64, extraData: i64 1)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !458, file: !2, size: 128, align: 64, elements: !469, templateParams: !465, identifier: "3de76324e4613a017cfb22686952e8ce")
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !458, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !451, file: !2, baseType: !458, size: 128, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !451, file: !2, baseType: !474, size: 128, align: 64, offset: 256)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !475, templateParams: !24, identifier: "841e47680ccca04665b2034bf5815694")
!475 = !{!476, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !474, file: !2, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64, dwarfAddressSpace: 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "d63695003f7c60186849daf2e0ab45a2")
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !474, file: !2, baseType: !480, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 3, lowerBound: 0)
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !426, file: !427, line: 2268, type: !449)
!486 = !DILocalVariable(name: "f", arg: 2, scope: !426, file: !427, line: 2268, type: !450)
!487 = !DILocation(line: 2268, column: 20, scope: !426)
!488 = !DILocation(line: 2268, column: 27, scope: !426)
!489 = !DILocation(line: 2268, column: 71, scope: !426)
!490 = !{i64 8}
!491 = !DILocation(line: 2268, column: 62, scope: !426)
!492 = !DILocation(line: 2268, column: 84, scope: !426)
!493 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h8bd86ba65fe73e59E", scope: !428, file: !427, line: 2268, type: !494, scopeLine: 2268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !500, retainedNodes: !497)
!494 = !DISubroutineType(types: !495)
!495 = !{!431, !496, !450}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!497 = !{!498, !499}
!498 = !DILocalVariable(name: "self", arg: 1, scope: !493, file: !427, line: 2268, type: !496)
!499 = !DILocalVariable(name: "f", arg: 2, scope: !493, file: !427, line: 2268, type: !450)
!500 = !{!501}
!501 = !DITemplateTypeParameter(name: "T", type: !26)
!502 = !DILocation(line: 2268, column: 20, scope: !493)
!503 = !DILocation(line: 2268, column: 27, scope: !493)
!504 = !DILocation(line: 2268, column: 71, scope: !493)
!505 = !{i64 4}
!506 = !DILocation(line: 2268, column: 62, scope: !493)
!507 = !DILocation(line: 2268, column: 84, scope: !493)
!508 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h02b9546723696483E", scope: !509, file: !218, line: 2553, type: !510, scopeLine: 2553, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !512)
!509 = !DINamespace(name: "intrinsics", scope: !142)
!510 = !DISubroutineType(types: !511)
!511 = !{!401, !207, !207, !9}
!512 = !{!513, !514, !515, !516, !518, !520, !522}
!513 = !DILocalVariable(name: "src", arg: 1, scope: !508, file: !218, line: 2553, type: !207)
!514 = !DILocalVariable(name: "dst", arg: 2, scope: !508, file: !218, line: 2553, type: !207)
!515 = !DILocalVariable(name: "count", arg: 3, scope: !508, file: !218, line: 2553, type: !9)
!516 = !DILocalVariable(name: "src_usize", scope: !517, file: !218, line: 2554, type: !9, align: 8)
!517 = distinct !DILexicalBlock(scope: !508, file: !218, line: 2554, column: 5)
!518 = !DILocalVariable(name: "dst_usize", scope: !519, file: !218, line: 2555, type: !9, align: 8)
!519 = distinct !DILexicalBlock(scope: !517, file: !218, line: 2555, column: 5)
!520 = !DILocalVariable(name: "size", scope: !521, file: !218, line: 2556, type: !9, align: 8)
!521 = distinct !DILexicalBlock(scope: !519, file: !218, line: 2556, column: 5)
!522 = !DILocalVariable(name: "diff", scope: !523, file: !218, line: 2559, type: !9, align: 8)
!523 = distinct !DILexicalBlock(scope: !521, file: !218, line: 2559, column: 5)
!524 = !DILocation(line: 2553, column: 36, scope: !508)
!525 = !DILocation(line: 2553, column: 51, scope: !508)
!526 = !DILocation(line: 2553, column: 66, scope: !508)
!527 = !DILocation(line: 2559, column: 9, scope: !523)
!528 = !DILocalVariable(name: "self", arg: 1, scope: !529, file: !201, line: 203, type: !207)
!529 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h39ebaf879cf22705E", scope: !202, file: !201, line: 203, type: !530, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{!9, !207}
!532 = !{!528}
!533 = !DILocation(line: 203, column: 17, scope: !529, inlinedAt: !534)
!534 = distinct !DILocation(line: 2554, column: 21, scope: !508)
!535 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !201, line: 58, type: !207)
!536 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hfbb44db8d160aefbE", scope: !202, file: !201, line: 58, type: !537, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !540, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!6, !207}
!539 = !{!535}
!540 = !{!190, !541}
!541 = !DITemplateTypeParameter(name: "U", type: !7)
!542 = !DILocation(line: 58, column: 26, scope: !536, inlinedAt: !543)
!543 = distinct !DILocation(line: 207, column: 33, scope: !529, inlinedAt: !534)
!544 = !DILocation(line: 207, column: 18, scope: !529, inlinedAt: !534)
!545 = !DILocation(line: 2554, column: 21, scope: !508)
!546 = !DILocation(line: 2554, column: 9, scope: !517)
!547 = !DILocation(line: 203, column: 17, scope: !529, inlinedAt: !548)
!548 = distinct !DILocation(line: 2555, column: 21, scope: !517)
!549 = !DILocation(line: 58, column: 26, scope: !536, inlinedAt: !550)
!550 = distinct !DILocation(line: 207, column: 33, scope: !529, inlinedAt: !548)
!551 = !DILocation(line: 207, column: 18, scope: !529, inlinedAt: !548)
!552 = !DILocation(line: 2555, column: 21, scope: !517)
!553 = !DILocation(line: 2555, column: 9, scope: !519)
!554 = !DILocation(line: 2556, column: 16, scope: !519)
!555 = !DILocation(line: 2556, column: 9, scope: !521)
!556 = !DILocation(line: 2559, column: 19, scope: !521)
!557 = !DILocation(line: 2559, column: 74, scope: !521)
!558 = !DILocation(line: 2559, column: 43, scope: !521)
!559 = !DILocation(line: 2559, column: 16, scope: !521)
!560 = !DILocation(line: 2562, column: 5, scope: !523)
!561 = !DILocation(line: 2563, column: 2, scope: !508)
!562 = distinct !DISubprogram(name: "is_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17hc662ec1828ef557bE", scope: !509, file: !218, line: 2553, type: !563, scopeLine: 2553, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !566)
!563 = !DISubroutineType(types: !564)
!564 = !{!401, !565, !565, !9}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !{!567, !568, !569, !570, !572, !574, !576}
!567 = !DILocalVariable(name: "src", arg: 1, scope: !562, file: !218, line: 2553, type: !565)
!568 = !DILocalVariable(name: "dst", arg: 2, scope: !562, file: !218, line: 2553, type: !565)
!569 = !DILocalVariable(name: "count", arg: 3, scope: !562, file: !218, line: 2553, type: !9)
!570 = !DILocalVariable(name: "src_usize", scope: !571, file: !218, line: 2554, type: !9, align: 8)
!571 = distinct !DILexicalBlock(scope: !562, file: !218, line: 2554, column: 5)
!572 = !DILocalVariable(name: "dst_usize", scope: !573, file: !218, line: 2555, type: !9, align: 8)
!573 = distinct !DILexicalBlock(scope: !571, file: !218, line: 2555, column: 5)
!574 = !DILocalVariable(name: "size", scope: !575, file: !218, line: 2556, type: !9, align: 8)
!575 = distinct !DILexicalBlock(scope: !573, file: !218, line: 2556, column: 5)
!576 = !DILocalVariable(name: "diff", scope: !577, file: !218, line: 2559, type: !9, align: 8)
!577 = distinct !DILexicalBlock(scope: !575, file: !218, line: 2559, column: 5)
!578 = !DILocation(line: 2553, column: 36, scope: !562)
!579 = !DILocation(line: 2553, column: 51, scope: !562)
!580 = !DILocation(line: 2553, column: 66, scope: !562)
!581 = !DILocation(line: 2559, column: 9, scope: !577)
!582 = !DILocalVariable(name: "self", arg: 1, scope: !583, file: !201, line: 203, type: !565)
!583 = distinct !DISubprogram(name: "addr<usize>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h86ade0aa1f8cb97dE", scope: !202, file: !201, line: 203, type: !584, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!9, !565}
!586 = !{!582}
!587 = !DILocation(line: 203, column: 17, scope: !583, inlinedAt: !588)
!588 = distinct !DILocation(line: 2554, column: 21, scope: !562)
!589 = !DILocalVariable(name: "self", arg: 1, scope: !590, file: !201, line: 58, type: !565)
!590 = distinct !DISubprogram(name: "cast<usize, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h23eab34a458b6b3aE", scope: !202, file: !201, line: 58, type: !591, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !594, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{!6, !565}
!593 = !{!589}
!594 = !{!466, !541}
!595 = !DILocation(line: 58, column: 26, scope: !590, inlinedAt: !596)
!596 = distinct !DILocation(line: 207, column: 33, scope: !583, inlinedAt: !588)
!597 = !DILocation(line: 207, column: 18, scope: !583, inlinedAt: !588)
!598 = !DILocation(line: 2554, column: 21, scope: !562)
!599 = !DILocation(line: 2554, column: 9, scope: !571)
!600 = !DILocation(line: 203, column: 17, scope: !583, inlinedAt: !601)
!601 = distinct !DILocation(line: 2555, column: 21, scope: !571)
!602 = !DILocation(line: 58, column: 26, scope: !590, inlinedAt: !603)
!603 = distinct !DILocation(line: 207, column: 33, scope: !583, inlinedAt: !601)
!604 = !DILocation(line: 207, column: 18, scope: !583, inlinedAt: !601)
!605 = !DILocation(line: 2555, column: 21, scope: !571)
!606 = !DILocation(line: 2555, column: 9, scope: !573)
!607 = !DILocation(line: 2556, column: 16, scope: !573)
!608 = !DILocation(line: 2556, column: 9, scope: !575)
!609 = !DILocation(line: 2559, column: 19, scope: !575)
!610 = !DILocation(line: 2559, column: 74, scope: !575)
!611 = !DILocation(line: 2559, column: 43, scope: !575)
!612 = !DILocation(line: 2559, column: 16, scope: !575)
!613 = !DILocation(line: 2562, column: 5, scope: !577)
!614 = !DILocation(line: 2563, column: 2, scope: !562)
!615 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h2081497d2c04d51aE", scope: !509, file: !218, line: 2655, type: !616, scopeLine: 2655, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !619)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !565, !618, !9}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!619 = !{!620, !621, !622}
!620 = !DILocalVariable(name: "src", arg: 1, scope: !615, file: !218, line: 2655, type: !565)
!621 = !DILocalVariable(name: "dst", arg: 2, scope: !615, file: !218, line: 2655, type: !618)
!622 = !DILocalVariable(name: "count", arg: 3, scope: !615, file: !218, line: 2655, type: !9)
!623 = !DILocation(line: 2655, column: 44, scope: !615)
!624 = !DILocation(line: 2655, column: 59, scope: !615)
!625 = !DILocation(line: 2655, column: 72, scope: !615)
!626 = !DILocation(line: 2665, column: 9, scope: !615)
!627 = !DILocation(line: 2673, column: 9, scope: !615)
!628 = !DILocation(line: 2675, column: 2, scope: !615)
!629 = !DILocalVariable(name: "src", arg: 1, scope: !630, file: !218, line: 2517, type: !565)
!630 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h33b106e842f35ab0E", scope: !631, file: !218, line: 2517, type: !616, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !632)
!631 = !DINamespace(name: "copy_nonoverlapping", scope: !509)
!632 = !{!629, !633, !634}
!633 = !DILocalVariable(name: "dst", arg: 2, scope: !630, file: !218, line: 2517, type: !618)
!634 = !DILocalVariable(name: "count", arg: 3, scope: !630, file: !218, line: 2517, type: !9)
!635 = !DILocation(line: 2517, column: 39, scope: !630, inlinedAt: !636)
!636 = distinct !DILocation(line: 2665, column: 9, scope: !615)
!637 = !DILocation(line: 2669, column: 13, scope: !630, inlinedAt: !636)
!638 = !DILocation(line: 2670, column: 20, scope: !630, inlinedAt: !636)
!639 = !DILocation(line: 2671, column: 20, scope: !630, inlinedAt: !636)
!640 = !DILocation(line: 2518, column: 20, scope: !630, inlinedAt: !636)
!641 = !DILocation(line: 2520, column: 21, scope: !630, inlinedAt: !636)
!642 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17hc7d2853d5e64f201E", scope: !509, file: !218, line: 2655, type: !643, scopeLine: 2655, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !207, !261, !9}
!645 = !{!646, !647, !648}
!646 = !DILocalVariable(name: "src", arg: 1, scope: !642, file: !218, line: 2655, type: !207)
!647 = !DILocalVariable(name: "dst", arg: 2, scope: !642, file: !218, line: 2655, type: !261)
!648 = !DILocalVariable(name: "count", arg: 3, scope: !642, file: !218, line: 2655, type: !9)
!649 = !DILocation(line: 2655, column: 44, scope: !642)
!650 = !DILocation(line: 2655, column: 59, scope: !642)
!651 = !DILocation(line: 2655, column: 72, scope: !642)
!652 = !DILocation(line: 2665, column: 9, scope: !642)
!653 = !DILocation(line: 2673, column: 9, scope: !642)
!654 = !DILocation(line: 2675, column: 2, scope: !642)
!655 = !DILocalVariable(name: "src", arg: 1, scope: !656, file: !218, line: 2517, type: !207)
!656 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h81a8d3ccbdd85a33E", scope: !631, file: !218, line: 2517, type: !643, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !657)
!657 = !{!655, !658, !659}
!658 = !DILocalVariable(name: "dst", arg: 2, scope: !656, file: !218, line: 2517, type: !261)
!659 = !DILocalVariable(name: "count", arg: 3, scope: !656, file: !218, line: 2517, type: !9)
!660 = !DILocation(line: 2517, column: 39, scope: !656, inlinedAt: !661)
!661 = distinct !DILocation(line: 2665, column: 9, scope: !642)
!662 = !DILocation(line: 2669, column: 13, scope: !656, inlinedAt: !661)
!663 = !DILocation(line: 2670, column: 20, scope: !656, inlinedAt: !661)
!664 = !DILocation(line: 2671, column: 20, scope: !656, inlinedAt: !661)
!665 = !DILocation(line: 2518, column: 20, scope: !656, inlinedAt: !661)
!666 = !DILocation(line: 2520, column: 21, scope: !656, inlinedAt: !661)
!667 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h149af2a9f28e4a2cE", scope: !509, file: !218, line: 2537, type: !668, scopeLine: 2537, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !683, retainedNodes: !681)
!668 = !DISubroutineType(types: !669)
!669 = !{!401, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !671, size: 64, align: 64, dwarfAddressSpace: 0)
!671 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !672, file: !2, size: 192, align: 64, elements: !674, templateParams: !189, identifier: "195d5ae69f942891d5dcbbfbd431416")
!672 = !DINamespace(name: "maybe_uninit", scope: !673)
!673 = !DINamespace(name: "mem", scope: !142)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !671, file: !2, baseType: !7, align: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !671, file: !2, baseType: !677, size: 192, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !678, file: !2, size: 192, align: 64, elements: !679, templateParams: !189, identifier: "67eeb6c8bcb3d28d9ddc6aca5510653c")
!678 = !DINamespace(name: "manually_drop", scope: !673)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !677, file: !2, baseType: !13, size: 192, align: 64)
!681 = !{!682}
!682 = !DILocalVariable(name: "ptr", arg: 1, scope: !667, file: !218, line: 2537, type: !670)
!683 = !{!684}
!684 = !DITemplateTypeParameter(name: "T", type: !671)
!685 = !DILocation(line: 2537, column: 42, scope: !667)
!686 = !DILocation(line: 2538, column: 6, scope: !667)
!687 = !DILocation(line: 2538, column: 5, scope: !667)
!688 = !DILocation(line: 2538, column: 23, scope: !667)
!689 = !DILocation(line: 2539, column: 2, scope: !667)
!690 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h4fdca66fb3f70d2cE", scope: !509, file: !218, line: 2537, type: !691, scopeLine: 2537, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!401, !207}
!693 = !{!694}
!694 = !DILocalVariable(name: "ptr", arg: 1, scope: !690, file: !218, line: 2537, type: !207)
!695 = !DILocation(line: 2537, column: 42, scope: !690)
!696 = !DILocation(line: 2538, column: 6, scope: !690)
!697 = !DILocation(line: 2538, column: 5, scope: !690)
!698 = !DILocation(line: 2538, column: 23, scope: !690)
!699 = !DILocation(line: 2539, column: 2, scope: !690)
!700 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<usize>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h5e3db6c043bf442bE", scope: !509, file: !218, line: 2537, type: !701, scopeLine: 2537, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !713, retainedNodes: !711)
!701 = !DISubroutineType(types: !702)
!702 = !{!401, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<usize>", baseType: !704, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<usize>", scope: !672, file: !2, size: 64, align: 64, elements: !705, templateParams: !465, identifier: "54dcae7fc0518a2bf29368821dc292c")
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !704, file: !2, baseType: !7, align: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !704, file: !2, baseType: !708, size: 64, align: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<usize>", scope: !678, file: !2, size: 64, align: 64, elements: !709, templateParams: !465, identifier: "1112dc114285b1b0ff7e96da14858771")
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !708, file: !2, baseType: !9, size: 64, align: 64)
!711 = !{!712}
!712 = !DILocalVariable(name: "ptr", arg: 1, scope: !700, file: !218, line: 2537, type: !703)
!713 = !{!714}
!714 = !DITemplateTypeParameter(name: "T", type: !704)
!715 = !DILocation(line: 2537, column: 42, scope: !700)
!716 = !DILocation(line: 2538, column: 6, scope: !700)
!717 = !DILocation(line: 2538, column: 5, scope: !700)
!718 = !DILocation(line: 2538, column: 23, scope: !700)
!719 = !DILocation(line: 2539, column: 2, scope: !700)
!720 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hc0b066e775af0993E", scope: !509, file: !218, line: 2543, type: !721, scopeLine: 2543, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!401, !9}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "len", arg: 1, scope: !720, file: !218, line: 2543, type: !9)
!725 = !DILocalVariable(name: "max_len", scope: !726, file: !218, line: 2544, type: !9, align: 8)
!726 = distinct !DILexicalBlock(scope: !720, file: !218, line: 2544, column: 5)
!727 = !DILocation(line: 2544, column: 9, scope: !726)
!728 = !DILocation(line: 2543, column: 43, scope: !720)
!729 = !DILocation(line: 2548, column: 5, scope: !726)
!730 = !DILocation(line: 2549, column: 2, scope: !720)
!731 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h3e8e1c65f736c496E", scope: !509, file: !218, line: 2746, type: !616, scopeLine: 2746, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !732)
!732 = !{!733, !734, !735}
!733 = !DILocalVariable(name: "src", arg: 1, scope: !731, file: !218, line: 2746, type: !565)
!734 = !DILocalVariable(name: "dst", arg: 2, scope: !731, file: !218, line: 2746, type: !618)
!735 = !DILocalVariable(name: "count", arg: 3, scope: !731, file: !218, line: 2746, type: !9)
!736 = !DILocation(line: 2746, column: 29, scope: !731)
!737 = !DILocation(line: 2746, column: 44, scope: !731)
!738 = !DILocation(line: 2746, column: 57, scope: !731)
!739 = !DILocation(line: 2755, column: 9, scope: !731)
!740 = !DILocation(line: 2760, column: 9, scope: !731)
!741 = !DILocation(line: 2762, column: 2, scope: !731)
!742 = !DILocalVariable(name: "src", arg: 1, scope: !743, file: !218, line: 2517, type: !565)
!743 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17h655fbc99ebdf040dE", scope: !744, file: !218, line: 2517, type: !745, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !747)
!744 = !DINamespace(name: "copy", scope: !509)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !565, !618}
!747 = !{!742, !748}
!748 = !DILocalVariable(name: "dst", arg: 2, scope: !743, file: !218, line: 2517, type: !618)
!749 = !DILocation(line: 2517, column: 39, scope: !743, inlinedAt: !750)
!750 = distinct !DILocation(line: 2755, column: 9, scope: !731)
!751 = !DILocation(line: 2758, column: 13, scope: !743, inlinedAt: !750)
!752 = !DILocation(line: 2758, column: 45, scope: !743, inlinedAt: !750)
!753 = !DILocation(line: 2518, column: 20, scope: !743, inlinedAt: !750)
!754 = !DILocation(line: 2520, column: 21, scope: !743, inlinedAt: !750)
!755 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17h6077bdcf76790159E", scope: !509, file: !218, line: 2746, type: !643, scopeLine: 2746, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !756)
!756 = !{!757, !758, !759}
!757 = !DILocalVariable(name: "src", arg: 1, scope: !755, file: !218, line: 2746, type: !207)
!758 = !DILocalVariable(name: "dst", arg: 2, scope: !755, file: !218, line: 2746, type: !261)
!759 = !DILocalVariable(name: "count", arg: 3, scope: !755, file: !218, line: 2746, type: !9)
!760 = !DILocation(line: 2746, column: 29, scope: !755)
!761 = !DILocation(line: 2746, column: 44, scope: !755)
!762 = !DILocation(line: 2746, column: 57, scope: !755)
!763 = !DILocation(line: 2755, column: 9, scope: !755)
!764 = !DILocation(line: 2760, column: 9, scope: !755)
!765 = !DILocation(line: 2762, column: 2, scope: !755)
!766 = !DILocalVariable(name: "src", arg: 1, scope: !767, file: !218, line: 2517, type: !207)
!767 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17h7396b1ace4cfa01bE", scope: !744, file: !218, line: 2517, type: !768, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !770)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !207, !261}
!770 = !{!766, !771}
!771 = !DILocalVariable(name: "dst", arg: 2, scope: !767, file: !218, line: 2517, type: !261)
!772 = !DILocation(line: 2517, column: 39, scope: !767, inlinedAt: !773)
!773 = distinct !DILocation(line: 2755, column: 9, scope: !755)
!774 = !DILocation(line: 2758, column: 13, scope: !767, inlinedAt: !773)
!775 = !DILocation(line: 2758, column: 45, scope: !767, inlinedAt: !773)
!776 = !DILocation(line: 2518, column: 20, scope: !767, inlinedAt: !773)
!777 = !DILocation(line: 2520, column: 21, scope: !767, inlinedAt: !773)
!778 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17hc5dbf38d3fae6ffaE", scope: !780, file: !779, line: 1375, type: !782, scopeLine: 1375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !784)
!779 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "e53eeb584156365c2c500b4010ad6081")
!780 = !DINamespace(name: "{impl#63}", scope: !781)
!781 = !DINamespace(name: "impls", scope: !149)
!782 = !DISubroutineType(types: !783)
!783 = !{!148, !132, !132}
!784 = !{!785, !786}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !778, file: !779, line: 1375, type: !132)
!786 = !DILocalVariable(name: "other", arg: 2, scope: !778, file: !779, line: 1375, type: !132)
!787 = !DILocation(line: 1375, column: 24, scope: !778)
!788 = !DILocation(line: 1375, column: 31, scope: !778)
!789 = !DILocation(line: 1378, column: 24, scope: !778)
!790 = !DILocation(line: 1378, column: 32, scope: !778)
!791 = !DILocation(line: 1379, column: 29, scope: !778)
!792 = !DILocation(line: 1379, column: 38, scope: !778)
!793 = !DILocation(line: 1378, column: 41, scope: !778)
!794 = !DILocation(line: 1378, column: 21, scope: !778)
!795 = !DILocation(line: 1381, column: 18, scope: !778)
!796 = !{i8 -1, i8 2}
!797 = !DILocation(line: 1380, column: 28, scope: !778)
!798 = !DILocation(line: 1379, column: 26, scope: !778)
!799 = !DILocation(line: 1379, column: 47, scope: !778)
!800 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17ha641c5a6c48c5a08E", scope: !802, file: !801, line: 189, type: !804, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !806)
!801 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "3143de71d5ad70ee2e53269932cc8053")
!802 = !DINamespace(name: "{impl#86}", scope: !803)
!803 = !DINamespace(name: "num", scope: !141)
!804 = !DISubroutineType(types: !805)
!805 = !{!431, !85, !450}
!806 = !{!807, !808}
!807 = !DILocalVariable(name: "self", arg: 1, scope: !800, file: !801, line: 189, type: !85)
!808 = !DILocalVariable(name: "f", arg: 2, scope: !800, file: !801, line: 189, type: !450)
!809 = !DILocation(line: 189, column: 20, scope: !800)
!810 = !DILocation(line: 189, column: 27, scope: !800)
!811 = !DILocation(line: 190, column: 20, scope: !800)
!812 = !DILocation(line: 192, column: 27, scope: !800)
!813 = !DILocation(line: 191, column: 21, scope: !800)
!814 = !DILocation(line: 197, column: 14, scope: !800)
!815 = !DILocation(line: 195, column: 21, scope: !800)
!816 = !DILocation(line: 193, column: 21, scope: !800)
!817 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17h4f92344c1f7e8a62E", scope: !818, file: !801, line: 189, type: !819, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !821)
!818 = !DINamespace(name: "{impl#87}", scope: !803)
!819 = !DISubroutineType(types: !820)
!820 = !{!431, !132, !450}
!821 = !{!822, !823}
!822 = !DILocalVariable(name: "self", arg: 1, scope: !817, file: !801, line: 189, type: !132)
!823 = !DILocalVariable(name: "f", arg: 2, scope: !817, file: !801, line: 189, type: !450)
!824 = !DILocation(line: 189, column: 20, scope: !817)
!825 = !DILocation(line: 189, column: 27, scope: !817)
!826 = !DILocation(line: 190, column: 20, scope: !817)
!827 = !DILocation(line: 192, column: 27, scope: !817)
!828 = !DILocation(line: 191, column: 21, scope: !817)
!829 = !DILocation(line: 197, column: 14, scope: !817)
!830 = !DILocation(line: 195, column: 21, scope: !817)
!831 = !DILocation(line: 193, column: 21, scope: !817)
!832 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h6e0b94c7d1d04dadE", scope: !834, file: !833, line: 627, type: !843, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !861, declaration: !860, retainedNodes: !864)
!833 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "01cd6fe38fc23dc71fabb47473394cb8")
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !835, file: !2, size: 128, align: 64, elements: !836, templateParams: !24, identifier: "d55b5ab40978336d510405748b0b49f9")
!835 = !DINamespace(name: "builders", scope: !141)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !834, file: !2, baseType: !838, size: 128, align: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !835, file: !2, size: 128, align: 64, elements: !839, templateParams: !24, identifier: "18b5404db7960e388a86b59ea9760fa")
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !838, file: !2, baseType: !450, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !838, file: !2, baseType: !431, size: 8, align: 8, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !838, file: !2, baseType: !401, size: 8, align: 8, offset: 72)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !845, !846}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !834, size: 64, align: 64, dwarfAddressSpace: 0)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !847, file: !2, size: 128, align: 64, elements: !848, templateParams: !189, identifier: "cd3b660072f450e39a2e847ea94a5107")
!847 = !DINamespace(name: "iter", scope: !166)
!848 = !{!849, !854, !855}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !846, file: !2, baseType: !850, size: 64, align: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !851, file: !2, size: 64, align: 64, elements: !852, templateParams: !189, identifier: "2335480a42d4284e8e2982305f44126d")
!851 = !DINamespace(name: "non_null", scope: !204)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !850, file: !2, baseType: !207, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !846, file: !2, baseType: !207, size: 64, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !846, file: !2, baseType: !856, align: 8)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !857, file: !2, align: 8, elements: !24, templateParams: !858, identifier: "d4137ba2763d08b68bdc9f0924969d53")
!857 = !DINamespace(name: "marker", scope: !142)
!858 = !{!859}
!859 = !DITemplateTypeParameter(name: "T", type: !12)
!860 = !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h6e0b94c7d1d04dadE", scope: !834, file: !833, line: 627, type: !843, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !861)
!861 = !{!862, !863}
!862 = !DITemplateTypeParameter(name: "D", type: !12)
!863 = !DITemplateTypeParameter(name: "I", type: !846)
!864 = !{!865, !866, !867, !869}
!865 = !DILocalVariable(name: "self", arg: 1, scope: !832, file: !833, line: 627, type: !845)
!866 = !DILocalVariable(name: "entries", arg: 2, scope: !832, file: !833, line: 627, type: !846)
!867 = !DILocalVariable(name: "iter", scope: !868, file: !833, line: 632, type: !846, align: 8)
!868 = distinct !DILexicalBlock(scope: !832, file: !833, line: 632, column: 9)
!869 = !DILocalVariable(name: "entry", scope: !870, file: !833, line: 632, type: !12, align: 8)
!870 = distinct !DILexicalBlock(scope: !868, file: !833, line: 632, column: 30)
!871 = !DILocation(line: 627, column: 26, scope: !832)
!872 = !DILocation(line: 627, column: 37, scope: !832)
!873 = !DILocation(line: 632, column: 22, scope: !868)
!874 = !DILocation(line: 632, column: 13, scope: !870)
!875 = !DILocation(line: 632, column: 22, scope: !832)
!876 = !DILocation(line: 632, column: 9, scope: !868)
!877 = !DILocation(line: 636, column: 6, scope: !832)
!878 = !DILocation(line: 632, column: 13, scope: !868)
!879 = !DILocation(line: 633, column: 13, scope: !870)
!880 = !DILocation(line: 634, column: 9, scope: !868)
!881 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17ha7dc9f46a2c1bbf8E", scope: !882, file: !427, line: 322, type: !948, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, declaration: !953, retainedNodes: !954)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !141, file: !2, size: 384, align: 64, elements: !883, templateParams: !24, identifier: "dec2eb544c6d114a1729e13a7474f40")
!883 = !{!884, !890, !932}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !882, file: !2, baseType: !885, size: 128, align: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !886, templateParams: !24, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!886 = !{!887, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !885, file: !2, baseType: !888, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !885, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !882, file: !2, baseType: !891, size: 128, align: 64, offset: 256)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !459, file: !2, size: 128, align: 64, elements: !892, templateParams: !24, identifier: "e23d17d3304655e6750a0ab2d9edac39")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_variant_part, scope: !891, file: !2, size: 128, align: 64, elements: !894, templateParams: !24, identifier: "bfd27e88b87b0ba5cd311f4e2a12036c", discriminator: !931)
!894 = !{!895, !927}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !893, file: !2, baseType: !896, size: 128, align: 64, extraData: i64 0)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !891, file: !2, size: 128, align: 64, elements: !24, templateParams: !897, identifier: "5aee93d5724874e8d5fc1e09008d60ef")
!897 = !{!898}
!898 = !DITemplateTypeParameter(name: "T", type: !899)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !900, templateParams: !24, identifier: "5c2bff1ce87945dcf46beabe124a8ecc")
!900 = !{!901, !926}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !899, file: !2, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64, dwarfAddressSpace: 0)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !140, file: !2, size: 448, align: 64, elements: !904, templateParams: !24, identifier: "131f69b9dc640c7b405d0c75880ec09c")
!904 = !{!905, !906, !907, !908, !909, !925}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !903, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !903, file: !2, baseType: !455, size: 32, align: 32, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !903, file: !2, baseType: !139, size: 8, align: 8, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !2, baseType: !27, size: 32, align: 32, offset: 352)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !903, file: !2, baseType: !910, size: 128, align: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !911, templateParams: !24, identifier: "de49f2e711729c26a3183f82a67e820b")
!911 = !{!912}
!912 = !DICompositeType(tag: DW_TAG_variant_part, scope: !910, file: !2, size: 128, align: 64, elements: !913, templateParams: !24, identifier: "f8aee855d501562836c2bde1eded98b", discriminator: !924)
!913 = !{!914, !918, !922}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !912, file: !2, baseType: !915, size: 128, align: 64, extraData: i64 0)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !910, file: !2, size: 128, align: 64, elements: !916, templateParams: !24, identifier: "ddb8199c8dc12775d50d3067915f0ee1")
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !915, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !912, file: !2, baseType: !919, size: 128, align: 64, extraData: i64 1)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !910, file: !2, size: 128, align: 64, elements: !920, templateParams: !24, identifier: "a474205d0b1ebc8668aca1dd185e6dd8")
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !919, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !912, file: !2, baseType: !923, size: 128, align: 64, extraData: i64 2)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !910, file: !2, size: 128, align: 64, elements: !24, identifier: "78259875ca0457d6d843b6907f3ee2cd")
!924 = !DIDerivedType(tag: DW_TAG_member, scope: !910, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !903, file: !2, baseType: !910, size: 128, align: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !899, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !893, file: !2, baseType: !928, size: 128, align: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !891, file: !2, size: 128, align: 64, elements: !929, templateParams: !897, identifier: "651380f2d7c231ae75361478798df683")
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !928, file: !2, baseType: !899, size: 128, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, scope: !891, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !882, file: !2, baseType: !933, size: 128, align: 64, offset: 128)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !934, templateParams: !24, identifier: "7aaa4600b8b1bb5ceecb4befe265d8a8")
!934 = !{!935, !947}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !933, file: !2, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64, dwarfAddressSpace: 0)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 128, align: 64, elements: !938, templateParams: !24, identifier: "1715f8ca39c24c1465154510b099d5db")
!938 = !{!939, !943}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !937, file: !2, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !941, size: 64, align: 64, dwarfAddressSpace: 0)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !942, file: !2, align: 8, elements: !24, identifier: "b53b9c37284ad14843698905c0a781ef")
!942 = !DINamespace(name: "{extern#0}", scope: !140)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !937, file: !2, baseType: !944, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !945, size: 64, align: 64, dwarfAddressSpace: 0)
!945 = !DISubroutineType(types: !946)
!946 = !{!431, !940, !450}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !933, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!882, !885, !933, !899, !950}
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !140, file: !2, align: 8, elements: !951, templateParams: !24, identifier: "351ac13b590d5d24af48663f31ffb4eb")
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !950, file: !2, baseType: !7, align: 8)
!953 = !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17ha7dc9f46a2c1bbf8E", scope: !882, file: !427, line: 322, type: !948, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !24)
!954 = !{!955, !956, !957, !958, !959}
!955 = !DILocalVariable(name: "pieces", arg: 1, scope: !881, file: !427, line: 323, type: !885)
!956 = !DILocalVariable(name: "args", arg: 2, scope: !881, file: !427, line: 324, type: !933)
!957 = !DILocalVariable(name: "fmt", arg: 3, scope: !881, file: !427, line: 325, type: !899)
!958 = !DILocalVariable(name: "_unsafe_arg", scope: !881, file: !427, line: 326, type: !950, align: 1)
!959 = !DILocalVariable(arg: 4, scope: !881, file: !427, line: 326, type: !950)
!960 = !DILocation(line: 326, column: 9, scope: !881)
!961 = !DILocation(line: 323, column: 9, scope: !881)
!962 = !DILocation(line: 324, column: 9, scope: !881)
!963 = !DILocation(line: 325, column: 9, scope: !881)
!964 = !DILocation(line: 328, column: 34, scope: !881)
!965 = !DILocation(line: 328, column: 9, scope: !881)
!966 = !DILocation(line: 329, column: 6, scope: !881)
!967 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hd805826023b59a70E", scope: !882, file: !427, line: 307, type: !968, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, declaration: !970, retainedNodes: !971)
!968 = !DISubroutineType(types: !969)
!969 = !{!882, !885, !933}
!970 = !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hd805826023b59a70E", scope: !882, file: !427, line: 307, type: !968, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !24)
!971 = !{!972, !973}
!972 = !DILocalVariable(name: "pieces", arg: 1, scope: !967, file: !427, line: 307, type: !885)
!973 = !DILocalVariable(name: "args", arg: 2, scope: !967, file: !427, line: 307, type: !933)
!974 = !DILocation(line: 307, column: 19, scope: !967)
!975 = !DILocation(line: 307, column: 47, scope: !967)
!976 = !DILocation(line: 308, column: 12, scope: !967)
!977 = !DILocation(line: 308, column: 56, scope: !967)
!978 = !DILocation(line: 308, column: 41, scope: !967)
!979 = !DILocation(line: 311, column: 34, scope: !967)
!980 = !DILocation(line: 311, column: 9, scope: !967)
!981 = !DILocation(line: 312, column: 6, scope: !967)
!982 = !DILocation(line: 309, column: 13, scope: !967)
!983 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h3df1cca92c3d59d6E", scope: !882, file: !427, line: 297, type: !984, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, declaration: !986, retainedNodes: !987)
!984 = !DISubroutineType(types: !985)
!985 = !{!882, !885}
!986 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h3df1cca92c3d59d6E", scope: !882, file: !427, line: 297, type: !984, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !24)
!987 = !{!988}
!988 = !DILocalVariable(name: "pieces", arg: 1, scope: !983, file: !427, line: 297, type: !885)
!989 = !DILocation(line: 297, column: 28, scope: !983)
!990 = !DILocation(line: 298, column: 12, scope: !983)
!991 = !DILocation(line: 301, column: 34, scope: !983)
!992 = !DILocation(line: 301, column: 9, scope: !983)
!993 = !DILocation(line: 302, column: 6, scope: !983)
!994 = !DILocation(line: 299, column: 13, scope: !983)
!995 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<u8>>", linkageName: "_ZN4core3mem11swap_simple17h2040f8deaa3606bbE", scope: !673, file: !996, line: 763, type: !997, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !1016, retainedNodes: !1009)
!996 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5e64a1abf54d04a4d014caa1e380bedd")
!997 = !DISubroutineType(types: !998)
!998 = !{null, !999, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<u8>", baseType: !1000, size: 64, align: 64, dwarfAddressSpace: 0)
!1000 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u8>", scope: !672, file: !2, size: 8, align: 8, elements: !1001, templateParams: !1007, identifier: "f77eabb37c58fb3b469f2a91053cb4ab")
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1000, file: !2, baseType: !7, align: 8)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1000, file: !2, baseType: !1004, size: 8, align: 8)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u8>", scope: !678, file: !2, size: 8, align: 8, elements: !1005, templateParams: !1007, identifier: "6e6c6cd2c57dffd59a79a6cd1cbea258")
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1004, file: !2, baseType: !123, size: 8, align: 8)
!1007 = !{!1008}
!1008 = !DITemplateTypeParameter(name: "T", type: !123)
!1009 = !{!1010, !1011, !1012, !1014}
!1010 = !DILocalVariable(name: "x", arg: 1, scope: !995, file: !996, line: 763, type: !999)
!1011 = !DILocalVariable(name: "y", arg: 2, scope: !995, file: !996, line: 763, type: !999)
!1012 = !DILocalVariable(name: "a", scope: !1013, file: !996, line: 780, type: !1000, align: 1)
!1013 = distinct !DILexicalBlock(scope: !995, file: !996, line: 780, column: 9)
!1014 = !DILocalVariable(name: "b", scope: !1015, file: !996, line: 781, type: !1000, align: 1)
!1015 = distinct !DILexicalBlock(scope: !1013, file: !996, line: 781, column: 9)
!1016 = !{!1017}
!1017 = !DITemplateTypeParameter(name: "T", type: !1000)
!1018 = !DILocation(line: 763, column: 36, scope: !995)
!1019 = !DILocation(line: 763, column: 47, scope: !995)
!1020 = !DILocation(line: 780, column: 17, scope: !995)
!1021 = !DILocation(line: 780, column: 13, scope: !1013)
!1022 = !DILocation(line: 781, column: 17, scope: !1013)
!1023 = !DILocation(line: 781, column: 13, scope: !1015)
!1024 = !DILocation(line: 782, column: 9, scope: !1015)
!1025 = !DILocation(line: 783, column: 9, scope: !1015)
!1026 = !DILocation(line: 785, column: 2, scope: !995)
!1027 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17h25eaebc9d9b1d20dE", scope: !673, file: !996, line: 763, type: !1028, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !1031)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !1030, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!1031 = !{!1032, !1033, !1034, !1036}
!1032 = !DILocalVariable(name: "x", arg: 1, scope: !1027, file: !996, line: 763, type: !1030)
!1033 = !DILocalVariable(name: "y", arg: 2, scope: !1027, file: !996, line: 763, type: !1030)
!1034 = !DILocalVariable(name: "a", scope: !1035, file: !996, line: 780, type: !13, align: 8)
!1035 = distinct !DILexicalBlock(scope: !1027, file: !996, line: 780, column: 9)
