; ModuleID = 'bootloader_api.6f2a0f405c298975-cgu.0'
source_filename = "bootloader_api.6f2a0f405c298975-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<config::BootloaderConfig, &str>" = type { i64, [22 x i64] }
%"core::result::Result<config::BootloaderConfig, &str>::Err" = type { [1 x i64], { ptr, i64 } }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::ptr::metadata::PtrRepr<[info::MemoryRegion]>" = type { [2 x i64] }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, &str>, config::Mapping>" = type { i64, [2 x i64] }
%"core::result::Result<config::Mapping, &str>::Ok" = type { [1 x i64], { i64, i64 } }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, &str>, config::Mapping>::Continue" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<config::Mapping, &str>::Err" = type { [1 x i64], { ptr, i64 } }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, &str>, config::Mapping>::Break" = type { [1 x i64], { ptr, i64 } }
%"config::BootloaderConfig" = type { %"config::Mappings", %"config::FrameBuffer", %"config::ApiVersion", i64 }
%"config::Mappings" = type { { i64, i64 }, { i64, i64 }, { i64, i64 }, { i64, i64 }, { i64, i64 }, { i64, i64 }, { i64, i64 }, { i64, i64 }, i8, [7 x i8] }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.77.0-nightly (bf8716f1c 2023-12-24)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.77.0-nightly (bf8716f1c 2023-12-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader_api-0.11.4/src/lib.rs/@/bootloader_api.6f2a0f405c298975-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader_api-0.11.4")
!6 = !{!7}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = distinct !DISubprogram(name: "from_residual<bootloader_api::config::BootloaderConfig, &str, &str>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h99dfa9e46c726f52E", scope: !20, file: !19, line: 1957, type: !22, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !148, retainedNodes: !144)
!19 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!20 = !DINamespace(name: "{impl#27}", scope: !21)
!21 = !DINamespace(name: "result", scope: !11)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !117, !135}
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bootloader_api::config::BootloaderConfig, &str>", scope: !21, file: !8, size: 1472, align: 64, flags: DIFlagPublic, elements: !25, templateParams: !45, identifier: "95b49f12f01f2063ada440e2fd7f8696")
!25 = !{!26}
!26 = !DICompositeType(tag: DW_TAG_variant_part, scope: !24, file: !8, size: 1472, align: 64, elements: !27, templateParams: !45, identifier: "b35cf71746d1403dd0f070f43d523749", discriminator: !116)
!27 = !{!28, !112}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !26, file: !8, baseType: !29, size: 1472, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !24, file: !8, size: 1472, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !103, identifier: "cbfd338bfa7c7c15198212397daaa0d5")
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !29, file: !8, baseType: !32, size: 1472, align: 64, flags: DIFlagPublic)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "BootloaderConfig", scope: !33, file: !8, size: 1472, align: 64, flags: DIFlagPublic, elements: !35, templateParams: !45, identifier: "ef4ca09e80c586ec98eeb3b7b09ac538")
!33 = !DINamespace(name: "config", scope: !34)
!34 = !DINamespace(name: "bootloader_api", scope: null)
!35 = !{!36, !46, !97, !98}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !32, file: !8, baseType: !37, size: 64, align: 16, offset: 1344, flags: DIFlagProtected)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ApiVersion", scope: !33, file: !8, size: 64, align: 16, flags: DIFlagPublic, elements: !38, templateParams: !45, identifier: "4c10eee44f73fc4d1d9c76e9524dda64")
!38 = !{!39, !41, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !37, file: !8, baseType: !40, size: 16, align: 16, flags: DIFlagPrivate)
!40 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !37, file: !8, baseType: !40, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "version_patch", scope: !37, file: !8, baseType: !40, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pre_release", scope: !37, file: !8, baseType: !44, size: 8, align: 8, offset: 48, flags: DIFlagPrivate)
!44 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!45 = !{}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !32, file: !8, baseType: !47, size: 1088, align: 64, flags: DIFlagPublic)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mappings", scope: !33, file: !8, size: 1088, align: 64, flags: DIFlagPublic, elements: !48, templateParams: !45, identifier: "cd93ac2ad5543b69cd0be3a8c644ea5")
!48 = !{!49, !62, !63, !64, !79, !80, !81, !95, !96}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack", scope: !47, file: !8, baseType: !50, size: 128, align: 64, flags: DIFlagPublic)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mapping", scope: !33, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !51, templateParams: !45, identifier: "15400682089b6d5e4366f96081ff1c81")
!51 = !{!52}
!52 = !DICompositeType(tag: DW_TAG_variant_part, scope: !50, file: !8, size: 128, align: 64, elements: !53, templateParams: !45, identifier: "129fbcde069f913f7f8aba19913f4198", discriminator: !61)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Dynamic", scope: !52, file: !8, baseType: !55, size: 128, align: 64, extraData: i128 0)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dynamic", scope: !50, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, identifier: "f8a17b7d14b8d5aa444c06717c5b75df")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "FixedAddress", scope: !52, file: !8, baseType: !57, size: 128, align: 64, extraData: i128 1)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedAddress", scope: !50, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !58, templateParams: !45, identifier: "80bd2ee9c5fb7eae5995e3179735c3ca")
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !57, file: !8, baseType: !60, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!60 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, scope: !50, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !47, file: !8, baseType: !50, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "framebuffer", scope: !47, file: !8, baseType: !50, size: 128, align: 64, offset: 256, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "physical_memory", scope: !47, file: !8, baseType: !65, size: 128, align: 64, offset: 768, flags: DIFlagPublic)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bootloader_api::config::Mapping>", scope: !66, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !45, identifier: "c21e7833b653497c5c59962fa783002")
!66 = !DINamespace(name: "option", scope: !11)
!67 = !{!68}
!68 = !DICompositeType(tag: DW_TAG_variant_part, scope: !65, file: !8, size: 128, align: 64, elements: !69, templateParams: !45, identifier: "2b33be685cc22f6ead896f0ab174752", discriminator: !78)
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !68, file: !8, baseType: !71, size: 128, align: 64, extraData: i128 2)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !65, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !72, identifier: "65f56860aa873f3840e32b4582ca2b1c")
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !50)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !68, file: !8, baseType: !75, size: 128, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !65, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !76, templateParams: !72, identifier: "53b27c6d550f244d40dddecfcd8f5671")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !75, file: !8, baseType: !50, size: 128, align: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !65, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_recursive", scope: !47, file: !8, baseType: !65, size: 128, align: 64, offset: 896, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "aslr", scope: !47, file: !8, baseType: !44, size: 8, align: 8, offset: 1024, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_start", scope: !47, file: !8, baseType: !82, size: 128, align: 64, offset: 384, flags: DIFlagPublic)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !66, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !83, templateParams: !45, identifier: "6f1696d18d23d47c69b222f2f35e16b5")
!83 = !{!84}
!84 = !DICompositeType(tag: DW_TAG_variant_part, scope: !82, file: !8, size: 128, align: 64, elements: !85, templateParams: !45, identifier: "73e7139f007f4e6023be7ef6d253e356", discriminator: !94)
!85 = !{!86, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !84, file: !8, baseType: !87, size: 128, align: 64, extraData: i128 0)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !82, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !88, identifier: "e506bb47389de31fa5a35e49f43ba94d")
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !60)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !84, file: !8, baseType: !91, size: 128, align: 64, extraData: i128 1)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !82, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !92, templateParams: !88, identifier: "7e2f1f2d455f3cb646237311fb922a41")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !91, file: !8, baseType: !60, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !82, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_end", scope: !47, file: !8, baseType: !82, size: 128, align: 64, offset: 512, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ramdisk_memory", scope: !47, file: !8, baseType: !50, size: 128, align: 64, offset: 640, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack_size", scope: !32, file: !8, baseType: !60, size: 64, align: 64, offset: 1408, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "frame_buffer", scope: !32, file: !8, baseType: !99, size: 256, align: 64, offset: 1088, flags: DIFlagPublic)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", scope: !33, file: !8, size: 256, align: 64, flags: DIFlagPublic, elements: !100, templateParams: !45, identifier: "ba041c0ed06e2f29227e1fe37007da3b")
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_height", scope: !99, file: !8, baseType: !82, size: 128, align: 64, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_width", scope: !99, file: !8, baseType: !82, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!103 = !{!104, !105}
!104 = !DITemplateTypeParameter(name: "T", type: !32)
!105 = !DITemplateTypeParameter(name: "E", type: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !107, templateParams: !45, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!107 = !{!108, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !106, file: !8, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !106, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !26, file: !8, baseType: !113, size: 1472, align: 64, extraData: i128 2)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !24, file: !8, size: 1472, align: 64, flags: DIFlagPublic, elements: !114, templateParams: !103, identifier: "740d01fa2ca75eb1116cdaec0ab93d76")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !8, baseType: !106, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, &str>", scope: !21, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !118, templateParams: !45, identifier: "df400de2cac42c13f8b5d9b97e28ea3a")
!118 = !{!119}
!119 = !DICompositeType(tag: DW_TAG_variant_part, scope: !117, file: !8, size: 128, align: 64, elements: !120, templateParams: !45, identifier: "924af762f13e2a10997b61d87c5e0319")
!120 = !{!121, !131}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !119, file: !8, baseType: !122, size: 128, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !117, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !123, templateParams: !129, identifier: "50daccbc07eb0a80afb2517c89389008")
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !8, baseType: !125, align: 8, flags: DIFlagPublic)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !126, file: !8, align: 8, flags: DIFlagPublic, elements: !127, templateParams: !45, identifier: "245f21ff7a9b6927717507d68e4319cb")
!126 = !DINamespace(name: "convert", scope: !11)
!127 = !{!128}
!128 = !DICompositeType(tag: DW_TAG_variant_part, scope: !125, file: !8, align: 8, elements: !45, identifier: "687d5cf5e4af6afdd42501ce35a0d623")
!129 = !{!130, !105}
!130 = !DITemplateTypeParameter(name: "T", type: !125)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !119, file: !8, baseType: !132, size: 128, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !117, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !133, templateParams: !129, identifier: "c0a5c1e72e91798d4110fe3fff56a32c")
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !132, file: !8, baseType: !106, size: 128, align: 64, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !137, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !139, templateParams: !45, identifier: "a313c32de3a8c9bc539767ad1b1d23fa")
!137 = !DINamespace(name: "location", scope: !138)
!138 = !DINamespace(name: "panic", scope: !11)
!139 = !{!140, !141, !143}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !136, file: !8, baseType: !106, size: 128, align: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !136, file: !8, baseType: !142, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!142 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !136, file: !8, baseType: !142, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!144 = !{!145, !146}
!145 = !DILocalVariable(name: "residual", arg: 1, scope: !18, file: !19, line: 1957, type: !117)
!146 = !DILocalVariable(name: "e", scope: !147, file: !19, line: 1959, type: !106, align: 8)
!147 = distinct !DILexicalBlock(scope: !18, file: !19, line: 1959, column: 13)
!148 = !{!104, !105, !149}
!149 = !DITemplateTypeParameter(name: "F", type: !106)
!150 = !DILocation(line: 1957, column: 22, scope: !18)
!151 = !DILocation(line: 1959, column: 17, scope: !18)
!152 = !{i64 1}
!153 = !DILocation(line: 1959, column: 17, scope: !147)
!154 = !DILocalVariable(name: "t", arg: 1, scope: !155, file: !156, line: 766, type: !106)
!155 = distinct !DISubprogram(name: "from<&str>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h725d60e7dba001fbE", scope: !157, file: !156, line: 766, type: !158, scopeLine: 766, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !161, retainedNodes: !160)
!156 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "42846d055f67fc97bf276e58c4167411")
!157 = !DINamespace(name: "{impl#4}", scope: !126)
!158 = !DISubroutineType(types: !159)
!159 = !{!106, !106}
!160 = !{!154}
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "T", type: !106)
!163 = !DILocation(line: 766, column: 13, scope: !155, inlinedAt: !164)
!164 = distinct !DILocation(line: 1959, column: 27, scope: !147)
!165 = !DILocation(line: 768, column: 6, scope: !155, inlinedAt: !164)
!166 = !DILocation(line: 1959, column: 27, scope: !147)
!167 = !DILocation(line: 1959, column: 23, scope: !147)
!168 = !DILocation(line: 1961, column: 6, scope: !18)
!169 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h574f0f53d7e7e06dE", scope: !171, file: !170, line: 2563, type: !172, scopeLine: 2563, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !198)
!170 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "cce44e2a04c587bcf8c6286ed2962b67")
!171 = !DINamespace(name: "intrinsics", scope: !11)
!172 = !DISubroutineType(types: !173)
!173 = !{!44, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader_api::info::MemoryRegion", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !176, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !177, templateParams: !45, identifier: "6a95af5cd8e2361ffdc362e62719f38")
!176 = !DINamespace(name: "info", scope: !34)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagPublic)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !8, baseType: !60, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !175, file: !8, baseType: !181, size: 64, align: 32, offset: 128, flags: DIFlagPublic)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionKind", scope: !176, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !182, templateParams: !45, identifier: "d9c9d656d80323edba7f17f4117d762f")
!182 = !{!183}
!183 = !DICompositeType(tag: DW_TAG_variant_part, scope: !181, file: !8, size: 64, align: 32, elements: !184, templateParams: !45, identifier: "9079b08bf9183ef57593f74c295ad38c", discriminator: !197)
!184 = !{!185, !187, !189, !193}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Usable", scope: !183, file: !8, baseType: !186, size: 64, align: 32, extraData: i128 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Usable", scope: !181, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !45, identifier: "e5b89fc2300996d1dda91dd6719af3c5")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Bootloader", scope: !183, file: !8, baseType: !188, size: 64, align: 32, extraData: i128 1)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bootloader", scope: !181, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !45, identifier: "8f9ad0f3c9ad9bd014d288cc3df16df5")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownUefi", scope: !183, file: !8, baseType: !190, size: 64, align: 32, extraData: i128 2)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnknownUefi", scope: !181, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !191, templateParams: !45, identifier: "850567b95c1e13574ffb6f954aaa6bfa")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !190, file: !8, baseType: !142, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownBios", scope: !183, file: !8, baseType: !194, size: 64, align: 32, extraData: i128 3)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnknownBios", scope: !181, file: !8, size: 64, align: 32, flags: DIFlagPublic, elements: !195, templateParams: !45, identifier: "3246db8f5252f0602ba2468c33b87355")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !8, baseType: !142, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !8, baseType: !142, size: 32, align: 32, flags: DIFlagArtificial)
!198 = !{!199}
!199 = !DILocalVariable(name: "ptr", arg: 1, scope: !169, file: !170, line: 2563, type: !174)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "T", type: !175)
!202 = !DILocation(line: 2563, column: 42, scope: !169)
!203 = !DILocation(line: 2564, column: 6, scope: !169)
!204 = !DILocation(line: 2564, column: 23, scope: !169)
!205 = !DILocation(line: 2564, column: 5, scope: !169)
!206 = !DILocation(line: 2565, column: 2, scope: !169)
!207 = !{i8 0, i8 2}
!208 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hcf341c7f824d289eE", scope: !171, file: !170, line: 2570, type: !209, scopeLine: 2570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{!44, !111}
!211 = !{!212, !213}
!212 = !DILocalVariable(name: "len", arg: 1, scope: !208, file: !170, line: 2570, type: !111)
!213 = !DILocalVariable(name: "max_len", scope: !214, file: !170, line: 2571, type: !111, align: 8)
!214 = distinct !DILexicalBlock(scope: !208, file: !170, line: 2571, column: 5)
!215 = !DILocation(line: 2571, column: 9, scope: !214)
!216 = !DILocation(line: 2570, column: 43, scope: !208)
!217 = !DILocation(line: 2575, column: 5, scope: !214)
!218 = !DILocation(line: 2576, column: 2, scope: !208)
!219 = distinct !DISubprogram(name: "ne<[u8; 16], [u8; 16]>", linkageName: "_ZN4core3cmp5impls69_$LT$impl$u20$core..cmp..PartialEq$LT$$RF$B$GT$$u20$for$u20$$RF$A$GT$2ne17h05635c7132ae53a3E", scope: !221, file: !220, line: 1612, type: !224, scopeLine: 1612, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !234, retainedNodes: !231)
!220 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "4d64db01bbffb5cbf515cfb9e16bc0b9")
!221 = !DINamespace(name: "{impl#9}", scope: !222)
!222 = !DINamespace(name: "impls", scope: !223)
!223 = !DINamespace(name: "cmp", scope: !11)
!224 = !DISubroutineType(types: !225)
!225 = !{!44, !226, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[u8; 16]", baseType: !227, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 16]", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 16, lowerBound: 0)
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "self", arg: 1, scope: !219, file: !220, line: 1612, type: !226)
!233 = !DILocalVariable(name: "other", arg: 2, scope: !219, file: !220, line: 1612, type: !226)
!234 = !{!235, !236}
!235 = !DITemplateTypeParameter(name: "A", type: !228)
!236 = !DITemplateTypeParameter(name: "B", type: !228)
!237 = !DILocation(line: 1612, column: 15, scope: !219)
!238 = !DILocation(line: 1612, column: 22, scope: !219)
!239 = !DILocation(line: 1613, column: 27, scope: !219)
!240 = !DILocation(line: 1613, column: 34, scope: !219)
!241 = !DILocation(line: 1613, column: 13, scope: !219)
!242 = !DILocation(line: 1614, column: 10, scope: !219)
!243 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hc4125f673f952f70E", scope: !245, file: !244, line: 321, type: !362, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, declaration: !364, retainedNodes: !365)
!244 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !45, identifier: "5c0bf663e13aed18b42e27881fea807c")
!246 = !{!247, !253, !296}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !245, file: !8, baseType: !248, size: 128, align: 64, flags: DIFlagPrivate)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !249, templateParams: !45, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!249 = !{!250, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !248, file: !8, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !248, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !245, file: !8, baseType: !254, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !66, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !255, templateParams: !45, identifier: "256519899e0672ceeaebd48b858206cf")
!255 = !{!256}
!256 = !DICompositeType(tag: DW_TAG_variant_part, scope: !254, file: !8, size: 128, align: 64, elements: !257, templateParams: !45, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !295)
!257 = !{!258, !291}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !256, file: !8, baseType: !259, size: 128, align: 64, extraData: i128 0)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !254, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !260, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "T", type: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !263, templateParams: !45, identifier: "24318146e6c8bdc87822ff535a36a389")
!263 = !{!264, !290}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !262, file: !8, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, flags: DIFlagPublic, elements: !267, templateParams: !45, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!267 = !{!268, !269, !271, !272, !273, !289}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !266, file: !8, baseType: !111, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !266, file: !8, baseType: !270, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!270 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !266, file: !8, baseType: !7, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !8, baseType: !142, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !266, file: !8, baseType: !274, size: 128, align: 64, flags: DIFlagPublic)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !275, templateParams: !45, identifier: "96b697dd48c62362a4fdd24d145e624f")
!275 = !{!276}
!276 = !DICompositeType(tag: DW_TAG_variant_part, scope: !274, file: !8, size: 128, align: 64, elements: !277, templateParams: !45, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !288)
!277 = !{!278, !282, !286}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !276, file: !8, baseType: !279, size: 128, align: 64, extraData: i128 0)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !274, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !280, templateParams: !45, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !279, file: !8, baseType: !111, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !276, file: !8, baseType: !283, size: 128, align: 64, extraData: i128 1)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !274, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !284, templateParams: !45, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !283, file: !8, baseType: !111, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !276, file: !8, baseType: !287, size: 128, align: 64, extraData: i128 2)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !274, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, identifier: "a1add839f51aefefecdce3df6110b61f")
!288 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !266, file: !8, baseType: !274, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !262, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !256, file: !8, baseType: !292, size: 128, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !254, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !293, templateParams: !260, identifier: "f965b304662f282235bb5dc25f3fae0f")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !292, file: !8, baseType: !262, size: 128, align: 64, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !254, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !245, file: !8, baseType: !297, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !298, templateParams: !45, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!298 = !{!299, !361}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !297, file: !8, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64, dwarfAddressSpace: 0)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !302, templateParams: !45, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!302 = !{!303, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !8, baseType: !304, size: 64, align: 64, flags: DIFlagPrivate)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !305, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !306, file: !8, align: 8, elements: !45, identifier: "fffd88202d364d3dc6423c86977eda88")
!306 = !DINamespace(name: "{extern#0}", scope: !9)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !301, file: !8, baseType: !308, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !304, !329}
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !21, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !312, templateParams: !45, identifier: "27f960845886d02861ac4e7842c7e3a5")
!312 = !{!313}
!313 = !DICompositeType(tag: DW_TAG_variant_part, scope: !311, file: !8, size: 8, align: 8, elements: !314, templateParams: !45, identifier: "66d489f599415104a0443264f219183e", discriminator: !328)
!314 = !{!315, !324}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !313, file: !8, baseType: !316, size: 8, align: 8, extraData: i128 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !311, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !317, templateParams: !320, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !316, file: !8, baseType: !319, align: 8, offset: 8, flags: DIFlagPublic)
!319 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!320 = !{!321, !322}
!321 = !DITemplateTypeParameter(name: "T", type: !319)
!322 = !DITemplateTypeParameter(name: "E", type: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, flags: DIFlagPublic, elements: !45, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !313, file: !8, baseType: !325, size: 8, align: 8, extraData: i128 1)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !311, file: !8, size: 8, align: 8, flags: DIFlagPublic, elements: !326, templateParams: !320, identifier: "c5badd8093158a69d1e378abd358f888")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !325, file: !8, baseType: !323, align: 8, offset: 8, flags: DIFlagPublic)
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !311, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !330, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, flags: DIFlagPublic, elements: !331, templateParams: !45, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!331 = !{!332, !333, !334, !335, !349, !350}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !8, baseType: !142, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !330, file: !8, baseType: !270, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !330, file: !8, baseType: !7, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !330, file: !8, baseType: !336, size: 128, align: 64, flags: DIFlagPrivate)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !66, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !337, templateParams: !45, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!337 = !{!338}
!338 = !DICompositeType(tag: DW_TAG_variant_part, scope: !336, file: !8, size: 128, align: 64, elements: !339, templateParams: !45, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !348)
!339 = !{!340, !344}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !338, file: !8, baseType: !341, size: 128, align: 64, extraData: i128 0)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !336, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !342, identifier: "ae81ebe2a9866af8df117bed47adaee")
!342 = !{!343}
!343 = !DITemplateTypeParameter(name: "T", type: !111)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !338, file: !8, baseType: !345, size: 128, align: 64, extraData: i128 1)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !336, file: !8, size: 128, align: 64, flags: DIFlagPublic, elements: !346, templateParams: !342, identifier: "a581ef88bb755022340fa98600955727")
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !345, file: !8, baseType: !111, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!348 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !330, file: !8, baseType: !336, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !330, file: !8, baseType: !351, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !352, templateParams: !45, identifier: "6607f9b055c62ce71a6a286c8014df9")
!352 = !{!353, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !351, file: !8, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !45, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !351, file: !8, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !358, size: 64, align: 64, dwarfAddressSpace: 0)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 192, align: 64, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 3, lowerBound: 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !297, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!245, !248}
!364 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hc4125f673f952f70E", scope: !245, file: !244, line: 321, type: !362, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !45)
!365 = !{!366}
!366 = !DILocalVariable(name: "pieces", arg: 1, scope: !243, file: !244, line: 321, type: !248)
!367 = !DILocation(line: 321, column: 28, scope: !243)
!368 = !DILocation(line: 322, column: 12, scope: !243)
!369 = !DILocation(line: 325, column: 34, scope: !243)
!370 = !DILocation(line: 325, column: 9, scope: !243)
!371 = !{i64 8}
!372 = !DILocation(line: 326, column: 6, scope: !243)
!373 = !DILocation(line: 323, column: 13, scope: !243)
!374 = distinct !DISubprogram(name: "to_le_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$11to_le_bytes17h51299f91267ff49eE", scope: !376, file: !375, line: 2368, type: !378, scopeLine: 2368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !383)
!375 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "77985b69d8b96d3837a96dc7438f1392")
!376 = !DINamespace(name: "{impl#7}", scope: !377)
!377 = !DINamespace(name: "num", scope: !11)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !40}
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, align: 8, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 2, lowerBound: 0)
!383 = !{!384}
!384 = !DILocalVariable(name: "self", arg: 1, scope: !374, file: !375, line: 2368, type: !40)
!385 = !DILocation(line: 2368, column: 34, scope: !374)
!386 = !DILocalVariable(name: "self", arg: 1, scope: !387, file: !375, line: 430, type: !40)
!387 = distinct !DISubprogram(name: "to_le", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$5to_le17h2c7a630f843709bcE", scope: !376, file: !375, line: 430, type: !388, scopeLine: 430, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !390)
!388 = !DISubroutineType(types: !389)
!389 = !{!40, !40}
!390 = !{!386}
!391 = !DILocation(line: 430, column: 28, scope: !387, inlinedAt: !392)
!392 = distinct !DILocation(line: 2369, column: 13, scope: !374)
!393 = !DILocation(line: 2369, column: 13, scope: !374)
!394 = !DILocation(line: 2370, column: 10, scope: !374)
!395 = distinct !DISubprogram(name: "to_ne_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$11to_ne_bytes17hfd6f12fe87d36925E", scope: !376, file: !375, line: 2404, type: !378, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !396)
!396 = !{!397}
!397 = !DILocalVariable(name: "self", arg: 1, scope: !395, file: !375, line: 2404, type: !40)
!398 = !DILocation(line: 2404, column: 34, scope: !395)
!399 = !DILocation(line: 2407, column: 22, scope: !395)
!400 = !DILocation(line: 2408, column: 10, scope: !395)
!401 = distinct !DISubprogram(name: "from_le_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$13from_le_bytes17h2cd93ec8052d7516E", scope: !376, file: !375, line: 2464, type: !402, scopeLine: 2464, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!40, !380}
!404 = !{!405}
!405 = !DILocalVariable(name: "bytes", arg: 1, scope: !401, file: !375, line: 2464, type: !380)
!406 = !DILocation(line: 2464, column: 36, scope: !401)
!407 = !DILocation(line: 2465, column: 27, scope: !401)
!408 = !DILocalVariable(name: "x", arg: 1, scope: !409, file: !375, line: 362, type: !40)
!409 = distinct !DISubprogram(name: "from_le", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$7from_le17h4a9ba9b82791b1e3E", scope: !376, file: !375, line: 362, type: !388, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !410)
!410 = !{!408}
!411 = !DILocation(line: 362, column: 30, scope: !409, inlinedAt: !412)
!412 = distinct !DILocation(line: 2465, column: 13, scope: !401)
!413 = !DILocation(line: 2466, column: 10, scope: !401)
!414 = distinct !DISubprogram(name: "from_ne_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u16$GT$13from_ne_bytes17h51ef8b86ff1f547fE", scope: !376, file: !375, line: 2506, type: !402, scopeLine: 2506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !415)
!415 = !{!416}
!416 = !DILocalVariable(name: "bytes", arg: 1, scope: !414, file: !375, line: 2506, type: !380)
!417 = !DILocation(line: 2506, column: 36, scope: !414)
!418 = !DILocation(line: 2508, column: 22, scope: !414)
!419 = !DILocation(line: 2509, column: 10, scope: !414)
!420 = distinct !DISubprogram(name: "to_le_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11to_le_bytes17hae39d2d7d1370814E", scope: !421, file: !375, line: 2368, type: !422, scopeLine: 2368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !427)
!421 = !DINamespace(name: "{impl#9}", scope: !377)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !60}
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 8, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 8, lowerBound: 0)
!427 = !{!428}
!428 = !DILocalVariable(name: "self", arg: 1, scope: !420, file: !375, line: 2368, type: !60)
!429 = !DILocation(line: 2368, column: 34, scope: !420)
!430 = !DILocalVariable(name: "self", arg: 1, scope: !431, file: !375, line: 430, type: !60)
!431 = distinct !DISubprogram(name: "to_le", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$5to_le17h36ee47d92beb07c5E", scope: !421, file: !375, line: 430, type: !432, scopeLine: 430, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!60, !60}
!434 = !{!430}
!435 = !DILocation(line: 430, column: 28, scope: !431, inlinedAt: !436)
!436 = distinct !DILocation(line: 2369, column: 13, scope: !420)
!437 = !DILocation(line: 2369, column: 13, scope: !420)
!438 = !DILocation(line: 2370, column: 10, scope: !420)
!439 = distinct !DISubprogram(name: "to_ne_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11to_ne_bytes17ha75a14b6f2aa6981E", scope: !421, file: !375, line: 2404, type: !422, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !440)
!440 = !{!441}
!441 = !DILocalVariable(name: "self", arg: 1, scope: !439, file: !375, line: 2404, type: !60)
!442 = !DILocation(line: 2404, column: 34, scope: !439)
!443 = !DILocation(line: 2407, column: 22, scope: !439)
!444 = !DILocation(line: 2408, column: 10, scope: !439)
!445 = distinct !DISubprogram(name: "from_le_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$13from_le_bytes17h1af895ba3e35f378E", scope: !421, file: !375, line: 2464, type: !446, scopeLine: 2464, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{!60, !424}
!448 = !{!449}
!449 = !DILocalVariable(name: "bytes", arg: 1, scope: !445, file: !375, line: 2464, type: !424)
!450 = !DILocation(line: 2464, column: 36, scope: !445)
!451 = !DILocation(line: 2465, column: 27, scope: !445)
!452 = !DILocalVariable(name: "x", arg: 1, scope: !453, file: !375, line: 362, type: !60)
!453 = distinct !DISubprogram(name: "from_le", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$7from_le17h9c17c602d5464325E", scope: !421, file: !375, line: 362, type: !432, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !454)
!454 = !{!452}
!455 = !DILocation(line: 362, column: 30, scope: !453, inlinedAt: !456)
!456 = distinct !DILocation(line: 2465, column: 13, scope: !445)
!457 = !DILocation(line: 2466, column: 10, scope: !445)
!458 = distinct !DISubprogram(name: "from_ne_bytes", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$13from_ne_bytes17h54c8a046cc464850E", scope: !421, file: !375, line: 2506, type: !446, scopeLine: 2506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !459)
!459 = !{!460}
!460 = !DILocalVariable(name: "bytes", arg: 1, scope: !458, file: !375, line: 2506, type: !424)
!461 = !DILocation(line: 2506, column: 36, scope: !458)
!462 = !DILocation(line: 2508, column: 22, scope: !458)
!463 = !DILocation(line: 2509, column: 10, scope: !458)
!464 = distinct !DISubprogram(name: "slice_from_raw_parts<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17hb8faad2ba77a0a22E", scope: !466, file: !465, line: 770, type: !467, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !474)
!465 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "0751cc28170b974ebf5abeae07cf66bf")
!466 = !DINamespace(name: "ptr", scope: !11)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !174, !111}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader_api::info::MemoryRegion]", file: !8, size: 128, align: 64, elements: !470, templateParams: !45, identifier: "9bbe46881f4e5279fac495da49a84967")
!470 = !{!471, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !469, file: !8, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !469, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!474 = !{!475, !476}
!475 = !DILocalVariable(name: "data", arg: 1, scope: !464, file: !465, line: 770, type: !174)
!476 = !DILocalVariable(name: "len", arg: 2, scope: !464, file: !465, line: 770, type: !111)
!477 = !DILocation(line: 770, column: 38, scope: !464)
!478 = !DILocation(line: 770, column: 54, scope: !464)
!479 = !DILocalVariable(name: "self", arg: 1, scope: !480, file: !481, line: 60, type: !174)
!480 = distinct !DISubprogram(name: "cast<bootloader_api::info::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h6313eee0225f8aa8E", scope: !482, file: !481, line: 60, type: !484, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !488, retainedNodes: !487)
!481 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "38bc561117faaf878dc249ac281f92b9")
!482 = !DINamespace(name: "{impl#0}", scope: !483)
!483 = !DINamespace(name: "const_ptr", scope: !466)
!484 = !DISubroutineType(types: !485)
!485 = !{!486, !174}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !{!479}
!488 = !{!201, !489}
!489 = !DITemplateTypeParameter(name: "U", type: !319)
!490 = !DILocation(line: 60, column: 26, scope: !480, inlinedAt: !491)
!491 = distinct !DILocation(line: 771, column: 20, scope: !464)
!492 = !DILocation(line: 771, column: 5, scope: !464)
!493 = !DILocation(line: 772, column: 2, scope: !464)
!494 = distinct !DISubprogram(name: "slice_from_raw_parts_mut<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core3ptr24slice_from_raw_parts_mut17hd8854cb197ee293fE", scope: !466, file: !465, line: 803, type: !495, scopeLine: 803, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !502)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !501, !111}
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader_api::info::MemoryRegion]", file: !8, size: 128, align: 64, elements: !498, templateParams: !45, identifier: "db46f5f8189986ffb6a83638b928ff3f")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !497, file: !8, baseType: !472, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !497, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader_api::info::MemoryRegion", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!502 = !{!503, !504}
!503 = !DILocalVariable(name: "data", arg: 1, scope: !494, file: !465, line: 803, type: !501)
!504 = !DILocalVariable(name: "len", arg: 2, scope: !494, file: !465, line: 803, type: !111)
!505 = !DILocation(line: 803, column: 42, scope: !494)
!506 = !DILocation(line: 803, column: 56, scope: !494)
!507 = !DILocalVariable(name: "self", arg: 1, scope: !508, file: !509, line: 60, type: !501)
!508 = distinct !DISubprogram(name: "cast<bootloader_api::info::MemoryRegion, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17h505a632cf95986daE", scope: !510, file: !509, line: 60, type: !512, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !488, retainedNodes: !515)
!509 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1cdb8bf37e9a3030e5a54af01a3bdb3b")
!510 = !DINamespace(name: "{impl#0}", scope: !511)
!511 = !DINamespace(name: "mut_ptr", scope: !466)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !501}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!515 = !{!507}
!516 = !DILocation(line: 60, column: 26, scope: !508, inlinedAt: !517)
!517 = distinct !DILocation(line: 804, column: 24, scope: !494)
!518 = !DILocation(line: 804, column: 5, scope: !494)
!519 = !DILocation(line: 805, column: 2, scope: !494)
!520 = distinct !DISubprogram(name: "from_raw_parts<[bootloader_api::info::MemoryRegion]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h32aa68e2fd7b0ad0E", scope: !522, file: !521, line: 111, type: !523, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !525)
!521 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "02a0aa93591cf45ea40bc18b5bf8fc0d")
!522 = !DINamespace(name: "metadata", scope: !466)
!523 = !DISubroutineType(types: !524)
!524 = !{!469, !486, !111}
!525 = !{!526, !527}
!526 = !DILocalVariable(name: "data_address", arg: 1, scope: !520, file: !521, line: 112, type: !486)
!527 = !DILocalVariable(name: "metadata", arg: 2, scope: !520, file: !521, line: 113, type: !111)
!528 = !DILocation(line: 112, column: 5, scope: !520)
!529 = !DILocation(line: 113, column: 5, scope: !520)
!530 = !DILocation(line: 118, column: 36, scope: !520)
!531 = !DILocation(line: 118, column: 14, scope: !520)
!532 = !DILocation(line: 119, column: 2, scope: !520)
!533 = distinct !DISubprogram(name: "from_raw_parts_mut<[bootloader_api::info::MemoryRegion]>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h57663ae6e2c6854dE", scope: !522, file: !521, line: 128, type: !534, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!497, !514, !111}
!536 = !{!537, !538}
!537 = !DILocalVariable(name: "data_address", arg: 1, scope: !533, file: !521, line: 129, type: !514)
!538 = !DILocalVariable(name: "metadata", arg: 2, scope: !533, file: !521, line: 130, type: !111)
!539 = !DILocation(line: 129, column: 5, scope: !533)
!540 = !DILocation(line: 130, column: 5, scope: !533)
!541 = !DILocation(line: 135, column: 36, scope: !533)
!542 = !DILocation(line: 135, column: 14, scope: !533)
!543 = !DILocation(line: 136, column: 2, scope: !533)
!544 = distinct !DISubprogram(name: "is_aligned<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$10is_aligned17hdd15780553067cd2E", scope: !482, file: !481, line: 1490, type: !172, scopeLine: 1490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !545)
!545 = !{!546}
!546 = !DILocalVariable(name: "self", arg: 1, scope: !544, file: !481, line: 1490, type: !174)
!547 = !DILocation(line: 1490, column: 29, scope: !544)
!548 = !DILocation(line: 1494, column: 9, scope: !544)
!549 = !DILocation(line: 1495, column: 6, scope: !544)
!550 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to12runtime_impl17h39aa3f1e57f4b19dE", scope: !551, file: !481, line: 1611, type: !552, scopeLine: 1611, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !554)
!551 = !DINamespace(name: "is_aligned_to", scope: !482)
!552 = !DISubroutineType(types: !553)
!553 = !{!44, !486, !111}
!554 = !{!555, !556}
!555 = !DILocalVariable(name: "ptr", arg: 1, scope: !550, file: !481, line: 1611, type: !486)
!556 = !DILocalVariable(name: "align", arg: 2, scope: !550, file: !481, line: 1611, type: !111)
!557 = !DILocation(line: 1611, column: 25, scope: !550)
!558 = !DILocation(line: 1611, column: 41, scope: !550)
!559 = !DILocalVariable(name: "self", arg: 1, scope: !560, file: !481, line: 206, type: !486)
!560 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h344f2aa991b6925fE", scope: !482, file: !481, line: 206, type: !561, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !564, retainedNodes: !563)
!561 = !DISubroutineType(types: !562)
!562 = !{!111, !486}
!563 = !{!559}
!564 = !{!321}
!565 = !DILocation(line: 206, column: 17, scope: !560, inlinedAt: !566)
!566 = distinct !DILocation(line: 1612, column: 13, scope: !550)
!567 = !DILocalVariable(name: "self", arg: 1, scope: !568, file: !481, line: 60, type: !486)
!568 = distinct !DISubprogram(name: "cast<(), ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h466937b3a1baa37aE", scope: !482, file: !481, line: 60, type: !569, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !572, retainedNodes: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{!486, !486}
!571 = !{!567}
!572 = !{!321, !489}
!573 = !DILocation(line: 60, column: 26, scope: !568, inlinedAt: !574)
!574 = distinct !DILocation(line: 210, column: 33, scope: !560, inlinedAt: !566)
!575 = !DILocation(line: 210, column: 18, scope: !560, inlinedAt: !566)
!576 = !DILocation(line: 1612, column: 26, scope: !550)
!577 = !DILocation(line: 1612, column: 13, scope: !550)
!578 = !DILocation(line: 1613, column: 10, scope: !550)
!579 = distinct !DISubprogram(name: "is_aligned_to<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to17hbaeecf4e688f39b9E", scope: !482, file: !481, line: 1605, type: !580, scopeLine: 1605, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{!44, !174, !111}
!582 = !{!583, !584}
!583 = !DILocalVariable(name: "self", arg: 1, scope: !579, file: !481, line: 1605, type: !174)
!584 = !DILocalVariable(name: "align", arg: 2, scope: !579, file: !481, line: 1605, type: !111)
!585 = !DILocation(line: 1605, column: 32, scope: !579)
!586 = !DILocation(line: 1605, column: 38, scope: !579)
!587 = !DILocalVariable(name: "self", arg: 1, scope: !588, file: !375, line: 2234, type: !111)
!588 = distinct !DISubprogram(name: "is_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15is_power_of_two17heb06dee5c5ace0a8E", scope: !589, file: !375, line: 2234, type: !209, scopeLine: 2234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !590)
!589 = !DINamespace(name: "{impl#11}", scope: !377)
!590 = !{!587}
!591 = !DILocation(line: 2234, column: 38, scope: !588, inlinedAt: !592)
!592 = distinct !DILocation(line: 1606, column: 13, scope: !579)
!593 = !DILocalVariable(name: "self", arg: 1, scope: !594, file: !375, line: 106, type: !111)
!594 = distinct !DISubprogram(name: "count_ones", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$10count_ones17h376b6ee4c46c005aE", scope: !589, file: !375, line: 106, type: !595, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!142, !111}
!597 = !{!593}
!598 = !DILocation(line: 106, column: 33, scope: !594, inlinedAt: !599)
!599 = distinct !DILocation(line: 2235, column: 13, scope: !588, inlinedAt: !592)
!600 = !DILocation(line: 107, column: 13, scope: !594, inlinedAt: !599)
!601 = !DILocation(line: 2235, column: 13, scope: !588, inlinedAt: !592)
!602 = !DILocation(line: 1606, column: 13, scope: !579)
!603 = !DILocation(line: 1607, column: 13, scope: !579)
!604 = !DILocation(line: 60, column: 26, scope: !480, inlinedAt: !605)
!605 = distinct !DILocation(line: 1625, column: 37, scope: !579)
!606 = !DILocation(line: 1625, column: 36, scope: !579)
!607 = !DILocation(line: 1625, column: 18, scope: !579)
!608 = !DILocation(line: 1626, column: 6, scope: !579)
!609 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null12runtime_impl17hf412206ef69dd640E", scope: !610, file: !481, line: 37, type: !611, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !45, retainedNodes: !614)
!610 = !DINamespace(name: "is_null", scope: !482)
!611 = !DISubroutineType(types: !612)
!612 = !{!44, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!614 = !{!615}
!615 = !DILocalVariable(name: "ptr", arg: 1, scope: !609, file: !481, line: 37, type: !613)
!616 = !DILocation(line: 37, column: 25, scope: !609)
!617 = !DILocalVariable(name: "self", arg: 1, scope: !618, file: !481, line: 206, type: !613)
!618 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17hb0ff4080e13eb0c3E", scope: !482, file: !481, line: 206, type: !619, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !622, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!111, !613}
!621 = !{!617}
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "T", type: !12)
!624 = !DILocation(line: 206, column: 17, scope: !618, inlinedAt: !625)
!625 = distinct !DILocation(line: 38, column: 13, scope: !609)
!626 = !DILocalVariable(name: "self", arg: 1, scope: !627, file: !481, line: 60, type: !613)
!627 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hff3ca194e81c577cE", scope: !482, file: !481, line: 60, type: !628, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !631, retainedNodes: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{!486, !613}
!630 = !{!626}
!631 = !{!623, !489}
!632 = !DILocation(line: 60, column: 26, scope: !627, inlinedAt: !633)
!633 = distinct !DILocation(line: 210, column: 33, scope: !618, inlinedAt: !625)
!634 = !DILocation(line: 210, column: 18, scope: !618, inlinedAt: !625)
!635 = !DILocation(line: 38, column: 13, scope: !609)
!636 = !DILocation(line: 39, column: 10, scope: !609)
!637 = distinct !DISubprogram(name: "is_null<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17he5ce3ba55bab4568E", scope: !482, file: !481, line: 35, type: !172, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !638)
!638 = !{!639}
!639 = !DILocalVariable(name: "self", arg: 1, scope: !637, file: !481, line: 35, type: !174)
!640 = !DILocation(line: 35, column: 26, scope: !637)
!641 = !DILocation(line: 52, column: 36, scope: !637)
!642 = !DILocation(line: 52, column: 18, scope: !637)
!643 = !DILocation(line: 53, column: 6, scope: !637)
!644 = distinct !DISubprogram(name: "eq<u8, u8, 8>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h4517781cfa43bdefE", scope: !646, file: !645, line: 10, type: !649, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !655, retainedNodes: !652)
!645 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "1524894cf0ce28fd6e90c297c47c06f9")
!646 = !DINamespace(name: "{impl#0}", scope: !647)
!647 = !DINamespace(name: "equality", scope: !648)
!648 = !DINamespace(name: "array", scope: !11)
!649 = !DISubroutineType(types: !650)
!650 = !{!44, !651, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 8]", baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!652 = !{!653, !654}
!653 = !DILocalVariable(name: "self", arg: 1, scope: !644, file: !645, line: 10, type: !651)
!654 = !DILocalVariable(name: "other", arg: 2, scope: !644, file: !645, line: 10, type: !651)
!655 = !{!656, !657}
!656 = !DITemplateTypeParameter(name: "A", type: !12)
!657 = !DITemplateTypeParameter(name: "B", type: !12)
!658 = !DILocation(line: 10, column: 11, scope: !644)
!659 = !DILocation(line: 10, column: 18, scope: !644)
!660 = !DILocation(line: 11, column: 9, scope: !644)
!661 = !DILocation(line: 12, column: 6, scope: !644)
!662 = distinct !DISubprogram(name: "eq<u8, u8, 9>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17hfe7fca05c82d00f4E", scope: !646, file: !645, line: 10, type: !663, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !655, retainedNodes: !669)
!663 = !DISubroutineType(types: !664)
!664 = !{!44, !665, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 9]", baseType: !666, size: 64, align: 64, dwarfAddressSpace: 0)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 72, align: 8, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 9, lowerBound: 0)
!669 = !{!670, !671}
!670 = !DILocalVariable(name: "self", arg: 1, scope: !662, file: !645, line: 10, type: !665)
!671 = !DILocalVariable(name: "other", arg: 2, scope: !662, file: !645, line: 10, type: !665)
!672 = !DILocation(line: 10, column: 11, scope: !662)
!673 = !DILocation(line: 10, column: 18, scope: !662)
!674 = !DILocation(line: 11, column: 9, scope: !662)
!675 = !DILocation(line: 12, column: 6, scope: !662)
!676 = distinct !DISubprogram(name: "ne<u8, u8, 16>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2ne17h1abdbfcf5c88fc2fE", scope: !646, file: !645, line: 14, type: !677, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !655, retainedNodes: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{!44, !227, !227}
!679 = !{!680, !681}
!680 = !DILocalVariable(name: "self", arg: 1, scope: !676, file: !645, line: 14, type: !227)
!681 = !DILocalVariable(name: "other", arg: 2, scope: !676, file: !645, line: 14, type: !227)
!682 = !DILocation(line: 14, column: 11, scope: !676)
!683 = !DILocation(line: 14, column: 18, scope: !676)
!684 = !DILocation(line: 15, column: 9, scope: !676)
!685 = !DILocation(line: 16, column: 6, scope: !676)
!686 = distinct !DISubprogram(name: "from_raw_parts<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h85e788be33a54cecE", scope: !688, file: !687, line: 94, type: !690, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !696)
!687 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "503b19e16c498622a7ca460c2aab934c")
!688 = !DINamespace(name: "raw", scope: !689)
!689 = !DINamespace(name: "slice", scope: !11)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !174, !111}
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader_api::info::MemoryRegion]", file: !8, size: 128, align: 64, elements: !693, templateParams: !45, identifier: "a9d2acc8d2cfa176d0cf7dd2588534c4")
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !692, file: !8, baseType: !472, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !692, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!696 = !{!697, !698}
!697 = !DILocalVariable(name: "data", arg: 1, scope: !686, file: !687, line: 94, type: !174)
!698 = !DILocalVariable(name: "len", arg: 2, scope: !686, file: !687, line: 94, type: !111)
!699 = !DILocation(line: 94, column: 43, scope: !686)
!700 = !DILocation(line: 94, column: 59, scope: !686)
!701 = !DILocation(line: 97, column: 9, scope: !686)
!702 = !DILocation(line: 102, column: 11, scope: !686)
!703 = !DILocation(line: 104, column: 2, scope: !686)
!704 = !DILocalVariable(name: "data", arg: 1, scope: !705, file: !170, line: 2542, type: !174)
!705 = distinct !DISubprogram(name: "runtime<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core5slice3raw14from_raw_parts7runtime17hb4c4d5ee026bd90fE", scope: !706, file: !170, line: 2542, type: !707, scopeLine: 2542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !709)
!706 = !DINamespace(name: "from_raw_parts", scope: !688)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !174, !111}
!709 = !{!704, !710}
!710 = !DILocalVariable(name: "len", arg: 2, scope: !705, file: !170, line: 2542, type: !111)
!711 = !DILocation(line: 2542, column: 39, scope: !705, inlinedAt: !712)
!712 = distinct !DILocation(line: 97, column: 9, scope: !686)
!713 = !DILocation(line: 99, column: 48, scope: !714, inlinedAt: !712)
!714 = !DILexicalBlockFile(scope: !705, file: !687, discriminator: 0)
!715 = !DILocation(line: 2545, column: 21, scope: !705, inlinedAt: !712)
!716 = !DILocation(line: 100, column: 20, scope: !714, inlinedAt: !712)
!717 = distinct !DISubprogram(name: "from_raw_parts_mut<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core5slice3raw18from_raw_parts_mut17h0c2f8ba037d00ff9E", scope: !688, file: !687, line: 141, type: !718, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !724)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !501, !111}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader_api::info::MemoryRegion]", file: !8, size: 128, align: 64, elements: !721, templateParams: !45, identifier: "ad1cdf01c2ac4e45b4b6d77c943f944a")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !720, file: !8, baseType: !472, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !720, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!724 = !{!725, !726}
!725 = !DILocalVariable(name: "data", arg: 1, scope: !717, file: !687, line: 141, type: !501)
!726 = !DILocalVariable(name: "len", arg: 2, scope: !717, file: !687, line: 141, type: !111)
!727 = !DILocation(line: 141, column: 47, scope: !717)
!728 = !DILocation(line: 141, column: 61, scope: !717)
!729 = !DILocation(line: 144, column: 9, scope: !717)
!730 = !DILocation(line: 149, column: 15, scope: !717)
!731 = !DILocation(line: 151, column: 2, scope: !717)
!732 = !DILocalVariable(name: "data", arg: 1, scope: !733, file: !170, line: 2542, type: !501)
!733 = distinct !DISubprogram(name: "runtime<bootloader_api::info::MemoryRegion>", linkageName: "_ZN4core5slice3raw18from_raw_parts_mut7runtime17h24d0b07a41c53397E", scope: !734, file: !170, line: 2542, type: !735, scopeLine: 2542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !200, retainedNodes: !737)
!734 = !DINamespace(name: "from_raw_parts_mut", scope: !688)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !501, !111}
!737 = !{!732, !738}
!738 = !DILocalVariable(name: "len", arg: 2, scope: !733, file: !170, line: 2542, type: !111)
!739 = !DILocation(line: 2542, column: 39, scope: !733, inlinedAt: !740)
!740 = distinct !DILocation(line: 144, column: 9, scope: !717)
!741 = !DILocation(line: 146, column: 46, scope: !742, inlinedAt: !740)
!742 = !DILexicalBlockFile(scope: !733, file: !687, discriminator: 0)
!743 = !DILocation(line: 2545, column: 21, scope: !733, inlinedAt: !740)
!744 = !DILocation(line: 147, column: 20, scope: !742, inlinedAt: !740)
!745 = distinct !DISubprogram(name: "from_raw_parts_mut<u8>", linkageName: "_ZN4core5slice3raw18from_raw_parts_mut17hb56602522cc6d315E", scope: !688, file: !687, line: 141, type: !746, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !622, retainedNodes: !753)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !752, !111}
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !8, size: 128, align: 64, elements: !749, templateParams: !45, identifier: "5acbf15c847666982b641ea58cf98317")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !748, file: !8, baseType: !109, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !748, file: !8, baseType: !111, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!753 = !{!754, !755}
!754 = !DILocalVariable(name: "data", arg: 1, scope: !745, file: !687, line: 141, type: !752)
!755 = !DILocalVariable(name: "len", arg: 2, scope: !745, file: !687, line: 141, type: !111)
!756 = !DILocation(line: 141, column: 47, scope: !745)
!757 = !DILocation(line: 141, column: 61, scope: !745)
!758 = !DILocation(line: 144, column: 9, scope: !745)
!759 = !DILocation(line: 149, column: 15, scope: !745)
!760 = !DILocation(line: 151, column: 2, scope: !745)
!761 = !DILocalVariable(name: "data", arg: 1, scope: !762, file: !170, line: 2542, type: !752)
!762 = distinct !DISubprogram(name: "runtime<u8>", linkageName: "_ZN4core5slice3raw18from_raw_parts_mut7runtime17h5d66a578566eca86E", scope: !734, file: !170, line: 2542, type: !763, scopeLine: 2542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !622, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !752, !111}
!765 = !{!761, !766}
!766 = !DILocalVariable(name: "len", arg: 2, scope: !762, file: !170, line: 2542, type: !111)
!767 = !DILocation(line: 2542, column: 39, scope: !762, inlinedAt: !768)
!768 = distinct !DILocation(line: 144, column: 9, scope: !745)
!769 = !DILocation(line: 146, column: 46, scope: !770, inlinedAt: !768)
!770 = !DILexicalBlockFile(scope: !762, file: !687, discriminator: 0)
!771 = !DILocation(line: 2545, column: 21, scope: !762, inlinedAt: !768)
!772 = !DILocation(line: 147, column: 20, scope: !770, inlinedAt: !768)
!773 = distinct !DISubprogram(name: "spec_eq<u8, u8, 9>", linkageName: "_ZN69_$LT$T$u20$as$u20$core..array..equality..SpecArrayEq$LT$U$C$_$GT$$GT$7spec_eq17hb742e23db53f1cdbE", scope: !774, file: !645, line: 147, type: !663, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !778, retainedNodes: !775)
!774 = !DINamespace(name: "{impl#9}", scope: !647)
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "a", arg: 1, scope: !773, file: !645, line: 147, type: !665)
!777 = !DILocalVariable(name: "b", arg: 2, scope: !773, file: !645, line: 147, type: !665)
!778 = !{!623, !779}
!779 = !DITemplateTypeParameter(name: "U", type: !12)
!780 = !DILocation(line: 147, column: 16, scope: !773)
!781 = !DILocation(line: 147, column: 28, scope: !773)
!782 = !DILocation(line: 151, column: 18, scope: !773)
!783 = !DILocation(line: 152, column: 6, scope: !773)
!784 = distinct !DISubprogram(name: "spec_eq<u8, u8, 8>", linkageName: "_ZN69_$LT$T$u20$as$u20$core..array..equality..SpecArrayEq$LT$U$C$_$GT$$GT$7spec_eq17hd3873aa4a9272fb5E", scope: !774, file: !645, line: 147, type: !649, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !778, retainedNodes: !785)
!785 = !{!786, !787}
!786 = !DILocalVariable(name: "a", arg: 1, scope: !784, file: !645, line: 147, type: !651)
!787 = !DILocalVariable(name: "b", arg: 2, scope: !784, file: !645, line: 147, type: !651)
!788 = !DILocation(line: 147, column: 16, scope: !784)
!789 = !DILocation(line: 147, column: 28, scope: !784)
!790 = !DILocation(line: 151, column: 18, scope: !784)
!791 = !DILocation(line: 152, column: 6, scope: !784)
!792 = distinct !DISubprogram(name: "spec_eq<u8, u8, 16>", linkageName: "_ZN69_$LT$T$u20$as$u20$core..array..equality..SpecArrayEq$LT$U$C$_$GT$$GT$7spec_eq17hff01fdb694ad63e3E", scope: !774, file: !645, line: 147, type: !677, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !778, retainedNodes: !793)
!793 = !{!794, !795}
!794 = !DILocalVariable(name: "a", arg: 1, scope: !792, file: !645, line: 147, type: !227)
!795 = !DILocalVariable(name: "b", arg: 2, scope: !792, file: !645, line: 147, type: !227)
!796 = !DILocation(line: 147, column: 16, scope: !792)
!797 = !DILocation(line: 147, column: 28, scope: !792)
!798 = !DILocation(line: 151, column: 18, scope: !792)
!799 = !DILocation(line: 152, column: 6, scope: !792)
!800 = distinct !DISubprogram(name: "spec_ne<u8, u8, 16>", linkageName: "_ZN69_$LT$T$u20$as$u20$core..array..equality..SpecArrayEq$LT$U$C$_$GT$$GT$7spec_ne17h2ddc70422a339de8E", scope: !774, file: !645, line: 153, type: !677, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !778, retainedNodes: !801)
!801 = !{!802, !803}
!802 = !DILocalVariable(name: "a", arg: 1, scope: !800, file: !645, line: 153, type: !227)
!803 = !DILocalVariable(name: "b", arg: 2, scope: !800, file: !645, line: 153, type: !227)
!804 = !DILocation(line: 153, column: 16, scope: !800)
!805 = !DILocation(line: 153, column: 28, scope: !800)
!806 = !DILocation(line: 154, column: 10, scope: !800)
!807 = !DILocation(line: 154, column: 9, scope: !800)
!808 = !DILocation(line: 155, column: 6, scope: !800)
!809 = distinct !DISubprogram(name: "branch<bootloader_api::config::Mapping, &str>", linkageName: "_ZN79_$LT$core..result..Result$LT$T$C$E$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17hfc7584b29ed1fccdE", scope: !810, file: !19, line: 1945, type: !811, scopeLine: 1945, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !839, retainedNodes: !845)
!810 = !DINamespace(name: "{impl#26}", scope: !21)
!811 = !DISubroutineType(types: !812)
!812 = !{!813, !831}
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::result::Result<core::convert::Infallible, &str>, bootloader_api::config::Mapping>", scope: !814, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !816, templateParams: !45, identifier: "5f1c22266b2b5cf8dd35025f1f812e1c")
!814 = !DINamespace(name: "control_flow", scope: !815)
!815 = !DINamespace(name: "ops", scope: !11)
!816 = !{!817}
!817 = !DICompositeType(tag: DW_TAG_variant_part, scope: !813, file: !8, size: 192, align: 64, elements: !818, templateParams: !45, identifier: "97ea27aa9e97b1ab49253fdff5d609f4", discriminator: !830)
!818 = !{!819, !826}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !817, file: !8, baseType: !820, size: 192, align: 64, extraData: i128 0)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !813, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !821, templateParams: !823, identifier: "f87b0f893c477d31eef3ee30f819851d")
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !820, file: !8, baseType: !50, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!823 = !{!824, !825}
!824 = !DITemplateTypeParameter(name: "B", type: !117)
!825 = !DITemplateTypeParameter(name: "C", type: !50)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !817, file: !8, baseType: !827, size: 192, align: 64, extraData: i128 1)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !813, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !828, templateParams: !823, identifier: "8c37b3180391f448194c4af67c7ef57")
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !827, file: !8, baseType: !117, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!830 = !DIDerivedType(tag: DW_TAG_member, scope: !813, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bootloader_api::config::Mapping, &str>", scope: !21, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !832, templateParams: !45, identifier: "5250a0f59b9934a2d6708d45f0ab3be")
!832 = !{!833}
!833 = !DICompositeType(tag: DW_TAG_variant_part, scope: !831, file: !8, size: 192, align: 64, elements: !834, templateParams: !45, identifier: "3431bd8b5a7bd4774f3c8364be09806d", discriminator: !844)
!834 = !{!835, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !833, file: !8, baseType: !836, size: 192, align: 64, extraData: i128 0)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !831, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !837, templateParams: !839, identifier: "f3f4cdec6f99258f11df25a1b6baaa9c")
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !836, file: !8, baseType: !50, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!839 = !{!73, !105}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !833, file: !8, baseType: !841, size: 192, align: 64, extraData: i128 1)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !831, file: !8, size: 192, align: 64, flags: DIFlagPublic, elements: !842, templateParams: !839, identifier: "6fb72c2be42001182e3a2bc7cedf5997")
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !841, file: !8, baseType: !106, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!844 = !DIDerivedType(tag: DW_TAG_member, scope: !831, file: !8, baseType: !60, size: 64, align: 64, flags: DIFlagArtificial)
!845 = !{!846, !847, !849}
!846 = !DILocalVariable(name: "self", arg: 1, scope: !809, file: !19, line: 1945, type: !831)
!847 = !DILocalVariable(name: "v", scope: !848, file: !19, line: 1947, type: !50, align: 8)
!848 = distinct !DILexicalBlock(scope: !809, file: !19, line: 1947, column: 13)
!849 = !DILocalVariable(name: "e", scope: !850, file: !19, line: 1948, type: !106, align: 8)
!850 = distinct !DILexicalBlock(scope: !809, file: !19, line: 1948, column: 13)
!851 = !DILocation(line: 1945, column: 15, scope: !809)
!852 = !DILocation(line: 1946, column: 15, scope: !809)
!853 = !{i64 0, i64 2}
!854 = !DILocation(line: 1946, column: 9, scope: !809)
!855 = !DILocation(line: 1947, column: 16, scope: !809)
!856 = !DILocation(line: 1947, column: 16, scope: !848)
!857 = !DILocation(line: 1947, column: 22, scope: !848)
!858 = !DILocation(line: 1947, column: 45, scope: !809)
!859 = !DILocation(line: 1948, column: 17, scope: !809)
!860 = !DILocation(line: 1948, column: 17, scope: !850)
!861 = !DILocation(line: 1948, column: 42, scope: !850)
!862 = !DILocation(line: 1948, column: 23, scope: !850)
!863 = !DILocation(line: 1948, column: 48, scope: !809)
!864 = !DILocation(line: 1950, column: 6, scope: !809)
!865 = distinct !DISubprogram(name: "new_default", linkageName: "_ZN14bootloader_api6config16BootloaderConfig11new_default17ha62b91f1504d0526E", scope: !32, file: !866, line: 52, type: !867, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !45, declaration: !869)
!866 = !DIFile(filename: "src/config.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader_api-0.11.4", checksumkind: CSK_MD5, checksum: "10ba77374077e7bf16cedc52d8a12027")
!867 = !DISubroutineType(types: !868)
!868 = !{!32}
!869 = !DISubprogram(name: "new_default", linkageName: "_ZN14bootloader_api6config16BootloaderConfig11new_default17ha62b91f1504d0526E", scope: !32, file: !866, line: 52, type: !867, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0, templateParams: !45)
!870 = !DILocation(line: 54, column: 32, scope: !865)
!871 = !DILocation(line: 55, column: 22, scope: !865)
!872 = !DILocation(line: 56, column: 23, scope: !865)
!873 = !DILocation(line: 57, column: 27, scope: !865)
!874 = !DILocation(line: 53, column: 9, scope: !865)
!875 = !DILocation(line: 59, column: 6, scope: !865)
!876 = distinct !DISubprogram(name: "serialize", linkageName: "_ZN14bootloader_api6config16BootloaderConfig9serialize17h4a391c2bf669fedaE", scope: !32, file: !866, line: 65, type: !877, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !45, declaration: !883, retainedNodes: !884)
!877 = !DISubroutineType(types: !878)
!878 = !{!879, !882}
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 992, align: 8, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 124, lowerBound: 0)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::config::BootloaderConfig", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!883 = !DISubprogram(name: "serialize", linkageName: "_ZN14bootloader_api6config16BootloaderConfig9serialize17h4a391c2bf669fedaE", scope: !32, file: !866, line: 65, type: !877, scopeLine: 65, flags: DIFlagPrototyped, spFlags: 0, templateParams: !45)
!884 = !{!885, !886, !889, !891, !893, !895, !898, !899, !900, !902, !905, !906, !907, !909, !910, !911, !913, !914, !915, !917, !918, !923, !928, !931, !936, !941, !946, !951, !956, !961, !963, !968, !970, !975, !980, !982, !987, !989, !994, !999, !1001}
!885 = !DILocalVariable(name: "self", arg: 1, scope: !876, file: !866, line: 65, type: !882)
!886 = !DILocalVariable(name: "version", scope: !887, file: !866, line: 67, type: !888, align: 8)
!887 = distinct !DILexicalBlock(scope: !876, file: !866, line: 66, column: 9)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::config::ApiVersion", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !DILocalVariable(name: "mappings", scope: !887, file: !866, line: 68, type: !890, align: 8)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::config::Mappings", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !DILocalVariable(name: "kernel_stack_size", scope: !887, file: !866, line: 69, type: !892, align: 8)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!893 = !DILocalVariable(name: "frame_buffer", scope: !887, file: !866, line: 70, type: !894, align: 8)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::config::FrameBuffer", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!895 = !DILocalVariable(name: "version_major", scope: !896, file: !866, line: 73, type: !897, align: 8)
!896 = distinct !DILexicalBlock(scope: !887, file: !866, line: 72, column: 9)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!898 = !DILocalVariable(name: "version_minor", scope: !896, file: !866, line: 74, type: !897, align: 8)
!899 = !DILocalVariable(name: "version_patch", scope: !896, file: !866, line: 75, type: !897, align: 8)
!900 = !DILocalVariable(name: "pre_release", scope: !896, file: !866, line: 76, type: !901, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !DILocalVariable(name: "kernel_stack", scope: !903, file: !866, line: 79, type: !904, align: 8)
!903 = distinct !DILexicalBlock(scope: !896, file: !866, line: 78, column: 9)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::config::Mapping", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!905 = !DILocalVariable(name: "boot_info", scope: !903, file: !866, line: 80, type: !904, align: 8)
!906 = !DILocalVariable(name: "framebuffer", scope: !903, file: !866, line: 81, type: !904, align: 8)
!907 = !DILocalVariable(name: "physical_memory", scope: !903, file: !866, line: 82, type: !908, align: 8)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<bootloader_api::config::Mapping>", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!909 = !DILocalVariable(name: "page_table_recursive", scope: !903, file: !866, line: 83, type: !908, align: 8)
!910 = !DILocalVariable(name: "aslr", scope: !903, file: !866, line: 84, type: !901, align: 8)
!911 = !DILocalVariable(name: "dynamic_range_start", scope: !903, file: !866, line: 85, type: !912, align: 8)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u64>", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!913 = !DILocalVariable(name: "dynamic_range_end", scope: !903, file: !866, line: 86, type: !912, align: 8)
!914 = !DILocalVariable(name: "ramdisk_memory", scope: !903, file: !866, line: 87, type: !904, align: 8)
!915 = !DILocalVariable(name: "minimum_framebuffer_height", scope: !916, file: !866, line: 90, type: !912, align: 8)
!916 = distinct !DILexicalBlock(scope: !903, file: !866, line: 89, column: 9)
!917 = !DILocalVariable(name: "minimum_framebuffer_width", scope: !916, file: !866, line: 91, type: !912, align: 8)
!918 = !DILocalVariable(name: "version", scope: !919, file: !866, line: 94, type: !920, align: 1)
!919 = distinct !DILexicalBlock(scope: !916, file: !866, line: 94, column: 9)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 56, align: 8, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 7, lowerBound: 0)
!923 = !DILocalVariable(name: "one", scope: !924, file: !866, line: 95, type: !925, align: 1)
!924 = distinct !DILexicalBlock(scope: !916, file: !866, line: 95, column: 13)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, align: 8, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 4, lowerBound: 0)
!928 = !DILocalVariable(name: "two", scope: !929, file: !866, line: 96, type: !930, align: 1)
!929 = distinct !DILexicalBlock(scope: !924, file: !866, line: 96, column: 13)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 24, align: 8, elements: !359)
!931 = !DILocalVariable(name: "buf", scope: !932, file: !866, line: 99, type: !933, align: 1)
!932 = distinct !DILexicalBlock(scope: !919, file: !866, line: 99, column: 9)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 184, align: 8, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 23, lowerBound: 0)
!936 = !DILocalVariable(name: "buf", scope: !937, file: !866, line: 100, type: !938, align: 1)
!937 = distinct !DILexicalBlock(scope: !932, file: !866, line: 100, column: 9)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 248, align: 8, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 31, lowerBound: 0)
!941 = !DILocalVariable(name: "buf", scope: !942, file: !866, line: 102, type: !943, align: 1)
!942 = distinct !DILexicalBlock(scope: !937, file: !866, line: 102, column: 9)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 320, align: 8, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 40, lowerBound: 0)
!946 = !DILocalVariable(name: "buf", scope: !947, file: !866, line: 103, type: !948, align: 1)
!947 = distinct !DILexicalBlock(scope: !942, file: !866, line: 103, column: 9)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 392, align: 8, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 49, lowerBound: 0)
!951 = !DILocalVariable(name: "buf", scope: !952, file: !866, line: 104, type: !953, align: 1)
!952 = distinct !DILexicalBlock(scope: !947, file: !866, line: 104, column: 9)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 464, align: 8, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 58, lowerBound: 0)
!956 = !DILocalVariable(name: "buf", scope: !957, file: !866, line: 106, type: !958, align: 1)
!957 = distinct !DILexicalBlock(scope: !952, file: !866, line: 106, column: 9)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 544, align: 8, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 68, lowerBound: 0)
!961 = !DILocalVariable(name: "m", scope: !962, file: !866, line: 110, type: !904, align: 8)
!962 = distinct !DILexicalBlock(scope: !952, file: !866, line: 110, column: 17)
!963 = !DILocalVariable(name: "buf", scope: !964, file: !866, line: 113, type: !965, align: 1)
!964 = distinct !DILexicalBlock(scope: !957, file: !866, line: 113, column: 9)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 624, align: 8, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 78, lowerBound: 0)
!968 = !DILocalVariable(name: "m", scope: !969, file: !866, line: 117, type: !904, align: 8)
!969 = distinct !DILexicalBlock(scope: !957, file: !866, line: 117, column: 17)
!970 = !DILocalVariable(name: "buf", scope: !971, file: !866, line: 120, type: !972, align: 1)
!971 = distinct !DILexicalBlock(scope: !964, file: !866, line: 120, column: 9)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 632, align: 8, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 79, lowerBound: 0)
!975 = !DILocalVariable(name: "buf", scope: !976, file: !866, line: 121, type: !977, align: 1)
!976 = distinct !DILexicalBlock(scope: !971, file: !866, line: 121, column: 9)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 704, align: 8, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 88, lowerBound: 0)
!980 = !DILocalVariable(name: "addr", scope: !981, file: !866, line: 125, type: !892, align: 8)
!981 = distinct !DILexicalBlock(scope: !971, file: !866, line: 125, column: 17)
!982 = !DILocalVariable(name: "buf", scope: !983, file: !866, line: 128, type: !984, align: 1)
!983 = distinct !DILexicalBlock(scope: !976, file: !866, line: 128, column: 9)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 776, align: 8, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 97, lowerBound: 0)
!987 = !DILocalVariable(name: "addr", scope: !988, file: !866, line: 132, type: !892, align: 8)
!988 = distinct !DILexicalBlock(scope: !976, file: !866, line: 132, column: 17)
!989 = !DILocalVariable(name: "buf", scope: !990, file: !866, line: 136, type: !991, align: 1)
!990 = distinct !DILexicalBlock(scope: !983, file: !866, line: 136, column: 9)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 848, align: 8, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 106, lowerBound: 0)
!994 = !DILocalVariable(name: "buf", scope: !995, file: !866, line: 138, type: !996, align: 1)
!995 = distinct !DILexicalBlock(scope: !990, file: !866, line: 138, column: 9)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 920, align: 8, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 115, lowerBound: 0)
!999 = !DILocalVariable(name: "addr", scope: !1000, file: !866, line: 142, type: !892, align: 8)
!1000 = distinct !DILexicalBlock(scope: !990, file: !866, line: 142, column: 17)
!1001 = !DILocalVariable(name: "addr", scope: !1002, file: !866, line: 150, type: !892, align: 8)
!1002 = distinct !DILexicalBlock(scope: !995, file: !866, line: 150, column: 17)
!1003 = !DILocation(line: 65, column: 28, scope: !876)
!1004 = !DILocation(line: 94, column: 13, scope: !919)
!1005 = !DILocation(line: 95, column: 17, scope: !924)
!1006 = !DILocation(line: 96, column: 17, scope: !929)
!1007 = !DILocation(line: 99, column: 13, scope: !932)
!1008 = !DILocation(line: 100, column: 13, scope: !937)
!1009 = !DILocation(line: 102, column: 13, scope: !942)
!1010 = !DILocation(line: 103, column: 13, scope: !947)
!1011 = !DILocation(line: 104, column: 13, scope: !952)
!1012 = !DILocation(line: 106, column: 13, scope: !957)
!1013 = !DILocation(line: 113, column: 13, scope: !964)
!1014 = !DILocation(line: 120, column: 13, scope: !971)
!1015 = !DILocation(line: 121, column: 13, scope: !976)
!1016 = !DILocation(line: 128, column: 13, scope: !983)
!1017 = !DILocation(line: 136, column: 13, scope: !990)
!1018 = !DILocation(line: 138, column: 13, scope: !995)
!1019 = !DILocation(line: 67, column: 13, scope: !876)
!1020 = !DILocation(line: 67, column: 13, scope: !887)
