; ModuleID = 'bootloader.1d7037a3-cgu.0'
source_filename = "bootloader.1d7037a3-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::ops::range::RangeInclusive<usize>" = type { i64, i64, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::mem::manually_drop::ManuallyDrop<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { %"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" }
%"core::mem::maybe_uninit::MaybeUninit<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { [3 x i64] }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "2149f970ce9658f412e4dc9754e4596b")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "ef6cafd47a88dc0087d3be0f23009826")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "dc1485c08bdd20233c3a28391abbc203")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "f11898327709b782893ea9a3dc81ff3b")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "ca301d2d93b95feac061b4e33e32561a")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "8b5c2750de7ad06458ea66def6cd4f20")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "299c820aab8f28c4d019286a8e4fc0f1")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "9118f31127f253fd369607fb2214e2f5")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "fbd6f3304e41661f3b038fb9df7eaa81")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "e5a2299c802929148b9d50aa6d30345e")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "6b2c3f34549a913bb9581991256e3afb")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "c9b0731136e2655691566bcdc47cd373")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "f0d5be5e0ebfe37f8009cecc4ba63cee")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "ed62d085a619173042794cb62c3965ba")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 7, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.69.0-nightly (246eae2fa 2023-02-21))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !162, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/lib.rs/@/bootloader.1d7037a3-cgu.0", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23")
!138 = !{!26, !139, !149, !156}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!140 = !DINamespace(name: "v1", scope: !141)
!141 = !DINamespace(name: "rt", scope: !142)
!142 = !DINamespace(name: "fmt", scope: !143)
!143 = !DINamespace(name: "core", scope: null)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !150, file: !2, baseType: !151, size: 8, align: 8, flags: DIFlagEnumClass, elements: !152)
!150 = !DINamespace(name: "cmp", scope: !143)
!151 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "Less", value: -1)
!154 = !DIEnumerator(name: "Equal", value: 0)
!155 = !DIEnumerator(name: "Greater", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !157, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !158)
!157 = !DINamespace(name: "panicking", scope: !143)
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!162 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!163 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17hb8f234a53d6bfd06E", scope: !165, file: !164, line: 373, type: !168, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !183)
!164 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "afd2e83bc7b2acdd8fe6c036dd45a95e")
!165 = !DINamespace(name: "{impl#4}", scope: !166)
!166 = !DINamespace(name: "index", scope: !167)
!167 = !DINamespace(name: "slice", scope: !143)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !175, !170}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !171, templateParams: !24, identifier: "2f401ee8dfca15abdea01bab449cd5a1")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !176, file: !2, size: 128, align: 64, elements: !178, templateParams: !181, identifier: "68b4355f832d5b808860ceba6b246024")
!176 = !DINamespace(name: "range", scope: !177)
!177 = !DINamespace(name: "ops", scope: !143)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "Idx", type: !9)
!183 = !{!184, !185, !186}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !164, line: 373, type: !175)
!185 = !DILocalVariable(name: "slice", arg: 2, scope: !163, file: !164, line: 373, type: !170)
!186 = !DILocalVariable(name: "this", scope: !187, file: !164, line: 374, type: !175, align: 8)
!187 = distinct !DILexicalBlock(scope: !163, file: !164, line: 374, column: 9)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !13)
!190 = !DILocation(line: 373, column: 29, scope: !163)
!191 = !DILocation(line: 373, column: 35, scope: !163)
!192 = !DILocation(line: 374, column: 13, scope: !187)
!193 = !DILocation(line: 374, column: 20, scope: !163)
!194 = !DILocation(line: 381, column: 13, scope: !187)
!195 = !DILocalVariable(name: "this", arg: 1, scope: !196, file: !197, line: 2218, type: !175)
!196 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17hd10520e92da969e3E", scope: !198, file: !197, line: 2218, type: !199, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !201)
!197 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "9636877b7f12d537541e2836c747da25")
!198 = !DINamespace(name: "get_unchecked", scope: !165)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !175, !170}
!201 = !{!195, !202}
!202 = !DILocalVariable(name: "slice", arg: 2, scope: !196, file: !197, line: 2218, type: !170)
!203 = !DILocation(line: 2218, column: 39, scope: !196, inlinedAt: !204)
!204 = distinct !DILocation(line: 381, column: 13, scope: !187)
!205 = !DILocation(line: 384, column: 17, scope: !206, inlinedAt: !204)
!206 = !DILexicalBlockFile(scope: !196, file: !164, discriminator: 0)
!207 = !DILocation(line: 384, column: 55, scope: !206, inlinedAt: !204)
!208 = !DILocation(line: 384, column: 43, scope: !206, inlinedAt: !204)
!209 = !DILocation(line: 2219, column: 20, scope: !196, inlinedAt: !204)
!210 = !{i8 0, i8 2}
!211 = !DILocation(line: 2221, column: 21, scope: !196, inlinedAt: !204)
!212 = !DILocation(line: 386, column: 39, scope: !187)
!213 = !DILocalVariable(name: "self", arg: 1, scope: !214, file: !215, line: 915, type: !221)
!214 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h6853ff56dcbd02a0E", scope: !216, file: !215, line: 915, type: !219, scopeLine: 915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !222)
!215 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "310ccb1a5479a9302756ed4297f2c8bd")
!216 = !DINamespace(name: "{impl#0}", scope: !217)
!217 = !DINamespace(name: "const_ptr", scope: !218)
!218 = !DINamespace(name: "ptr", scope: !143)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !221, !9}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!222 = !{!213, !223}
!223 = !DILocalVariable(name: "count", arg: 2, scope: !214, file: !215, line: 915, type: !9)
!224 = !DILocation(line: 915, column: 29, scope: !214, inlinedAt: !225)
!225 = distinct !DILocation(line: 386, column: 39, scope: !187)
!226 = !DILocation(line: 915, column: 35, scope: !214, inlinedAt: !225)
!227 = !DILocalVariable(name: "self", arg: 1, scope: !228, file: !215, line: 460, type: !221)
!228 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h7d8774c36bf4d034E", scope: !216, file: !215, line: 460, type: !229, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{!221, !221, !231}
!231 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!232 = !{!227, !233}
!233 = !DILocalVariable(name: "count", arg: 2, scope: !228, file: !215, line: 460, type: !231)
!234 = !DILocation(line: 460, column: 32, scope: !228, inlinedAt: !235)
!235 = distinct !DILocation(line: 920, column: 18, scope: !214, inlinedAt: !225)
!236 = !DILocation(line: 460, column: 38, scope: !228, inlinedAt: !235)
!237 = !DILocation(line: 465, column: 18, scope: !228, inlinedAt: !235)
!238 = !DILocation(line: 386, column: 71, scope: !187)
!239 = !DILocation(line: 386, column: 13, scope: !187)
!240 = !DILocation(line: 388, column: 6, scope: !163)
!241 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h15f541329c45e716E", scope: !165, file: !164, line: 391, type: !242, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !248)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !175, !244}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !245, templateParams: !24, identifier: "899239b578103bec8585cc6b84cfe53d")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !244, file: !2, baseType: !173, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !244, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !{!249, !250, !251}
!249 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !164, line: 391, type: !175)
!250 = !DILocalVariable(name: "slice", arg: 2, scope: !241, file: !164, line: 391, type: !244)
!251 = !DILocalVariable(name: "this", scope: !252, file: !164, line: 392, type: !175, align: 8)
!252 = distinct !DILexicalBlock(scope: !241, file: !164, line: 392, column: 9)
!253 = !DILocation(line: 391, column: 33, scope: !241)
!254 = !DILocation(line: 391, column: 39, scope: !241)
!255 = !DILocation(line: 392, column: 13, scope: !252)
!256 = !DILocation(line: 392, column: 20, scope: !241)
!257 = !DILocation(line: 395, column: 13, scope: !252)
!258 = !DILocalVariable(name: "this", arg: 1, scope: !259, file: !197, line: 2218, type: !175)
!259 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17h98ec7ac4b28f8648E", scope: !260, file: !197, line: 2218, type: !261, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !263)
!260 = !DINamespace(name: "get_unchecked_mut", scope: !165)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !175, !244}
!263 = !{!258, !264}
!264 = !DILocalVariable(name: "slice", arg: 2, scope: !259, file: !197, line: 2218, type: !244)
!265 = !DILocation(line: 2218, column: 39, scope: !259, inlinedAt: !266)
!266 = distinct !DILocation(line: 395, column: 13, scope: !252)
!267 = !DILocation(line: 398, column: 17, scope: !268, inlinedAt: !266)
!268 = !DILexicalBlockFile(scope: !259, file: !164, discriminator: 0)
!269 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !271, line: 1878, type: !244)
!270 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h4e8f7248369d348eE", scope: !272, file: !271, line: 1878, type: !274, scopeLine: 1878, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !276)
!271 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "8f9c2a68da2d937402d223242416154f")
!272 = !DINamespace(name: "{impl#1}", scope: !273)
!273 = !DINamespace(name: "mut_ptr", scope: !218)
!274 = !DISubroutineType(types: !275)
!275 = !{!9, !244}
!276 = !{!269}
!277 = !DILocation(line: 1878, column: 22, scope: !270, inlinedAt: !278)
!278 = distinct !DILocation(line: 398, column: 55, scope: !268, inlinedAt: !266)
!279 = !DILocation(line: 1879, column: 9, scope: !270, inlinedAt: !278)
!280 = !DILocation(line: 398, column: 43, scope: !268, inlinedAt: !266)
!281 = !DILocation(line: 2219, column: 20, scope: !259, inlinedAt: !266)
!282 = !DILocation(line: 2221, column: 21, scope: !259, inlinedAt: !266)
!283 = !DILocalVariable(name: "self", arg: 1, scope: !284, file: !271, line: 2014, type: !244)
!284 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17hd9785d4fc8f2dde8E", scope: !272, file: !271, line: 2014, type: !285, scopeLine: 2014, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !288)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !244}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !{!283}
!289 = !DILocation(line: 2014, column: 29, scope: !284, inlinedAt: !290)
!290 = distinct !DILocation(line: 400, column: 43, scope: !252)
!291 = !DILocalVariable(name: "self", arg: 1, scope: !292, file: !271, line: 1015, type: !287)
!292 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h0b563a5a4f4fdaa8E", scope: !293, file: !271, line: 1015, type: !294, scopeLine: 1015, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !296)
!293 = !DINamespace(name: "{impl#0}", scope: !273)
!294 = !DISubroutineType(types: !295)
!295 = !{!287, !287, !9}
!296 = !{!291, !297}
!297 = !DILocalVariable(name: "count", arg: 2, scope: !292, file: !271, line: 1015, type: !9)
!298 = !DILocation(line: 1015, column: 29, scope: !292, inlinedAt: !299)
!299 = distinct !DILocation(line: 400, column: 43, scope: !252)
!300 = !DILocation(line: 1015, column: 35, scope: !292, inlinedAt: !299)
!301 = !DILocalVariable(name: "self", arg: 1, scope: !302, file: !271, line: 472, type: !287)
!302 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h30bcd6b72f80b07fE", scope: !293, file: !271, line: 472, type: !303, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !305)
!303 = !DISubroutineType(types: !304)
!304 = !{!287, !287, !231}
!305 = !{!301, !306}
!306 = !DILocalVariable(name: "count", arg: 2, scope: !302, file: !271, line: 472, type: !231)
!307 = !DILocation(line: 472, column: 32, scope: !302, inlinedAt: !308)
!308 = distinct !DILocation(line: 1020, column: 18, scope: !292, inlinedAt: !299)
!309 = !DILocation(line: 472, column: 38, scope: !302, inlinedAt: !308)
!310 = !DILocation(line: 479, column: 18, scope: !302, inlinedAt: !308)
!311 = !DILocation(line: 400, column: 79, scope: !252)
!312 = !DILocation(line: 400, column: 13, scope: !252)
!313 = !DILocation(line: 402, column: 6, scope: !241)
!314 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h287b66d601df05f8E", scope: !165, file: !164, line: 405, type: !315, scopeLine: 405, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !334)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !175, !317, !321}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !318, templateParams: !24, identifier: "7239d4e26ceb1d376c52c25e25733da4")
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !317, file: !2, baseType: !173, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !317, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !323, file: !2, size: 192, align: 64, elements: !325, templateParams: !24, identifier: "ba91c9b532f73ed29960cd9fed44efec")
!323 = !DINamespace(name: "location", scope: !324)
!324 = !DINamespace(name: "panic", scope: !143)
!325 = !{!326, !332, !333}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !322, file: !2, baseType: !327, size: 128, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !328, templateParams: !24, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !327, file: !2, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !327, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !322, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !322, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!334 = !{!335, !336}
!335 = !DILocalVariable(name: "self", arg: 1, scope: !314, file: !164, line: 405, type: !175)
!336 = !DILocalVariable(name: "slice", arg: 2, scope: !314, file: !164, line: 405, type: !317)
!337 = !DILocation(line: 405, column: 14, scope: !314)
!338 = !DILocation(line: 405, column: 20, scope: !314)
!339 = !DILocation(line: 406, column: 12, scope: !314)
!340 = !DILocation(line: 408, column: 19, scope: !314)
!341 = !DILocation(line: 407, column: 13, scope: !314)
!342 = !DILocation(line: 412, column: 20, scope: !314)
!343 = !DILocation(line: 413, column: 6, scope: !314)
!344 = !DILocation(line: 409, column: 13, scope: !314)
!345 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h997e6282d5db556bE", scope: !165, file: !164, line: 416, type: !346, scopeLine: 416, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !352)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !175, !348, !321}
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !349, templateParams: !24, identifier: "8252aad9bb14d5b65538f9bf1aa31088")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !348, file: !2, baseType: !173, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !348, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "self", arg: 1, scope: !345, file: !164, line: 416, type: !175)
!354 = !DILocalVariable(name: "slice", arg: 2, scope: !345, file: !164, line: 416, type: !348)
!355 = !DILocation(line: 416, column: 18, scope: !345)
!356 = !DILocation(line: 416, column: 24, scope: !345)
!357 = !DILocation(line: 417, column: 12, scope: !345)
!358 = !DILocation(line: 419, column: 19, scope: !345)
!359 = !DILocation(line: 418, column: 13, scope: !345)
!360 = !DILocation(line: 423, column: 24, scope: !345)
!361 = !DILocation(line: 424, column: 6, scope: !345)
!362 = !DILocation(line: 420, column: 13, scope: !345)
!363 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h5412c5f9bbbd53aeE", scope: !364, file: !164, line: 460, type: !365, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !370)
!364 = !DINamespace(name: "{impl#5}", scope: !166)
!365 = !DISubroutineType(types: !366)
!366 = !{!348, !367, !348, !321}
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !368, templateParams: !181, identifier: "a4b3ef1fe64b8c3c189abf5d030d06aa")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !367, file: !2, baseType: !9, size: 64, align: 64)
!370 = !{!371, !372}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !363, file: !164, line: 460, type: !367)
!372 = !DILocalVariable(name: "slice", arg: 2, scope: !363, file: !164, line: 460, type: !348)
!373 = !DILocation(line: 460, column: 18, scope: !363)
!374 = !DILocation(line: 460, column: 24, scope: !363)
!375 = !DILocation(line: 461, column: 9, scope: !363)
!376 = !DILocation(line: 462, column: 6, scope: !363)
!377 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h4d6bf24801eca16eE", scope: !378, file: !164, line: 487, type: !379, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !384)
!378 = !DINamespace(name: "{impl#6}", scope: !166)
!379 = !DISubroutineType(types: !380)
!380 = !{!244, !381, !244}
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !382, templateParams: !181, identifier: "7746bb6200981691be5a874ad4af3168")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !381, file: !2, baseType: !9, size: 64, align: 64)
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "self", arg: 1, scope: !377, file: !164, line: 487, type: !381)
!386 = !DILocalVariable(name: "slice", arg: 2, scope: !377, file: !164, line: 487, type: !244)
!387 = !DILocation(line: 487, column: 33, scope: !377)
!388 = !DILocation(line: 487, column: 39, scope: !377)
!389 = !DILocation(line: 1878, column: 22, scope: !270, inlinedAt: !390)
!390 = distinct !DILocation(line: 489, column: 31, scope: !377)
!391 = !DILocation(line: 1879, column: 9, scope: !270, inlinedAt: !390)
!392 = !DILocation(line: 489, column: 18, scope: !377)
!393 = !DILocation(line: 490, column: 6, scope: !377)
!394 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h228b6d3bd03ce9c7E", scope: !378, file: !164, line: 502, type: !395, scopeLine: 502, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!348, !381, !348, !321}
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "self", arg: 1, scope: !394, file: !164, line: 502, type: !381)
!399 = !DILocalVariable(name: "slice", arg: 2, scope: !394, file: !164, line: 502, type: !348)
!400 = !DILocation(line: 502, column: 18, scope: !394)
!401 = !DILocation(line: 502, column: 24, scope: !394)
!402 = !DILocation(line: 503, column: 12, scope: !394)
!403 = !DILocation(line: 507, column: 24, scope: !394)
!404 = !DILocation(line: 508, column: 6, scope: !394)
!405 = !DILocation(line: 504, column: 13, scope: !394)
!406 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN115_$LT$core..ops..range..RangeInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h9378c84f89e88f47E", scope: !407, file: !164, line: 583, type: !408, scopeLine: 583, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !416)
!407 = !DINamespace(name: "{impl#8}", scope: !166)
!408 = !DISubroutineType(types: !409)
!409 = !{!348, !410, !348, !321}
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !176, file: !2, size: 192, align: 64, elements: !411, templateParams: !181, identifier: "8fe78dbb44e4a49690dc8d8213b74166")
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !410, file: !2, baseType: !9, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !410, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !410, file: !2, baseType: !415, size: 8, align: 8, offset: 128)
!415 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!416 = !{!417, !418}
!417 = !DILocalVariable(name: "self", arg: 1, scope: !406, file: !164, line: 583, type: !410)
!418 = !DILocalVariable(name: "slice", arg: 2, scope: !406, file: !164, line: 583, type: !348)
!419 = !DILocation(line: 583, column: 18, scope: !406)
!420 = !DILocation(line: 583, column: 24, scope: !406)
!421 = !DILocation(line: 584, column: 13, scope: !406)
!422 = !DILocation(line: 584, column: 12, scope: !406)
!423 = !DILocation(line: 587, column: 9, scope: !406)
!424 = !DILocation(line: 588, column: 6, scope: !406)
!425 = !DILocation(line: 585, column: 13, scope: !406)
!426 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN117_$LT$core..ops..range..RangeToInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17heb0f1984c841e2a1E", scope: !427, file: !164, line: 624, type: !428, scopeLine: 624, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !433)
!427 = !DINamespace(name: "{impl#9}", scope: !166)
!428 = !DISubroutineType(types: !429)
!429 = !{!348, !430, !348, !321}
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeToInclusive<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !431, templateParams: !181, identifier: "e79c17799af49a06694fb7fa59a0bddb")
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !430, file: !2, baseType: !9, size: 64, align: 64)
!433 = !{!434, !435}
!434 = !DILocalVariable(name: "self", arg: 1, scope: !426, file: !164, line: 624, type: !430)
!435 = !DILocalVariable(name: "slice", arg: 2, scope: !426, file: !164, line: 624, type: !348)
!436 = !DILocation(line: 624, column: 18, scope: !426)
!437 = !DILocation(line: 624, column: 24, scope: !426)
!438 = !DILocation(line: 625, column: 9, scope: !426)
!439 = !DILocation(line: 626, column: 6, scope: !426)
!440 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6021ca7e6427facaE", scope: !442, file: !441, line: 2396, type: !443, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !498)
!441 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!442 = !DINamespace(name: "{impl#59}", scope: !142)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !463, !464}
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !446, file: !2, size: 8, align: 8, elements: !447, templateParams: !24, identifier: "788bffb4789253a9afd2241f2cf6c63")
!446 = !DINamespace(name: "result", scope: !143)
!447 = !{!448}
!448 = !DICompositeType(tag: DW_TAG_variant_part, scope: !445, file: !2, size: 8, align: 8, elements: !449, templateParams: !24, identifier: "a5c9a77aaba9139ff38fda7f8eb66621", discriminator: !462)
!449 = !{!450, !458}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !448, file: !2, baseType: !451, size: 8, align: 8, extraData: i64 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !445, file: !2, size: 8, align: 8, elements: !452, templateParams: !454, identifier: "215bfedc2e085f664292f2a587a10cfd")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !451, file: !2, baseType: !7, align: 8, offset: 8)
!454 = !{!455, !456}
!455 = !DITemplateTypeParameter(name: "T", type: !7)
!456 = !DITemplateTypeParameter(name: "E", type: !457)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !142, file: !2, align: 8, elements: !24, identifier: "fc4dd510399c056143ebb04e96e96efe")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !448, file: !2, baseType: !459, size: 8, align: 8, extraData: i64 1)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !445, file: !2, size: 8, align: 8, elements: !460, templateParams: !454, identifier: "e9504b56de2478d488546b43335c032d")
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !459, file: !2, baseType: !457, align: 8, offset: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !445, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !465, size: 64, align: 64, dwarfAddressSpace: 0)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !142, file: !2, size: 512, align: 64, elements: !466, templateParams: !24, identifier: "9b9ae44c91c17007c5d6724c43bf796a")
!466 = !{!467, !468, !470, !471, !486, !487}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !465, file: !2, baseType: !469, size: 32, align: 32, offset: 416)
!469 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !465, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !465, file: !2, baseType: !472, size: 128, align: 64, offset: 128)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !473, file: !2, size: 128, align: 64, elements: !474, templateParams: !24, identifier: "7c810bf04bf09bbb6e233b88eeea1c13")
!473 = !DINamespace(name: "option", scope: !143)
!474 = !{!475}
!475 = !DICompositeType(tag: DW_TAG_variant_part, scope: !472, file: !2, size: 128, align: 64, elements: !476, templateParams: !24, identifier: "25288f32166afb81c64879a204cd361", discriminator: !485)
!476 = !{!477, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !475, file: !2, baseType: !478, size: 128, align: 64, extraData: i64 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !472, file: !2, size: 128, align: 64, elements: !24, templateParams: !479, identifier: "c47cd9059ac8b1d02d08c13c5ebdc9c5")
!479 = !{!480}
!480 = !DITemplateTypeParameter(name: "T", type: !9)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !475, file: !2, baseType: !482, size: 128, align: 64, extraData: i64 1)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !472, file: !2, size: 128, align: 64, elements: !483, templateParams: !479, identifier: "9e32042650b6fd1fa50bb285d2f0504a")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !482, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !465, file: !2, baseType: !472, size: 128, align: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !465, file: !2, baseType: !488, size: 128, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !489, templateParams: !24, identifier: "130a7508282b65bdc4224777d2c38b70")
!489 = !{!490, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !488, file: !2, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64, dwarfAddressSpace: 0)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "fbca469ffff351bd55eaf5b63e80f55")
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !488, file: !2, baseType: !494, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !495, size: 64, align: 64, dwarfAddressSpace: 0)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 3, lowerBound: 0)
!498 = !{!499, !500}
!499 = !DILocalVariable(name: "self", arg: 1, scope: !440, file: !441, line: 2396, type: !463)
!500 = !DILocalVariable(name: "f", arg: 2, scope: !440, file: !441, line: 2396, type: !464)
!501 = !DILocation(line: 2396, column: 20, scope: !440)
!502 = !DILocation(line: 2396, column: 27, scope: !440)
!503 = !DILocation(line: 2396, column: 71, scope: !440)
!504 = !{i64 8}
!505 = !DILocation(line: 2396, column: 62, scope: !440)
!506 = !DILocation(line: 2396, column: 84, scope: !440)
!507 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hb740925c6eb3f5d4E", scope: !442, file: !441, line: 2396, type: !508, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !514, retainedNodes: !511)
!508 = !DISubroutineType(types: !509)
!509 = !{!445, !510, !464}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "self", arg: 1, scope: !507, file: !441, line: 2396, type: !510)
!513 = !DILocalVariable(name: "f", arg: 2, scope: !507, file: !441, line: 2396, type: !464)
!514 = !{!515}
!515 = !DITemplateTypeParameter(name: "T", type: !26)
!516 = !DILocation(line: 2396, column: 20, scope: !507)
!517 = !DILocation(line: 2396, column: 27, scope: !507)
!518 = !DILocation(line: 2396, column: 71, scope: !507)
!519 = !{i64 4}
!520 = !DILocation(line: 2396, column: 62, scope: !507)
!521 = !DILocation(line: 2396, column: 84, scope: !507)
!522 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17hadd98891bdebc46aE", scope: !523, file: !197, line: 2253, type: !524, scopeLine: 2253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !526)
!523 = !DINamespace(name: "intrinsics", scope: !143)
!524 = !DISubroutineType(types: !525)
!525 = !{!415, !221, !221, !9}
!526 = !{!527, !528, !529, !530, !532, !534, !536}
!527 = !DILocalVariable(name: "src", arg: 1, scope: !522, file: !197, line: 2253, type: !221)
!528 = !DILocalVariable(name: "dst", arg: 2, scope: !522, file: !197, line: 2253, type: !221)
!529 = !DILocalVariable(name: "count", arg: 3, scope: !522, file: !197, line: 2253, type: !9)
!530 = !DILocalVariable(name: "src_usize", scope: !531, file: !197, line: 2254, type: !9, align: 8)
!531 = distinct !DILexicalBlock(scope: !522, file: !197, line: 2254, column: 5)
!532 = !DILocalVariable(name: "dst_usize", scope: !533, file: !197, line: 2255, type: !9, align: 8)
!533 = distinct !DILexicalBlock(scope: !531, file: !197, line: 2255, column: 5)
!534 = !DILocalVariable(name: "size", scope: !535, file: !197, line: 2256, type: !9, align: 8)
!535 = distinct !DILexicalBlock(scope: !533, file: !197, line: 2256, column: 5)
!536 = !DILocalVariable(name: "diff", scope: !537, file: !197, line: 2257, type: !9, align: 8)
!537 = distinct !DILexicalBlock(scope: !535, file: !197, line: 2257, column: 5)
!538 = !DILocation(line: 2253, column: 36, scope: !522)
!539 = !DILocation(line: 2253, column: 51, scope: !522)
!540 = !DILocation(line: 2253, column: 66, scope: !522)
!541 = !DILocation(line: 2257, column: 9, scope: !537)
!542 = !DILocalVariable(name: "self", arg: 1, scope: !543, file: !215, line: 203, type: !221)
!543 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h75af8660e25638c6E", scope: !216, file: !215, line: 203, type: !544, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!9, !221}
!546 = !{!542}
!547 = !DILocation(line: 203, column: 17, scope: !543, inlinedAt: !548)
!548 = distinct !DILocation(line: 2254, column: 21, scope: !522)
!549 = !DILocalVariable(name: "self", arg: 1, scope: !550, file: !215, line: 58, type: !221)
!550 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h047194b75c9db07cE", scope: !216, file: !215, line: 58, type: !551, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !554, retainedNodes: !553)
!551 = !DISubroutineType(types: !552)
!552 = !{!6, !221}
!553 = !{!549}
!554 = !{!189, !555}
!555 = !DITemplateTypeParameter(name: "U", type: !7)
!556 = !DILocation(line: 58, column: 26, scope: !550, inlinedAt: !557)
!557 = distinct !DILocation(line: 207, column: 33, scope: !543, inlinedAt: !548)
!558 = !DILocation(line: 207, column: 18, scope: !543, inlinedAt: !548)
!559 = !DILocation(line: 2254, column: 21, scope: !522)
!560 = !DILocation(line: 2254, column: 9, scope: !531)
!561 = !DILocation(line: 203, column: 17, scope: !543, inlinedAt: !562)
!562 = distinct !DILocation(line: 2255, column: 21, scope: !531)
!563 = !DILocation(line: 58, column: 26, scope: !550, inlinedAt: !564)
!564 = distinct !DILocation(line: 207, column: 33, scope: !543, inlinedAt: !562)
!565 = !DILocation(line: 207, column: 18, scope: !543, inlinedAt: !562)
!566 = !DILocation(line: 2255, column: 21, scope: !531)
!567 = !DILocation(line: 2255, column: 9, scope: !533)
!568 = !DILocation(line: 2256, column: 16, scope: !533)
!569 = !DILocation(line: 2256, column: 9, scope: !535)
!570 = !DILocation(line: 2257, column: 19, scope: !535)
!571 = !DILocation(line: 2257, column: 74, scope: !535)
!572 = !DILocation(line: 2257, column: 43, scope: !535)
!573 = !DILocation(line: 2257, column: 16, scope: !535)
!574 = !DILocation(line: 2260, column: 5, scope: !537)
!575 = !DILocation(line: 2261, column: 2, scope: !522)
!576 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17hb745d534b1a3fc84E", scope: !523, file: !197, line: 2353, type: !577, scopeLine: 2353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !221, !287, !9}
!579 = !{!580, !581, !582}
!580 = !DILocalVariable(name: "src", arg: 1, scope: !576, file: !197, line: 2353, type: !221)
!581 = !DILocalVariable(name: "dst", arg: 2, scope: !576, file: !197, line: 2353, type: !287)
!582 = !DILocalVariable(name: "count", arg: 3, scope: !576, file: !197, line: 2353, type: !9)
!583 = !DILocation(line: 2353, column: 44, scope: !576)
!584 = !DILocation(line: 2353, column: 59, scope: !576)
!585 = !DILocation(line: 2353, column: 72, scope: !576)
!586 = !DILocation(line: 2362, column: 9, scope: !576)
!587 = !DILocalVariable(name: "src", arg: 1, scope: !588, file: !197, line: 2218, type: !221)
!588 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h72501f1547f5aaeaE", scope: !589, file: !197, line: 2218, type: !577, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !590)
!589 = !DINamespace(name: "copy_nonoverlapping", scope: !523)
!590 = !{!587, !591, !592}
!591 = !DILocalVariable(name: "dst", arg: 2, scope: !588, file: !197, line: 2218, type: !287)
!592 = !DILocalVariable(name: "count", arg: 3, scope: !588, file: !197, line: 2218, type: !9)
!593 = !DILocation(line: 2218, column: 39, scope: !588, inlinedAt: !594)
!594 = distinct !DILocation(line: 2362, column: 9, scope: !576)
!595 = !DILocation(line: 2366, column: 13, scope: !588, inlinedAt: !594)
!596 = !DILocation(line: 2367, column: 20, scope: !588, inlinedAt: !594)
!597 = !DILocation(line: 2368, column: 20, scope: !588, inlinedAt: !594)
!598 = !DILocation(line: 2219, column: 20, scope: !588, inlinedAt: !594)
!599 = !DILocation(line: 2221, column: 21, scope: !588, inlinedAt: !594)
!600 = !DILocation(line: 2370, column: 9, scope: !576)
!601 = !DILocation(line: 2372, column: 2, scope: !576)
!602 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17he6b556ffae8c6245E", scope: !523, file: !197, line: 2353, type: !603, scopeLine: 2353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !479, retainedNodes: !607)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !605, !606, !9}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!607 = !{!608, !609, !610}
!608 = !DILocalVariable(name: "src", arg: 1, scope: !602, file: !197, line: 2353, type: !605)
!609 = !DILocalVariable(name: "dst", arg: 2, scope: !602, file: !197, line: 2353, type: !606)
!610 = !DILocalVariable(name: "count", arg: 3, scope: !602, file: !197, line: 2353, type: !9)
!611 = !DILocation(line: 2353, column: 44, scope: !602)
!612 = !DILocation(line: 2353, column: 59, scope: !602)
!613 = !DILocation(line: 2353, column: 72, scope: !602)
!614 = !DILocation(line: 2362, column: 9, scope: !602)
!615 = !DILocalVariable(name: "src", arg: 1, scope: !616, file: !197, line: 2218, type: !605)
!616 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h5f2075035140fd79E", scope: !589, file: !197, line: 2218, type: !603, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !479, retainedNodes: !617)
!617 = !{!615, !618, !619}
!618 = !DILocalVariable(name: "dst", arg: 2, scope: !616, file: !197, line: 2218, type: !606)
!619 = !DILocalVariable(name: "count", arg: 3, scope: !616, file: !197, line: 2218, type: !9)
!620 = !DILocation(line: 2218, column: 39, scope: !616, inlinedAt: !621)
!621 = distinct !DILocation(line: 2362, column: 9, scope: !602)
!622 = !DILocation(line: 2366, column: 13, scope: !616, inlinedAt: !621)
!623 = !DILocation(line: 2367, column: 20, scope: !616, inlinedAt: !621)
!624 = !DILocation(line: 2368, column: 20, scope: !616, inlinedAt: !621)
!625 = !DILocation(line: 2219, column: 20, scope: !616, inlinedAt: !621)
!626 = !DILocation(line: 2221, column: 21, scope: !616, inlinedAt: !621)
!627 = !DILocation(line: 2370, column: 9, scope: !602)
!628 = !DILocation(line: 2372, column: 2, scope: !602)
!629 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h6a60c6b4bab249b8E", scope: !523, file: !197, line: 2237, type: !630, scopeLine: 2237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!415, !221}
!632 = !{!633}
!633 = !DILocalVariable(name: "ptr", arg: 1, scope: !629, file: !197, line: 2237, type: !221)
!634 = !DILocation(line: 2237, column: 42, scope: !629)
!635 = !DILocation(line: 2238, column: 6, scope: !629)
!636 = !DILocation(line: 2238, column: 5, scope: !629)
!637 = !DILocation(line: 2238, column: 23, scope: !629)
!638 = !DILocation(line: 2239, column: 2, scope: !629)
!639 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h826fcd3d06ba96b4E", scope: !523, file: !197, line: 2237, type: !640, scopeLine: 2237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !655, retainedNodes: !653)
!640 = !DISubroutineType(types: !641)
!641 = !{!415, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !643, size: 64, align: 64, dwarfAddressSpace: 0)
!643 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !644, file: !2, size: 192, align: 64, elements: !646, templateParams: !188, identifier: "528b41129458118f58cbd7553824be9")
!644 = !DINamespace(name: "maybe_uninit", scope: !645)
!645 = !DINamespace(name: "mem", scope: !143)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !643, file: !2, baseType: !7, align: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !643, file: !2, baseType: !649, size: 192, align: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !650, file: !2, size: 192, align: 64, elements: !651, templateParams: !188, identifier: "19c6fa3444ffdd416edd43c726664d8f")
!650 = !DINamespace(name: "manually_drop", scope: !645)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !2, baseType: !13, size: 192, align: 64)
!653 = !{!654}
!654 = !DILocalVariable(name: "ptr", arg: 1, scope: !639, file: !197, line: 2237, type: !642)
!655 = !{!656}
!656 = !DITemplateTypeParameter(name: "T", type: !643)
!657 = !DILocation(line: 2237, column: 42, scope: !639)
!658 = !DILocation(line: 2238, column: 6, scope: !639)
!659 = !DILocation(line: 2238, column: 5, scope: !639)
!660 = !DILocation(line: 2238, column: 23, scope: !639)
!661 = !DILocation(line: 2239, column: 2, scope: !639)
!662 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hf4c172ba13be3f02E", scope: !523, file: !197, line: 2243, type: !663, scopeLine: 2243, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!415, !9}
!665 = !{!666, !667}
!666 = !DILocalVariable(name: "len", arg: 1, scope: !662, file: !197, line: 2243, type: !9)
!667 = !DILocalVariable(name: "max_len", scope: !668, file: !197, line: 2244, type: !9, align: 8)
!668 = distinct !DILexicalBlock(scope: !662, file: !197, line: 2244, column: 5)
!669 = !DILocation(line: 2243, column: 43, scope: !662)
!670 = !DILocation(line: 2244, column: 19, scope: !662)
!671 = !DILocation(line: 2244, column: 9, scope: !668)
!672 = !DILocation(line: 2248, column: 5, scope: !668)
!673 = !DILocation(line: 2249, column: 2, scope: !662)
!674 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h9831803a7b3cada9E", scope: !523, file: !197, line: 2443, type: !603, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !479, retainedNodes: !675)
!675 = !{!676, !677, !678}
!676 = !DILocalVariable(name: "src", arg: 1, scope: !674, file: !197, line: 2443, type: !605)
!677 = !DILocalVariable(name: "dst", arg: 2, scope: !674, file: !197, line: 2443, type: !606)
!678 = !DILocalVariable(name: "count", arg: 3, scope: !674, file: !197, line: 2443, type: !9)
!679 = !DILocation(line: 2443, column: 29, scope: !674)
!680 = !DILocation(line: 2443, column: 44, scope: !674)
!681 = !DILocation(line: 2443, column: 57, scope: !674)
!682 = !DILocation(line: 2451, column: 9, scope: !674)
!683 = !DILocalVariable(name: "src", arg: 1, scope: !684, file: !197, line: 2218, type: !605)
!684 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17ha701b94fc6bd3866E", scope: !685, file: !197, line: 2218, type: !686, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !479, retainedNodes: !688)
!685 = !DINamespace(name: "copy", scope: !523)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !605, !606}
!688 = !{!683, !689}
!689 = !DILocalVariable(name: "dst", arg: 2, scope: !684, file: !197, line: 2218, type: !606)
!690 = !DILocation(line: 2218, column: 39, scope: !684, inlinedAt: !691)
!691 = distinct !DILocation(line: 2451, column: 9, scope: !674)
!692 = !DILocation(line: 2454, column: 13, scope: !684, inlinedAt: !691)
!693 = !DILocation(line: 2454, column: 45, scope: !684, inlinedAt: !691)
!694 = !DILocation(line: 2219, column: 20, scope: !684, inlinedAt: !691)
!695 = !DILocation(line: 2221, column: 21, scope: !684, inlinedAt: !691)
!696 = !DILocation(line: 2456, column: 9, scope: !674)
!697 = !DILocation(line: 2458, column: 2, scope: !674)
!698 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17hc5335cd0346ba533E", scope: !523, file: !197, line: 2443, type: !577, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !699)
!699 = !{!700, !701, !702}
!700 = !DILocalVariable(name: "src", arg: 1, scope: !698, file: !197, line: 2443, type: !221)
!701 = !DILocalVariable(name: "dst", arg: 2, scope: !698, file: !197, line: 2443, type: !287)
!702 = !DILocalVariable(name: "count", arg: 3, scope: !698, file: !197, line: 2443, type: !9)
!703 = !DILocation(line: 2443, column: 29, scope: !698)
!704 = !DILocation(line: 2443, column: 44, scope: !698)
!705 = !DILocation(line: 2443, column: 57, scope: !698)
!706 = !DILocation(line: 2451, column: 9, scope: !698)
!707 = !DILocalVariable(name: "src", arg: 1, scope: !708, file: !197, line: 2218, type: !221)
!708 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17h76ee47e5dba4e515E", scope: !685, file: !197, line: 2218, type: !709, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !221, !287}
!711 = !{!707, !712}
!712 = !DILocalVariable(name: "dst", arg: 2, scope: !708, file: !197, line: 2218, type: !287)
!713 = !DILocation(line: 2218, column: 39, scope: !708, inlinedAt: !714)
!714 = distinct !DILocation(line: 2451, column: 9, scope: !698)
!715 = !DILocation(line: 2454, column: 13, scope: !708, inlinedAt: !714)
!716 = !DILocation(line: 2454, column: 45, scope: !708, inlinedAt: !714)
!717 = !DILocation(line: 2219, column: 20, scope: !708, inlinedAt: !714)
!718 = !DILocation(line: 2221, column: 21, scope: !708, inlinedAt: !714)
!719 = !DILocation(line: 2456, column: 9, scope: !698)
!720 = !DILocation(line: 2458, column: 2, scope: !698)
!721 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17h20daabefeafea6fcE", scope: !723, file: !722, line: 1409, type: !725, scopeLine: 1409, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !727)
!722 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "3edd07a073af9fa0170275f7799f80b9")
!723 = !DINamespace(name: "{impl#63}", scope: !724)
!724 = !DINamespace(name: "impls", scope: !150)
!725 = !DISubroutineType(types: !726)
!726 = !{!149, !132, !132}
!727 = !{!728, !729}
!728 = !DILocalVariable(name: "self", arg: 1, scope: !721, file: !722, line: 1409, type: !132)
!729 = !DILocalVariable(name: "other", arg: 2, scope: !721, file: !722, line: 1409, type: !132)
!730 = !DILocation(line: 1409, column: 24, scope: !721)
!731 = !DILocation(line: 1409, column: 31, scope: !721)
!732 = !DILocation(line: 1412, column: 24, scope: !721)
!733 = !DILocation(line: 1412, column: 32, scope: !721)
!734 = !DILocation(line: 1413, column: 29, scope: !721)
!735 = !DILocation(line: 1413, column: 38, scope: !721)
!736 = !DILocation(line: 1412, column: 41, scope: !721)
!737 = !DILocation(line: 1412, column: 21, scope: !721)
!738 = !DILocation(line: 1415, column: 18, scope: !721)
!739 = !{i8 -1, i8 2}
!740 = !DILocation(line: 1414, column: 28, scope: !721)
!741 = !DILocation(line: 1413, column: 26, scope: !721)
!742 = !DILocation(line: 1413, column: 47, scope: !721)
!743 = distinct !DISubprogram(name: "new_lower_hex<u64>", linkageName: "_ZN4core3fmt10ArgumentV113new_lower_hex17h433ba05b4d707d9bE", scope: !744, file: !441, line: 329, type: !754, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !758, retainedNodes: !756)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !142, file: !2, size: 128, align: 64, elements: !745, templateParams: !24, identifier: "f24895bf20b1f11393e3198b0078cd90")
!745 = !{!746, !750}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !2, baseType: !747, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !748, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !749, file: !2, align: 8, elements: !24, identifier: "83cf1042a24ae6619d6bcd30f5d788ab")
!749 = !DINamespace(name: "{extern#0}", scope: !142)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !744, file: !2, baseType: !751, size: 64, align: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !752, size: 64, align: 64, dwarfAddressSpace: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!445, !747, !464}
!754 = !DISubroutineType(types: !755)
!755 = !{!744, !132}
!756 = !{!757}
!757 = !DILocalVariable(name: "x", arg: 1, scope: !743, file: !441, line: 329, type: !132)
!758 = !{!759}
!759 = !DITemplateTypeParameter(name: "T", type: !22)
!760 = !DILocation(line: 329, column: 30, scope: !743)
!761 = !DILocation(line: 330, column: 13, scope: !743)
!762 = !DILocation(line: 331, column: 10, scope: !743)
!763 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17h5b1a2ebb45fc8c47E", scope: !765, file: !764, line: 185, type: !767, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !769)
!764 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!765 = !DINamespace(name: "{impl#86}", scope: !766)
!766 = !DINamespace(name: "num", scope: !142)
!767 = !DISubroutineType(types: !768)
!768 = !{!445, !85, !464}
!769 = !{!770, !771}
!770 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !764, line: 185, type: !85)
!771 = !DILocalVariable(name: "f", arg: 2, scope: !763, file: !764, line: 185, type: !464)
!772 = !DILocation(line: 185, column: 20, scope: !763)
!773 = !DILocation(line: 185, column: 27, scope: !763)
!774 = !DILocation(line: 186, column: 20, scope: !763)
!775 = !DILocation(line: 188, column: 27, scope: !763)
!776 = !DILocation(line: 187, column: 21, scope: !763)
!777 = !DILocation(line: 193, column: 14, scope: !763)
!778 = !DILocation(line: 191, column: 21, scope: !763)
!779 = !DILocation(line: 189, column: 21, scope: !763)
!780 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17hb863c40d86c7fdd5E", scope: !781, file: !764, line: 185, type: !782, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !784)
!781 = !DINamespace(name: "{impl#87}", scope: !766)
!782 = !DISubroutineType(types: !783)
!783 = !{!445, !132, !464}
!784 = !{!785, !786}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !764, line: 185, type: !132)
!786 = !DILocalVariable(name: "f", arg: 2, scope: !780, file: !764, line: 185, type: !464)
!787 = !DILocation(line: 185, column: 20, scope: !780)
!788 = !DILocation(line: 185, column: 27, scope: !780)
!789 = !DILocation(line: 186, column: 20, scope: !780)
!790 = !DILocation(line: 188, column: 27, scope: !780)
!791 = !DILocation(line: 187, column: 21, scope: !780)
!792 = !DILocation(line: 193, column: 14, scope: !780)
!793 = !DILocation(line: 191, column: 21, scope: !780)
!794 = !DILocation(line: 189, column: 21, scope: !780)
!795 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h3b408f9ace557e17E", scope: !797, file: !796, line: 627, type: !806, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !830, retainedNodes: !823)
!796 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a909d1cde985fb0d953605fd1b0e0e2")
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !798, file: !2, size: 128, align: 64, elements: !799, templateParams: !24, identifier: "ecb3007fc91522dc2ad34c10a595dc7")
!798 = !DINamespace(name: "builders", scope: !142)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !797, file: !2, baseType: !801, size: 128, align: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !798, file: !2, size: 128, align: 64, elements: !802, templateParams: !24, identifier: "4b6969bebc5568bbacf6ed98d6711e01")
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !801, file: !2, baseType: !464, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !801, file: !2, baseType: !445, size: 8, align: 8, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !801, file: !2, baseType: !415, size: 8, align: 8, offset: 72)
!806 = !DISubroutineType(types: !807)
!807 = !{!808, !808, !809}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !797, size: 64, align: 64, dwarfAddressSpace: 0)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !810, file: !2, size: 128, align: 64, elements: !811, templateParams: !188, identifier: "87276184c4fc8f8d4fbdfae86f6b7f55")
!810 = !DINamespace(name: "iter", scope: !167)
!811 = !{!812, !817, !818}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !809, file: !2, baseType: !813, size: 64, align: 64, offset: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !814, file: !2, size: 64, align: 64, elements: !815, templateParams: !188, identifier: "d8af6e52327b59c36040bbc53dd43636")
!814 = !DINamespace(name: "non_null", scope: !218)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !813, file: !2, baseType: !221, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !809, file: !2, baseType: !221, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !809, file: !2, baseType: !819, align: 8)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !820, file: !2, align: 8, elements: !24, templateParams: !821, identifier: "24b1620c5164e9156e4d4eb02e6bc37c")
!820 = !DINamespace(name: "marker", scope: !143)
!821 = !{!822}
!822 = !DITemplateTypeParameter(name: "T", type: !12)
!823 = !{!824, !825, !826, !828}
!824 = !DILocalVariable(name: "self", arg: 1, scope: !795, file: !796, line: 627, type: !808)
!825 = !DILocalVariable(name: "entries", arg: 2, scope: !795, file: !796, line: 627, type: !809)
!826 = !DILocalVariable(name: "iter", scope: !827, file: !796, line: 632, type: !809, align: 8)
!827 = distinct !DILexicalBlock(scope: !795, file: !796, line: 632, column: 9)
!828 = !DILocalVariable(name: "entry", scope: !829, file: !796, line: 632, type: !12, align: 8)
!829 = distinct !DILexicalBlock(scope: !827, file: !796, line: 632, column: 30)
!830 = !{!831, !832}
!831 = !DITemplateTypeParameter(name: "D", type: !12)
!832 = !DITemplateTypeParameter(name: "I", type: !809)
!833 = !DILocation(line: 627, column: 26, scope: !795)
!834 = !DILocation(line: 627, column: 37, scope: !795)
!835 = !DILocation(line: 632, column: 22, scope: !827)
!836 = !DILocation(line: 632, column: 13, scope: !829)
!837 = !DILocation(line: 632, column: 22, scope: !795)
!838 = !DILocation(line: 632, column: 9, scope: !827)
!839 = !DILocation(line: 636, column: 6, scope: !795)
!840 = !DILocation(line: 632, column: 13, scope: !827)
!841 = !DILocation(line: 633, column: 13, scope: !829)
!842 = !DILocation(line: 634, column: 9, scope: !827)
!843 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h34d6d65ca81cd693E", scope: !844, file: !441, line: 421, type: !903, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !908)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !142, file: !2, size: 384, align: 64, elements: !845, templateParams: !24, identifier: "6349816354aa93c9c1313312dc1f6df8")
!845 = !{!846, !852, !897}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !844, file: !2, baseType: !847, size: 128, align: 64, offset: 128)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !848, templateParams: !24, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!848 = !{!849, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !847, file: !2, baseType: !850, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !847, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !844, file: !2, baseType: !853, size: 128, align: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !473, file: !2, size: 128, align: 64, elements: !854, templateParams: !24, identifier: "910dbdb16568df75bf80cbca1fd92433")
!854 = !{!855}
!855 = !DICompositeType(tag: DW_TAG_variant_part, scope: !853, file: !2, size: 128, align: 64, elements: !856, templateParams: !24, identifier: "4edb0d8a2ee15e0b56ae5d0c9c0bf0e4", discriminator: !896)
!856 = !{!857, !892}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !855, file: !2, baseType: !858, size: 128, align: 64, extraData: i64 0)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !853, file: !2, size: 128, align: 64, elements: !24, templateParams: !859, identifier: "75c4f2bae4e0df9abc28affa1d548c12")
!859 = !{!860}
!860 = !DITemplateTypeParameter(name: "T", type: !861)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !862, templateParams: !24, identifier: "770d9f14499d58ad818fe834fdf51bee")
!862 = !{!863, !891}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !861, file: !2, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64, dwarfAddressSpace: 0)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 448, align: 64, elements: !866, templateParams: !24, identifier: "14c90a8ea4c7c37d10839a7eae9d70c9")
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !865, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !865, file: !2, baseType: !869, size: 384, align: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !140, file: !2, size: 384, align: 64, elements: !870, templateParams: !24, identifier: "9423f974ddb81c1ca3f1597108bb064b")
!870 = !{!871, !872, !873, !874, !890}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !869, file: !2, baseType: !469, size: 32, align: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !869, file: !2, baseType: !139, size: 8, align: 8, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !869, file: !2, baseType: !27, size: 32, align: 32, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !869, file: !2, baseType: !875, size: 128, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !876, templateParams: !24, identifier: "ec8ec62201f5a20b9b4c5a51c0d9aa46")
!876 = !{!877}
!877 = !DICompositeType(tag: DW_TAG_variant_part, scope: !875, file: !2, size: 128, align: 64, elements: !878, templateParams: !24, identifier: "dd09d2bfb4745e3e9134dcbed11f4b9d", discriminator: !889)
!878 = !{!879, !883, !887}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !877, file: !2, baseType: !880, size: 128, align: 64, extraData: i64 0)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !875, file: !2, size: 128, align: 64, elements: !881, templateParams: !24, identifier: "5365717288fdddaf146e25f47cafbb54")
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !880, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !877, file: !2, baseType: !884, size: 128, align: 64, extraData: i64 1)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !875, file: !2, size: 128, align: 64, elements: !885, templateParams: !24, identifier: "af5fa2811eb9b5a263adff7f4d011b48")
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !884, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !877, file: !2, baseType: !888, size: 128, align: 64, extraData: i64 2)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !875, file: !2, size: 128, align: 64, elements: !24, identifier: "2a6ef902c5b7fb9a8009fad57d3503d8")
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !875, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !869, file: !2, baseType: !875, size: 128, align: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !861, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !855, file: !2, baseType: !893, size: 128, align: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !853, file: !2, size: 128, align: 64, elements: !894, templateParams: !859, identifier: "20162f7a0a4aaa9d58fd63d979338130")
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !893, file: !2, baseType: !861, size: 128, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !844, file: !2, baseType: !898, size: 128, align: 64, offset: 256)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !899, templateParams: !24, identifier: "aad5c4f4aeaf5e472bfbf21d14bdaedf")
!899 = !{!900, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !898, file: !2, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !898, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!844, !847, !898, !861, !905}
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !142, file: !2, align: 8, elements: !906, templateParams: !24, identifier: "70b4bad5302e8381b9a9ce3886429509")
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !905, file: !2, baseType: !7, align: 8)
!908 = !{!909, !910, !911, !912}
!909 = !DILocalVariable(name: "pieces", arg: 1, scope: !843, file: !441, line: 422, type: !847)
!910 = !DILocalVariable(name: "args", arg: 2, scope: !843, file: !441, line: 423, type: !898)
!911 = !DILocalVariable(name: "fmt", arg: 3, scope: !843, file: !441, line: 424, type: !861)
!912 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !843, file: !441, line: 425, type: !905)
!913 = !DILocation(line: 422, column: 9, scope: !843)
!914 = !DILocation(line: 423, column: 9, scope: !843)
!915 = !DILocation(line: 424, column: 9, scope: !843)
!916 = !DILocation(line: 425, column: 9, scope: !843)
!917 = !DILocation(line: 427, column: 34, scope: !843)
!918 = !DILocation(line: 427, column: 9, scope: !843)
!919 = !DILocation(line: 428, column: 6, scope: !843)
!920 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h30dac65f16f7140aE", scope: !844, file: !441, line: 401, type: !921, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{!844, !847, !898}
!923 = !{!924, !925}
!924 = !DILocalVariable(name: "pieces", arg: 1, scope: !920, file: !441, line: 401, type: !847)
!925 = !DILocalVariable(name: "args", arg: 2, scope: !920, file: !441, line: 401, type: !898)
!926 = !DILocation(line: 401, column: 25, scope: !920)
!927 = !DILocation(line: 401, column: 53, scope: !920)
!928 = !DILocation(line: 402, column: 12, scope: !920)
!929 = !DILocation(line: 402, column: 56, scope: !920)
!930 = !DILocation(line: 402, column: 41, scope: !920)
!931 = !DILocation(line: 405, column: 34, scope: !920)
!932 = !DILocation(line: 405, column: 9, scope: !920)
!933 = !DILocation(line: 406, column: 6, scope: !920)
!934 = !DILocation(line: 403, column: 13, scope: !920)
!935 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17hb5406f0a3506dab5E", scope: !645, file: !936, line: 756, type: !937, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !940)
!936 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2818803a2f5479a3883c65b3bb9963fd")
!937 = !DISubroutineType(types: !938)
!938 = !{null, !939, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!940 = !{!941, !942, !943, !945}
!941 = !DILocalVariable(name: "x", arg: 1, scope: !935, file: !936, line: 756, type: !939)
!942 = !DILocalVariable(name: "y", arg: 2, scope: !935, file: !936, line: 756, type: !939)
!943 = !DILocalVariable(name: "a", scope: !944, file: !936, line: 773, type: !13, align: 8)
!944 = distinct !DILexicalBlock(scope: !935, file: !936, line: 773, column: 9)
!945 = !DILocalVariable(name: "b", scope: !946, file: !936, line: 774, type: !13, align: 8)
!946 = distinct !DILexicalBlock(scope: !944, file: !936, line: 774, column: 9)
!947 = !DILocation(line: 756, column: 36, scope: !935)
!948 = !DILocation(line: 756, column: 47, scope: !935)
!949 = !DILocation(line: 773, column: 13, scope: !944)
!950 = !DILocation(line: 774, column: 13, scope: !946)
!951 = !DILocation(line: 773, column: 17, scope: !935)
!952 = !DILocation(line: 774, column: 17, scope: !944)
!953 = !DILocation(line: 775, column: 23, scope: !946)
!954 = !DILocation(line: 775, column: 9, scope: !946)
!955 = !DILocation(line: 776, column: 23, scope: !946)
!956 = !DILocation(line: 776, column: 9, scope: !946)
!957 = !DILocation(line: 778, column: 2, scope: !935)
!958 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17hede3dff591370c1cE", scope: !645, file: !936, line: 756, type: !959, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !655, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !961, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !643, size: 64, align: 64, dwarfAddressSpace: 0)
!962 = !{!963, !964, !965, !967}
!963 = !DILocalVariable(name: "x", arg: 1, scope: !958, file: !936, line: 756, type: !961)
!964 = !DILocalVariable(name: "y", arg: 2, scope: !958, file: !936, line: 756, type: !961)
!965 = !DILocalVariable(name: "a", scope: !966, file: !936, line: 773, type: !643, align: 8)
!966 = distinct !DILexicalBlock(scope: !958, file: !936, line: 773, column: 9)
!967 = !DILocalVariable(name: "b", scope: !968, file: !936, line: 774, type: !643, align: 8)
!968 = distinct !DILexicalBlock(scope: !966, file: !936, line: 774, column: 9)
!969 = !DILocation(line: 756, column: 36, scope: !958)
!970 = !DILocation(line: 756, column: 47, scope: !958)
!971 = !DILocation(line: 773, column: 13, scope: !966)
!972 = !DILocation(line: 774, column: 13, scope: !968)
!973 = !DILocation(line: 773, column: 17, scope: !958)
!974 = !DILocation(line: 774, column: 17, scope: !966)
!975 = !DILocation(line: 775, column: 23, scope: !968)
!976 = !DILocation(line: 775, column: 9, scope: !968)
!977 = !DILocation(line: 776, column: 23, scope: !968)
!978 = !DILocation(line: 776, column: 9, scope: !968)
!979 = !DILocation(line: 778, column: 2, scope: !958)
!980 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17hdd0820cc94f081c7E", scope: !645, file: !936, line: 719, type: !937, scopeLine: 719, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !981)
!981 = !{!982, !983}
!982 = !DILocalVariable(name: "x", arg: 1, scope: !980, file: !936, line: 719, type: !939)
!983 = !DILocalVariable(name: "y", arg: 2, scope: !980, file: !936, line: 719, type: !939)
!984 = !DILocation(line: 719, column: 22, scope: !980)
!985 = !DILocation(line: 719, column: 33, scope: !980)
!986 = !DILocation(line: 734, column: 12, scope: !980)
!987 = !DILocation(line: 748, column: 5, scope: !980)
!988 = !DILocation(line: 737, column: 29, scope: !980)
!989 = !DILocation(line: 749, column: 2, scope: !980)
!990 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17h17e565d642337995E", scope: !645, file: !936, line: 148, type: !991, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !13}
!993 = !{!994}
!994 = !DILocalVariable(name: "t", arg: 1, scope: !990, file: !936, line: 148, type: !13)
!995 = !DILocation(line: 148, column: 24, scope: !990)
!996 = !DILocalVariable(name: "value", arg: 1, scope: !997, file: !998, line: 70, type: !13)
!997 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17h92caa8560d3d7000E", scope: !649, file: !998, line: 70, type: !999, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !188, retainedNodes: !1001)
!998 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!999 = !DISubroutineType(types: !1000)
!1000 = !{!649, !13}
!1001 = !{!996}
!1002 = !DILocation(line: 70, column: 22, scope: !997, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 149, column: 13, scope: !990)
!1004 = !DILocation(line: 71, column: 9, scope: !997, inlinedAt: !1003)
!1005 = !DILocation(line: 150, column: 2, scope: !990)
!1006 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h72c30a1e2370563bE", scope: !1008, file: !1007, line: 571, type: !1010, scopeLine: 571, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1012)
!1007 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "83927209ac309798655233058ca6d5ae")
!1008 = !DINamespace(name: "{impl#11}", scope: !1009)
!1009 = !DINamespace(name: "num", scope: !143)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!472, !9, !9}
!1012 = !{!1013, !1014, !1015, !1017}
!1013 = !DILocalVariable(name: "self", arg: 1, scope: !1006, file: !1007, line: 571, type: !9)
!1014 = !DILocalVariable(name: "rhs", arg: 2, scope: !1006, file: !1007, line: 571, type: !9)
!1015 = !DILocalVariable(name: "a", scope: !1016, file: !1007, line: 572, type: !9, align: 8)
!1016 = distinct !DILexicalBlock(scope: !1006, file: !1007, line: 572, column: 13)
!1017 = !DILocalVariable(name: "b", scope: !1016, file: !1007, line: 572, type: !415, align: 1)
!1018 = !DILocation(line: 571, column: 34, scope: !1006)
!1019 = !DILocation(line: 571, column: 40, scope: !1006)
!1020 = !DILocalVariable(name: "self", arg: 1, scope: !1021, file: !1007, line: 1698, type: !9)
!1021 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17hfb2247e143eeda61E", scope: !1008, file: !1007, line: 1698, type: !1022, scopeLine: 1698, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1028)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !9, !9}
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !1025, templateParams: !24, identifier: "5d4cb4b3e2da4aeebd47965411ffedac")
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1024, file: !2, baseType: !9, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1024, file: !2, baseType: !415, size: 8, align: 8, offset: 64)
!1028 = !{!1020, !1029, !1030, !1032}
!1029 = !DILocalVariable(name: "rhs", arg: 2, scope: !1021, file: !1007, line: 1698, type: !9)
!1030 = !DILocalVariable(name: "a", scope: !1031, file: !1007, line: 1699, type: !22, align: 8)
!1031 = distinct !DILexicalBlock(scope: !1021, file: !1007, line: 1699, column: 13)
!1032 = !DILocalVariable(name: "b", scope: !1031, file: !1007, line: 1699, type: !415, align: 1)
!1033 = !DILocation(line: 1698, column: 38, scope: !1021, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 572, column: 26, scope: !1006)
!1035 = !DILocation(line: 1698, column: 44, scope: !1021, inlinedAt: !1034)
!1036 = !DILocation(line: 1699, column: 26, scope: !1021, inlinedAt: !1034)
!1037 = !DILocation(line: 1699, column: 18, scope: !1021, inlinedAt: !1034)
!1038 = !DILocation(line: 1699, column: 18, scope: !1031, inlinedAt: !1034)
