; ModuleID = 'bootloader.ebac9e79-cgu.0'
source_filename = "bootloader.ebac9e79-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::ops::range::RangeInclusive<usize>" = type { i64, i64, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::mem::manually_drop::ManuallyDrop<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { %"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" }
%"core::mem::maybe_uninit::MaybeUninit<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { [3 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "c546fe0483c488e9e9c45ceeb8a737fa")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "8ed342ef475793d783a172808af5275f")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "3b867001a47ec42fac11900805495c72")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "9619534a641401472dc42129a6860822")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "5f8d8bc9a008c10bb39d338f7e7602b7")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "66ff2dcbfb38c216c91c93b33c8afb87")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "1fe14ef0b638e6ac439cbcdfc6c4b85a")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "76a36f92706138bc96068bd075a152f1")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "e83d82324c180bc28d13ffeb5e6d6edf")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "989fb4aea1a4161d614b0726cc27e6fb")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "778dd39aa88855aa410dab5423c32a0")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "e037b49fac83d2dc55bcc45435618a87")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "cbd012db968e3b3ab1f8d3265fbe90e1")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "70647e3b853d5fbc78a98226bf104528")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 7, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !162, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/lib.rs/@/bootloader.ebac9e79-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23")
!138 = !{!26, !139, !149, !156}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!140 = !DINamespace(name: "v1", scope: !141)
!141 = !DINamespace(name: "rt", scope: !142)
!142 = !DINamespace(name: "fmt", scope: !143)
!143 = !DINamespace(name: "core", scope: null)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !150, file: !2, baseType: !151, size: 8, align: 8, flags: DIFlagEnumClass, elements: !152)
!150 = !DINamespace(name: "cmp", scope: !143)
!151 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "Less", value: -1)
!154 = !DIEnumerator(name: "Equal", value: 0)
!155 = !DIEnumerator(name: "Greater", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !157, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !158)
!157 = !DINamespace(name: "panicking", scope: !143)
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!162 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!163 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h01361d41522453d9E", scope: !165, file: !164, line: 374, type: !168, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !183)
!164 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "1350c165f4aa6e79d8fe4fa0de29c328")
!165 = !DINamespace(name: "{impl#4}", scope: !166)
!166 = !DINamespace(name: "index", scope: !167)
!167 = !DINamespace(name: "slice", scope: !143)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !175, !170}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !171, templateParams: !24, identifier: "5797476d2273060f8d7bda1f5194a52")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !176, file: !2, size: 128, align: 64, elements: !178, templateParams: !181, identifier: "a38539fb613303b2a542584743e0908e")
!176 = !DINamespace(name: "range", scope: !177)
!177 = !DINamespace(name: "ops", scope: !143)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "Idx", type: !9)
!183 = !{!184, !185, !186, !188}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !164, line: 374, type: !175)
!185 = !DILocalVariable(name: "slice", arg: 2, scope: !163, file: !164, line: 374, type: !170)
!186 = !DILocalVariable(name: "this", scope: !187, file: !164, line: 375, type: !175, align: 8)
!187 = distinct !DILexicalBlock(scope: !163, file: !164, line: 375, column: 9)
!188 = !DILocalVariable(name: "new_len", scope: !189, file: !164, line: 386, type: !9, align: 8)
!189 = distinct !DILexicalBlock(scope: !187, file: !164, line: 386, column: 13)
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !13)
!192 = !DILocation(line: 374, column: 29, scope: !163)
!193 = !DILocation(line: 374, column: 35, scope: !163)
!194 = !DILocation(line: 375, column: 13, scope: !187)
!195 = !DILocation(line: 375, column: 20, scope: !163)
!196 = !DILocation(line: 381, column: 13, scope: !187)
!197 = !DILocalVariable(name: "this", arg: 1, scope: !198, file: !199, line: 2241, type: !175)
!198 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17h2ec63823b488252cE", scope: !200, file: !199, line: 2241, type: !201, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !203)
!199 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!200 = !DINamespace(name: "get_unchecked", scope: !165)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !175, !170}
!203 = !{!197, !204}
!204 = !DILocalVariable(name: "slice", arg: 2, scope: !198, file: !199, line: 2241, type: !170)
!205 = !DILocation(line: 2241, column: 39, scope: !198, inlinedAt: !206)
!206 = distinct !DILocation(line: 381, column: 13, scope: !187)
!207 = !DILocation(line: 384, column: 17, scope: !208, inlinedAt: !206)
!208 = !DILexicalBlockFile(scope: !198, file: !164, discriminator: 0)
!209 = !DILocation(line: 384, column: 55, scope: !208, inlinedAt: !206)
!210 = !DILocation(line: 384, column: 43, scope: !208, inlinedAt: !206)
!211 = !DILocation(line: 2242, column: 20, scope: !198, inlinedAt: !206)
!212 = !{i8 0, i8 2}
!213 = !DILocation(line: 2244, column: 21, scope: !198, inlinedAt: !206)
!214 = !DILocation(line: 386, column: 27, scope: !187)
!215 = !DILocation(line: 386, column: 17, scope: !189)
!216 = !DILocation(line: 387, column: 39, scope: !189)
!217 = !DILocalVariable(name: "self", arg: 1, scope: !218, file: !219, line: 915, type: !225)
!218 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h995ff155af770048E", scope: !220, file: !219, line: 915, type: !223, scopeLine: 915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !226)
!219 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "310ccb1a5479a9302756ed4297f2c8bd")
!220 = !DINamespace(name: "{impl#0}", scope: !221)
!221 = !DINamespace(name: "const_ptr", scope: !222)
!222 = !DINamespace(name: "ptr", scope: !143)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !225, !9}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !{!217, !227}
!227 = !DILocalVariable(name: "count", arg: 2, scope: !218, file: !219, line: 915, type: !9)
!228 = !DILocation(line: 915, column: 29, scope: !218, inlinedAt: !229)
!229 = distinct !DILocation(line: 387, column: 39, scope: !189)
!230 = !DILocation(line: 915, column: 35, scope: !218, inlinedAt: !229)
!231 = !DILocalVariable(name: "self", arg: 1, scope: !232, file: !219, line: 460, type: !225)
!232 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17haeeea06ee69b2584E", scope: !220, file: !219, line: 460, type: !233, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !236)
!233 = !DISubroutineType(types: !234)
!234 = !{!225, !225, !235}
!235 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!236 = !{!231, !237}
!237 = !DILocalVariable(name: "count", arg: 2, scope: !232, file: !219, line: 460, type: !235)
!238 = !DILocation(line: 460, column: 32, scope: !232, inlinedAt: !239)
!239 = distinct !DILocation(line: 920, column: 18, scope: !218, inlinedAt: !229)
!240 = !DILocation(line: 460, column: 38, scope: !232, inlinedAt: !239)
!241 = !DILocation(line: 465, column: 18, scope: !232, inlinedAt: !239)
!242 = !DILocation(line: 387, column: 13, scope: !189)
!243 = !DILocation(line: 389, column: 6, scope: !163)
!244 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h202392f75bbf82dcE", scope: !165, file: !164, line: 392, type: !245, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !251)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !175, !247}
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !248, templateParams: !24, identifier: "538f63368f63e612b22e7d3cb1555069")
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !247, file: !2, baseType: !173, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !247, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!251 = !{!252, !253, !254, !256}
!252 = !DILocalVariable(name: "self", arg: 1, scope: !244, file: !164, line: 392, type: !175)
!253 = !DILocalVariable(name: "slice", arg: 2, scope: !244, file: !164, line: 392, type: !247)
!254 = !DILocalVariable(name: "this", scope: !255, file: !164, line: 393, type: !175, align: 8)
!255 = distinct !DILexicalBlock(scope: !244, file: !164, line: 393, column: 9)
!256 = !DILocalVariable(name: "new_len", scope: !257, file: !164, line: 401, type: !9, align: 8)
!257 = distinct !DILexicalBlock(scope: !255, file: !164, line: 401, column: 13)
!258 = !DILocation(line: 392, column: 33, scope: !244)
!259 = !DILocation(line: 392, column: 39, scope: !244)
!260 = !DILocation(line: 393, column: 13, scope: !255)
!261 = !DILocation(line: 393, column: 20, scope: !244)
!262 = !DILocation(line: 396, column: 13, scope: !255)
!263 = !DILocalVariable(name: "this", arg: 1, scope: !264, file: !199, line: 2241, type: !175)
!264 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17hd00ddf68feedb094E", scope: !265, file: !199, line: 2241, type: !266, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !268)
!265 = !DINamespace(name: "get_unchecked_mut", scope: !165)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !175, !247}
!268 = !{!263, !269}
!269 = !DILocalVariable(name: "slice", arg: 2, scope: !264, file: !199, line: 2241, type: !247)
!270 = !DILocation(line: 2241, column: 39, scope: !264, inlinedAt: !271)
!271 = distinct !DILocation(line: 396, column: 13, scope: !255)
!272 = !DILocation(line: 399, column: 17, scope: !273, inlinedAt: !271)
!273 = !DILexicalBlockFile(scope: !264, file: !164, discriminator: 0)
!274 = !DILocalVariable(name: "self", arg: 1, scope: !275, file: !276, line: 1878, type: !247)
!275 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17hd04d3e9db1b39a63E", scope: !277, file: !276, line: 1878, type: !279, scopeLine: 1878, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !281)
!276 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "8f9c2a68da2d937402d223242416154f")
!277 = !DINamespace(name: "{impl#1}", scope: !278)
!278 = !DINamespace(name: "mut_ptr", scope: !222)
!279 = !DISubroutineType(types: !280)
!280 = !{!9, !247}
!281 = !{!274}
!282 = !DILocation(line: 1878, column: 22, scope: !275, inlinedAt: !283)
!283 = distinct !DILocation(line: 399, column: 55, scope: !273, inlinedAt: !271)
!284 = !DILocation(line: 1879, column: 9, scope: !275, inlinedAt: !283)
!285 = !DILocation(line: 399, column: 43, scope: !273, inlinedAt: !271)
!286 = !DILocation(line: 2242, column: 20, scope: !264, inlinedAt: !271)
!287 = !DILocation(line: 2244, column: 21, scope: !264, inlinedAt: !271)
!288 = !DILocation(line: 401, column: 27, scope: !255)
!289 = !DILocation(line: 401, column: 17, scope: !257)
!290 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !276, line: 2014, type: !247)
!291 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17hb51cbd1a342bd3abE", scope: !277, file: !276, line: 2014, type: !292, scopeLine: 2014, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !295)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !247}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !{!290}
!296 = !DILocation(line: 2014, column: 29, scope: !291, inlinedAt: !297)
!297 = distinct !DILocation(line: 402, column: 43, scope: !257)
!298 = !DILocalVariable(name: "self", arg: 1, scope: !299, file: !276, line: 1015, type: !294)
!299 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hd6d5461b94be3585E", scope: !300, file: !276, line: 1015, type: !301, scopeLine: 1015, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !303)
!300 = !DINamespace(name: "{impl#0}", scope: !278)
!301 = !DISubroutineType(types: !302)
!302 = !{!294, !294, !9}
!303 = !{!298, !304}
!304 = !DILocalVariable(name: "count", arg: 2, scope: !299, file: !276, line: 1015, type: !9)
!305 = !DILocation(line: 1015, column: 29, scope: !299, inlinedAt: !306)
!306 = distinct !DILocation(line: 402, column: 43, scope: !257)
!307 = !DILocation(line: 1015, column: 35, scope: !299, inlinedAt: !306)
!308 = !DILocalVariable(name: "self", arg: 1, scope: !309, file: !276, line: 472, type: !294)
!309 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h936bc12661a38c4eE", scope: !300, file: !276, line: 472, type: !310, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{!294, !294, !235}
!312 = !{!308, !313}
!313 = !DILocalVariable(name: "count", arg: 2, scope: !309, file: !276, line: 472, type: !235)
!314 = !DILocation(line: 472, column: 32, scope: !309, inlinedAt: !315)
!315 = distinct !DILocation(line: 1020, column: 18, scope: !299, inlinedAt: !306)
!316 = !DILocation(line: 472, column: 38, scope: !309, inlinedAt: !315)
!317 = !DILocation(line: 479, column: 18, scope: !309, inlinedAt: !315)
!318 = !DILocation(line: 402, column: 13, scope: !257)
!319 = !DILocation(line: 404, column: 6, scope: !244)
!320 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h406a63f4bfd5143aE", scope: !165, file: !164, line: 407, type: !321, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !340)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !175, !323, !327}
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !324, templateParams: !24, identifier: "1d67cf81949e39173126ea85579b3671")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !323, file: !2, baseType: !173, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !323, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !329, file: !2, size: 192, align: 64, elements: !331, templateParams: !24, identifier: "ce713e8941e9786f7cd6b9ed5cdf02a8")
!329 = !DINamespace(name: "location", scope: !330)
!330 = !DINamespace(name: "panic", scope: !143)
!331 = !{!332, !338, !339}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !328, file: !2, baseType: !333, size: 128, align: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !334, templateParams: !24, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !333, file: !2, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !328, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !328, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!340 = !{!341, !342}
!341 = !DILocalVariable(name: "self", arg: 1, scope: !320, file: !164, line: 407, type: !175)
!342 = !DILocalVariable(name: "slice", arg: 2, scope: !320, file: !164, line: 407, type: !323)
!343 = !DILocation(line: 407, column: 14, scope: !320)
!344 = !DILocation(line: 407, column: 20, scope: !320)
!345 = !DILocation(line: 408, column: 12, scope: !320)
!346 = !DILocation(line: 410, column: 19, scope: !320)
!347 = !DILocation(line: 409, column: 13, scope: !320)
!348 = !DILocation(line: 414, column: 20, scope: !320)
!349 = !DILocation(line: 415, column: 6, scope: !320)
!350 = !DILocation(line: 411, column: 13, scope: !320)
!351 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h1b9025a7c2eacdb7E", scope: !165, file: !164, line: 418, type: !352, scopeLine: 418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !358)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !175, !354, !327}
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !355, templateParams: !24, identifier: "6c0b6b6f98ebaee45f3544413fce9d70")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !354, file: !2, baseType: !173, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !354, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!358 = !{!359, !360}
!359 = !DILocalVariable(name: "self", arg: 1, scope: !351, file: !164, line: 418, type: !175)
!360 = !DILocalVariable(name: "slice", arg: 2, scope: !351, file: !164, line: 418, type: !354)
!361 = !DILocation(line: 418, column: 18, scope: !351)
!362 = !DILocation(line: 418, column: 24, scope: !351)
!363 = !DILocation(line: 419, column: 12, scope: !351)
!364 = !DILocation(line: 421, column: 19, scope: !351)
!365 = !DILocation(line: 420, column: 13, scope: !351)
!366 = !DILocation(line: 425, column: 24, scope: !351)
!367 = !DILocation(line: 426, column: 6, scope: !351)
!368 = !DILocation(line: 422, column: 13, scope: !351)
!369 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h18893aedccd47536E", scope: !370, file: !164, line: 462, type: !371, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !376)
!370 = !DINamespace(name: "{impl#5}", scope: !166)
!371 = !DISubroutineType(types: !372)
!372 = !{!354, !373, !354, !327}
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !374, templateParams: !181, identifier: "eef9e250acf500f29d1a295d662e643c")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !373, file: !2, baseType: !9, size: 64, align: 64)
!376 = !{!377, !378}
!377 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !164, line: 462, type: !373)
!378 = !DILocalVariable(name: "slice", arg: 2, scope: !369, file: !164, line: 462, type: !354)
!379 = !DILocation(line: 462, column: 18, scope: !369)
!380 = !DILocation(line: 462, column: 24, scope: !369)
!381 = !DILocation(line: 463, column: 9, scope: !369)
!382 = !DILocation(line: 464, column: 6, scope: !369)
!383 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h61dddd128cad722aE", scope: !384, file: !164, line: 489, type: !385, scopeLine: 489, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !390)
!384 = !DINamespace(name: "{impl#6}", scope: !166)
!385 = !DISubroutineType(types: !386)
!386 = !{!247, !387, !247}
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !388, templateParams: !181, identifier: "99fed6f0a894aa5b34f9722931a161de")
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !387, file: !2, baseType: !9, size: 64, align: 64)
!390 = !{!391, !392}
!391 = !DILocalVariable(name: "self", arg: 1, scope: !383, file: !164, line: 489, type: !387)
!392 = !DILocalVariable(name: "slice", arg: 2, scope: !383, file: !164, line: 489, type: !247)
!393 = !DILocation(line: 489, column: 33, scope: !383)
!394 = !DILocation(line: 489, column: 39, scope: !383)
!395 = !DILocation(line: 1878, column: 22, scope: !275, inlinedAt: !396)
!396 = distinct !DILocation(line: 491, column: 31, scope: !383)
!397 = !DILocation(line: 1879, column: 9, scope: !275, inlinedAt: !396)
!398 = !DILocation(line: 491, column: 18, scope: !383)
!399 = !DILocation(line: 492, column: 6, scope: !383)
!400 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hc9f1df66d2642dbcE", scope: !384, file: !164, line: 504, type: !401, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!354, !387, !354, !327}
!403 = !{!404, !405}
!404 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !164, line: 504, type: !387)
!405 = !DILocalVariable(name: "slice", arg: 2, scope: !400, file: !164, line: 504, type: !354)
!406 = !DILocation(line: 504, column: 18, scope: !400)
!407 = !DILocation(line: 504, column: 24, scope: !400)
!408 = !DILocation(line: 505, column: 12, scope: !400)
!409 = !DILocation(line: 509, column: 24, scope: !400)
!410 = !DILocation(line: 510, column: 6, scope: !400)
!411 = !DILocation(line: 506, column: 13, scope: !400)
!412 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN115_$LT$core..ops..range..RangeInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h4e9f4e6aca761bfaE", scope: !413, file: !164, line: 585, type: !414, scopeLine: 585, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !422)
!413 = !DINamespace(name: "{impl#8}", scope: !166)
!414 = !DISubroutineType(types: !415)
!415 = !{!354, !416, !354, !327}
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !176, file: !2, size: 192, align: 64, elements: !417, templateParams: !181, identifier: "b64482fb51ba2b5cdadb166cbbe28d89")
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !416, file: !2, baseType: !9, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !416, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !416, file: !2, baseType: !421, size: 8, align: 8, offset: 128)
!421 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!422 = !{!423, !424}
!423 = !DILocalVariable(name: "self", arg: 1, scope: !412, file: !164, line: 585, type: !416)
!424 = !DILocalVariable(name: "slice", arg: 2, scope: !412, file: !164, line: 585, type: !354)
!425 = !DILocation(line: 585, column: 18, scope: !412)
!426 = !DILocation(line: 585, column: 24, scope: !412)
!427 = !DILocation(line: 586, column: 13, scope: !412)
!428 = !DILocation(line: 586, column: 12, scope: !412)
!429 = !DILocation(line: 589, column: 9, scope: !412)
!430 = !DILocation(line: 590, column: 6, scope: !412)
!431 = !DILocation(line: 587, column: 13, scope: !412)
!432 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN117_$LT$core..ops..range..RangeToInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h9a90a00cb3549364E", scope: !433, file: !164, line: 626, type: !434, scopeLine: 626, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !439)
!433 = !DINamespace(name: "{impl#9}", scope: !166)
!434 = !DISubroutineType(types: !435)
!435 = !{!354, !436, !354, !327}
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeToInclusive<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !437, templateParams: !181, identifier: "ec941d5de8b2d79bd435b04e7bdf9715")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !436, file: !2, baseType: !9, size: 64, align: 64)
!439 = !{!440, !441}
!440 = !DILocalVariable(name: "self", arg: 1, scope: !432, file: !164, line: 626, type: !436)
!441 = !DILocalVariable(name: "slice", arg: 2, scope: !432, file: !164, line: 626, type: !354)
!442 = !DILocation(line: 626, column: 18, scope: !432)
!443 = !DILocation(line: 626, column: 24, scope: !432)
!444 = !DILocation(line: 627, column: 9, scope: !432)
!445 = !DILocation(line: 628, column: 6, scope: !432)
!446 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h1484d596ca396b6fE", scope: !448, file: !447, line: 2396, type: !449, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !504)
!447 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!448 = !DINamespace(name: "{impl#59}", scope: !142)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !469, !470}
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !452, file: !2, size: 8, align: 8, elements: !453, templateParams: !24, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!452 = !DINamespace(name: "result", scope: !143)
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_variant_part, scope: !451, file: !2, size: 8, align: 8, elements: !455, templateParams: !24, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !468)
!455 = !{!456, !464}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !454, file: !2, baseType: !457, size: 8, align: 8, extraData: i64 0)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !451, file: !2, size: 8, align: 8, elements: !458, templateParams: !460, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !457, file: !2, baseType: !7, align: 8, offset: 8)
!460 = !{!461, !462}
!461 = !DITemplateTypeParameter(name: "T", type: !7)
!462 = !DITemplateTypeParameter(name: "E", type: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !142, file: !2, align: 8, elements: !24, identifier: "c2c8f2f945c37359aa57422093183824")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !454, file: !2, baseType: !465, size: 8, align: 8, extraData: i64 1)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !451, file: !2, size: 8, align: 8, elements: !466, templateParams: !460, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !465, file: !2, baseType: !463, align: 8, offset: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !471, size: 64, align: 64, dwarfAddressSpace: 0)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !142, file: !2, size: 512, align: 64, elements: !472, templateParams: !24, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!472 = !{!473, !474, !476, !477, !492, !493}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !471, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !471, file: !2, baseType: !475, size: 32, align: 32, offset: 416)
!475 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !471, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !471, file: !2, baseType: !478, size: 128, align: 64, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !479, file: !2, size: 128, align: 64, elements: !480, templateParams: !24, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!479 = !DINamespace(name: "option", scope: !143)
!480 = !{!481}
!481 = !DICompositeType(tag: DW_TAG_variant_part, scope: !478, file: !2, size: 128, align: 64, elements: !482, templateParams: !24, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !491)
!482 = !{!483, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !481, file: !2, baseType: !484, size: 128, align: 64, extraData: i64 0)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !478, file: !2, size: 128, align: 64, elements: !24, templateParams: !485, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!485 = !{!486}
!486 = !DITemplateTypeParameter(name: "T", type: !9)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !481, file: !2, baseType: !488, size: 128, align: 64, extraData: i64 1)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !478, file: !2, size: 128, align: 64, elements: !489, templateParams: !485, identifier: "eec942390a307d7c8c2162b2092f63f3")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !478, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !471, file: !2, baseType: !478, size: 128, align: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !471, file: !2, baseType: !494, size: 128, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !495, templateParams: !24, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!495 = !{!496, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !494, file: !2, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "bb744bac75d5d19249a16512e8e296c")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !494, file: !2, baseType: !500, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 3, lowerBound: 0)
!504 = !{!505, !506}
!505 = !DILocalVariable(name: "self", arg: 1, scope: !446, file: !447, line: 2396, type: !469)
!506 = !DILocalVariable(name: "f", arg: 2, scope: !446, file: !447, line: 2396, type: !470)
!507 = !DILocation(line: 2396, column: 20, scope: !446)
!508 = !DILocation(line: 2396, column: 27, scope: !446)
!509 = !DILocation(line: 2396, column: 71, scope: !446)
!510 = !{i64 8}
!511 = !DILocation(line: 2396, column: 62, scope: !446)
!512 = !DILocation(line: 2396, column: 84, scope: !446)
!513 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17heb471c0ce559efb1E", scope: !448, file: !447, line: 2396, type: !514, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !520, retainedNodes: !517)
!514 = !DISubroutineType(types: !515)
!515 = !{!451, !516, !470}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "self", arg: 1, scope: !513, file: !447, line: 2396, type: !516)
!519 = !DILocalVariable(name: "f", arg: 2, scope: !513, file: !447, line: 2396, type: !470)
!520 = !{!521}
!521 = !DITemplateTypeParameter(name: "T", type: !26)
!522 = !DILocation(line: 2396, column: 20, scope: !513)
!523 = !DILocation(line: 2396, column: 27, scope: !513)
!524 = !DILocation(line: 2396, column: 71, scope: !513)
!525 = !{i64 4}
!526 = !DILocation(line: 2396, column: 62, scope: !513)
!527 = !DILocation(line: 2396, column: 84, scope: !513)
!528 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h5c56d261f36d6e12E", scope: !529, file: !199, line: 2276, type: !530, scopeLine: 2276, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !532)
!529 = !DINamespace(name: "intrinsics", scope: !143)
!530 = !DISubroutineType(types: !531)
!531 = !{!421, !225, !225, !9}
!532 = !{!533, !534, !535, !536, !538, !540, !542}
!533 = !DILocalVariable(name: "src", arg: 1, scope: !528, file: !199, line: 2276, type: !225)
!534 = !DILocalVariable(name: "dst", arg: 2, scope: !528, file: !199, line: 2276, type: !225)
!535 = !DILocalVariable(name: "count", arg: 3, scope: !528, file: !199, line: 2276, type: !9)
!536 = !DILocalVariable(name: "src_usize", scope: !537, file: !199, line: 2277, type: !9, align: 8)
!537 = distinct !DILexicalBlock(scope: !528, file: !199, line: 2277, column: 5)
!538 = !DILocalVariable(name: "dst_usize", scope: !539, file: !199, line: 2278, type: !9, align: 8)
!539 = distinct !DILexicalBlock(scope: !537, file: !199, line: 2278, column: 5)
!540 = !DILocalVariable(name: "size", scope: !541, file: !199, line: 2279, type: !9, align: 8)
!541 = distinct !DILexicalBlock(scope: !539, file: !199, line: 2279, column: 5)
!542 = !DILocalVariable(name: "diff", scope: !543, file: !199, line: 2280, type: !9, align: 8)
!543 = distinct !DILexicalBlock(scope: !541, file: !199, line: 2280, column: 5)
!544 = !DILocation(line: 2276, column: 36, scope: !528)
!545 = !DILocation(line: 2276, column: 51, scope: !528)
!546 = !DILocation(line: 2276, column: 66, scope: !528)
!547 = !DILocation(line: 2280, column: 9, scope: !543)
!548 = !DILocalVariable(name: "self", arg: 1, scope: !549, file: !219, line: 203, type: !225)
!549 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h0a99ed6458449ea9E", scope: !220, file: !219, line: 203, type: !550, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!9, !225}
!552 = !{!548}
!553 = !DILocation(line: 203, column: 17, scope: !549, inlinedAt: !554)
!554 = distinct !DILocation(line: 2277, column: 21, scope: !528)
!555 = !DILocalVariable(name: "self", arg: 1, scope: !556, file: !219, line: 58, type: !225)
!556 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h1b8afa316f16578aE", scope: !220, file: !219, line: 58, type: !557, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !560, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!6, !225}
!559 = !{!555}
!560 = !{!191, !561}
!561 = !DITemplateTypeParameter(name: "U", type: !7)
!562 = !DILocation(line: 58, column: 26, scope: !556, inlinedAt: !563)
!563 = distinct !DILocation(line: 207, column: 33, scope: !549, inlinedAt: !554)
!564 = !DILocation(line: 207, column: 18, scope: !549, inlinedAt: !554)
!565 = !DILocation(line: 2277, column: 21, scope: !528)
!566 = !DILocation(line: 2277, column: 9, scope: !537)
!567 = !DILocation(line: 203, column: 17, scope: !549, inlinedAt: !568)
!568 = distinct !DILocation(line: 2278, column: 21, scope: !537)
!569 = !DILocation(line: 58, column: 26, scope: !556, inlinedAt: !570)
!570 = distinct !DILocation(line: 207, column: 33, scope: !549, inlinedAt: !568)
!571 = !DILocation(line: 207, column: 18, scope: !549, inlinedAt: !568)
!572 = !DILocation(line: 2278, column: 21, scope: !537)
!573 = !DILocation(line: 2278, column: 9, scope: !539)
!574 = !DILocation(line: 2279, column: 16, scope: !539)
!575 = !DILocation(line: 2279, column: 9, scope: !541)
!576 = !DILocation(line: 2280, column: 19, scope: !541)
!577 = !DILocation(line: 2280, column: 74, scope: !541)
!578 = !DILocation(line: 2280, column: 43, scope: !541)
!579 = !DILocation(line: 2280, column: 16, scope: !541)
!580 = !DILocation(line: 2283, column: 5, scope: !543)
!581 = !DILocation(line: 2284, column: 2, scope: !528)
!582 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h2200521e5e5761abE", scope: !529, file: !199, line: 2376, type: !583, scopeLine: 2376, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !225, !294, !9}
!585 = !{!586, !587, !588}
!586 = !DILocalVariable(name: "src", arg: 1, scope: !582, file: !199, line: 2376, type: !225)
!587 = !DILocalVariable(name: "dst", arg: 2, scope: !582, file: !199, line: 2376, type: !294)
!588 = !DILocalVariable(name: "count", arg: 3, scope: !582, file: !199, line: 2376, type: !9)
!589 = !DILocation(line: 2376, column: 44, scope: !582)
!590 = !DILocation(line: 2376, column: 59, scope: !582)
!591 = !DILocation(line: 2376, column: 72, scope: !582)
!592 = !DILocation(line: 2385, column: 9, scope: !582)
!593 = !DILocalVariable(name: "src", arg: 1, scope: !594, file: !199, line: 2241, type: !225)
!594 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h20abb14ad7aa314fE", scope: !595, file: !199, line: 2241, type: !583, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !596)
!595 = !DINamespace(name: "copy_nonoverlapping", scope: !529)
!596 = !{!593, !597, !598}
!597 = !DILocalVariable(name: "dst", arg: 2, scope: !594, file: !199, line: 2241, type: !294)
!598 = !DILocalVariable(name: "count", arg: 3, scope: !594, file: !199, line: 2241, type: !9)
!599 = !DILocation(line: 2241, column: 39, scope: !594, inlinedAt: !600)
!600 = distinct !DILocation(line: 2385, column: 9, scope: !582)
!601 = !DILocation(line: 2389, column: 13, scope: !594, inlinedAt: !600)
!602 = !DILocation(line: 2390, column: 20, scope: !594, inlinedAt: !600)
!603 = !DILocation(line: 2391, column: 20, scope: !594, inlinedAt: !600)
!604 = !DILocation(line: 2242, column: 20, scope: !594, inlinedAt: !600)
!605 = !DILocation(line: 2244, column: 21, scope: !594, inlinedAt: !600)
!606 = !DILocation(line: 2393, column: 9, scope: !582)
!607 = !DILocation(line: 2395, column: 2, scope: !582)
!608 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h520356a0fc1741dcE", scope: !529, file: !199, line: 2376, type: !609, scopeLine: 2376, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !613)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611, !612, !9}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(name: "src", arg: 1, scope: !608, file: !199, line: 2376, type: !611)
!615 = !DILocalVariable(name: "dst", arg: 2, scope: !608, file: !199, line: 2376, type: !612)
!616 = !DILocalVariable(name: "count", arg: 3, scope: !608, file: !199, line: 2376, type: !9)
!617 = !DILocation(line: 2376, column: 44, scope: !608)
!618 = !DILocation(line: 2376, column: 59, scope: !608)
!619 = !DILocation(line: 2376, column: 72, scope: !608)
!620 = !DILocation(line: 2385, column: 9, scope: !608)
!621 = !DILocalVariable(name: "src", arg: 1, scope: !622, file: !199, line: 2241, type: !611)
!622 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17hb7bcf291927b3151E", scope: !595, file: !199, line: 2241, type: !609, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !623)
!623 = !{!621, !624, !625}
!624 = !DILocalVariable(name: "dst", arg: 2, scope: !622, file: !199, line: 2241, type: !612)
!625 = !DILocalVariable(name: "count", arg: 3, scope: !622, file: !199, line: 2241, type: !9)
!626 = !DILocation(line: 2241, column: 39, scope: !622, inlinedAt: !627)
!627 = distinct !DILocation(line: 2385, column: 9, scope: !608)
!628 = !DILocation(line: 2389, column: 13, scope: !622, inlinedAt: !627)
!629 = !DILocation(line: 2390, column: 20, scope: !622, inlinedAt: !627)
!630 = !DILocation(line: 2391, column: 20, scope: !622, inlinedAt: !627)
!631 = !DILocation(line: 2242, column: 20, scope: !622, inlinedAt: !627)
!632 = !DILocation(line: 2244, column: 21, scope: !622, inlinedAt: !627)
!633 = !DILocation(line: 2393, column: 9, scope: !608)
!634 = !DILocation(line: 2395, column: 2, scope: !608)
!635 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h39b99bb979a2c2caE", scope: !529, file: !199, line: 2260, type: !636, scopeLine: 2260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!421, !225}
!638 = !{!639}
!639 = !DILocalVariable(name: "ptr", arg: 1, scope: !635, file: !199, line: 2260, type: !225)
!640 = !DILocation(line: 2260, column: 42, scope: !635)
!641 = !DILocation(line: 2261, column: 6, scope: !635)
!642 = !DILocation(line: 2261, column: 5, scope: !635)
!643 = !DILocation(line: 2261, column: 23, scope: !635)
!644 = !DILocation(line: 2262, column: 2, scope: !635)
!645 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h77b7d0c96435260eE", scope: !529, file: !199, line: 2260, type: !646, scopeLine: 2260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !661, retainedNodes: !659)
!646 = !DISubroutineType(types: !647)
!647 = !{!421, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !649, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !650, file: !2, size: 192, align: 64, elements: !652, templateParams: !190, identifier: "14f08a375902d32ab0cd4ad1c34080c2")
!650 = !DINamespace(name: "maybe_uninit", scope: !651)
!651 = !DINamespace(name: "mem", scope: !143)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !649, file: !2, baseType: !7, align: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !2, baseType: !655, size: 192, align: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !656, file: !2, size: 192, align: 64, elements: !657, templateParams: !190, identifier: "cc541f23c3ecc5864b26671b2c8849c9")
!656 = !DINamespace(name: "manually_drop", scope: !651)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !655, file: !2, baseType: !13, size: 192, align: 64)
!659 = !{!660}
!660 = !DILocalVariable(name: "ptr", arg: 1, scope: !645, file: !199, line: 2260, type: !648)
!661 = !{!662}
!662 = !DITemplateTypeParameter(name: "T", type: !649)
!663 = !DILocation(line: 2260, column: 42, scope: !645)
!664 = !DILocation(line: 2261, column: 6, scope: !645)
!665 = !DILocation(line: 2261, column: 5, scope: !645)
!666 = !DILocation(line: 2261, column: 23, scope: !645)
!667 = !DILocation(line: 2262, column: 2, scope: !645)
!668 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hb365c4273ba2c3adE", scope: !529, file: !199, line: 2266, type: !669, scopeLine: 2266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!421, !9}
!671 = !{!672, !673}
!672 = !DILocalVariable(name: "len", arg: 1, scope: !668, file: !199, line: 2266, type: !9)
!673 = !DILocalVariable(name: "max_len", scope: !674, file: !199, line: 2267, type: !9, align: 8)
!674 = distinct !DILexicalBlock(scope: !668, file: !199, line: 2267, column: 5)
!675 = !DILocation(line: 2266, column: 43, scope: !668)
!676 = !DILocation(line: 2267, column: 19, scope: !668)
!677 = !DILocation(line: 2267, column: 9, scope: !674)
!678 = !DILocation(line: 2271, column: 5, scope: !674)
!679 = !DILocation(line: 2272, column: 2, scope: !668)
!680 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h05891d76475b3d26E", scope: !529, file: !199, line: 2466, type: !609, scopeLine: 2466, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !681)
!681 = !{!682, !683, !684}
!682 = !DILocalVariable(name: "src", arg: 1, scope: !680, file: !199, line: 2466, type: !611)
!683 = !DILocalVariable(name: "dst", arg: 2, scope: !680, file: !199, line: 2466, type: !612)
!684 = !DILocalVariable(name: "count", arg: 3, scope: !680, file: !199, line: 2466, type: !9)
!685 = !DILocation(line: 2466, column: 29, scope: !680)
!686 = !DILocation(line: 2466, column: 44, scope: !680)
!687 = !DILocation(line: 2466, column: 57, scope: !680)
!688 = !DILocation(line: 2474, column: 9, scope: !680)
!689 = !DILocalVariable(name: "src", arg: 1, scope: !690, file: !199, line: 2241, type: !611)
!690 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17h939af37eba549770E", scope: !691, file: !199, line: 2241, type: !692, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !694)
!691 = !DINamespace(name: "copy", scope: !529)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !611, !612}
!694 = !{!689, !695}
!695 = !DILocalVariable(name: "dst", arg: 2, scope: !690, file: !199, line: 2241, type: !612)
!696 = !DILocation(line: 2241, column: 39, scope: !690, inlinedAt: !697)
!697 = distinct !DILocation(line: 2474, column: 9, scope: !680)
!698 = !DILocation(line: 2477, column: 13, scope: !690, inlinedAt: !697)
!699 = !DILocation(line: 2477, column: 45, scope: !690, inlinedAt: !697)
!700 = !DILocation(line: 2242, column: 20, scope: !690, inlinedAt: !697)
!701 = !DILocation(line: 2244, column: 21, scope: !690, inlinedAt: !697)
!702 = !DILocation(line: 2479, column: 9, scope: !680)
!703 = !DILocation(line: 2481, column: 2, scope: !680)
!704 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17h461b3c2ec587c164E", scope: !529, file: !199, line: 2466, type: !583, scopeLine: 2466, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !705)
!705 = !{!706, !707, !708}
!706 = !DILocalVariable(name: "src", arg: 1, scope: !704, file: !199, line: 2466, type: !225)
!707 = !DILocalVariable(name: "dst", arg: 2, scope: !704, file: !199, line: 2466, type: !294)
!708 = !DILocalVariable(name: "count", arg: 3, scope: !704, file: !199, line: 2466, type: !9)
!709 = !DILocation(line: 2466, column: 29, scope: !704)
!710 = !DILocation(line: 2466, column: 44, scope: !704)
!711 = !DILocation(line: 2466, column: 57, scope: !704)
!712 = !DILocation(line: 2474, column: 9, scope: !704)
!713 = !DILocalVariable(name: "src", arg: 1, scope: !714, file: !199, line: 2241, type: !225)
!714 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17h75fbe6a23b22e187E", scope: !691, file: !199, line: 2241, type: !715, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !225, !294}
!717 = !{!713, !718}
!718 = !DILocalVariable(name: "dst", arg: 2, scope: !714, file: !199, line: 2241, type: !294)
!719 = !DILocation(line: 2241, column: 39, scope: !714, inlinedAt: !720)
!720 = distinct !DILocation(line: 2474, column: 9, scope: !704)
!721 = !DILocation(line: 2477, column: 13, scope: !714, inlinedAt: !720)
!722 = !DILocation(line: 2477, column: 45, scope: !714, inlinedAt: !720)
!723 = !DILocation(line: 2242, column: 20, scope: !714, inlinedAt: !720)
!724 = !DILocation(line: 2244, column: 21, scope: !714, inlinedAt: !720)
!725 = !DILocation(line: 2479, column: 9, scope: !704)
!726 = !DILocation(line: 2481, column: 2, scope: !704)
!727 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17h17b0a92ea52cea06E", scope: !729, file: !728, line: 1412, type: !731, scopeLine: 1412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !733)
!728 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "b91f20a51804d5cdbda7bdba75d392d5")
!729 = !DINamespace(name: "{impl#63}", scope: !730)
!730 = !DINamespace(name: "impls", scope: !150)
!731 = !DISubroutineType(types: !732)
!732 = !{!149, !132, !132}
!733 = !{!734, !735}
!734 = !DILocalVariable(name: "self", arg: 1, scope: !727, file: !728, line: 1412, type: !132)
!735 = !DILocalVariable(name: "other", arg: 2, scope: !727, file: !728, line: 1412, type: !132)
!736 = !DILocation(line: 1412, column: 24, scope: !727)
!737 = !DILocation(line: 1412, column: 31, scope: !727)
!738 = !DILocation(line: 1415, column: 24, scope: !727)
!739 = !DILocation(line: 1415, column: 32, scope: !727)
!740 = !DILocation(line: 1416, column: 29, scope: !727)
!741 = !DILocation(line: 1416, column: 38, scope: !727)
!742 = !DILocation(line: 1415, column: 41, scope: !727)
!743 = !DILocation(line: 1415, column: 21, scope: !727)
!744 = !DILocation(line: 1418, column: 18, scope: !727)
!745 = !{i8 -1, i8 2}
!746 = !DILocation(line: 1417, column: 28, scope: !727)
!747 = !DILocation(line: 1416, column: 26, scope: !727)
!748 = !DILocation(line: 1416, column: 47, scope: !727)
!749 = distinct !DISubprogram(name: "new_lower_hex<u64>", linkageName: "_ZN4core3fmt10ArgumentV113new_lower_hex17hf2216d6e6eea11b9E", scope: !750, file: !447, line: 329, type: !760, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !764, retainedNodes: !762)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !142, file: !2, size: 128, align: 64, elements: !751, templateParams: !24, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !750, file: !2, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !754, size: 64, align: 64, dwarfAddressSpace: 0)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !755, file: !2, align: 8, elements: !24, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!755 = !DINamespace(name: "{extern#0}", scope: !142)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !750, file: !2, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !758, size: 64, align: 64, dwarfAddressSpace: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!451, !753, !470}
!760 = !DISubroutineType(types: !761)
!761 = !{!750, !132}
!762 = !{!763}
!763 = !DILocalVariable(name: "x", arg: 1, scope: !749, file: !447, line: 329, type: !132)
!764 = !{!765}
!765 = !DITemplateTypeParameter(name: "T", type: !22)
!766 = !DILocation(line: 329, column: 30, scope: !749)
!767 = !DILocation(line: 330, column: 13, scope: !749)
!768 = !DILocation(line: 331, column: 10, scope: !749)
!769 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hd1a51dee9cb224e7E", scope: !771, file: !770, line: 185, type: !773, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !775)
!770 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!771 = !DINamespace(name: "{impl#86}", scope: !772)
!772 = !DINamespace(name: "num", scope: !142)
!773 = !DISubroutineType(types: !774)
!774 = !{!451, !85, !470}
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "self", arg: 1, scope: !769, file: !770, line: 185, type: !85)
!777 = !DILocalVariable(name: "f", arg: 2, scope: !769, file: !770, line: 185, type: !470)
!778 = !DILocation(line: 185, column: 20, scope: !769)
!779 = !DILocation(line: 185, column: 27, scope: !769)
!780 = !DILocation(line: 186, column: 20, scope: !769)
!781 = !DILocation(line: 188, column: 27, scope: !769)
!782 = !DILocation(line: 187, column: 21, scope: !769)
!783 = !DILocation(line: 193, column: 14, scope: !769)
!784 = !DILocation(line: 191, column: 21, scope: !769)
!785 = !DILocation(line: 189, column: 21, scope: !769)
!786 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17ha8fd9c1831acb9abE", scope: !787, file: !770, line: 185, type: !788, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !790)
!787 = !DINamespace(name: "{impl#87}", scope: !772)
!788 = !DISubroutineType(types: !789)
!789 = !{!451, !132, !470}
!790 = !{!791, !792}
!791 = !DILocalVariable(name: "self", arg: 1, scope: !786, file: !770, line: 185, type: !132)
!792 = !DILocalVariable(name: "f", arg: 2, scope: !786, file: !770, line: 185, type: !470)
!793 = !DILocation(line: 185, column: 20, scope: !786)
!794 = !DILocation(line: 185, column: 27, scope: !786)
!795 = !DILocation(line: 186, column: 20, scope: !786)
!796 = !DILocation(line: 188, column: 27, scope: !786)
!797 = !DILocation(line: 187, column: 21, scope: !786)
!798 = !DILocation(line: 193, column: 14, scope: !786)
!799 = !DILocation(line: 191, column: 21, scope: !786)
!800 = !DILocation(line: 189, column: 21, scope: !786)
!801 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17heea09fb09a6e8fd4E", scope: !803, file: !802, line: 627, type: !812, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !836, retainedNodes: !829)
!802 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a909d1cde985fb0d953605fd1b0e0e2")
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !804, file: !2, size: 128, align: 64, elements: !805, templateParams: !24, identifier: "359b827f5af0b285a339c514d5b771c5")
!804 = !DINamespace(name: "builders", scope: !142)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !803, file: !2, baseType: !807, size: 128, align: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !804, file: !2, size: 128, align: 64, elements: !808, templateParams: !24, identifier: "14b54b19ea742c9f9a96cbcbfee439ac")
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !807, file: !2, baseType: !470, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !807, file: !2, baseType: !451, size: 8, align: 8, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !807, file: !2, baseType: !421, size: 8, align: 8, offset: 72)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !814, !815}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !803, size: 64, align: 64, dwarfAddressSpace: 0)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !816, file: !2, size: 128, align: 64, elements: !817, templateParams: !190, identifier: "13e412909f00faea6d7a78cfbd3738a7")
!816 = !DINamespace(name: "iter", scope: !167)
!817 = !{!818, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !815, file: !2, baseType: !819, size: 64, align: 64, offset: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !820, file: !2, size: 64, align: 64, elements: !821, templateParams: !190, identifier: "9c3cbaf4cec1c60ae0b47c65ec531e1d")
!820 = !DINamespace(name: "non_null", scope: !222)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !819, file: !2, baseType: !225, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !815, file: !2, baseType: !225, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !815, file: !2, baseType: !825, align: 8)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !826, file: !2, align: 8, elements: !24, templateParams: !827, identifier: "8fbd1266d8c69db4ece0a90c2dd721fc")
!826 = !DINamespace(name: "marker", scope: !143)
!827 = !{!828}
!828 = !DITemplateTypeParameter(name: "T", type: !12)
!829 = !{!830, !831, !832, !834}
!830 = !DILocalVariable(name: "self", arg: 1, scope: !801, file: !802, line: 627, type: !814)
!831 = !DILocalVariable(name: "entries", arg: 2, scope: !801, file: !802, line: 627, type: !815)
!832 = !DILocalVariable(name: "iter", scope: !833, file: !802, line: 632, type: !815, align: 8)
!833 = distinct !DILexicalBlock(scope: !801, file: !802, line: 632, column: 9)
!834 = !DILocalVariable(name: "entry", scope: !835, file: !802, line: 632, type: !12, align: 8)
!835 = distinct !DILexicalBlock(scope: !833, file: !802, line: 632, column: 30)
!836 = !{!837, !838}
!837 = !DITemplateTypeParameter(name: "D", type: !12)
!838 = !DITemplateTypeParameter(name: "I", type: !815)
!839 = !DILocation(line: 627, column: 26, scope: !801)
!840 = !DILocation(line: 627, column: 37, scope: !801)
!841 = !DILocation(line: 632, column: 22, scope: !833)
!842 = !DILocation(line: 632, column: 13, scope: !835)
!843 = !DILocation(line: 632, column: 22, scope: !801)
!844 = !DILocation(line: 632, column: 9, scope: !833)
!845 = !DILocation(line: 636, column: 6, scope: !801)
!846 = !DILocation(line: 632, column: 13, scope: !833)
!847 = !DILocation(line: 633, column: 13, scope: !835)
!848 = !DILocation(line: 634, column: 9, scope: !833)
!849 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h5a0892b6564d3a6fE", scope: !850, file: !447, line: 421, type: !909, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !914)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !142, file: !2, size: 384, align: 64, elements: !851, templateParams: !24, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!851 = !{!852, !858, !903}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !850, file: !2, baseType: !853, size: 128, align: 64, offset: 128)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !854, templateParams: !24, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!854 = !{!855, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !853, file: !2, baseType: !856, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !853, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !850, file: !2, baseType: !859, size: 128, align: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !479, file: !2, size: 128, align: 64, elements: !860, templateParams: !24, identifier: "37e4e944ba32344d635147f54bf9f4df")
!860 = !{!861}
!861 = !DICompositeType(tag: DW_TAG_variant_part, scope: !859, file: !2, size: 128, align: 64, elements: !862, templateParams: !24, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !902)
!862 = !{!863, !898}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !861, file: !2, baseType: !864, size: 128, align: 64, extraData: i64 0)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !859, file: !2, size: 128, align: 64, elements: !24, templateParams: !865, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!865 = !{!866}
!866 = !DITemplateTypeParameter(name: "T", type: !867)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !868, templateParams: !24, identifier: "2225a8a3217ca2e4230086a86939d931")
!868 = !{!869, !897}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !867, file: !2, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64, dwarfAddressSpace: 0)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 448, align: 64, elements: !872, templateParams: !24, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !871, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !871, file: !2, baseType: !875, size: 384, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !140, file: !2, size: 384, align: 64, elements: !876, templateParams: !24, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!876 = !{!877, !878, !879, !880, !896}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !875, file: !2, baseType: !475, size: 32, align: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !875, file: !2, baseType: !139, size: 8, align: 8, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !2, baseType: !27, size: 32, align: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !875, file: !2, baseType: !881, size: 128, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !882, templateParams: !24, identifier: "32660758978696a09244873a5d6fbb61")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_variant_part, scope: !881, file: !2, size: 128, align: 64, elements: !884, templateParams: !24, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !895)
!884 = !{!885, !889, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !883, file: !2, baseType: !886, size: 128, align: 64, extraData: i64 0)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !881, file: !2, size: 128, align: 64, elements: !887, templateParams: !24, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !886, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !883, file: !2, baseType: !890, size: 128, align: 64, extraData: i64 1)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !881, file: !2, size: 128, align: 64, elements: !891, templateParams: !24, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !890, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !883, file: !2, baseType: !894, size: 128, align: 64, extraData: i64 2)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !881, file: !2, size: 128, align: 64, elements: !24, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!895 = !DIDerivedType(tag: DW_TAG_member, scope: !881, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !875, file: !2, baseType: !881, size: 128, align: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !867, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !861, file: !2, baseType: !899, size: 128, align: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !859, file: !2, size: 128, align: 64, elements: !900, templateParams: !865, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !899, file: !2, baseType: !867, size: 128, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, scope: !859, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !850, file: !2, baseType: !904, size: 128, align: 64, offset: 256)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !905, templateParams: !24, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!905 = !{!906, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !904, file: !2, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64, dwarfAddressSpace: 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !904, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!850, !853, !904, !867, !911}
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !142, file: !2, align: 8, elements: !912, templateParams: !24, identifier: "9da388efda58098f3ebab1da42679df")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !911, file: !2, baseType: !7, align: 8)
!914 = !{!915, !916, !917, !918}
!915 = !DILocalVariable(name: "pieces", arg: 1, scope: !849, file: !447, line: 422, type: !853)
!916 = !DILocalVariable(name: "args", arg: 2, scope: !849, file: !447, line: 423, type: !904)
!917 = !DILocalVariable(name: "fmt", arg: 3, scope: !849, file: !447, line: 424, type: !867)
!918 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !849, file: !447, line: 425, type: !911)
!919 = !DILocation(line: 422, column: 9, scope: !849)
!920 = !DILocation(line: 423, column: 9, scope: !849)
!921 = !DILocation(line: 424, column: 9, scope: !849)
!922 = !DILocation(line: 425, column: 9, scope: !849)
!923 = !DILocation(line: 427, column: 34, scope: !849)
!924 = !DILocation(line: 427, column: 9, scope: !849)
!925 = !DILocation(line: 428, column: 6, scope: !849)
!926 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h1d2dfdaa3c3dd788E", scope: !850, file: !447, line: 401, type: !927, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!850, !853, !904}
!929 = !{!930, !931}
!930 = !DILocalVariable(name: "pieces", arg: 1, scope: !926, file: !447, line: 401, type: !853)
!931 = !DILocalVariable(name: "args", arg: 2, scope: !926, file: !447, line: 401, type: !904)
!932 = !DILocation(line: 401, column: 25, scope: !926)
!933 = !DILocation(line: 401, column: 53, scope: !926)
!934 = !DILocation(line: 402, column: 12, scope: !926)
!935 = !DILocation(line: 402, column: 56, scope: !926)
!936 = !DILocation(line: 402, column: 41, scope: !926)
!937 = !DILocation(line: 405, column: 34, scope: !926)
!938 = !DILocation(line: 405, column: 9, scope: !926)
!939 = !DILocation(line: 406, column: 6, scope: !926)
!940 = !DILocation(line: 403, column: 13, scope: !926)
!941 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17h4ddadd38c3f7a384E", scope: !651, file: !942, line: 756, type: !943, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !946)
!942 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2818803a2f5479a3883c65b3bb9963fd")
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!946 = !{!947, !948, !949, !951}
!947 = !DILocalVariable(name: "x", arg: 1, scope: !941, file: !942, line: 756, type: !945)
!948 = !DILocalVariable(name: "y", arg: 2, scope: !941, file: !942, line: 756, type: !945)
!949 = !DILocalVariable(name: "a", scope: !950, file: !942, line: 773, type: !13, align: 8)
!950 = distinct !DILexicalBlock(scope: !941, file: !942, line: 773, column: 9)
!951 = !DILocalVariable(name: "b", scope: !952, file: !942, line: 774, type: !13, align: 8)
!952 = distinct !DILexicalBlock(scope: !950, file: !942, line: 774, column: 9)
!953 = !DILocation(line: 756, column: 36, scope: !941)
!954 = !DILocation(line: 756, column: 47, scope: !941)
!955 = !DILocation(line: 773, column: 13, scope: !950)
!956 = !DILocation(line: 774, column: 13, scope: !952)
!957 = !DILocation(line: 773, column: 17, scope: !941)
!958 = !DILocation(line: 774, column: 17, scope: !950)
!959 = !DILocation(line: 775, column: 23, scope: !952)
!960 = !DILocation(line: 775, column: 9, scope: !952)
!961 = !DILocation(line: 776, column: 23, scope: !952)
!962 = !DILocation(line: 776, column: 9, scope: !952)
!963 = !DILocation(line: 778, column: 2, scope: !941)
!964 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17hfa435f99e9ce0eaaE", scope: !651, file: !942, line: 756, type: !965, scopeLine: 756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !661, retainedNodes: !968)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !967, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !649, size: 64, align: 64, dwarfAddressSpace: 0)
!968 = !{!969, !970, !971, !973}
!969 = !DILocalVariable(name: "x", arg: 1, scope: !964, file: !942, line: 756, type: !967)
!970 = !DILocalVariable(name: "y", arg: 2, scope: !964, file: !942, line: 756, type: !967)
!971 = !DILocalVariable(name: "a", scope: !972, file: !942, line: 773, type: !649, align: 8)
!972 = distinct !DILexicalBlock(scope: !964, file: !942, line: 773, column: 9)
!973 = !DILocalVariable(name: "b", scope: !974, file: !942, line: 774, type: !649, align: 8)
!974 = distinct !DILexicalBlock(scope: !972, file: !942, line: 774, column: 9)
!975 = !DILocation(line: 756, column: 36, scope: !964)
!976 = !DILocation(line: 756, column: 47, scope: !964)
!977 = !DILocation(line: 773, column: 13, scope: !972)
!978 = !DILocation(line: 774, column: 13, scope: !974)
!979 = !DILocation(line: 773, column: 17, scope: !964)
!980 = !DILocation(line: 774, column: 17, scope: !972)
!981 = !DILocation(line: 775, column: 23, scope: !974)
!982 = !DILocation(line: 775, column: 9, scope: !974)
!983 = !DILocation(line: 776, column: 23, scope: !974)
!984 = !DILocation(line: 776, column: 9, scope: !974)
!985 = !DILocation(line: 778, column: 2, scope: !964)
!986 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17hfd06fbd69cd1e95cE", scope: !651, file: !942, line: 719, type: !943, scopeLine: 719, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !987)
!987 = !{!988, !989}
!988 = !DILocalVariable(name: "x", arg: 1, scope: !986, file: !942, line: 719, type: !945)
!989 = !DILocalVariable(name: "y", arg: 2, scope: !986, file: !942, line: 719, type: !945)
!990 = !DILocation(line: 719, column: 22, scope: !986)
!991 = !DILocation(line: 719, column: 33, scope: !986)
!992 = !DILocation(line: 734, column: 12, scope: !986)
!993 = !DILocation(line: 748, column: 5, scope: !986)
!994 = !DILocation(line: 737, column: 29, scope: !986)
!995 = !DILocation(line: 749, column: 2, scope: !986)
!996 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17h81dd88fda83363bcE", scope: !651, file: !942, line: 148, type: !997, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !13}
!999 = !{!1000}
!1000 = !DILocalVariable(name: "t", arg: 1, scope: !996, file: !942, line: 148, type: !13)
!1001 = !DILocation(line: 148, column: 24, scope: !996)
!1002 = !DILocalVariable(name: "value", arg: 1, scope: !1003, file: !1004, line: 70, type: !13)
!1003 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17he17141b11a1a907cE", scope: !655, file: !1004, line: 70, type: !1005, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !1007)
!1004 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!655, !13}
!1007 = !{!1002}
!1008 = !DILocation(line: 70, column: 22, scope: !1003, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 149, column: 13, scope: !996)
!1010 = !DILocation(line: 71, column: 9, scope: !1003, inlinedAt: !1009)
!1011 = !DILocation(line: 150, column: 2, scope: !996)
!1012 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h2fa8b69b5dab9e4eE", scope: !1014, file: !1013, line: 576, type: !1016, scopeLine: 576, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1018)
!1013 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "3eed1b8baad53fb1e7d6811c678f60f8")
!1014 = !DINamespace(name: "{impl#11}", scope: !1015)
!1015 = !DINamespace(name: "num", scope: !143)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!478, !9, !9}
!1018 = !{!1019, !1020, !1021, !1023}
!1019 = !DILocalVariable(name: "self", arg: 1, scope: !1012, file: !1013, line: 576, type: !9)
!1020 = !DILocalVariable(name: "rhs", arg: 2, scope: !1012, file: !1013, line: 576, type: !9)
!1021 = !DILocalVariable(name: "a", scope: !1022, file: !1013, line: 577, type: !9, align: 8)
!1022 = distinct !DILexicalBlock(scope: !1012, file: !1013, line: 577, column: 13)
!1023 = !DILocalVariable(name: "b", scope: !1022, file: !1013, line: 577, type: !421, align: 1)
!1024 = !DILocation(line: 576, column: 34, scope: !1012)
!1025 = !DILocation(line: 576, column: 40, scope: !1012)
!1026 = !DILocalVariable(name: "self", arg: 1, scope: !1027, file: !1013, line: 1703, type: !9)
!1027 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17haec0d6bf1efe3798E", scope: !1014, file: !1013, line: 1703, type: !1028, scopeLine: 1703, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1034)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1030, !9, !9}
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !1031, templateParams: !24, identifier: "5d4cb4b3e2da4aeebd47965411ffedac")
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1030, file: !2, baseType: !9, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1030, file: !2, baseType: !421, size: 8, align: 8, offset: 64)
!1034 = !{!1026, !1035, !1036, !1038}
!1035 = !DILocalVariable(name: "rhs", arg: 2, scope: !1027, file: !1013, line: 1703, type: !9)
!1036 = !DILocalVariable(name: "a", scope: !1037, file: !1013, line: 1704, type: !22, align: 8)
!1037 = distinct !DILexicalBlock(scope: !1027, file: !1013, line: 1704, column: 13)
