; ModuleID = 'bootloader.29cc74be93a1743e-cgu.0'
source_filename = "bootloader.29cc74be93a1743e-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::ops::range::RangeInclusive<usize>" = type { i64, i64, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}
%"[closure@core::slice::sort::choose_pivot<bootinfo::memory_map::MemoryRegion, [closure@core::slice::<impl [bootinfo::memory_map::MemoryRegion]>::sort_unstable_by<[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]>::{closure#0}]>::{closure#0}]" = type { { ptr, i64 }, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "2779528a88d6dc0ad82a0e4e9fbaa7e4")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "a8f2a6d4cce426be14c00524dc0874f0")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "eda0d2a9321fee60b061820d7cde2525")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "5f02d32e8784bf6269c2277222c666a7")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "b7439872a6042f4ce7d743026fd7bb07")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "d94ad0b8aa36c594adcb6a1d7842575c")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "369548007d832e0ecbffb9d4645358e7")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "816cae719e586f73a314bc441f41d44f")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "d4eefc3f1de6f177d6d5b54fb4ddfbc3")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "12562056e38898ffcca3d526315c36c9")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "f38a48dd32686bf0e1e0e7e5157754e6")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "2e65e53cc0097cd2125656914d9ede0a")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "a5b4825ed3aa5bf346786108612239b0")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "bf750079e417872ca71f9aed0159cc28")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 8, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.71.0-nightly (f49560538 2023-04-28))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !161, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/lib.rs/@/bootloader.29cc74be93a1743e-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23")
!138 = !{!26, !139, !148, !155}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !143)
!140 = !DINamespace(name: "rt", scope: !141)
!141 = !DINamespace(name: "fmt", scope: !142)
!142 = !DINamespace(name: "core", scope: null)
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!145 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !149, file: !2, baseType: !150, size: 8, align: 8, flags: DIFlagEnumClass, elements: !151)
!149 = !DINamespace(name: "cmp", scope: !142)
!150 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "Less", value: -1)
!153 = !DIEnumerator(name: "Equal", value: 0)
!154 = !DIEnumerator(name: "Greater", value: 1)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !156, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !157)
!156 = !DINamespace(name: "panicking", scope: !142)
!157 = !{!158, !159, !160}
!158 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!159 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!160 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!161 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!162 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h174965a1ba63e8fdE", scope: !164, file: !163, line: 371, type: !167, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !182)
!163 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "d107e626d2145c8c7d098a7b217e6306")
!164 = !DINamespace(name: "{impl#4}", scope: !165)
!165 = !DINamespace(name: "index", scope: !166)
!166 = !DINamespace(name: "slice", scope: !142)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !174, !169}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !170, templateParams: !24, identifier: "b2df953ab6d64c329946497154c9e3d3")
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !169, file: !2, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !169, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !175, file: !2, size: 128, align: 64, elements: !177, templateParams: !180, identifier: "18cd61c87dbf51eb4088b653e33d00b5")
!175 = !DINamespace(name: "range", scope: !176)
!176 = !DINamespace(name: "ops", scope: !142)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !174, file: !2, baseType: !9, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!180 = !{!181}
!181 = !DITemplateTypeParameter(name: "Idx", type: !9)
!182 = !{!183, !184, !185, !187}
!183 = !DILocalVariable(name: "self", arg: 1, scope: !162, file: !163, line: 371, type: !174)
!184 = !DILocalVariable(name: "slice", arg: 2, scope: !162, file: !163, line: 371, type: !169)
!185 = !DILocalVariable(name: "this", scope: !186, file: !163, line: 372, type: !174, align: 8)
!186 = distinct !DILexicalBlock(scope: !162, file: !163, line: 372, column: 9)
!187 = !DILocalVariable(name: "new_len", scope: !188, file: !163, line: 383, type: !9, align: 8)
!188 = distinct !DILexicalBlock(scope: !186, file: !163, line: 383, column: 13)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "T", type: !13)
!191 = !DILocation(line: 371, column: 29, scope: !162)
!192 = !DILocation(line: 371, column: 35, scope: !162)
!193 = !DILocation(line: 372, column: 13, scope: !186)
!194 = !DILocation(line: 372, column: 20, scope: !162)
!195 = !DILocation(line: 378, column: 13, scope: !186)
!196 = !DILocation(line: 383, column: 27, scope: !186)
!197 = !DILocation(line: 383, column: 17, scope: !188)
!198 = !DILocation(line: 384, column: 39, scope: !188)
!199 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !201, line: 915, type: !207)
!200 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h3fe5160e9aea5b50E", scope: !202, file: !201, line: 915, type: !205, scopeLine: 915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !208)
!201 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "3038863dc20b91ad4f69036221337420")
!202 = !DINamespace(name: "{impl#0}", scope: !203)
!203 = !DINamespace(name: "const_ptr", scope: !204)
!204 = !DINamespace(name: "ptr", scope: !142)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !207, !9}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !{!199, !209}
!209 = !DILocalVariable(name: "count", arg: 2, scope: !200, file: !201, line: 915, type: !9)
!210 = !DILocation(line: 915, column: 29, scope: !200, inlinedAt: !211)
!211 = distinct !DILocation(line: 384, column: 39, scope: !188)
!212 = !DILocation(line: 915, column: 35, scope: !200, inlinedAt: !211)
!213 = !DILocation(line: 927, column: 13, scope: !200, inlinedAt: !211)
!214 = !DILocation(line: 384, column: 13, scope: !188)
!215 = !DILocation(line: 386, column: 6, scope: !162)
!216 = !DILocalVariable(name: "this", arg: 1, scope: !217, file: !218, line: 2510, type: !174)
!217 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17h156612c739a92e31E", scope: !219, file: !218, line: 2510, type: !220, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !222)
!218 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "b961ce15748c96c32140721627355748")
!219 = !DINamespace(name: "get_unchecked", scope: !164)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !174, !169}
!222 = !{!216, !223}
!223 = !DILocalVariable(name: "slice", arg: 2, scope: !217, file: !218, line: 2510, type: !169)
!224 = !DILocation(line: 2510, column: 39, scope: !217, inlinedAt: !225)
!225 = distinct !DILocation(line: 378, column: 13, scope: !186)
!226 = !DILocation(line: 381, column: 17, scope: !227, inlinedAt: !225)
!227 = !DILexicalBlockFile(scope: !217, file: !163, discriminator: 0)
!228 = !DILocation(line: 381, column: 55, scope: !227, inlinedAt: !225)
!229 = !DILocation(line: 381, column: 43, scope: !227, inlinedAt: !225)
!230 = !DILocation(line: 2511, column: 20, scope: !217, inlinedAt: !225)
!231 = !{i8 0, i8 2}
!232 = !DILocation(line: 2513, column: 21, scope: !217, inlinedAt: !225)
!233 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17hfacf56c2574810d2E", scope: !164, file: !163, line: 389, type: !234, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !240)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !174, !236}
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !237, templateParams: !24, identifier: "7f4badd13c4de7ab822ca5c4c9d7d27f")
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !236, file: !2, baseType: !172, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!240 = !{!241, !242, !243, !245}
!241 = !DILocalVariable(name: "self", arg: 1, scope: !233, file: !163, line: 389, type: !174)
!242 = !DILocalVariable(name: "slice", arg: 2, scope: !233, file: !163, line: 389, type: !236)
!243 = !DILocalVariable(name: "this", scope: !244, file: !163, line: 390, type: !174, align: 8)
!244 = distinct !DILexicalBlock(scope: !233, file: !163, line: 390, column: 9)
!245 = !DILocalVariable(name: "new_len", scope: !246, file: !163, line: 398, type: !9, align: 8)
!246 = distinct !DILexicalBlock(scope: !244, file: !163, line: 398, column: 13)
!247 = !DILocation(line: 389, column: 33, scope: !233)
!248 = !DILocation(line: 389, column: 39, scope: !233)
!249 = !DILocation(line: 390, column: 13, scope: !244)
!250 = !DILocation(line: 390, column: 20, scope: !233)
!251 = !DILocation(line: 393, column: 13, scope: !244)
!252 = !DILocation(line: 398, column: 27, scope: !244)
!253 = !DILocation(line: 398, column: 17, scope: !246)
!254 = !DILocalVariable(name: "self", arg: 1, scope: !255, file: !256, line: 2032, type: !236)
!255 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h6b018f74a5c43a00E", scope: !257, file: !256, line: 2032, type: !259, scopeLine: 2032, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !262)
!256 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a6afd5ac69802a5308a55262a61b144")
!257 = !DINamespace(name: "{impl#1}", scope: !258)
!258 = !DINamespace(name: "mut_ptr", scope: !204)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !236}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !{!254}
!263 = !DILocation(line: 2032, column: 29, scope: !255, inlinedAt: !264)
!264 = distinct !DILocation(line: 399, column: 43, scope: !246)
!265 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !256, line: 1025, type: !261)
!266 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h6b99bcd453829b97E", scope: !267, file: !256, line: 1025, type: !268, scopeLine: 1025, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !270)
!267 = !DINamespace(name: "{impl#0}", scope: !258)
!268 = !DISubroutineType(types: !269)
!269 = !{!261, !261, !9}
!270 = !{!265, !271}
!271 = !DILocalVariable(name: "count", arg: 2, scope: !266, file: !256, line: 1025, type: !9)
!272 = !DILocation(line: 1025, column: 29, scope: !266, inlinedAt: !273)
!273 = distinct !DILocation(line: 399, column: 43, scope: !246)
!274 = !DILocation(line: 1025, column: 35, scope: !266, inlinedAt: !273)
!275 = !DILocation(line: 1037, column: 13, scope: !266, inlinedAt: !273)
!276 = !DILocation(line: 399, column: 13, scope: !246)
!277 = !DILocation(line: 401, column: 6, scope: !233)
!278 = !DILocalVariable(name: "this", arg: 1, scope: !279, file: !218, line: 2510, type: !174)
!279 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17h76428ad97d6eff0cE", scope: !280, file: !218, line: 2510, type: !281, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !283)
!280 = !DINamespace(name: "get_unchecked_mut", scope: !164)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !174, !236}
!283 = !{!278, !284}
!284 = !DILocalVariable(name: "slice", arg: 2, scope: !279, file: !218, line: 2510, type: !236)
!285 = !DILocation(line: 2510, column: 39, scope: !279, inlinedAt: !286)
!286 = distinct !DILocation(line: 393, column: 13, scope: !244)
!287 = !DILocation(line: 396, column: 17, scope: !288, inlinedAt: !286)
!288 = !DILexicalBlockFile(scope: !279, file: !163, discriminator: 0)
!289 = !DILocalVariable(name: "self", arg: 1, scope: !290, file: !256, line: 1896, type: !236)
!290 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h2cd53046dd6ffd97E", scope: !257, file: !256, line: 1896, type: !291, scopeLine: 1896, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{!9, !236}
!293 = !{!289}
!294 = !DILocation(line: 1896, column: 22, scope: !290, inlinedAt: !295)
!295 = distinct !DILocation(line: 396, column: 55, scope: !288, inlinedAt: !286)
!296 = !DILocation(line: 1897, column: 9, scope: !290, inlinedAt: !295)
!297 = !DILocation(line: 396, column: 43, scope: !288, inlinedAt: !286)
!298 = !DILocation(line: 2511, column: 20, scope: !279, inlinedAt: !286)
!299 = !DILocation(line: 2513, column: 21, scope: !279, inlinedAt: !286)
!300 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h06c169b84a427d0eE", scope: !164, file: !163, line: 404, type: !301, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !320)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !174, !303, !307}
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !304, templateParams: !24, identifier: "a1f66151f051bfdee5f3669608d8086b")
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !303, file: !2, baseType: !172, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !303, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !308, size: 64, align: 64, dwarfAddressSpace: 0)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !309, file: !2, size: 192, align: 64, elements: !311, templateParams: !24, identifier: "3e3218ee032660044ada2288cb4b8584")
!309 = !DINamespace(name: "location", scope: !310)
!310 = !DINamespace(name: "panic", scope: !142)
!311 = !{!312, !318, !319}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !308, file: !2, baseType: !313, size: 128, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !314, templateParams: !24, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !313, file: !2, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !308, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !308, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!320 = !{!321, !322}
!321 = !DILocalVariable(name: "self", arg: 1, scope: !300, file: !163, line: 404, type: !174)
!322 = !DILocalVariable(name: "slice", arg: 2, scope: !300, file: !163, line: 404, type: !303)
!323 = !DILocation(line: 404, column: 14, scope: !300)
!324 = !DILocation(line: 404, column: 20, scope: !300)
!325 = !DILocation(line: 405, column: 12, scope: !300)
!326 = !DILocation(line: 407, column: 19, scope: !300)
!327 = !DILocation(line: 406, column: 13, scope: !300)
!328 = !DILocation(line: 411, column: 20, scope: !300)
!329 = !DILocation(line: 412, column: 6, scope: !300)
!330 = !DILocation(line: 408, column: 13, scope: !300)
!331 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h7d4cc9f120219a7eE", scope: !164, file: !163, line: 415, type: !332, scopeLine: 415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !338)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !174, !334, !307}
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !335, templateParams: !24, identifier: "3ad04270f3c30707fca606d2b27e2714")
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !334, file: !2, baseType: !172, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!338 = !{!339, !340}
!339 = !DILocalVariable(name: "self", arg: 1, scope: !331, file: !163, line: 415, type: !174)
!340 = !DILocalVariable(name: "slice", arg: 2, scope: !331, file: !163, line: 415, type: !334)
!341 = !DILocation(line: 415, column: 18, scope: !331)
!342 = !DILocation(line: 415, column: 24, scope: !331)
!343 = !DILocation(line: 416, column: 12, scope: !331)
!344 = !DILocation(line: 418, column: 19, scope: !331)
!345 = !DILocation(line: 417, column: 13, scope: !331)
!346 = !DILocation(line: 422, column: 24, scope: !331)
!347 = !DILocation(line: 423, column: 6, scope: !331)
!348 = !DILocation(line: 419, column: 13, scope: !331)
!349 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h6d8936b6797b6854E", scope: !350, file: !163, line: 459, type: !351, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !356)
!350 = !DINamespace(name: "{impl#5}", scope: !165)
!351 = !DISubroutineType(types: !352)
!352 = !{!334, !353, !334, !307}
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !354, templateParams: !180, identifier: "6cb6de305a10bf2cff0b0b7208377db7")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !353, file: !2, baseType: !9, size: 64, align: 64)
!356 = !{!357, !358}
!357 = !DILocalVariable(name: "self", arg: 1, scope: !349, file: !163, line: 459, type: !353)
!358 = !DILocalVariable(name: "slice", arg: 2, scope: !349, file: !163, line: 459, type: !334)
!359 = !DILocation(line: 459, column: 18, scope: !349)
!360 = !DILocation(line: 459, column: 24, scope: !349)
!361 = !DILocation(line: 460, column: 9, scope: !349)
!362 = !DILocation(line: 461, column: 6, scope: !349)
!363 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h447124bbfa895005E", scope: !364, file: !163, line: 486, type: !365, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !370)
!364 = !DINamespace(name: "{impl#6}", scope: !165)
!365 = !DISubroutineType(types: !366)
!366 = !{!236, !367, !236}
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !368, templateParams: !180, identifier: "633fa894cee051e54c34353f6c506c59")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !367, file: !2, baseType: !9, size: 64, align: 64)
!370 = !{!371, !372}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !363, file: !163, line: 486, type: !367)
!372 = !DILocalVariable(name: "slice", arg: 2, scope: !363, file: !163, line: 486, type: !236)
!373 = !DILocation(line: 486, column: 33, scope: !363)
!374 = !DILocation(line: 486, column: 39, scope: !363)
!375 = !DILocation(line: 1896, column: 22, scope: !290, inlinedAt: !376)
!376 = distinct !DILocation(line: 488, column: 31, scope: !363)
!377 = !DILocation(line: 1897, column: 9, scope: !290, inlinedAt: !376)
!378 = !DILocation(line: 488, column: 18, scope: !363)
!379 = !DILocation(line: 489, column: 6, scope: !363)
!380 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h5fa0145d511e9c00E", scope: !364, file: !163, line: 501, type: !381, scopeLine: 501, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!334, !367, !334, !307}
!383 = !{!384, !385}
!384 = !DILocalVariable(name: "self", arg: 1, scope: !380, file: !163, line: 501, type: !367)
!385 = !DILocalVariable(name: "slice", arg: 2, scope: !380, file: !163, line: 501, type: !334)
!386 = !DILocation(line: 501, column: 18, scope: !380)
!387 = !DILocation(line: 501, column: 24, scope: !380)
!388 = !DILocation(line: 502, column: 12, scope: !380)
!389 = !DILocation(line: 506, column: 24, scope: !380)
!390 = !DILocation(line: 507, column: 6, scope: !380)
!391 = !DILocation(line: 503, column: 13, scope: !380)
!392 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN115_$LT$core..ops..range..RangeInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h5e1dce60117b08eaE", scope: !393, file: !163, line: 582, type: !394, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !402)
!393 = !DINamespace(name: "{impl#8}", scope: !165)
!394 = !DISubroutineType(types: !395)
!395 = !{!334, !396, !334, !307}
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !175, file: !2, size: 192, align: 64, elements: !397, templateParams: !180, identifier: "4cc010dd72530bd497804bb5144e1045")
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !396, file: !2, baseType: !9, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !396, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !396, file: !2, baseType: !401, size: 8, align: 8, offset: 128)
!401 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "self", arg: 1, scope: !392, file: !163, line: 582, type: !396)
!404 = !DILocalVariable(name: "slice", arg: 2, scope: !392, file: !163, line: 582, type: !334)
!405 = !DILocation(line: 582, column: 18, scope: !392)
!406 = !DILocation(line: 582, column: 24, scope: !392)
!407 = !DILocation(line: 583, column: 13, scope: !392)
!408 = !DILocation(line: 583, column: 12, scope: !392)
!409 = !DILocation(line: 586, column: 9, scope: !392)
!410 = !DILocation(line: 587, column: 6, scope: !392)
!411 = !DILocation(line: 584, column: 13, scope: !392)
!412 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN117_$LT$core..ops..range..RangeToInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hda782a337d58430aE", scope: !413, file: !163, line: 623, type: !414, scopeLine: 623, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !419)
!413 = !DINamespace(name: "{impl#9}", scope: !165)
!414 = !DISubroutineType(types: !415)
!415 = !{!334, !416, !334, !307}
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeToInclusive<usize>", scope: !175, file: !2, size: 64, align: 64, elements: !417, templateParams: !180, identifier: "d7397f3fe79997e63efbd65817c75b2c")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !416, file: !2, baseType: !9, size: 64, align: 64)
!419 = !{!420, !421}
!420 = !DILocalVariable(name: "self", arg: 1, scope: !412, file: !163, line: 623, type: !416)
!421 = !DILocalVariable(name: "slice", arg: 2, scope: !412, file: !163, line: 623, type: !334)
!422 = !DILocation(line: 623, column: 18, scope: !412)
!423 = !DILocation(line: 623, column: 24, scope: !412)
!424 = !DILocation(line: 624, column: 9, scope: !412)
!425 = !DILocation(line: 625, column: 6, scope: !412)
!426 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7fc877f30612e8b6E", scope: !428, file: !427, line: 2269, type: !429, scopeLine: 2269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !487, retainedNodes: !484)
!427 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "6b0c81a808d92ec5841ea47424002502")
!428 = !DINamespace(name: "{impl#53}", scope: !141)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !449, !450}
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !432, file: !2, size: 8, align: 8, elements: !433, templateParams: !24, identifier: "2fd86163cab7c59d321f813815445f61")
!432 = !DINamespace(name: "result", scope: !142)
!433 = !{!434}
!434 = !DICompositeType(tag: DW_TAG_variant_part, scope: !431, file: !2, size: 8, align: 8, elements: !435, templateParams: !24, identifier: "54f01c7802f052a075c25065a54e3108", discriminator: !448)
!435 = !{!436, !444}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !434, file: !2, baseType: !437, size: 8, align: 8, extraData: i64 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !431, file: !2, size: 8, align: 8, elements: !438, templateParams: !440, identifier: "199ca63b65771145c1ecaa36e0c45446")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !437, file: !2, baseType: !7, align: 8, offset: 8)
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "T", type: !7)
!442 = !DITemplateTypeParameter(name: "E", type: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !141, file: !2, align: 8, elements: !24, identifier: "e8cc4da9d962b0d25409a133a5d42c")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !434, file: !2, baseType: !445, size: 8, align: 8, extraData: i64 1)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !431, file: !2, size: 8, align: 8, elements: !446, templateParams: !440, identifier: "42ce6621199a4384f72edb2ce280fbba")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !443, align: 8, offset: 8)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !431, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !141, file: !2, size: 512, align: 64, elements: !452, templateParams: !24, identifier: "ba1c66510e28e89fe66e924337088184")
!452 = !{!453, !454, !456, !457, !472, !473}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !451, file: !2, baseType: !455, size: 32, align: 32, offset: 416)
!455 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !451, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !451, file: !2, baseType: !458, size: 128, align: 64, offset: 128)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !459, file: !2, size: 128, align: 64, elements: !460, templateParams: !24, identifier: "7182c598151f2d841d4f46050c57b41c")
!459 = !DINamespace(name: "option", scope: !142)
!460 = !{!461}
!461 = !DICompositeType(tag: DW_TAG_variant_part, scope: !458, file: !2, size: 128, align: 64, elements: !462, templateParams: !24, identifier: "cbec1a373e2f23dd816907c50c746fd0", discriminator: !471)
!462 = !{!463, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !461, file: !2, baseType: !464, size: 128, align: 64, extraData: i64 0)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !458, file: !2, size: 128, align: 64, elements: !24, templateParams: !465, identifier: "656d115187d98681854f3179cd6091aa")
!465 = !{!466}
!466 = !DITemplateTypeParameter(name: "T", type: !9)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !461, file: !2, baseType: !468, size: 128, align: 64, extraData: i64 1)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !458, file: !2, size: 128, align: 64, elements: !469, templateParams: !465, identifier: "8a80ba7685ed458a9d770fc472f6a3ea")
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !458, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !451, file: !2, baseType: !458, size: 128, align: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !451, file: !2, baseType: !474, size: 128, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !475, templateParams: !24, identifier: "5db60ab68e9a33842ed84c98957b092f")
!475 = !{!476, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !474, file: !2, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64, dwarfAddressSpace: 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "2bf51e8df80b66cd32f422ed18b7c106")
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !474, file: !2, baseType: !480, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 3, lowerBound: 0)
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !426, file: !427, line: 2269, type: !449)
!486 = !DILocalVariable(name: "f", arg: 2, scope: !426, file: !427, line: 2269, type: !450)
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "T", type: !26)
!489 = !DILocation(line: 2269, column: 20, scope: !426)
!490 = !DILocation(line: 2269, column: 27, scope: !426)
!491 = !DILocation(line: 2269, column: 71, scope: !426)
!492 = !{i64 4}
!493 = !DILocation(line: 2269, column: 62, scope: !426)
!494 = !DILocation(line: 2269, column: 84, scope: !426)
!495 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17ha73fadb73b4826ddE", scope: !428, file: !427, line: 2269, type: !496, scopeLine: 2269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !499)
!496 = !DISubroutineType(types: !497)
!497 = !{!431, !498, !450}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !{!500, !501}
!500 = !DILocalVariable(name: "self", arg: 1, scope: !495, file: !427, line: 2269, type: !498)
!501 = !DILocalVariable(name: "f", arg: 2, scope: !495, file: !427, line: 2269, type: !450)
!502 = !DILocation(line: 2269, column: 20, scope: !495)
!503 = !DILocation(line: 2269, column: 27, scope: !495)
!504 = !DILocation(line: 2269, column: 71, scope: !495)
!505 = !{i64 8}
!506 = !DILocation(line: 2269, column: 62, scope: !495)
!507 = !DILocation(line: 2269, column: 84, scope: !495)
!508 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h486db419f38937a8E", scope: !509, file: !218, line: 2545, type: !510, scopeLine: 2545, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !512)
!509 = !DINamespace(name: "intrinsics", scope: !142)
!510 = !DISubroutineType(types: !511)
!511 = !{!401, !207, !207, !9}
!512 = !{!513, !514, !515, !516, !518, !520, !522}
!513 = !DILocalVariable(name: "src", arg: 1, scope: !508, file: !218, line: 2545, type: !207)
!514 = !DILocalVariable(name: "dst", arg: 2, scope: !508, file: !218, line: 2545, type: !207)
!515 = !DILocalVariable(name: "count", arg: 3, scope: !508, file: !218, line: 2545, type: !9)
!516 = !DILocalVariable(name: "src_usize", scope: !517, file: !218, line: 2546, type: !9, align: 8)
!517 = distinct !DILexicalBlock(scope: !508, file: !218, line: 2546, column: 5)
!518 = !DILocalVariable(name: "dst_usize", scope: !519, file: !218, line: 2547, type: !9, align: 8)
!519 = distinct !DILexicalBlock(scope: !517, file: !218, line: 2547, column: 5)
!520 = !DILocalVariable(name: "size", scope: !521, file: !218, line: 2548, type: !9, align: 8)
!521 = distinct !DILexicalBlock(scope: !519, file: !218, line: 2548, column: 5)
!522 = !DILocalVariable(name: "diff", scope: !523, file: !218, line: 2551, type: !9, align: 8)
!523 = distinct !DILexicalBlock(scope: !521, file: !218, line: 2551, column: 5)
!524 = !DILocation(line: 2545, column: 36, scope: !508)
!525 = !DILocation(line: 2545, column: 51, scope: !508)
!526 = !DILocation(line: 2545, column: 66, scope: !508)
!527 = !DILocation(line: 2551, column: 9, scope: !523)
!528 = !DILocalVariable(name: "self", arg: 1, scope: !529, file: !201, line: 203, type: !207)
!529 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17hfb069b686cbbe0aaE", scope: !202, file: !201, line: 203, type: !530, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{!9, !207}
!532 = !{!528}
!533 = !DILocation(line: 203, column: 17, scope: !529, inlinedAt: !534)
!534 = distinct !DILocation(line: 2546, column: 21, scope: !508)
!535 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !201, line: 58, type: !207)
!536 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hc79edfa29f27cd76E", scope: !202, file: !201, line: 58, type: !537, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !540, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!6, !207}
!539 = !{!535}
!540 = !{!190, !541}
!541 = !DITemplateTypeParameter(name: "U", type: !7)
!542 = !DILocation(line: 58, column: 26, scope: !536, inlinedAt: !543)
!543 = distinct !DILocation(line: 207, column: 33, scope: !529, inlinedAt: !534)
!544 = !DILocation(line: 207, column: 18, scope: !529, inlinedAt: !534)
!545 = !DILocation(line: 2546, column: 21, scope: !508)
!546 = !DILocation(line: 2546, column: 9, scope: !517)
!547 = !DILocation(line: 203, column: 17, scope: !529, inlinedAt: !548)
!548 = distinct !DILocation(line: 2547, column: 21, scope: !517)
!549 = !DILocation(line: 58, column: 26, scope: !536, inlinedAt: !550)
!550 = distinct !DILocation(line: 207, column: 33, scope: !529, inlinedAt: !548)
!551 = !DILocation(line: 207, column: 18, scope: !529, inlinedAt: !548)
!552 = !DILocation(line: 2547, column: 21, scope: !517)
!553 = !DILocation(line: 2547, column: 9, scope: !519)
!554 = !DILocation(line: 2548, column: 16, scope: !519)
!555 = !DILocation(line: 2548, column: 9, scope: !521)
!556 = !DILocation(line: 2551, column: 19, scope: !521)
!557 = !DILocation(line: 2551, column: 74, scope: !521)
!558 = !DILocation(line: 2551, column: 43, scope: !521)
!559 = !DILocation(line: 2551, column: 16, scope: !521)
!560 = !DILocation(line: 2554, column: 5, scope: !523)
!561 = !DILocation(line: 2555, column: 2, scope: !508)
!562 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h41ba5ef21035be4eE", scope: !509, file: !218, line: 2647, type: !563, scopeLine: 2647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !207, !261, !9}
!565 = !{!566, !567, !568}
!566 = !DILocalVariable(name: "src", arg: 1, scope: !562, file: !218, line: 2647, type: !207)
!567 = !DILocalVariable(name: "dst", arg: 2, scope: !562, file: !218, line: 2647, type: !261)
!568 = !DILocalVariable(name: "count", arg: 3, scope: !562, file: !218, line: 2647, type: !9)
!569 = !DILocation(line: 2647, column: 44, scope: !562)
!570 = !DILocation(line: 2647, column: 59, scope: !562)
!571 = !DILocation(line: 2647, column: 72, scope: !562)
!572 = !DILocation(line: 2657, column: 9, scope: !562)
!573 = !DILocation(line: 2665, column: 9, scope: !562)
!574 = !DILocation(line: 2667, column: 2, scope: !562)
!575 = !DILocalVariable(name: "src", arg: 1, scope: !576, file: !218, line: 2510, type: !207)
!576 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h0e7febf4a715d66eE", scope: !577, file: !218, line: 2510, type: !563, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !578)
!577 = !DINamespace(name: "copy_nonoverlapping", scope: !509)
!578 = !{!575, !579, !580}
!579 = !DILocalVariable(name: "dst", arg: 2, scope: !576, file: !218, line: 2510, type: !261)
!580 = !DILocalVariable(name: "count", arg: 3, scope: !576, file: !218, line: 2510, type: !9)
!581 = !DILocation(line: 2510, column: 39, scope: !576, inlinedAt: !582)
!582 = distinct !DILocation(line: 2657, column: 9, scope: !562)
!583 = !DILocation(line: 2661, column: 13, scope: !576, inlinedAt: !582)
!584 = !DILocation(line: 2662, column: 20, scope: !576, inlinedAt: !582)
!585 = !DILocation(line: 2663, column: 20, scope: !576, inlinedAt: !582)
!586 = !DILocation(line: 2511, column: 20, scope: !576, inlinedAt: !582)
!587 = !DILocation(line: 2513, column: 21, scope: !576, inlinedAt: !582)
!588 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17hbc768b6fe7843ff2E", scope: !509, file: !218, line: 2647, type: !589, scopeLine: 2647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !593)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !591, !592, !9}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!593 = !{!594, !595, !596}
!594 = !DILocalVariable(name: "src", arg: 1, scope: !588, file: !218, line: 2647, type: !591)
!595 = !DILocalVariable(name: "dst", arg: 2, scope: !588, file: !218, line: 2647, type: !592)
!596 = !DILocalVariable(name: "count", arg: 3, scope: !588, file: !218, line: 2647, type: !9)
!597 = !DILocation(line: 2647, column: 44, scope: !588)
!598 = !DILocation(line: 2647, column: 59, scope: !588)
!599 = !DILocation(line: 2647, column: 72, scope: !588)
!600 = !DILocation(line: 2657, column: 9, scope: !588)
!601 = !DILocation(line: 2665, column: 9, scope: !588)
!602 = !DILocation(line: 2667, column: 2, scope: !588)
!603 = !DILocalVariable(name: "src", arg: 1, scope: !604, file: !218, line: 2510, type: !591)
!604 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h25ac2bb0467aa76aE", scope: !577, file: !218, line: 2510, type: !589, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !605)
!605 = !{!603, !606, !607}
!606 = !DILocalVariable(name: "dst", arg: 2, scope: !604, file: !218, line: 2510, type: !592)
!607 = !DILocalVariable(name: "count", arg: 3, scope: !604, file: !218, line: 2510, type: !9)
!608 = !DILocation(line: 2510, column: 39, scope: !604, inlinedAt: !609)
!609 = distinct !DILocation(line: 2657, column: 9, scope: !588)
!610 = !DILocation(line: 2661, column: 13, scope: !604, inlinedAt: !609)
!611 = !DILocation(line: 2662, column: 20, scope: !604, inlinedAt: !609)
!612 = !DILocation(line: 2663, column: 20, scope: !604, inlinedAt: !609)
!613 = !DILocation(line: 2511, column: 20, scope: !604, inlinedAt: !609)
!614 = !DILocation(line: 2513, column: 21, scope: !604, inlinedAt: !609)
!615 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h1f7b303582864a0eE", scope: !509, file: !218, line: 2529, type: !616, scopeLine: 2529, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !631, retainedNodes: !629)
!616 = !DISubroutineType(types: !617)
!617 = !{!401, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !619, size: 64, align: 64, dwarfAddressSpace: 0)
!619 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !620, file: !2, size: 192, align: 64, elements: !622, templateParams: !189, identifier: "e68c541abc9f54ffcafed90f3e63c21d")
!620 = !DINamespace(name: "maybe_uninit", scope: !621)
!621 = !DINamespace(name: "mem", scope: !142)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !619, file: !2, baseType: !7, align: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !619, file: !2, baseType: !625, size: 192, align: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !626, file: !2, size: 192, align: 64, elements: !627, templateParams: !189, identifier: "17f0b6b8b89d9625ca2d393820e42193")
!626 = !DINamespace(name: "manually_drop", scope: !621)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !625, file: !2, baseType: !13, size: 192, align: 64)
!629 = !{!630}
!630 = !DILocalVariable(name: "ptr", arg: 1, scope: !615, file: !218, line: 2529, type: !618)
!631 = !{!632}
!632 = !DITemplateTypeParameter(name: "T", type: !619)
!633 = !DILocation(line: 2529, column: 42, scope: !615)
!634 = !DILocation(line: 2530, column: 6, scope: !615)
!635 = !DILocation(line: 2530, column: 5, scope: !615)
!636 = !DILocation(line: 2530, column: 23, scope: !615)
!637 = !DILocation(line: 2531, column: 2, scope: !615)
!638 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17hc5f2ec5300fbb4bfE", scope: !509, file: !218, line: 2529, type: !639, scopeLine: 2529, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !641)
!639 = !DISubroutineType(types: !640)
!640 = !{!401, !207}
!641 = !{!642}
!642 = !DILocalVariable(name: "ptr", arg: 1, scope: !638, file: !218, line: 2529, type: !207)
!643 = !DILocation(line: 2529, column: 42, scope: !638)
!644 = !DILocation(line: 2530, column: 6, scope: !638)
!645 = !DILocation(line: 2530, column: 5, scope: !638)
!646 = !DILocation(line: 2530, column: 23, scope: !638)
!647 = !DILocation(line: 2531, column: 2, scope: !638)
!648 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hde767ae676a5474fE", scope: !509, file: !218, line: 2535, type: !649, scopeLine: 2535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!401, !9}
!651 = !{!652, !653}
!652 = !DILocalVariable(name: "len", arg: 1, scope: !648, file: !218, line: 2535, type: !9)
!653 = !DILocalVariable(name: "max_len", scope: !654, file: !218, line: 2536, type: !9, align: 8)
!654 = distinct !DILexicalBlock(scope: !648, file: !218, line: 2536, column: 5)
!655 = !DILocation(line: 2536, column: 9, scope: !654)
!656 = !DILocation(line: 2535, column: 43, scope: !648)
!657 = !DILocation(line: 2540, column: 5, scope: !654)
!658 = !DILocation(line: 2541, column: 2, scope: !648)
!659 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h51769a115d3c0008E", scope: !509, file: !218, line: 2738, type: !589, scopeLine: 2738, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !660)
!660 = !{!661, !662, !663}
!661 = !DILocalVariable(name: "src", arg: 1, scope: !659, file: !218, line: 2738, type: !591)
!662 = !DILocalVariable(name: "dst", arg: 2, scope: !659, file: !218, line: 2738, type: !592)
!663 = !DILocalVariable(name: "count", arg: 3, scope: !659, file: !218, line: 2738, type: !9)
!664 = !DILocation(line: 2738, column: 29, scope: !659)
!665 = !DILocation(line: 2738, column: 44, scope: !659)
!666 = !DILocation(line: 2738, column: 57, scope: !659)
!667 = !DILocation(line: 2747, column: 9, scope: !659)
!668 = !DILocation(line: 2752, column: 9, scope: !659)
!669 = !DILocation(line: 2754, column: 2, scope: !659)
!670 = !DILocalVariable(name: "src", arg: 1, scope: !671, file: !218, line: 2510, type: !591)
!671 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17ha2950624090d1286E", scope: !672, file: !218, line: 2510, type: !673, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !465, retainedNodes: !675)
!672 = !DINamespace(name: "copy", scope: !509)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !591, !592}
!675 = !{!670, !676}
!676 = !DILocalVariable(name: "dst", arg: 2, scope: !671, file: !218, line: 2510, type: !592)
!677 = !DILocation(line: 2510, column: 39, scope: !671, inlinedAt: !678)
!678 = distinct !DILocation(line: 2747, column: 9, scope: !659)
!679 = !DILocation(line: 2750, column: 13, scope: !671, inlinedAt: !678)
!680 = !DILocation(line: 2750, column: 45, scope: !671, inlinedAt: !678)
!681 = !DILocation(line: 2511, column: 20, scope: !671, inlinedAt: !678)
!682 = !DILocation(line: 2513, column: 21, scope: !671, inlinedAt: !678)
!683 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17hec6c0c291f5acb3dE", scope: !509, file: !218, line: 2738, type: !563, scopeLine: 2738, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !684)
!684 = !{!685, !686, !687}
!685 = !DILocalVariable(name: "src", arg: 1, scope: !683, file: !218, line: 2738, type: !207)
!686 = !DILocalVariable(name: "dst", arg: 2, scope: !683, file: !218, line: 2738, type: !261)
!687 = !DILocalVariable(name: "count", arg: 3, scope: !683, file: !218, line: 2738, type: !9)
!688 = !DILocation(line: 2738, column: 29, scope: !683)
!689 = !DILocation(line: 2738, column: 44, scope: !683)
!690 = !DILocation(line: 2738, column: 57, scope: !683)
!691 = !DILocation(line: 2747, column: 9, scope: !683)
!692 = !DILocation(line: 2752, column: 9, scope: !683)
!693 = !DILocation(line: 2754, column: 2, scope: !683)
!694 = !DILocalVariable(name: "src", arg: 1, scope: !695, file: !218, line: 2510, type: !207)
!695 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17h166a771d022cb87dE", scope: !672, file: !218, line: 2510, type: !696, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !207, !261}
!698 = !{!694, !699}
!699 = !DILocalVariable(name: "dst", arg: 2, scope: !695, file: !218, line: 2510, type: !261)
!700 = !DILocation(line: 2510, column: 39, scope: !695, inlinedAt: !701)
!701 = distinct !DILocation(line: 2747, column: 9, scope: !683)
!702 = !DILocation(line: 2750, column: 13, scope: !695, inlinedAt: !701)
!703 = !DILocation(line: 2750, column: 45, scope: !695, inlinedAt: !701)
!704 = !DILocation(line: 2511, column: 20, scope: !695, inlinedAt: !701)
!705 = !DILocation(line: 2513, column: 21, scope: !695, inlinedAt: !701)
!706 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17hc3ea1d6743894018E", scope: !708, file: !707, line: 1375, type: !710, scopeLine: 1375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !712)
!707 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "d644eb02e860469d314db953642d3471")
!708 = !DINamespace(name: "{impl#63}", scope: !709)
!709 = !DINamespace(name: "impls", scope: !149)
!710 = !DISubroutineType(types: !711)
!711 = !{!148, !132, !132}
!712 = !{!713, !714}
!713 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !707, line: 1375, type: !132)
!714 = !DILocalVariable(name: "other", arg: 2, scope: !706, file: !707, line: 1375, type: !132)
!715 = !DILocation(line: 1375, column: 24, scope: !706)
!716 = !DILocation(line: 1375, column: 31, scope: !706)
!717 = !DILocation(line: 1378, column: 24, scope: !706)
!718 = !DILocation(line: 1378, column: 32, scope: !706)
!719 = !DILocation(line: 1379, column: 29, scope: !706)
!720 = !DILocation(line: 1379, column: 38, scope: !706)
!721 = !DILocation(line: 1378, column: 41, scope: !706)
!722 = !DILocation(line: 1378, column: 21, scope: !706)
!723 = !DILocation(line: 1381, column: 18, scope: !706)
!724 = !{i8 -1, i8 2}
!725 = !DILocation(line: 1380, column: 28, scope: !706)
!726 = !DILocation(line: 1379, column: 26, scope: !706)
!727 = !DILocation(line: 1379, column: 47, scope: !706)
!728 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17h5a181105292e9ec3E", scope: !730, file: !729, line: 185, type: !732, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !734)
!729 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!730 = !DINamespace(name: "{impl#86}", scope: !731)
!731 = !DINamespace(name: "num", scope: !141)
!732 = !DISubroutineType(types: !733)
!733 = !{!431, !85, !450}
!734 = !{!735, !736}
!735 = !DILocalVariable(name: "self", arg: 1, scope: !728, file: !729, line: 185, type: !85)
!736 = !DILocalVariable(name: "f", arg: 2, scope: !728, file: !729, line: 185, type: !450)
!737 = !DILocation(line: 185, column: 20, scope: !728)
!738 = !DILocation(line: 185, column: 27, scope: !728)
!739 = !DILocation(line: 186, column: 20, scope: !728)
!740 = !DILocation(line: 188, column: 27, scope: !728)
!741 = !DILocation(line: 187, column: 21, scope: !728)
!742 = !DILocation(line: 193, column: 14, scope: !728)
!743 = !DILocation(line: 191, column: 21, scope: !728)
!744 = !DILocation(line: 189, column: 21, scope: !728)
!745 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17h13fb050ba9099d34E", scope: !746, file: !729, line: 185, type: !747, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !749)
!746 = !DINamespace(name: "{impl#87}", scope: !731)
!747 = !DISubroutineType(types: !748)
!748 = !{!431, !132, !450}
!749 = !{!750, !751}
!750 = !DILocalVariable(name: "self", arg: 1, scope: !745, file: !729, line: 185, type: !132)
!751 = !DILocalVariable(name: "f", arg: 2, scope: !745, file: !729, line: 185, type: !450)
!752 = !DILocation(line: 185, column: 20, scope: !745)
!753 = !DILocation(line: 185, column: 27, scope: !745)
!754 = !DILocation(line: 186, column: 20, scope: !745)
!755 = !DILocation(line: 188, column: 27, scope: !745)
!756 = !DILocation(line: 187, column: 21, scope: !745)
!757 = !DILocation(line: 193, column: 14, scope: !745)
!758 = !DILocation(line: 191, column: 21, scope: !745)
!759 = !DILocation(line: 189, column: 21, scope: !745)
!760 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17ha58637c42fd033a9E", scope: !762, file: !761, line: 627, type: !771, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !795, retainedNodes: !788)
!761 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d369067f6435760f7cc849d2e066cf9")
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !763, file: !2, size: 128, align: 64, elements: !764, templateParams: !24, identifier: "ae07da23b080ec60b105d8215b18a026")
!763 = !DINamespace(name: "builders", scope: !141)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !762, file: !2, baseType: !766, size: 128, align: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !763, file: !2, size: 128, align: 64, elements: !767, templateParams: !24, identifier: "ee606292d8e267aa410b9fb0fdbcf0f1")
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !766, file: !2, baseType: !450, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !766, file: !2, baseType: !431, size: 8, align: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !766, file: !2, baseType: !401, size: 8, align: 8, offset: 72)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !773, !774}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !762, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !775, file: !2, size: 128, align: 64, elements: !776, templateParams: !189, identifier: "5bc19c3c7d4a2ee82859122c73f5cfe0")
!775 = !DINamespace(name: "iter", scope: !166)
!776 = !{!777, !782, !783}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !774, file: !2, baseType: !778, size: 64, align: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !779, file: !2, size: 64, align: 64, elements: !780, templateParams: !189, identifier: "baadf4d0713ee55c88ab9538c882ce60")
!779 = !DINamespace(name: "non_null", scope: !204)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !778, file: !2, baseType: !207, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !774, file: !2, baseType: !207, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !774, file: !2, baseType: !784, align: 8)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !785, file: !2, align: 8, elements: !24, templateParams: !786, identifier: "f1569371ef1c8b341e77b601b13bc9cb")
!785 = !DINamespace(name: "marker", scope: !142)
!786 = !{!787}
!787 = !DITemplateTypeParameter(name: "T", type: !12)
!788 = !{!789, !790, !791, !793}
!789 = !DILocalVariable(name: "self", arg: 1, scope: !760, file: !761, line: 627, type: !773)
!790 = !DILocalVariable(name: "entries", arg: 2, scope: !760, file: !761, line: 627, type: !774)
!791 = !DILocalVariable(name: "iter", scope: !792, file: !761, line: 632, type: !774, align: 8)
!792 = distinct !DILexicalBlock(scope: !760, file: !761, line: 632, column: 9)
!793 = !DILocalVariable(name: "entry", scope: !794, file: !761, line: 632, type: !12, align: 8)
!794 = distinct !DILexicalBlock(scope: !792, file: !761, line: 632, column: 30)
!795 = !{!796, !797}
!796 = !DITemplateTypeParameter(name: "D", type: !12)
!797 = !DITemplateTypeParameter(name: "I", type: !774)
!798 = !DILocation(line: 627, column: 26, scope: !760)
!799 = !DILocation(line: 627, column: 37, scope: !760)
!800 = !DILocation(line: 632, column: 22, scope: !792)
!801 = !DILocation(line: 632, column: 13, scope: !794)
!802 = !DILocation(line: 632, column: 22, scope: !760)
!803 = !DILocation(line: 632, column: 9, scope: !792)
!804 = !DILocation(line: 636, column: 6, scope: !760)
!805 = !DILocation(line: 632, column: 13, scope: !792)
!806 = !DILocation(line: 633, column: 13, scope: !794)
!807 = !DILocation(line: 634, column: 9, scope: !792)
!808 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17he6b6155d83e3d98fE", scope: !809, file: !427, line: 333, type: !875, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !880)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !141, file: !2, size: 384, align: 64, elements: !810, templateParams: !24, identifier: "3fe42376b1215e3c513455baf65e326c")
!810 = !{!811, !817, !859}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !809, file: !2, baseType: !812, size: 128, align: 64, offset: 128)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !813, templateParams: !24, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!813 = !{!814, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !812, file: !2, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !812, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !809, file: !2, baseType: !818, size: 128, align: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !459, file: !2, size: 128, align: 64, elements: !819, templateParams: !24, identifier: "df5933aa3c6a9722742184851af5033a")
!819 = !{!820}
!820 = !DICompositeType(tag: DW_TAG_variant_part, scope: !818, file: !2, size: 128, align: 64, elements: !821, templateParams: !24, identifier: "1646963b667c96d9a442c2d3b1073220", discriminator: !858)
!821 = !{!822, !854}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !820, file: !2, baseType: !823, size: 128, align: 64, extraData: i64 0)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !818, file: !2, size: 128, align: 64, elements: !24, templateParams: !824, identifier: "97766f76e39853db3159b250c9d78db0")
!824 = !{!825}
!825 = !DITemplateTypeParameter(name: "T", type: !826)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !827, templateParams: !24, identifier: "ccd3fb5103664797cd5b567c3f0fd7e9")
!827 = !{!828, !853}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !826, file: !2, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64, dwarfAddressSpace: 0)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !140, file: !2, size: 448, align: 64, elements: !831, templateParams: !24, identifier: "c260d6150bb5bc8c142c245d8170b89c")
!831 = !{!832, !833, !834, !835, !836, !852}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !830, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !830, file: !2, baseType: !455, size: 32, align: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !830, file: !2, baseType: !139, size: 8, align: 8, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !830, file: !2, baseType: !27, size: 32, align: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !830, file: !2, baseType: !837, size: 128, align: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !838, templateParams: !24, identifier: "b949088d80ce83b320d7a7cb28de90d")
!838 = !{!839}
!839 = !DICompositeType(tag: DW_TAG_variant_part, scope: !837, file: !2, size: 128, align: 64, elements: !840, templateParams: !24, identifier: "f47c4848087d9b8effa8dd614cb9155f", discriminator: !851)
!840 = !{!841, !845, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !839, file: !2, baseType: !842, size: 128, align: 64, extraData: i64 0)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !837, file: !2, size: 128, align: 64, elements: !843, templateParams: !24, identifier: "e05070f661b792797efd4a004b55064e")
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !842, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !839, file: !2, baseType: !846, size: 128, align: 64, extraData: i64 1)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !837, file: !2, size: 128, align: 64, elements: !847, templateParams: !24, identifier: "9f51e9afc132ad1f315ce258130e8a4")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !839, file: !2, baseType: !850, size: 128, align: 64, extraData: i64 2)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !837, file: !2, size: 128, align: 64, elements: !24, identifier: "ada4c6a7bf59be7476587d993c5cac36")
!851 = !DIDerivedType(tag: DW_TAG_member, scope: !837, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !830, file: !2, baseType: !837, size: 128, align: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !826, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !820, file: !2, baseType: !855, size: 128, align: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !818, file: !2, size: 128, align: 64, elements: !856, templateParams: !824, identifier: "10a9ef3e4ebadceee41170cc5ddfec96")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !2, baseType: !826, size: 128, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !809, file: !2, baseType: !860, size: 128, align: 64, offset: 256)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !861, templateParams: !24, identifier: "b7d08e53003fad3855fb5c1b5ddc2cc6")
!861 = !{!862, !874}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !860, file: !2, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64, dwarfAddressSpace: 0)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 128, align: 64, elements: !865, templateParams: !24, identifier: "b2e8380e554a80515b7493dbea0eb626")
!865 = !{!866, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !864, file: !2, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !868, size: 64, align: 64, dwarfAddressSpace: 0)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !869, file: !2, align: 8, elements: !24, identifier: "4f858257f67fe311ee5b9d89fb7a346")
!869 = !DINamespace(name: "{extern#0}", scope: !140)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !864, file: !2, baseType: !871, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !872, size: 64, align: 64, dwarfAddressSpace: 0)
!872 = !DISubroutineType(types: !873)
!873 = !{!431, !867, !450}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !860, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!809, !812, !860, !826, !877}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !140, file: !2, align: 8, elements: !878, templateParams: !24, identifier: "705e11c2ff919d421903976528c2")
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !877, file: !2, baseType: !7, align: 8)
!880 = !{!881, !882, !883, !884, !885}
!881 = !DILocalVariable(name: "pieces", arg: 1, scope: !808, file: !427, line: 334, type: !812)
!882 = !DILocalVariable(name: "args", arg: 2, scope: !808, file: !427, line: 335, type: !860)
!883 = !DILocalVariable(name: "fmt", arg: 3, scope: !808, file: !427, line: 336, type: !826)
!884 = !DILocalVariable(name: "_unsafe_arg", scope: !808, file: !427, line: 337, type: !877, align: 1)
!885 = !DILocalVariable(arg: 4, scope: !808, file: !427, line: 337, type: !877)
!886 = !DILocation(line: 337, column: 9, scope: !808)
!887 = !DILocation(line: 334, column: 9, scope: !808)
!888 = !DILocation(line: 335, column: 9, scope: !808)
!889 = !DILocation(line: 336, column: 9, scope: !808)
!890 = !DILocation(line: 339, column: 34, scope: !808)
!891 = !DILocation(line: 339, column: 9, scope: !808)
!892 = !DILocation(line: 340, column: 6, scope: !808)
!893 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h9cb1f000867efa0eE", scope: !809, file: !427, line: 308, type: !894, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!809, !812, !860}
!896 = !{!897, !898}
!897 = !DILocalVariable(name: "pieces", arg: 1, scope: !893, file: !427, line: 308, type: !812)
!898 = !DILocalVariable(name: "args", arg: 2, scope: !893, file: !427, line: 308, type: !860)
!899 = !DILocation(line: 308, column: 19, scope: !893)
!900 = !DILocation(line: 308, column: 47, scope: !893)
!901 = !DILocation(line: 309, column: 12, scope: !893)
!902 = !DILocation(line: 309, column: 56, scope: !893)
!903 = !DILocation(line: 309, column: 41, scope: !893)
!904 = !DILocation(line: 312, column: 34, scope: !893)
!905 = !DILocation(line: 312, column: 9, scope: !893)
!906 = !DILocation(line: 313, column: 6, scope: !893)
!907 = !DILocation(line: 310, column: 13, scope: !893)
!908 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hec4bca10500626d6E", scope: !809, file: !427, line: 297, type: !909, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!809, !812}
!911 = !{!912}
!912 = !DILocalVariable(name: "pieces", arg: 1, scope: !908, file: !427, line: 297, type: !812)
!913 = !DILocation(line: 297, column: 28, scope: !908)
!914 = !DILocation(line: 298, column: 12, scope: !908)
!915 = !DILocation(line: 301, column: 34, scope: !908)
!916 = !DILocation(line: 301, column: 9, scope: !908)
!917 = !DILocation(line: 302, column: 6, scope: !908)
!918 = !DILocation(line: 299, column: 13, scope: !908)
!919 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17h807652d7fd21b86bE", scope: !621, file: !920, line: 763, type: !921, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !631, retainedNodes: !924)
!920 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "67be03cda038c8ef7d5434bd5fa63bd3")
!921 = !DISubroutineType(types: !922)
!922 = !{null, !923, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !619, size: 64, align: 64, dwarfAddressSpace: 0)
!924 = !{!925, !926, !927, !929}
!925 = !DILocalVariable(name: "x", arg: 1, scope: !919, file: !920, line: 763, type: !923)
!926 = !DILocalVariable(name: "y", arg: 2, scope: !919, file: !920, line: 763, type: !923)
!927 = !DILocalVariable(name: "a", scope: !928, file: !920, line: 780, type: !619, align: 8)
!928 = distinct !DILexicalBlock(scope: !919, file: !920, line: 780, column: 9)
!929 = !DILocalVariable(name: "b", scope: !930, file: !920, line: 781, type: !619, align: 8)
!930 = distinct !DILexicalBlock(scope: !928, file: !920, line: 781, column: 9)
!931 = !DILocation(line: 763, column: 36, scope: !919)
!932 = !DILocation(line: 763, column: 47, scope: !919)
!933 = !DILocation(line: 780, column: 13, scope: !928)
!934 = !DILocation(line: 781, column: 13, scope: !930)
!935 = !DILocation(line: 780, column: 17, scope: !919)
!936 = !DILocation(line: 781, column: 17, scope: !928)
!937 = !DILocation(line: 782, column: 23, scope: !930)
!938 = !DILocation(line: 782, column: 9, scope: !930)
!939 = !DILocation(line: 783, column: 23, scope: !930)
!940 = !DILocation(line: 783, column: 9, scope: !930)
!941 = !DILocation(line: 785, column: 2, scope: !919)
!942 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17he4eea0885f042464E", scope: !621, file: !920, line: 763, type: !943, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !946)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!946 = !{!947, !948, !949, !951}
!947 = !DILocalVariable(name: "x", arg: 1, scope: !942, file: !920, line: 763, type: !945)
!948 = !DILocalVariable(name: "y", arg: 2, scope: !942, file: !920, line: 763, type: !945)
!949 = !DILocalVariable(name: "a", scope: !950, file: !920, line: 780, type: !13, align: 8)
!950 = distinct !DILexicalBlock(scope: !942, file: !920, line: 780, column: 9)
!951 = !DILocalVariable(name: "b", scope: !952, file: !920, line: 781, type: !13, align: 8)
!952 = distinct !DILexicalBlock(scope: !950, file: !920, line: 781, column: 9)
!953 = !DILocation(line: 763, column: 36, scope: !942)
!954 = !DILocation(line: 763, column: 47, scope: !942)
!955 = !DILocation(line: 780, column: 13, scope: !950)
!956 = !DILocation(line: 781, column: 13, scope: !952)
!957 = !DILocation(line: 780, column: 17, scope: !942)
!958 = !DILocation(line: 781, column: 17, scope: !950)
!959 = !DILocation(line: 782, column: 23, scope: !952)
!960 = !DILocation(line: 782, column: 9, scope: !952)
!961 = !DILocation(line: 783, column: 23, scope: !952)
!962 = !DILocation(line: 783, column: 9, scope: !952)
!963 = !DILocation(line: 785, column: 2, scope: !942)
!964 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17h5e32ce30d0549785E", scope: !621, file: !920, line: 726, type: !943, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !965)
!965 = !{!966, !967}
!966 = !DILocalVariable(name: "x", arg: 1, scope: !964, file: !920, line: 726, type: !945)
!967 = !DILocalVariable(name: "y", arg: 2, scope: !964, file: !920, line: 726, type: !945)
!968 = !DILocation(line: 726, column: 22, scope: !964)
!969 = !DILocation(line: 726, column: 33, scope: !964)
!970 = !DILocation(line: 741, column: 12, scope: !964)
!971 = !DILocation(line: 755, column: 5, scope: !964)
!972 = !DILocation(line: 744, column: 29, scope: !964)
!973 = !DILocation(line: 756, column: 2, scope: !964)
!974 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17h252116982950a14dE", scope: !621, file: !920, line: 148, type: !975, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !13}
!977 = !{!978}
!978 = !DILocalVariable(name: "t", arg: 1, scope: !974, file: !920, line: 148, type: !13)
!979 = !DILocation(line: 148, column: 24, scope: !974)
!980 = !DILocalVariable(name: "value", arg: 1, scope: !981, file: !982, line: 70, type: !13)
!981 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17hf8ab99b4169cb985E", scope: !625, file: !982, line: 70, type: !983, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !189, retainedNodes: !985)
!982 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "757172e61d55c773a9468e6d26f74706")
!983 = !DISubroutineType(types: !984)
!984 = !{!625, !13}
!985 = !{!980}
!986 = !DILocation(line: 70, column: 22, scope: !981, inlinedAt: !987)
!987 = distinct !DILocation(line: 149, column: 13, scope: !974)
!988 = !DILocation(line: 71, column: 9, scope: !981, inlinedAt: !987)
!989 = !DILocation(line: 150, column: 2, scope: !974)
!990 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17he5a0beee4fd45944E", scope: !992, file: !991, line: 576, type: !994, scopeLine: 576, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !996)
!991 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "9f9a8c2611080e433b531f707b01187e")
!992 = !DINamespace(name: "{impl#11}", scope: !993)
!993 = !DINamespace(name: "num", scope: !142)
!994 = !DISubroutineType(types: !995)
!995 = !{!458, !9, !9}
!996 = !{!997, !998, !999, !1001}
!997 = !DILocalVariable(name: "self", arg: 1, scope: !990, file: !991, line: 576, type: !9)
!998 = !DILocalVariable(name: "rhs", arg: 2, scope: !990, file: !991, line: 576, type: !9)
!999 = !DILocalVariable(name: "a", scope: !1000, file: !991, line: 577, type: !9, align: 8)
!1000 = distinct !DILexicalBlock(scope: !990, file: !991, line: 577, column: 13)
!1001 = !DILocalVariable(name: "b", scope: !1000, file: !991, line: 577, type: !401, align: 1)
!1002 = !DILocation(line: 576, column: 34, scope: !990)
!1003 = !DILocation(line: 576, column: 40, scope: !990)
!1004 = !DILocalVariable(name: "self", arg: 1, scope: !1005, file: !991, line: 1702, type: !9)
!1005 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17h238b71a21f9ec77aE", scope: !992, file: !991, line: 1702, type: !1006, scopeLine: 1702, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1012)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1008, !9, !9}
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !1009, templateParams: !24, identifier: "4030f8452435be378048c6d8b59c8539")
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1008, file: !2, baseType: !9, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1008, file: !2, baseType: !401, size: 8, align: 8, offset: 64)
!1012 = !{!1004, !1013, !1014, !1016}
!1013 = !DILocalVariable(name: "rhs", arg: 2, scope: !1005, file: !991, line: 1702, type: !9)
!1014 = !DILocalVariable(name: "a", scope: !1015, file: !991, line: 1703, type: !22, align: 8)
!1015 = distinct !DILexicalBlock(scope: !1005, file: !991, line: 1703, column: 13)
!1016 = !DILocalVariable(name: "b", scope: !1015, file: !991, line: 1703, type: !401, align: 1)
!1017 = !DILocation(line: 1702, column: 38, scope: !1005, inlinedAt: !1018)
!1018 = distinct !DILocation(line: 577, column: 26, scope: !990)
!1019 = !DILocation(line: 1702, column: 44, scope: !1005, inlinedAt: !1018)
!1020 = !DILocation(line: 1703, column: 26, scope: !1005, inlinedAt: !1018)
!1021 = !DILocation(line: 1703, column: 18, scope: !1005, inlinedAt: !1018)
!1022 = !DILocation(line: 1703, column: 18, scope: !1015, inlinedAt: !1018)
!1023 = !DILocation(line: 1703, column: 21, scope: !1005, inlinedAt: !1018)
!1024 = !DILocation(line: 1703, column: 21, scope: !1015, inlinedAt: !1018)
!1025 = !DILocation(line: 1704, column: 13, scope: !1015, inlinedAt: !1018)
!1026 = !DILocation(line: 1705, column: 10, scope: !1005, inlinedAt: !1018)
!1027 = !DILocation(line: 577, column: 26, scope: !990)
!1028 = !DILocation(line: 577, column: 18, scope: !990)
!1029 = !DILocation(line: 577, column: 18, scope: !1000)
!1030 = !DILocation(line: 577, column: 21, scope: !990)
!1031 = !DILocation(line: 577, column: 21, scope: !1000)
!1032 = !DILocation(line: 578, column: 16, scope: !1000)
!1033 = !DILocation(line: 578, column: 42, scope: !1000)
!1034 = !DILocation(line: 578, column: 13, scope: !1000)
!1035 = !DILocation(line: 578, column: 30, scope: !1000)
!1036 = !DILocation(line: 579, column: 10, scope: !990)
!1037 = !{i64 0, i64 2}
!1038 = distinct !DISubprogram(name: "next_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$17next_power_of_two17ha4fc2aa9633a53bdE", scope: !992, file: !991, line: 2216, type: !1039, scopeLine: 2216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1041)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!9, !9}
!1041 = !{!1042}
!1042 = !DILocalVariable(name: "self", arg: 1, scope: !1038, file: !991, line: 2216, type: !9)
!1043 = !DILocation(line: 2216, column: 40, scope: !1038)
!1044 = !DILocation(line: 2217, column: 13, scope: !1038)
!1045 = !DILocation(line: 2218, column: 10, scope: !1038)
