; ModuleID = 'bootloader.4c619316-cgu.0'
source_filename = "bootloader.4c619316-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::ops::range::RangeInclusive<usize>" = type { i64, i64, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}
%"[closure@core::slice::sort::choose_pivot<bootinfo::memory_map::MemoryRegion, [closure@core::slice::<impl [bootinfo::memory_map::MemoryRegion]>::sort_unstable_by<[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]>::{closure#0}]>::{closure#0}]" = type { { ptr, i64 }, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "4b612d25f61d12d4c09ed70e0fec28bd")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "c44d3765c8b39cfb34e01224737a2436")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "9ef9ef1937a6636b61c2ba1435e17489")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !19, templateParams: !24, identifier: "eda01ae88cc45f81d2e2650a93f0e044")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !24, identifier: "760b1fdf024dbdcb8464c34a1adc1d0d")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !64, vtableHolder: !22, templateParams: !24, identifier: "651342a23dd28bf3b43591e743ad2be6")
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !63, file: !2, baseType: !6, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !63, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !63, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !72, vtableHolder: !27, templateParams: !24, identifier: "9a50413855c1bf1dc3d017ea33a4cf53")
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !71, file: !2, baseType: !6, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !71, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !71, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !80, vtableHolder: !85, templateParams: !24, identifier: "a1796ee89ddeeaf5f4c580736da82908")
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !79, file: !2, baseType: !6, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !79, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !79, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !89, vtableHolder: !94, templateParams: !24, identifier: "373d22b9cfe699ffd0b22cd6c250b421")
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !88, file: !2, baseType: !6, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !88, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !88, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !95, templateParams: !24, identifier: "cbff1f6ff1c2668c9d19a225cf1e9d90")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !94, file: !2, baseType: !97, size: 12288, align: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 64, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !94, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "cd382ff39a3173ef89c3b043f08f48b")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !110, templateParams: !24, identifier: "9dd4922627d64ce1caf9bc8e09623063")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !109, file: !2, baseType: !22, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !109, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !117, vtableHolder: !122, templateParams: !24, identifier: "54c2724b2adb1eb31351269ada2d013")
!117 = !{!118, !119, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !116, file: !2, baseType: !6, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !116, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !127, vtableHolder: !132, templateParams: !24, identifier: "72a8f41c2039c0da2413a8ce1c63be0")
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !126, file: !2, baseType: !6, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !126, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !126, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !{i32 8, !"PIC Level", i32 2}
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !137, producer: "clang LLVM (rustc version 1.71.0-nightly (d0f204e4d 2023-04-16))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, globals: !162, splitDebugInlining: false)
!137 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23/src/lib.rs/@/bootloader.4c619316-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bootloader-0.9.23")
!138 = !{!26, !139, !149, !156}
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !140, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!140 = !DINamespace(name: "v1", scope: !141)
!141 = !DINamespace(name: "rt", scope: !142)
!142 = !DINamespace(name: "fmt", scope: !143)
!143 = !DINamespace(name: "core", scope: null)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !150, file: !2, baseType: !151, size: 8, align: 8, flags: DIFlagEnumClass, elements: !152)
!150 = !DINamespace(name: "cmp", scope: !143)
!151 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "Less", value: -1)
!154 = !DIEnumerator(name: "Equal", value: 0)
!155 = !DIEnumerator(name: "Greater", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !157, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagEnumClass, elements: !158)
!157 = !DINamespace(name: "panicking", scope: !143)
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!162 = !{!0, !44, !52, !61, !69, !77, !86, !101, !114, !124}
!163 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h2d47314f2b84b306E", scope: !165, file: !164, line: 374, type: !168, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !183)
!164 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "1350c165f4aa6e79d8fe4fa0de29c328")
!165 = !DINamespace(name: "{impl#4}", scope: !166)
!166 = !DINamespace(name: "index", scope: !167)
!167 = !DINamespace(name: "slice", scope: !143)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !175, !170}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !171, templateParams: !24, identifier: "7010c4221deaabc85662a14799cddacb")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !176, file: !2, size: 128, align: 64, elements: !178, templateParams: !181, identifier: "affb821d2ef067ad9b92b5e9467b6ff1")
!176 = !DINamespace(name: "range", scope: !177)
!177 = !DINamespace(name: "ops", scope: !143)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "Idx", type: !9)
!183 = !{!184, !185, !186, !188}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !164, line: 374, type: !175)
!185 = !DILocalVariable(name: "slice", arg: 2, scope: !163, file: !164, line: 374, type: !170)
!186 = !DILocalVariable(name: "this", scope: !187, file: !164, line: 375, type: !175, align: 8)
!187 = distinct !DILexicalBlock(scope: !163, file: !164, line: 375, column: 9)
!188 = !DILocalVariable(name: "new_len", scope: !189, file: !164, line: 386, type: !9, align: 8)
!189 = distinct !DILexicalBlock(scope: !187, file: !164, line: 386, column: 13)
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !13)
!192 = !DILocation(line: 374, column: 29, scope: !163)
!193 = !DILocation(line: 374, column: 35, scope: !163)
!194 = !DILocation(line: 375, column: 13, scope: !187)
!195 = !DILocation(line: 375, column: 20, scope: !163)
!196 = !DILocation(line: 381, column: 13, scope: !187)
!197 = !DILocation(line: 386, column: 27, scope: !187)
!198 = !DILocation(line: 386, column: 17, scope: !189)
!199 = !DILocation(line: 387, column: 39, scope: !189)
!200 = !DILocalVariable(name: "self", arg: 1, scope: !201, file: !202, line: 915, type: !208)
!201 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h68bd737be34ebddaE", scope: !203, file: !202, line: 915, type: !206, scopeLine: 915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !209)
!202 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "2a21946c6980740609ff35bdd2bfdb1c")
!203 = !DINamespace(name: "{impl#0}", scope: !204)
!204 = !DINamespace(name: "const_ptr", scope: !205)
!205 = !DINamespace(name: "ptr", scope: !143)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !208, !9}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !{!200, !210}
!210 = !DILocalVariable(name: "count", arg: 2, scope: !201, file: !202, line: 915, type: !9)
!211 = !DILocation(line: 915, column: 29, scope: !201, inlinedAt: !212)
!212 = distinct !DILocation(line: 387, column: 39, scope: !189)
!213 = !DILocation(line: 915, column: 35, scope: !201, inlinedAt: !212)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !215, file: !202, line: 460, type: !208)
!215 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h3019254ff67435c7E", scope: !203, file: !202, line: 460, type: !216, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !219)
!216 = !DISubroutineType(types: !217)
!217 = !{!208, !208, !218}
!218 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!219 = !{!214, !220}
!220 = !DILocalVariable(name: "count", arg: 2, scope: !215, file: !202, line: 460, type: !218)
!221 = !DILocation(line: 460, column: 32, scope: !215, inlinedAt: !222)
!222 = distinct !DILocation(line: 920, column: 18, scope: !201, inlinedAt: !212)
!223 = !DILocation(line: 460, column: 38, scope: !215, inlinedAt: !222)
!224 = !DILocation(line: 465, column: 18, scope: !215, inlinedAt: !222)
!225 = !DILocation(line: 387, column: 13, scope: !189)
!226 = !DILocation(line: 389, column: 6, scope: !163)
!227 = !DILocalVariable(name: "this", arg: 1, scope: !228, file: !229, line: 2484, type: !175)
!228 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17h1ff5ce516cbba997E", scope: !230, file: !229, line: 2484, type: !231, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !233)
!229 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a443bdaf0a09f89f5b2fb75aa981800")
!230 = !DINamespace(name: "get_unchecked", scope: !165)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !175, !170}
!233 = !{!227, !234}
!234 = !DILocalVariable(name: "slice", arg: 2, scope: !228, file: !229, line: 2484, type: !170)
!235 = !DILocation(line: 2484, column: 39, scope: !228, inlinedAt: !236)
!236 = distinct !DILocation(line: 381, column: 13, scope: !187)
!237 = !DILocation(line: 384, column: 17, scope: !238, inlinedAt: !236)
!238 = !DILexicalBlockFile(scope: !228, file: !164, discriminator: 0)
!239 = !DILocation(line: 384, column: 55, scope: !238, inlinedAt: !236)
!240 = !DILocation(line: 384, column: 43, scope: !238, inlinedAt: !236)
!241 = !DILocation(line: 2485, column: 20, scope: !228, inlinedAt: !236)
!242 = !{i8 0, i8 2}
!243 = !DILocation(line: 2487, column: 21, scope: !228, inlinedAt: !236)
!244 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h2ce56c62d1d071b6E", scope: !165, file: !164, line: 392, type: !245, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !251)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !175, !247}
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !248, templateParams: !24, identifier: "36ef83c999cdb5c258c3ef4b914b609f")
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !247, file: !2, baseType: !173, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !247, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!251 = !{!252, !253, !254, !256}
!252 = !DILocalVariable(name: "self", arg: 1, scope: !244, file: !164, line: 392, type: !175)
!253 = !DILocalVariable(name: "slice", arg: 2, scope: !244, file: !164, line: 392, type: !247)
!254 = !DILocalVariable(name: "this", scope: !255, file: !164, line: 393, type: !175, align: 8)
!255 = distinct !DILexicalBlock(scope: !244, file: !164, line: 393, column: 9)
!256 = !DILocalVariable(name: "new_len", scope: !257, file: !164, line: 401, type: !9, align: 8)
!257 = distinct !DILexicalBlock(scope: !255, file: !164, line: 401, column: 13)
!258 = !DILocation(line: 392, column: 33, scope: !244)
!259 = !DILocation(line: 392, column: 39, scope: !244)
!260 = !DILocation(line: 393, column: 13, scope: !255)
!261 = !DILocation(line: 393, column: 20, scope: !244)
!262 = !DILocation(line: 396, column: 13, scope: !255)
!263 = !DILocation(line: 401, column: 27, scope: !255)
!264 = !DILocation(line: 401, column: 17, scope: !257)
!265 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !267, line: 2014, type: !247)
!266 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h6b83ef297ea5609fE", scope: !268, file: !267, line: 2014, type: !270, scopeLine: 2014, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !273)
!267 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "11087a90ad8f3b9862444e143466697a")
!268 = !DINamespace(name: "{impl#1}", scope: !269)
!269 = !DINamespace(name: "mut_ptr", scope: !205)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !247}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!273 = !{!265}
!274 = !DILocation(line: 2014, column: 29, scope: !266, inlinedAt: !275)
!275 = distinct !DILocation(line: 402, column: 43, scope: !257)
!276 = !DILocalVariable(name: "self", arg: 1, scope: !277, file: !267, line: 1015, type: !272)
!277 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hf3f870e6812bbbb6E", scope: !278, file: !267, line: 1015, type: !279, scopeLine: 1015, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !281)
!278 = !DINamespace(name: "{impl#0}", scope: !269)
!279 = !DISubroutineType(types: !280)
!280 = !{!272, !272, !9}
!281 = !{!276, !282}
!282 = !DILocalVariable(name: "count", arg: 2, scope: !277, file: !267, line: 1015, type: !9)
!283 = !DILocation(line: 1015, column: 29, scope: !277, inlinedAt: !284)
!284 = distinct !DILocation(line: 402, column: 43, scope: !257)
!285 = !DILocation(line: 1015, column: 35, scope: !277, inlinedAt: !284)
!286 = !DILocalVariable(name: "self", arg: 1, scope: !287, file: !267, line: 472, type: !272)
!287 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h63b181a41f41fa84E", scope: !278, file: !267, line: 472, type: !288, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{!272, !272, !218}
!290 = !{!286, !291}
!291 = !DILocalVariable(name: "count", arg: 2, scope: !287, file: !267, line: 472, type: !218)
!292 = !DILocation(line: 472, column: 32, scope: !287, inlinedAt: !293)
!293 = distinct !DILocation(line: 1020, column: 18, scope: !277, inlinedAt: !284)
!294 = !DILocation(line: 472, column: 38, scope: !287, inlinedAt: !293)
!295 = !DILocation(line: 479, column: 18, scope: !287, inlinedAt: !293)
!296 = !DILocation(line: 402, column: 13, scope: !257)
!297 = !DILocation(line: 404, column: 6, scope: !244)
!298 = !DILocalVariable(name: "this", arg: 1, scope: !299, file: !229, line: 2484, type: !175)
!299 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17h19713aa0ec311f3bE", scope: !300, file: !229, line: 2484, type: !301, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !303)
!300 = !DINamespace(name: "get_unchecked_mut", scope: !165)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !175, !247}
!303 = !{!298, !304}
!304 = !DILocalVariable(name: "slice", arg: 2, scope: !299, file: !229, line: 2484, type: !247)
!305 = !DILocation(line: 2484, column: 39, scope: !299, inlinedAt: !306)
!306 = distinct !DILocation(line: 396, column: 13, scope: !255)
!307 = !DILocation(line: 399, column: 17, scope: !308, inlinedAt: !306)
!308 = !DILexicalBlockFile(scope: !299, file: !164, discriminator: 0)
!309 = !DILocalVariable(name: "self", arg: 1, scope: !310, file: !267, line: 1878, type: !247)
!310 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17hd347498c18c4ec94E", scope: !268, file: !267, line: 1878, type: !311, scopeLine: 1878, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{!9, !247}
!313 = !{!309}
!314 = !DILocation(line: 1878, column: 22, scope: !310, inlinedAt: !315)
!315 = distinct !DILocation(line: 399, column: 55, scope: !308, inlinedAt: !306)
!316 = !DILocation(line: 1879, column: 9, scope: !310, inlinedAt: !315)
!317 = !DILocation(line: 399, column: 43, scope: !308, inlinedAt: !306)
!318 = !DILocation(line: 2485, column: 20, scope: !299, inlinedAt: !306)
!319 = !DILocation(line: 2487, column: 21, scope: !299, inlinedAt: !306)
!320 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17haff5e48139e6d51eE", scope: !165, file: !164, line: 407, type: !321, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !340)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !175, !323, !327}
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !324, templateParams: !24, identifier: "75bb5f1ad11dafe0f685cba80f250c61")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !323, file: !2, baseType: !173, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !323, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !329, file: !2, size: 192, align: 64, elements: !331, templateParams: !24, identifier: "24a132ec608676bf484e0b39817cad59")
!329 = !DINamespace(name: "location", scope: !330)
!330 = !DINamespace(name: "panic", scope: !143)
!331 = !{!332, !338, !339}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !328, file: !2, baseType: !333, size: 128, align: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !334, templateParams: !24, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !333, file: !2, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !328, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !328, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!340 = !{!341, !342}
!341 = !DILocalVariable(name: "self", arg: 1, scope: !320, file: !164, line: 407, type: !175)
!342 = !DILocalVariable(name: "slice", arg: 2, scope: !320, file: !164, line: 407, type: !323)
!343 = !DILocation(line: 407, column: 14, scope: !320)
!344 = !DILocation(line: 407, column: 20, scope: !320)
!345 = !DILocation(line: 408, column: 12, scope: !320)
!346 = !DILocation(line: 410, column: 19, scope: !320)
!347 = !DILocation(line: 409, column: 13, scope: !320)
!348 = !DILocation(line: 414, column: 20, scope: !320)
!349 = !DILocation(line: 415, column: 6, scope: !320)
!350 = !DILocation(line: 411, column: 13, scope: !320)
!351 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hf93e08869586640aE", scope: !165, file: !164, line: 418, type: !352, scopeLine: 418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !358)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !175, !354, !327}
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !355, templateParams: !24, identifier: "2fddb9de6ac0e1ec52fec4088780f399")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !354, file: !2, baseType: !173, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !354, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!358 = !{!359, !360}
!359 = !DILocalVariable(name: "self", arg: 1, scope: !351, file: !164, line: 418, type: !175)
!360 = !DILocalVariable(name: "slice", arg: 2, scope: !351, file: !164, line: 418, type: !354)
!361 = !DILocation(line: 418, column: 18, scope: !351)
!362 = !DILocation(line: 418, column: 24, scope: !351)
!363 = !DILocation(line: 419, column: 12, scope: !351)
!364 = !DILocation(line: 421, column: 19, scope: !351)
!365 = !DILocation(line: 420, column: 13, scope: !351)
!366 = !DILocation(line: 425, column: 24, scope: !351)
!367 = !DILocation(line: 426, column: 6, scope: !351)
!368 = !DILocation(line: 422, column: 13, scope: !351)
!369 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hd9bac579f2e3e23fE", scope: !370, file: !164, line: 462, type: !371, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !376)
!370 = !DINamespace(name: "{impl#5}", scope: !166)
!371 = !DISubroutineType(types: !372)
!372 = !{!354, !373, !354, !327}
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !374, templateParams: !181, identifier: "9070d5ae45b45995c91dfb6b5ad4ffc1")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !373, file: !2, baseType: !9, size: 64, align: 64)
!376 = !{!377, !378}
!377 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !164, line: 462, type: !373)
!378 = !DILocalVariable(name: "slice", arg: 2, scope: !369, file: !164, line: 462, type: !354)
!379 = !DILocation(line: 462, column: 18, scope: !369)
!380 = !DILocation(line: 462, column: 24, scope: !369)
!381 = !DILocation(line: 463, column: 9, scope: !369)
!382 = !DILocation(line: 464, column: 6, scope: !369)
!383 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h0358784fea02884dE", scope: !384, file: !164, line: 489, type: !385, scopeLine: 489, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !390)
!384 = !DINamespace(name: "{impl#6}", scope: !166)
!385 = !DISubroutineType(types: !386)
!386 = !{!247, !387, !247}
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !388, templateParams: !181, identifier: "f57de976b31ca4cfbd343fdb3a994ff4")
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !387, file: !2, baseType: !9, size: 64, align: 64)
!390 = !{!391, !392}
!391 = !DILocalVariable(name: "self", arg: 1, scope: !383, file: !164, line: 489, type: !387)
!392 = !DILocalVariable(name: "slice", arg: 2, scope: !383, file: !164, line: 489, type: !247)
!393 = !DILocation(line: 489, column: 33, scope: !383)
!394 = !DILocation(line: 489, column: 39, scope: !383)
!395 = !DILocation(line: 1878, column: 22, scope: !310, inlinedAt: !396)
!396 = distinct !DILocation(line: 491, column: 31, scope: !383)
!397 = !DILocation(line: 1879, column: 9, scope: !310, inlinedAt: !396)
!398 = !DILocation(line: 491, column: 18, scope: !383)
!399 = !DILocation(line: 492, column: 6, scope: !383)
!400 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hd547e1811f3e4269E", scope: !384, file: !164, line: 504, type: !401, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!354, !387, !354, !327}
!403 = !{!404, !405}
!404 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !164, line: 504, type: !387)
!405 = !DILocalVariable(name: "slice", arg: 2, scope: !400, file: !164, line: 504, type: !354)
!406 = !DILocation(line: 504, column: 18, scope: !400)
!407 = !DILocation(line: 504, column: 24, scope: !400)
!408 = !DILocation(line: 505, column: 12, scope: !400)
!409 = !DILocation(line: 509, column: 24, scope: !400)
!410 = !DILocation(line: 510, column: 6, scope: !400)
!411 = !DILocation(line: 506, column: 13, scope: !400)
!412 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN115_$LT$core..ops..range..RangeInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17hc4ce3d4532c78366E", scope: !413, file: !164, line: 585, type: !414, scopeLine: 585, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !422)
!413 = !DINamespace(name: "{impl#8}", scope: !166)
!414 = !DISubroutineType(types: !415)
!415 = !{!354, !416, !354, !327}
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !176, file: !2, size: 192, align: 64, elements: !417, templateParams: !181, identifier: "c3d4d44a3e02317da17f2599f7ce7774")
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !416, file: !2, baseType: !9, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !416, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !416, file: !2, baseType: !421, size: 8, align: 8, offset: 128)
!421 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!422 = !{!423, !424}
!423 = !DILocalVariable(name: "self", arg: 1, scope: !412, file: !164, line: 585, type: !416)
!424 = !DILocalVariable(name: "slice", arg: 2, scope: !412, file: !164, line: 585, type: !354)
!425 = !DILocation(line: 585, column: 18, scope: !412)
!426 = !DILocation(line: 585, column: 24, scope: !412)
!427 = !DILocation(line: 586, column: 13, scope: !412)
!428 = !DILocation(line: 586, column: 12, scope: !412)
!429 = !DILocation(line: 589, column: 9, scope: !412)
!430 = !DILocation(line: 590, column: 6, scope: !412)
!431 = !DILocation(line: 587, column: 13, scope: !412)
!432 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN117_$LT$core..ops..range..RangeToInclusive$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h0a361e9ac236b6adE", scope: !433, file: !164, line: 626, type: !434, scopeLine: 626, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !439)
!433 = !DINamespace(name: "{impl#9}", scope: !166)
!434 = !DISubroutineType(types: !435)
!435 = !{!354, !436, !354, !327}
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeToInclusive<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !437, templateParams: !181, identifier: "47a3fc841551c6af239fb7cc117833ee")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !436, file: !2, baseType: !9, size: 64, align: 64)
!439 = !{!440, !441}
!440 = !DILocalVariable(name: "self", arg: 1, scope: !432, file: !164, line: 626, type: !436)
!441 = !DILocalVariable(name: "slice", arg: 2, scope: !432, file: !164, line: 626, type: !354)
!442 = !DILocation(line: 626, column: 18, scope: !432)
!443 = !DILocation(line: 626, column: 24, scope: !432)
!444 = !DILocation(line: 627, column: 9, scope: !432)
!445 = !DILocation(line: 628, column: 6, scope: !432)
!446 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17ha840e02953f70767E", scope: !448, file: !447, line: 2418, type: !449, scopeLine: 2418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !504)
!447 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!448 = !DINamespace(name: "{impl#59}", scope: !142)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !469, !470}
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !452, file: !2, size: 8, align: 8, elements: !453, templateParams: !24, identifier: "1c6ce168e24238e83c13ec35dde7d382")
!452 = !DINamespace(name: "result", scope: !143)
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_variant_part, scope: !451, file: !2, size: 8, align: 8, elements: !455, templateParams: !24, identifier: "42dfca7da53f7734270db51480dbcc24", discriminator: !468)
!455 = !{!456, !464}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !454, file: !2, baseType: !457, size: 8, align: 8, extraData: i64 0)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !451, file: !2, size: 8, align: 8, elements: !458, templateParams: !460, identifier: "4d011f8c16a13f53ec25b197c7b1903")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !457, file: !2, baseType: !7, align: 8, offset: 8)
!460 = !{!461, !462}
!461 = !DITemplateTypeParameter(name: "T", type: !7)
!462 = !DITemplateTypeParameter(name: "E", type: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !142, file: !2, align: 8, elements: !24, identifier: "d361babf030d8dcc5fc2146a5e622473")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !454, file: !2, baseType: !465, size: 8, align: 8, extraData: i64 1)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !451, file: !2, size: 8, align: 8, elements: !466, templateParams: !460, identifier: "c5af1e4fa5907b7a524a9ebbd4a5ec10")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !465, file: !2, baseType: !463, align: 8, offset: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !2, baseType: !123, size: 8, align: 8, flags: DIFlagArtificial)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !471, size: 64, align: 64, dwarfAddressSpace: 0)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !142, file: !2, size: 512, align: 64, elements: !472, templateParams: !24, identifier: "a3b888d0a58016a3ad42c934cf971ea3")
!472 = !{!473, !474, !476, !477, !492, !493}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !471, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !471, file: !2, baseType: !475, size: 32, align: 32, offset: 416)
!475 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !471, file: !2, baseType: !139, size: 8, align: 8, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !471, file: !2, baseType: !478, size: 128, align: 64, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !479, file: !2, size: 128, align: 64, elements: !480, templateParams: !24, identifier: "8d57b0310dad0e81a52a7e1f827929d")
!479 = !DINamespace(name: "option", scope: !143)
!480 = !{!481}
!481 = !DICompositeType(tag: DW_TAG_variant_part, scope: !478, file: !2, size: 128, align: 64, elements: !482, templateParams: !24, identifier: "1503e6327b896c262eca127cbc35ec74", discriminator: !491)
!482 = !{!483, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !481, file: !2, baseType: !484, size: 128, align: 64, extraData: i64 0)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !478, file: !2, size: 128, align: 64, elements: !24, templateParams: !485, identifier: "b9a11c756332445b5e317b2b2625f528")
!485 = !{!486}
!486 = !DITemplateTypeParameter(name: "T", type: !9)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !481, file: !2, baseType: !488, size: 128, align: 64, extraData: i64 1)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !478, file: !2, size: 128, align: 64, elements: !489, templateParams: !485, identifier: "87159a1745a522a36bc4a0700aab6dc3")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !478, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !471, file: !2, baseType: !478, size: 128, align: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !471, file: !2, baseType: !494, size: 128, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !495, templateParams: !24, identifier: "b58efcb3df0f0beb9aa098f750459fd2")
!495 = !{!496, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !494, file: !2, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "bcfe988c4f0dd1d50291e24ffc6447")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !494, file: !2, baseType: !500, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 3, lowerBound: 0)
!504 = !{!505, !506}
!505 = !DILocalVariable(name: "self", arg: 1, scope: !446, file: !447, line: 2418, type: !469)
!506 = !DILocalVariable(name: "f", arg: 2, scope: !446, file: !447, line: 2418, type: !470)
!507 = !DILocation(line: 2418, column: 20, scope: !446)
!508 = !DILocation(line: 2418, column: 27, scope: !446)
!509 = !DILocation(line: 2418, column: 71, scope: !446)
!510 = !{i64 8}
!511 = !DILocation(line: 2418, column: 62, scope: !446)
!512 = !DILocation(line: 2418, column: 84, scope: !446)
!513 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hd6cd9195c5fd3845E", scope: !448, file: !447, line: 2418, type: !514, scopeLine: 2418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !520, retainedNodes: !517)
!514 = !DISubroutineType(types: !515)
!515 = !{!451, !516, !470}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "self", arg: 1, scope: !513, file: !447, line: 2418, type: !516)
!519 = !DILocalVariable(name: "f", arg: 2, scope: !513, file: !447, line: 2418, type: !470)
!520 = !{!521}
!521 = !DITemplateTypeParameter(name: "T", type: !26)
!522 = !DILocation(line: 2418, column: 20, scope: !513)
!523 = !DILocation(line: 2418, column: 27, scope: !513)
!524 = !DILocation(line: 2418, column: 71, scope: !513)
!525 = !{i64 4}
!526 = !DILocation(line: 2418, column: 62, scope: !513)
!527 = !DILocation(line: 2418, column: 84, scope: !513)
!528 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17hde59f38a0bf7fb53E", scope: !529, file: !229, line: 2519, type: !530, scopeLine: 2519, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !532)
!529 = !DINamespace(name: "intrinsics", scope: !143)
!530 = !DISubroutineType(types: !531)
!531 = !{!421, !208, !208, !9}
!532 = !{!533, !534, !535, !536, !538, !540, !542}
!533 = !DILocalVariable(name: "src", arg: 1, scope: !528, file: !229, line: 2519, type: !208)
!534 = !DILocalVariable(name: "dst", arg: 2, scope: !528, file: !229, line: 2519, type: !208)
!535 = !DILocalVariable(name: "count", arg: 3, scope: !528, file: !229, line: 2519, type: !9)
!536 = !DILocalVariable(name: "src_usize", scope: !537, file: !229, line: 2520, type: !9, align: 8)
!537 = distinct !DILexicalBlock(scope: !528, file: !229, line: 2520, column: 5)
!538 = !DILocalVariable(name: "dst_usize", scope: !539, file: !229, line: 2521, type: !9, align: 8)
!539 = distinct !DILexicalBlock(scope: !537, file: !229, line: 2521, column: 5)
!540 = !DILocalVariable(name: "size", scope: !541, file: !229, line: 2522, type: !9, align: 8)
!541 = distinct !DILexicalBlock(scope: !539, file: !229, line: 2522, column: 5)
!542 = !DILocalVariable(name: "diff", scope: !543, file: !229, line: 2523, type: !9, align: 8)
!543 = distinct !DILexicalBlock(scope: !541, file: !229, line: 2523, column: 5)
!544 = !DILocation(line: 2519, column: 36, scope: !528)
!545 = !DILocation(line: 2519, column: 51, scope: !528)
!546 = !DILocation(line: 2519, column: 66, scope: !528)
!547 = !DILocation(line: 2523, column: 9, scope: !543)
!548 = !DILocalVariable(name: "self", arg: 1, scope: !549, file: !202, line: 203, type: !208)
!549 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17hdb4bf42d8c97bf01E", scope: !203, file: !202, line: 203, type: !550, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!9, !208}
!552 = !{!548}
!553 = !DILocation(line: 203, column: 17, scope: !549, inlinedAt: !554)
!554 = distinct !DILocation(line: 2520, column: 21, scope: !528)
!555 = !DILocalVariable(name: "self", arg: 1, scope: !556, file: !202, line: 58, type: !208)
!556 = distinct !DISubprogram(name: "cast<bootloader::bootinfo::memory_map::MemoryRegion, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hbc73f6ce52aea6beE", scope: !203, file: !202, line: 58, type: !557, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !560, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!6, !208}
!559 = !{!555}
!560 = !{!191, !561}
!561 = !DITemplateTypeParameter(name: "U", type: !7)
!562 = !DILocation(line: 58, column: 26, scope: !556, inlinedAt: !563)
!563 = distinct !DILocation(line: 207, column: 33, scope: !549, inlinedAt: !554)
!564 = !DILocation(line: 207, column: 18, scope: !549, inlinedAt: !554)
!565 = !DILocation(line: 2520, column: 21, scope: !528)
!566 = !DILocation(line: 2520, column: 9, scope: !537)
!567 = !DILocation(line: 203, column: 17, scope: !549, inlinedAt: !568)
!568 = distinct !DILocation(line: 2521, column: 21, scope: !537)
!569 = !DILocation(line: 58, column: 26, scope: !556, inlinedAt: !570)
!570 = distinct !DILocation(line: 207, column: 33, scope: !549, inlinedAt: !568)
!571 = !DILocation(line: 207, column: 18, scope: !549, inlinedAt: !568)
!572 = !DILocation(line: 2521, column: 21, scope: !537)
!573 = !DILocation(line: 2521, column: 9, scope: !539)
!574 = !DILocation(line: 2522, column: 16, scope: !539)
!575 = !DILocation(line: 2522, column: 9, scope: !541)
!576 = !DILocation(line: 2523, column: 19, scope: !541)
!577 = !DILocation(line: 2523, column: 74, scope: !541)
!578 = !DILocation(line: 2523, column: 43, scope: !541)
!579 = !DILocation(line: 2523, column: 16, scope: !541)
!580 = !DILocation(line: 2526, column: 5, scope: !543)
!581 = !DILocation(line: 2527, column: 2, scope: !528)
!582 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h043830e124fcf1c8E", scope: !529, file: !229, line: 2619, type: !583, scopeLine: 2619, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !208, !272, !9}
!585 = !{!586, !587, !588}
!586 = !DILocalVariable(name: "src", arg: 1, scope: !582, file: !229, line: 2619, type: !208)
!587 = !DILocalVariable(name: "dst", arg: 2, scope: !582, file: !229, line: 2619, type: !272)
!588 = !DILocalVariable(name: "count", arg: 3, scope: !582, file: !229, line: 2619, type: !9)
!589 = !DILocation(line: 2619, column: 44, scope: !582)
!590 = !DILocation(line: 2619, column: 59, scope: !582)
!591 = !DILocation(line: 2619, column: 72, scope: !582)
!592 = !DILocation(line: 2629, column: 9, scope: !582)
!593 = !DILocation(line: 2637, column: 9, scope: !582)
!594 = !DILocation(line: 2639, column: 2, scope: !582)
!595 = !DILocalVariable(name: "src", arg: 1, scope: !596, file: !229, line: 2484, type: !208)
!596 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h9f39d8379615f03aE", scope: !597, file: !229, line: 2484, type: !583, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !598)
!597 = !DINamespace(name: "copy_nonoverlapping", scope: !529)
!598 = !{!595, !599, !600}
!599 = !DILocalVariable(name: "dst", arg: 2, scope: !596, file: !229, line: 2484, type: !272)
!600 = !DILocalVariable(name: "count", arg: 3, scope: !596, file: !229, line: 2484, type: !9)
!601 = !DILocation(line: 2484, column: 39, scope: !596, inlinedAt: !602)
!602 = distinct !DILocation(line: 2629, column: 9, scope: !582)
!603 = !DILocation(line: 2633, column: 13, scope: !596, inlinedAt: !602)
!604 = !DILocation(line: 2634, column: 20, scope: !596, inlinedAt: !602)
!605 = !DILocation(line: 2635, column: 20, scope: !596, inlinedAt: !602)
!606 = !DILocation(line: 2485, column: 20, scope: !596, inlinedAt: !602)
!607 = !DILocation(line: 2487, column: 21, scope: !596, inlinedAt: !602)
!608 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h3fc0a0a5354c2a60E", scope: !529, file: !229, line: 2619, type: !609, scopeLine: 2619, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !613)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611, !612, !9}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(name: "src", arg: 1, scope: !608, file: !229, line: 2619, type: !611)
!615 = !DILocalVariable(name: "dst", arg: 2, scope: !608, file: !229, line: 2619, type: !612)
!616 = !DILocalVariable(name: "count", arg: 3, scope: !608, file: !229, line: 2619, type: !9)
!617 = !DILocation(line: 2619, column: 44, scope: !608)
!618 = !DILocation(line: 2619, column: 59, scope: !608)
!619 = !DILocation(line: 2619, column: 72, scope: !608)
!620 = !DILocation(line: 2629, column: 9, scope: !608)
!621 = !DILocation(line: 2637, column: 9, scope: !608)
!622 = !DILocation(line: 2639, column: 2, scope: !608)
!623 = !DILocalVariable(name: "src", arg: 1, scope: !624, file: !229, line: 2484, type: !611)
!624 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h5cb93030700fe491E", scope: !597, file: !229, line: 2484, type: !609, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !625)
!625 = !{!623, !626, !627}
!626 = !DILocalVariable(name: "dst", arg: 2, scope: !624, file: !229, line: 2484, type: !612)
!627 = !DILocalVariable(name: "count", arg: 3, scope: !624, file: !229, line: 2484, type: !9)
!628 = !DILocation(line: 2484, column: 39, scope: !624, inlinedAt: !629)
!629 = distinct !DILocation(line: 2629, column: 9, scope: !608)
!630 = !DILocation(line: 2633, column: 13, scope: !624, inlinedAt: !629)
!631 = !DILocation(line: 2634, column: 20, scope: !624, inlinedAt: !629)
!632 = !DILocation(line: 2635, column: 20, scope: !624, inlinedAt: !629)
!633 = !DILocation(line: 2485, column: 20, scope: !624, inlinedAt: !629)
!634 = !DILocation(line: 2487, column: 21, scope: !624, inlinedAt: !629)
!635 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h7024e836f5e00bcaE", scope: !529, file: !229, line: 2503, type: !636, scopeLine: 2503, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !651, retainedNodes: !649)
!636 = !DISubroutineType(types: !637)
!637 = !{!421, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !639, size: 64, align: 64, dwarfAddressSpace: 0)
!639 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !640, file: !2, size: 192, align: 64, elements: !642, templateParams: !190, identifier: "2af97901b9bae128171a06be16c67c9a")
!640 = !DINamespace(name: "maybe_uninit", scope: !641)
!641 = !DINamespace(name: "mem", scope: !143)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !639, file: !2, baseType: !7, align: 8)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !639, file: !2, baseType: !645, size: 192, align: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !646, file: !2, size: 192, align: 64, elements: !647, templateParams: !190, identifier: "6e18a9f6ad22e2f12c075c9cc271a6bc")
!646 = !DINamespace(name: "manually_drop", scope: !641)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !2, baseType: !13, size: 192, align: 64)
!649 = !{!650}
!650 = !DILocalVariable(name: "ptr", arg: 1, scope: !635, file: !229, line: 2503, type: !638)
!651 = !{!652}
!652 = !DITemplateTypeParameter(name: "T", type: !639)
!653 = !DILocation(line: 2503, column: 42, scope: !635)
!654 = !DILocation(line: 2504, column: 6, scope: !635)
!655 = !DILocation(line: 2504, column: 5, scope: !635)
!656 = !DILocation(line: 2504, column: 23, scope: !635)
!657 = !DILocation(line: 2505, column: 2, scope: !635)
!658 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17hf4ba8c4511457810E", scope: !529, file: !229, line: 2503, type: !659, scopeLine: 2503, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!421, !208}
!661 = !{!662}
!662 = !DILocalVariable(name: "ptr", arg: 1, scope: !658, file: !229, line: 2503, type: !208)
!663 = !DILocation(line: 2503, column: 42, scope: !658)
!664 = !DILocation(line: 2504, column: 6, scope: !658)
!665 = !DILocation(line: 2504, column: 5, scope: !658)
!666 = !DILocation(line: 2504, column: 23, scope: !658)
!667 = !DILocation(line: 2505, column: 2, scope: !658)
!668 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17hf5c09850e6be46cfE", scope: !529, file: !229, line: 2509, type: !669, scopeLine: 2509, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!421, !9}
!671 = !{!672, !673}
!672 = !DILocalVariable(name: "len", arg: 1, scope: !668, file: !229, line: 2509, type: !9)
!673 = !DILocalVariable(name: "max_len", scope: !674, file: !229, line: 2510, type: !9, align: 8)
!674 = distinct !DILexicalBlock(scope: !668, file: !229, line: 2510, column: 5)
!675 = !DILocation(line: 2509, column: 43, scope: !668)
!676 = !DILocation(line: 2510, column: 19, scope: !668)
!677 = !DILocation(line: 2510, column: 9, scope: !674)
!678 = !DILocation(line: 2514, column: 5, scope: !674)
!679 = !DILocation(line: 2515, column: 2, scope: !668)
!680 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17h6835612ca7c29911E", scope: !529, file: !229, line: 2710, type: !609, scopeLine: 2710, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !681)
!681 = !{!682, !683, !684}
!682 = !DILocalVariable(name: "src", arg: 1, scope: !680, file: !229, line: 2710, type: !611)
!683 = !DILocalVariable(name: "dst", arg: 2, scope: !680, file: !229, line: 2710, type: !612)
!684 = !DILocalVariable(name: "count", arg: 3, scope: !680, file: !229, line: 2710, type: !9)
!685 = !DILocation(line: 2710, column: 29, scope: !680)
!686 = !DILocation(line: 2710, column: 44, scope: !680)
!687 = !DILocation(line: 2710, column: 57, scope: !680)
!688 = !DILocation(line: 2719, column: 9, scope: !680)
!689 = !DILocation(line: 2724, column: 9, scope: !680)
!690 = !DILocation(line: 2726, column: 2, scope: !680)
!691 = !DILocalVariable(name: "src", arg: 1, scope: !692, file: !229, line: 2484, type: !611)
!692 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17h400269ee81791563E", scope: !693, file: !229, line: 2484, type: !694, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !485, retainedNodes: !696)
!693 = !DINamespace(name: "copy", scope: !529)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !611, !612}
!696 = !{!691, !697}
!697 = !DILocalVariable(name: "dst", arg: 2, scope: !692, file: !229, line: 2484, type: !612)
!698 = !DILocation(line: 2484, column: 39, scope: !692, inlinedAt: !699)
!699 = distinct !DILocation(line: 2719, column: 9, scope: !680)
!700 = !DILocation(line: 2722, column: 13, scope: !692, inlinedAt: !699)
!701 = !DILocation(line: 2722, column: 45, scope: !692, inlinedAt: !699)
!702 = !DILocation(line: 2485, column: 20, scope: !692, inlinedAt: !699)
!703 = !DILocation(line: 2487, column: 21, scope: !692, inlinedAt: !699)
!704 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17hde30679fb0cb8f2eE", scope: !529, file: !229, line: 2710, type: !583, scopeLine: 2710, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !705)
!705 = !{!706, !707, !708}
!706 = !DILocalVariable(name: "src", arg: 1, scope: !704, file: !229, line: 2710, type: !208)
!707 = !DILocalVariable(name: "dst", arg: 2, scope: !704, file: !229, line: 2710, type: !272)
!708 = !DILocalVariable(name: "count", arg: 3, scope: !704, file: !229, line: 2710, type: !9)
!709 = !DILocation(line: 2710, column: 29, scope: !704)
!710 = !DILocation(line: 2710, column: 44, scope: !704)
!711 = !DILocation(line: 2710, column: 57, scope: !704)
!712 = !DILocation(line: 2719, column: 9, scope: !704)
!713 = !DILocation(line: 2724, column: 9, scope: !704)
!714 = !DILocation(line: 2726, column: 2, scope: !704)
!715 = !DILocalVariable(name: "src", arg: 1, scope: !716, file: !229, line: 2484, type: !208)
!716 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17hbe7485e94375aad4E", scope: !693, file: !229, line: 2484, type: !717, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !208, !272}
!719 = !{!715, !720}
!720 = !DILocalVariable(name: "dst", arg: 2, scope: !716, file: !229, line: 2484, type: !272)
!721 = !DILocation(line: 2484, column: 39, scope: !716, inlinedAt: !722)
!722 = distinct !DILocation(line: 2719, column: 9, scope: !704)
!723 = !DILocation(line: 2722, column: 13, scope: !716, inlinedAt: !722)
!724 = !DILocation(line: 2722, column: 45, scope: !716, inlinedAt: !722)
!725 = !DILocation(line: 2485, column: 20, scope: !716, inlinedAt: !722)
!726 = !DILocation(line: 2487, column: 21, scope: !716, inlinedAt: !722)
!727 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17ha720db96ca76e537E", scope: !729, file: !728, line: 1415, type: !731, scopeLine: 1415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !733)
!728 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "1600eb58139fc5bc9fc1d10b55c4e0c1")
!729 = !DINamespace(name: "{impl#63}", scope: !730)
!730 = !DINamespace(name: "impls", scope: !150)
!731 = !DISubroutineType(types: !732)
!732 = !{!149, !132, !132}
!733 = !{!734, !735}
!734 = !DILocalVariable(name: "self", arg: 1, scope: !727, file: !728, line: 1415, type: !132)
!735 = !DILocalVariable(name: "other", arg: 2, scope: !727, file: !728, line: 1415, type: !132)
!736 = !DILocation(line: 1415, column: 24, scope: !727)
!737 = !DILocation(line: 1415, column: 31, scope: !727)
!738 = !DILocation(line: 1418, column: 24, scope: !727)
!739 = !DILocation(line: 1418, column: 32, scope: !727)
!740 = !DILocation(line: 1419, column: 29, scope: !727)
!741 = !DILocation(line: 1419, column: 38, scope: !727)
!742 = !DILocation(line: 1418, column: 41, scope: !727)
!743 = !DILocation(line: 1418, column: 21, scope: !727)
!744 = !DILocation(line: 1421, column: 18, scope: !727)
!745 = !{i8 -1, i8 2}
!746 = !DILocation(line: 1420, column: 28, scope: !727)
!747 = !DILocation(line: 1419, column: 26, scope: !727)
!748 = !DILocation(line: 1419, column: 47, scope: !727)
!749 = distinct !DISubprogram(name: "new_lower_hex<u64>", linkageName: "_ZN4core3fmt10ArgumentV113new_lower_hex17hc064ddddc92919cbE", scope: !750, file: !447, line: 329, type: !760, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !764, retainedNodes: !762)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !142, file: !2, size: 128, align: 64, elements: !751, templateParams: !24, identifier: "3c2ef6ebf262caba6e43777d9c298823")
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !750, file: !2, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !754, size: 64, align: 64, dwarfAddressSpace: 0)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !755, file: !2, align: 8, elements: !24, identifier: "43185ab61ba6b0b799bd1bef1620bc0b")
!755 = !DINamespace(name: "{extern#0}", scope: !142)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !750, file: !2, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !758, size: 64, align: 64, dwarfAddressSpace: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!451, !753, !470}
!760 = !DISubroutineType(types: !761)
!761 = !{!750, !132}
!762 = !{!763}
!763 = !DILocalVariable(name: "x", arg: 1, scope: !749, file: !447, line: 329, type: !132)
!764 = !{!765}
!765 = !DITemplateTypeParameter(name: "T", type: !22)
!766 = !DILocation(line: 329, column: 30, scope: !749)
!767 = !DILocation(line: 330, column: 13, scope: !749)
!768 = !DILocation(line: 331, column: 10, scope: !749)
!769 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hea2ff610b2a3984aE", scope: !771, file: !770, line: 185, type: !773, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !775)
!770 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!771 = !DINamespace(name: "{impl#86}", scope: !772)
!772 = !DINamespace(name: "num", scope: !142)
!773 = !DISubroutineType(types: !774)
!774 = !{!451, !85, !470}
!775 = !{!776, !777}
!776 = !DILocalVariable(name: "self", arg: 1, scope: !769, file: !770, line: 185, type: !85)
!777 = !DILocalVariable(name: "f", arg: 2, scope: !769, file: !770, line: 185, type: !470)
!778 = !DILocation(line: 185, column: 20, scope: !769)
!779 = !DILocation(line: 185, column: 27, scope: !769)
!780 = !DILocation(line: 186, column: 20, scope: !769)
!781 = !DILocation(line: 188, column: 27, scope: !769)
!782 = !DILocation(line: 187, column: 21, scope: !769)
!783 = !DILocation(line: 193, column: 14, scope: !769)
!784 = !DILocation(line: 191, column: 21, scope: !769)
!785 = !DILocation(line: 189, column: 21, scope: !769)
!786 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17h1603b60bba44f0f1E", scope: !787, file: !770, line: 185, type: !788, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !790)
!787 = !DINamespace(name: "{impl#87}", scope: !772)
!788 = !DISubroutineType(types: !789)
!789 = !{!451, !132, !470}
!790 = !{!791, !792}
!791 = !DILocalVariable(name: "self", arg: 1, scope: !786, file: !770, line: 185, type: !132)
!792 = !DILocalVariable(name: "f", arg: 2, scope: !786, file: !770, line: 185, type: !470)
!793 = !DILocation(line: 185, column: 20, scope: !786)
!794 = !DILocation(line: 185, column: 27, scope: !786)
!795 = !DILocation(line: 186, column: 20, scope: !786)
!796 = !DILocation(line: 188, column: 27, scope: !786)
!797 = !DILocation(line: 187, column: 21, scope: !786)
!798 = !DILocation(line: 193, column: 14, scope: !786)
!799 = !DILocation(line: 191, column: 21, scope: !786)
!800 = !DILocation(line: 189, column: 21, scope: !786)
!801 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hf04f1b1141114cdfE", scope: !803, file: !802, line: 627, type: !812, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !836, retainedNodes: !829)
!802 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a909d1cde985fb0d953605fd1b0e0e2")
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !804, file: !2, size: 128, align: 64, elements: !805, templateParams: !24, identifier: "9ea564596e2c9e1b661a8626c1eb3eed")
!804 = !DINamespace(name: "builders", scope: !142)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !803, file: !2, baseType: !807, size: 128, align: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !804, file: !2, size: 128, align: 64, elements: !808, templateParams: !24, identifier: "834020fb28782bbe6224c9026860e130")
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !807, file: !2, baseType: !470, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !807, file: !2, baseType: !451, size: 8, align: 8, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !807, file: !2, baseType: !421, size: 8, align: 8, offset: 72)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !814, !815}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !803, size: 64, align: 64, dwarfAddressSpace: 0)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !816, file: !2, size: 128, align: 64, elements: !817, templateParams: !190, identifier: "d091305b1f737eecefc97f2e7715e83f")
!816 = !DINamespace(name: "iter", scope: !167)
!817 = !{!818, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !815, file: !2, baseType: !819, size: 64, align: 64, offset: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !820, file: !2, size: 64, align: 64, elements: !821, templateParams: !190, identifier: "8bb01a0a505b0921a61be7b08dd284db")
!820 = !DINamespace(name: "non_null", scope: !205)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !819, file: !2, baseType: !208, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !815, file: !2, baseType: !208, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !815, file: !2, baseType: !825, align: 8)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !826, file: !2, align: 8, elements: !24, templateParams: !827, identifier: "274c3e5ee5790d51d9cb9828a999008e")
!826 = !DINamespace(name: "marker", scope: !143)
!827 = !{!828}
!828 = !DITemplateTypeParameter(name: "T", type: !12)
!829 = !{!830, !831, !832, !834}
!830 = !DILocalVariable(name: "self", arg: 1, scope: !801, file: !802, line: 627, type: !814)
!831 = !DILocalVariable(name: "entries", arg: 2, scope: !801, file: !802, line: 627, type: !815)
!832 = !DILocalVariable(name: "iter", scope: !833, file: !802, line: 632, type: !815, align: 8)
!833 = distinct !DILexicalBlock(scope: !801, file: !802, line: 632, column: 9)
!834 = !DILocalVariable(name: "entry", scope: !835, file: !802, line: 632, type: !12, align: 8)
!835 = distinct !DILexicalBlock(scope: !833, file: !802, line: 632, column: 30)
!836 = !{!837, !838}
!837 = !DITemplateTypeParameter(name: "D", type: !12)
!838 = !DITemplateTypeParameter(name: "I", type: !815)
!839 = !DILocation(line: 627, column: 26, scope: !801)
!840 = !DILocation(line: 627, column: 37, scope: !801)
!841 = !DILocation(line: 632, column: 22, scope: !833)
!842 = !DILocation(line: 632, column: 13, scope: !835)
!843 = !DILocation(line: 632, column: 22, scope: !801)
!844 = !DILocation(line: 632, column: 9, scope: !833)
!845 = !DILocation(line: 636, column: 6, scope: !801)
!846 = !DILocation(line: 632, column: 13, scope: !833)
!847 = !DILocation(line: 633, column: 13, scope: !835)
!848 = !DILocation(line: 634, column: 9, scope: !833)
!849 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h96272abef9da8fc8E", scope: !850, file: !447, line: 443, type: !909, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !914)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !142, file: !2, size: 384, align: 64, elements: !851, templateParams: !24, identifier: "dc49042afee2f796a8fa4685389c4b18")
!851 = !{!852, !858, !903}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !850, file: !2, baseType: !853, size: 128, align: 64, offset: 128)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !854, templateParams: !24, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!854 = !{!855, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !853, file: !2, baseType: !856, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !853, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !850, file: !2, baseType: !859, size: 128, align: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !479, file: !2, size: 128, align: 64, elements: !860, templateParams: !24, identifier: "62d362416a1eb41bf984638792a73145")
!860 = !{!861}
!861 = !DICompositeType(tag: DW_TAG_variant_part, scope: !859, file: !2, size: 128, align: 64, elements: !862, templateParams: !24, identifier: "51527d667cbd19b863d93073f3cc474", discriminator: !902)
!862 = !{!863, !898}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !861, file: !2, baseType: !864, size: 128, align: 64, extraData: i64 0)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !859, file: !2, size: 128, align: 64, elements: !24, templateParams: !865, identifier: "66a59c7143972a6588bd1a9c8246e60f")
!865 = !{!866}
!866 = !DITemplateTypeParameter(name: "T", type: !867)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !868, templateParams: !24, identifier: "66b60dbaad43783577fb935928e2ac56")
!868 = !{!869, !897}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !867, file: !2, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64, dwarfAddressSpace: 0)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !140, file: !2, size: 448, align: 64, elements: !872, templateParams: !24, identifier: "1b0f53c51c2a0850dc27a4ea7530e9b2")
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !871, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !871, file: !2, baseType: !875, size: 384, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !140, file: !2, size: 384, align: 64, elements: !876, templateParams: !24, identifier: "4ceb8823bbeb709d93b7ffb6ddd40132")
!876 = !{!877, !878, !879, !880, !896}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !875, file: !2, baseType: !475, size: 32, align: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !875, file: !2, baseType: !139, size: 8, align: 8, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !2, baseType: !27, size: 32, align: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !875, file: !2, baseType: !881, size: 128, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !140, file: !2, size: 128, align: 64, elements: !882, templateParams: !24, identifier: "beb49147a723c973b15fc19c2245c821")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_variant_part, scope: !881, file: !2, size: 128, align: 64, elements: !884, templateParams: !24, identifier: "c9db73f716fc865c39b9a87ace47fe10", discriminator: !895)
!884 = !{!885, !889, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !883, file: !2, baseType: !886, size: 128, align: 64, extraData: i64 0)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !881, file: !2, size: 128, align: 64, elements: !887, templateParams: !24, identifier: "db0b97f002b1fae3dbc4ebdd853ff355")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !886, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !883, file: !2, baseType: !890, size: 128, align: 64, extraData: i64 1)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !881, file: !2, size: 128, align: 64, elements: !891, templateParams: !24, identifier: "49d2632f301eeedc951f3431bb382902")
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !890, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !883, file: !2, baseType: !894, size: 128, align: 64, extraData: i64 2)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !881, file: !2, size: 128, align: 64, elements: !24, identifier: "afc023622f1fd60e7b29fd0e4f997a04")
!895 = !DIDerivedType(tag: DW_TAG_member, scope: !881, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !875, file: !2, baseType: !881, size: 128, align: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !867, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !861, file: !2, baseType: !899, size: 128, align: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !859, file: !2, size: 128, align: 64, elements: !900, templateParams: !865, identifier: "45eaeac90b0c2cad515177aa4ad012c0")
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !899, file: !2, baseType: !867, size: 128, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, scope: !859, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !850, file: !2, baseType: !904, size: 128, align: 64, offset: 256)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !905, templateParams: !24, identifier: "83fd9dd078f03ba333a6c21d9c3331b7")
!905 = !{!906, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !904, file: !2, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64, dwarfAddressSpace: 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !904, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!850, !853, !904, !867, !911}
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !142, file: !2, align: 8, elements: !912, templateParams: !24, identifier: "4faa2d0373bebf10eea7ffc10aef50")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !911, file: !2, baseType: !7, align: 8)
!914 = !{!915, !916, !917, !918, !919}
!915 = !DILocalVariable(name: "pieces", arg: 1, scope: !849, file: !447, line: 444, type: !853)
!916 = !DILocalVariable(name: "args", arg: 2, scope: !849, file: !447, line: 445, type: !904)
!917 = !DILocalVariable(name: "fmt", arg: 3, scope: !849, file: !447, line: 446, type: !867)
!918 = !DILocalVariable(name: "_unsafe_arg", scope: !849, file: !447, line: 447, type: !911, align: 1)
!919 = !DILocalVariable(arg: 4, scope: !849, file: !447, line: 447, type: !911)
!920 = !DILocation(line: 447, column: 9, scope: !849)
!921 = !DILocation(line: 444, column: 9, scope: !849)
!922 = !DILocation(line: 445, column: 9, scope: !849)
!923 = !DILocation(line: 446, column: 9, scope: !849)
!924 = !DILocation(line: 449, column: 34, scope: !849)
!925 = !DILocation(line: 449, column: 9, scope: !849)
!926 = !DILocation(line: 450, column: 6, scope: !849)
!927 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hc8c49b7ed491bfe8E", scope: !850, file: !447, line: 412, type: !928, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!850, !853, !904}
!930 = !{!931, !932}
!931 = !DILocalVariable(name: "pieces", arg: 1, scope: !927, file: !447, line: 412, type: !853)
!932 = !DILocalVariable(name: "args", arg: 2, scope: !927, file: !447, line: 412, type: !904)
!933 = !DILocation(line: 412, column: 19, scope: !927)
!934 = !DILocation(line: 412, column: 47, scope: !927)
!935 = !DILocation(line: 413, column: 12, scope: !927)
!936 = !DILocation(line: 413, column: 56, scope: !927)
!937 = !DILocation(line: 413, column: 41, scope: !927)
!938 = !DILocation(line: 416, column: 34, scope: !927)
!939 = !DILocation(line: 416, column: 9, scope: !927)
!940 = !DILocation(line: 417, column: 6, scope: !927)
!941 = !DILocation(line: 414, column: 13, scope: !927)
!942 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h7d88afe42d22638bE", scope: !850, file: !447, line: 399, type: !943, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !945)
!943 = !DISubroutineType(types: !944)
!944 = !{!850, !853}
!945 = !{!946}
!946 = !DILocalVariable(name: "pieces", arg: 1, scope: !942, file: !447, line: 399, type: !853)
!947 = !DILocation(line: 399, column: 28, scope: !942)
!948 = !DILocation(line: 400, column: 12, scope: !942)
!949 = !DILocation(line: 403, column: 34, scope: !942)
!950 = !DILocation(line: 403, column: 9, scope: !942)
!951 = !DILocation(line: 404, column: 6, scope: !942)
!952 = !DILocation(line: 401, column: 13, scope: !942)
!953 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17h3fac42cd55c798b3E", scope: !641, file: !954, line: 763, type: !955, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !651, retainedNodes: !958)
!954 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d20d11efdf2289b0b0de68a76bdca89c")
!955 = !DISubroutineType(types: !956)
!956 = !{null, !957, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !639, size: 64, align: 64, dwarfAddressSpace: 0)
!958 = !{!959, !960, !961, !963}
!959 = !DILocalVariable(name: "x", arg: 1, scope: !953, file: !954, line: 763, type: !957)
!960 = !DILocalVariable(name: "y", arg: 2, scope: !953, file: !954, line: 763, type: !957)
!961 = !DILocalVariable(name: "a", scope: !962, file: !954, line: 780, type: !639, align: 8)
!962 = distinct !DILexicalBlock(scope: !953, file: !954, line: 780, column: 9)
!963 = !DILocalVariable(name: "b", scope: !964, file: !954, line: 781, type: !639, align: 8)
!964 = distinct !DILexicalBlock(scope: !962, file: !954, line: 781, column: 9)
!965 = !DILocation(line: 763, column: 36, scope: !953)
!966 = !DILocation(line: 763, column: 47, scope: !953)
!967 = !DILocation(line: 780, column: 13, scope: !962)
!968 = !DILocation(line: 781, column: 13, scope: !964)
!969 = !DILocation(line: 780, column: 17, scope: !953)
!970 = !DILocation(line: 781, column: 17, scope: !962)
!971 = !DILocation(line: 782, column: 23, scope: !964)
!972 = !DILocation(line: 782, column: 9, scope: !964)
!973 = !DILocation(line: 783, column: 23, scope: !964)
!974 = !DILocation(line: 783, column: 9, scope: !964)
!975 = !DILocation(line: 785, column: 2, scope: !953)
!976 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17h59cb8439350ba3caE", scope: !641, file: !954, line: 763, type: !977, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !980)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !979, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!980 = !{!981, !982, !983, !985}
!981 = !DILocalVariable(name: "x", arg: 1, scope: !976, file: !954, line: 763, type: !979)
!982 = !DILocalVariable(name: "y", arg: 2, scope: !976, file: !954, line: 763, type: !979)
!983 = !DILocalVariable(name: "a", scope: !984, file: !954, line: 780, type: !13, align: 8)
!984 = distinct !DILexicalBlock(scope: !976, file: !954, line: 780, column: 9)
!985 = !DILocalVariable(name: "b", scope: !986, file: !954, line: 781, type: !13, align: 8)
!986 = distinct !DILexicalBlock(scope: !984, file: !954, line: 781, column: 9)
!987 = !DILocation(line: 763, column: 36, scope: !976)
!988 = !DILocation(line: 763, column: 47, scope: !976)
!989 = !DILocation(line: 780, column: 13, scope: !984)
!990 = !DILocation(line: 781, column: 13, scope: !986)
!991 = !DILocation(line: 780, column: 17, scope: !976)
!992 = !DILocation(line: 781, column: 17, scope: !984)
!993 = !DILocation(line: 782, column: 23, scope: !986)
!994 = !DILocation(line: 782, column: 9, scope: !986)
!995 = !DILocation(line: 783, column: 23, scope: !986)
!996 = !DILocation(line: 783, column: 9, scope: !986)
!997 = !DILocation(line: 785, column: 2, scope: !976)
!998 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17h1e8e662fc708a4c7E", scope: !641, file: !954, line: 726, type: !977, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !999)
!999 = !{!1000, !1001}
!1000 = !DILocalVariable(name: "x", arg: 1, scope: !998, file: !954, line: 726, type: !979)
!1001 = !DILocalVariable(name: "y", arg: 2, scope: !998, file: !954, line: 726, type: !979)
!1002 = !DILocation(line: 726, column: 22, scope: !998)
!1003 = !DILocation(line: 726, column: 33, scope: !998)
!1004 = !DILocation(line: 741, column: 12, scope: !998)
!1005 = !DILocation(line: 755, column: 5, scope: !998)
!1006 = !DILocation(line: 744, column: 29, scope: !998)
!1007 = !DILocation(line: 756, column: 2, scope: !998)
!1008 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17hf1997bd7a4ba0664E", scope: !641, file: !954, line: 148, type: !1009, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !13}
!1011 = !{!1012}
!1012 = !DILocalVariable(name: "t", arg: 1, scope: !1008, file: !954, line: 148, type: !13)
!1013 = !DILocation(line: 148, column: 24, scope: !1008)
!1014 = !DILocalVariable(name: "value", arg: 1, scope: !1015, file: !1016, line: 70, type: !13)
!1015 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17hc3f0bc4df6bde2ecE", scope: !645, file: !1016, line: 70, type: !1017, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !190, retainedNodes: !1019)
!1016 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!645, !13}
!1019 = !{!1014}
!1020 = !DILocation(line: 70, column: 22, scope: !1015, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 149, column: 13, scope: !1008)
!1022 = !DILocation(line: 71, column: 9, scope: !1015, inlinedAt: !1021)
!1023 = !DILocation(line: 150, column: 2, scope: !1008)
!1024 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h189dca2a0ce59f54E", scope: !1026, file: !1025, line: 576, type: !1028, scopeLine: 576, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !136, templateParams: !24, retainedNodes: !1030)
!1025 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "b2a733f80e3cd43066f918bdafc87bd0")
!1026 = !DINamespace(name: "{impl#11}", scope: !1027)
!1027 = !DINamespace(name: "num", scope: !143)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!478, !9, !9}
!1030 = !{!1031, !1032, !1033, !1035}
!1031 = !DILocalVariable(name: "self", arg: 1, scope: !1024, file: !1025, line: 576, type: !9)
!1032 = !DILocalVariable(name: "rhs", arg: 2, scope: !1024, file: !1025, line: 576, type: !9)
!1033 = !DILocalVariable(name: "a", scope: !1034, file: !1025, line: 577, type: !9, align: 8)
!1034 = distinct !DILexicalBlock(scope: !1024, file: !1025, line: 577, column: 13)
!1035 = !DILocalVariable(name: "b", scope: !1034, file: !1025, line: 577, type: !421, align: 1)
!1036 = !DILocation(line: 576, column: 34, scope: !1024)
!1037 = !DILocation(line: 576, column: 40, scope: !1024)
!1038 = !DILocalVariable(name: "self", arg: 1, scope: !1039, file: !1025, line: 1702, type: !9)
