; ModuleID = 'ukbqg5yo5cpsfm0'
source_filename = "ukbqg5yo5cpsfm0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17hcbddfc66485da5c3E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "cpu_interrupts/src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "5addfbf8ddfedac2fa67679ba8b42414")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "3e619f417e43c278e551ee13a6329ec2")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "e8e6fd14c05d6372e32fbf892241a961")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "ff4463b66f44ad752b5220d611f621e7")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "52427f54eaec5c40c63e6292edfa119f")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "9bc61996c48b34f8fbc757ecb83e5380")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "4896df4686748c80bcf8d7fb9479d37a")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "999576729e999239dbfd19559932a0aa")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "f10a2d09ccfd9ffcec8f8b56872817ad")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "628eeb09b80e9f506ef8662dcea068b7")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "c0ed5bf87f876cac190880f60ba37157")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "2748a5b798dda49c55e70073ce5cc5b6")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "27689c12ac5a4b3d11e0c7c085c94514")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h3194530a621b3f51E", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "a605d2931f3ccf9ddee8e4fc47be06b4")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17hf8b3521ed710522fE", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "cpu_interrupts/src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "b51888289469cc9b519f55727db7f0f1")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "bf86a2facc80b124d48bb4a1c23c4edc")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h20ad8846b57ebeacE", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h5e8166aadd8e1cfeE", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "10c602754e2155e6da75a8c4f472856")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "f422f88e738bcdf7f1cc8d54d667a2a")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "bc29413ac92bd4d5368e07244b51db87")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "e476c5763eb9a9e7aa18b139ff514fa8")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "466313cd76b85cd6f8c5d9d7ee3a674e")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "4beae6021574b2c6ceeaa4ebff290276")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "1f66deb8a881d6d5a085e4754d734739", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "ed3b2cb225d217a68c5e7bf9bce92f49")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "614669be0ef223284ff0d796bec21864")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "1353a19bd08e370f1a1e3dbe1ebe911d")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "1d647c019db7d403dd4ee37dba74dd91")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "35f8cf6006e3d2c5fda6afb5c493e491")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "55d0938edaf4e5b352b5db3968a166ea")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !190, templateParams: !18, identifier: "d37c2ce024f90fdb27770b6a34dbdd80")
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !191, file: !6, size: 32768, align: 128, elements: !192, templateParams: !18, identifier: "3df45e4e99457e3f11f3eb748cf3b9e")
!191 = !DINamespace(name: "idt", scope: !92)
!192 = !{!193, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !269, !270, !271, !272, !293, !294, !295, !296, !314, !315, !316, !318, !319, !320, !321}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !190, file: !6, baseType: !194, size: 128, align: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !191, file: !6, size: 128, align: 32, elements: !195, templateParams: !222, identifier: "f1ada7143814528fbaa2c07c89365e8c")
!195 = !{!196, !197, !198, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !194, file: !6, baseType: !55, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !191, file: !6, size: 16, align: 16, elements: !200, templateParams: !18, identifier: "b880f84bdd4d142d770cee8eb9332849")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !6, baseType: !55, size: 16, align: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !194, file: !6, baseType: !206, align: 8, offset: 128)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !207, identifier: "761bb9c8026dc9a4673026307cf75013")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !191, file: !6, size: 320, align: 64, elements: !213, templateParams: !18, identifier: "3fc24781a9c074c1d8dd9b4507bb754f")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !6, baseType: !215, size: 320, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !191, file: !6, size: 320, align: 64, elements: !216, templateParams: !18, identifier: "f28980447529b5c9a88e02c26eaa75b8")
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "F", type: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !190, file: !6, baseType: !232, size: 128, align: 32, offset: 1024)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !233, templateParams: !248, identifier: "fd64c03e4708932af3d17da4e7a56e41")
!233 = !{!234, !235, !236, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !232, file: !6, baseType: !55, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !232, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !6, baseType: !241, align: 8, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !242, identifier: "91600a0425e4aeab96af9f1c5ff1b8e4")
!242 = !{!243}
!243 = !DITemplateTypeParameter(name: "T", type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !212, !102}
!247 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "F", type: !244)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1280)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !191, file: !6, size: 128, align: 32, elements: !253, templateParams: !267, identifier: "60749c8fc2d8168b51844ce5d44b85a2")
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !252, file: !6, baseType: !55, size: 16, align: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !252, file: !6, baseType: !261, align: 8, offset: 128)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !262, identifier: "61a6a7c635409d023503aeb5cf445013")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !102}
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "F", type: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !190, file: !6, baseType: !273, size: 128, align: 32, offset: 1792)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !191, file: !6, size: 128, align: 32, elements: !274, templateParams: !291, identifier: "c6501d5c288ccdcf1b14f8cd559704c1")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !273, file: !6, baseType: !55, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !273, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !273, file: !6, baseType: !282, align: 8, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !283, identifier: "453bedebcc8ffb349eebeb6ce498deb8")
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !212, !288}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !191, file: !6, size: 64, align: 64, elements: !289, templateParams: !18, identifier: "5ed47681bfbf7b19dde04feac6197688")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !288, file: !6, baseType: !102, size: 64, align: 64)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "F", type: !285)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !190, file: !6, baseType: !297, size: 128, align: 32, offset: 2304)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !298, templateParams: !312, identifier: "d150a8103a8c2147ef1bf36a36b70c2")
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !297, file: !6, baseType: !55, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !297, file: !6, baseType: !306, align: 8, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !307, identifier: "856f5befa85be1f2859f2b1fa4574b23")
!307 = !{!308}
!308 = !DITemplateTypeParameter(name: "T", type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DISubroutineType(types: !311)
!311 = !{!247, !212}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "F", type: !309)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !190, file: !6, baseType: !317, size: 1024, align: 32, offset: 2688)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 32, elements: !161)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3712)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 3968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !190, file: !6, baseType: !322, size: 28672, align: 32, offset: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 28672, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 224, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !18, identifier: "6318429a201933c5e68ddd43e27758f9")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !6, baseType: !186, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!333 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !18, identifier: "ad70fc0c43e030e5d43761e6004d09fe")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !6, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.71.0-nightly (5ea3f0ae0 2023-05-23))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !370, splitDebugInlining: false)
!347 = !DIFile(filename: "cpu_interrupts/src/lib.rs/@/ukbqg5yo5cpsfm0", directory: "/Users/yaw/self/theo")
!348 = !{!349, !357, !364}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !352)
!350 = !DINamespace(name: "rt", scope: !351)
!351 = !DINamespace(name: "fmt", scope: !17)
!352 = !{!353, !354, !355, !356}
!353 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!362 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!363 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!367 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!370 = !{!0, !77, !84, !113, !118, !181, !325, !334}
!371 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h5845ab4b83826ba7E", scope: !373, file: !372, line: 2299, type: !374, scopeLine: 2299, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !423)
!372 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a732c99c57cb2d76a548fb6f43c5e00")
!373 = !DINamespace(name: "{impl#12}", scope: !351)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !342, !394}
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !377, file: !6, size: 8, align: 8, elements: !378, templateParams: !18, identifier: "22c75a34514fa785fe8d5e5737b404a")
!377 = !DINamespace(name: "result", scope: !17)
!378 = !{!379}
!379 = !DICompositeType(tag: DW_TAG_variant_part, scope: !376, file: !6, size: 8, align: 8, elements: !380, templateParams: !18, identifier: "318b8b14c370a5a4f50890e5a30a4497", discriminator: !393)
!380 = !{!381, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !379, file: !6, baseType: !382, size: 8, align: 8, extraData: i64 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !376, file: !6, size: 8, align: 8, elements: !383, templateParams: !385, identifier: "5b323728d71ad8b54f91e8647fb6c225")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !6, baseType: !67, align: 8, offset: 8)
!385 = !{!386, !387}
!386 = !DITemplateTypeParameter(name: "T", type: !67)
!387 = !DITemplateTypeParameter(name: "E", type: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !351, file: !6, align: 8, elements: !18, identifier: "fc30e04e843f09017d3a1f431d2f6e0c")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !379, file: !6, baseType: !390, size: 8, align: 8, extraData: i64 1)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !376, file: !6, size: 8, align: 8, elements: !391, templateParams: !385, identifier: "a4826728ee7be77ec8568eb24e01c72")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !6, baseType: !388, align: 8, offset: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !351, file: !6, size: 512, align: 64, elements: !396, templateParams: !18, identifier: "a84a5bdbf0499ca1d68196c4b862c039")
!396 = !{!397, !398, !400, !401, !413, !414}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !395, file: !6, baseType: !95, size: 32, align: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !395, file: !6, baseType: !399, size: 32, align: 32, offset: 384)
!399 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !395, file: !6, baseType: !349, size: 8, align: 8, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !395, file: !6, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !403, templateParams: !18, identifier: "9ff7c8d78ada7de0ac9d763d1c46855f")
!403 = !{!404}
!404 = !DICompositeType(tag: DW_TAG_variant_part, scope: !402, file: !6, size: 128, align: 64, elements: !405, templateParams: !18, identifier: "4121c4c375fd14965cbbd4a52ee80751", discriminator: !412)
!405 = !{!406, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !404, file: !6, baseType: !407, size: 128, align: 64, extraData: i64 0)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !402, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "2820df4bdcb3911085cbffae781ae71")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !404, file: !6, baseType: !409, size: 128, align: 64, extraData: i64 1)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !402, file: !6, size: 128, align: 64, elements: !410, templateParams: !138, identifier: "3de76324e4613a017cfb22686952e8ce")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !395, file: !6, baseType: !402, size: 128, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !395, file: !6, baseType: !415, size: 128, align: 64, offset: 256)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !416, templateParams: !18, identifier: "841e47680ccca04665b2034bf5815694")
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !415, file: !6, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64, dwarfAddressSpace: 0)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "d63695003f7c60186849daf2e0ab45a2")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !415, file: !6, baseType: !421, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !422, size: 64, align: 64, dwarfAddressSpace: 0)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!423 = !{!424, !425}
!424 = !DILocalVariable(name: "self", arg: 1, scope: !371, file: !372, line: 2299, type: !342)
!425 = !DILocalVariable(name: "f", arg: 2, scope: !371, file: !372, line: 2299, type: !394)
!426 = !DILocation(line: 2299, column: 12, scope: !371)
!427 = !DILocation(line: 2299, column: 19, scope: !371)
!428 = !DILocation(line: 2300, column: 9, scope: !371)
!429 = !DILocation(line: 2301, column: 6, scope: !371)
!430 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17hed35257bc25815aeE", scope: !432, file: !431, line: 237, type: !434, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !437)
!431 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!432 = !DINamespace(name: "{impl#2}", scope: !433)
!433 = !DINamespace(name: "bit_field", scope: null)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !436, !137, !333}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !{!438, !439, !440}
!438 = !DILocalVariable(name: "self", arg: 1, scope: !430, file: !431, line: 237, type: !436)
!439 = !DILocalVariable(name: "bit", arg: 2, scope: !430, file: !431, line: 237, type: !137)
!440 = !DILocalVariable(name: "value", arg: 3, scope: !430, file: !431, line: 237, type: !333)
!441 = !DILocation(line: 237, column: 24, scope: !430)
!442 = !DILocation(line: 237, column: 35, scope: !430)
!443 = !DILocation(line: 237, column: 47, scope: !430)
!444 = !DILocation(line: 238, column: 25, scope: !430)
!445 = !DILocation(line: 238, column: 17, scope: !430)
!446 = !DILocation(line: 240, column: 20, scope: !430)
!447 = !DILocation(line: 243, column: 31, scope: !430)
!448 = !DILocation(line: 241, column: 30, scope: !430)
!449 = !DILocation(line: 241, column: 21, scope: !430)
!450 = !DILocation(line: 240, column: 17, scope: !430)
!451 = !DILocation(line: 247, column: 14, scope: !430)
!452 = !DILocation(line: 243, column: 30, scope: !430)
!453 = !DILocation(line: 243, column: 21, scope: !430)
!454 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17ha7aa460ecf3ef465E", scope: !432, file: !431, line: 250, type: !455, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !473, retainedNodes: !465)
!455 = !DISubroutineType(types: !456)
!456 = !{!436, !436, !457, !55}
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !458, file: !6, size: 128, align: 64, elements: !460, templateParams: !463, identifier: "1f8bc2272e64a96da1c0d704b5981322")
!458 = !DINamespace(name: "range", scope: !459)
!459 = !DINamespace(name: "ops", scope: !17)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !457, file: !6, baseType: !137, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !457, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!463 = !{!464}
!464 = !DITemplateTypeParameter(name: "Idx", type: !137)
!465 = !{!466, !467, !468, !469, !471}
!466 = !DILocalVariable(name: "self", arg: 1, scope: !454, file: !431, line: 250, type: !436)
!467 = !DILocalVariable(name: "range", arg: 2, scope: !454, file: !431, line: 250, type: !457)
!468 = !DILocalVariable(name: "value", arg: 3, scope: !454, file: !431, line: 250, type: !55)
!469 = !DILocalVariable(name: "range", scope: !470, file: !431, line: 251, type: !457, align: 8)
!470 = distinct !DILexicalBlock(scope: !454, file: !431, line: 251, column: 17)
!471 = !DILocalVariable(name: "bitmask", scope: !472, file: !431, line: 260, type: !55, align: 2)
!472 = distinct !DILexicalBlock(scope: !470, file: !431, line: 260, column: 17)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !457)
!475 = !DILocation(line: 250, column: 48, scope: !454)
!476 = !DILocation(line: 250, column: 59, scope: !454)
!477 = !DILocation(line: 250, column: 69, scope: !454)
!478 = !DILocation(line: 251, column: 29, scope: !454)
!479 = !DILocation(line: 251, column: 21, scope: !470)
!480 = !DILocation(line: 253, column: 25, scope: !470)
!481 = !DILocation(line: 253, column: 17, scope: !470)
!482 = !DILocation(line: 254, column: 25, scope: !470)
!483 = !DILocation(line: 254, column: 17, scope: !470)
!484 = !DILocation(line: 255, column: 25, scope: !470)
!485 = !DILocation(line: 255, column: 17, scope: !470)
!486 = !DILocation(line: 256, column: 54, scope: !470)
!487 = !DILocation(line: 256, column: 34, scope: !470)
!488 = !DILocation(line: 256, column: 25, scope: !470)
!489 = !DILocation(line: 257, column: 45, scope: !470)
!490 = !DILocation(line: 257, column: 25, scope: !470)
!491 = !DILocation(line: 256, column: 17, scope: !470)
!492 = !DILocation(line: 260, column: 45, scope: !470)
!493 = !DILocation(line: 260, column: 39, scope: !470)
!494 = !DILocation(line: 261, column: 37, scope: !470)
!495 = !DILocation(line: 260, column: 38, scope: !470)
!496 = !DILocation(line: 260, column: 37, scope: !470)
!497 = !DILocation(line: 260, column: 21, scope: !472)
!498 = !DILocation(line: 265, column: 26, scope: !472)
!499 = !DILocation(line: 265, column: 25, scope: !472)
!500 = !DILocation(line: 265, column: 45, scope: !472)
!501 = !DILocation(line: 265, column: 17, scope: !472)
!502 = !DILocation(line: 268, column: 14, scope: !454)
!503 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h75ca53a18234dd2eE", scope: !504, file: !372, line: 322, type: !575, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !580, retainedNodes: !581)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !351, file: !6, size: 384, align: 64, elements: !505, templateParams: !18, identifier: "dec2eb544c6d114a1729e13a7474f40")
!505 = !{!506, !517, !559}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !504, file: !6, baseType: !507, size: 128, align: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !508, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!508 = !{!509, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !507, file: !6, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !512, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!512 = !{!513, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !511, file: !6, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !511, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !504, file: !6, baseType: !518, size: 128, align: 64, offset: 256)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !145, file: !6, size: 128, align: 64, elements: !519, templateParams: !18, identifier: "e23d17d3304655e6750a0ab2d9edac39")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_variant_part, scope: !518, file: !6, size: 128, align: 64, elements: !521, templateParams: !18, identifier: "bfd27e88b87b0ba5cd311f4e2a12036c", discriminator: !558)
!521 = !{!522, !554}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !520, file: !6, baseType: !523, size: 128, align: 64, extraData: i64 0)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !518, file: !6, size: 128, align: 64, elements: !18, templateParams: !524, identifier: "5aee93d5724874e8d5fc1e09008d60ef")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !6, size: 128, align: 64, elements: !527, templateParams: !18, identifier: "5c2bff1ce87945dcf46beabe124a8ecc")
!527 = !{!528, !553}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !526, file: !6, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !350, file: !6, size: 448, align: 64, elements: !531, templateParams: !18, identifier: "131f69b9dc640c7b405d0c75880ec09c")
!531 = !{!532, !533, !534, !535, !536, !552}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !530, file: !6, baseType: !137, size: 64, align: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !530, file: !6, baseType: !399, size: 32, align: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !530, file: !6, baseType: !349, size: 8, align: 8, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !6, baseType: !95, size: 32, align: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !530, file: !6, baseType: !537, size: 128, align: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !350, file: !6, size: 128, align: 64, elements: !538, templateParams: !18, identifier: "de49f2e711729c26a3183f82a67e820b")
!538 = !{!539}
!539 = !DICompositeType(tag: DW_TAG_variant_part, scope: !537, file: !6, size: 128, align: 64, elements: !540, templateParams: !18, identifier: "f8aee855d501562836c2bde1eded98b", discriminator: !551)
!540 = !{!541, !545, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !539, file: !6, baseType: !542, size: 128, align: 64, extraData: i64 0)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !537, file: !6, size: 128, align: 64, elements: !543, templateParams: !18, identifier: "ddb8199c8dc12775d50d3067915f0ee1")
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !542, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !539, file: !6, baseType: !546, size: 128, align: 64, extraData: i64 1)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !537, file: !6, size: 128, align: 64, elements: !547, templateParams: !18, identifier: "a474205d0b1ebc8668aca1dd185e6dd8")
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !546, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !539, file: !6, baseType: !550, size: 128, align: 64, extraData: i64 2)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !537, file: !6, size: 128, align: 64, elements: !18, identifier: "78259875ca0457d6d843b6907f3ee2cd")
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !530, file: !6, baseType: !537, size: 128, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !526, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !520, file: !6, baseType: !555, size: 128, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !518, file: !6, size: 128, align: 64, elements: !556, templateParams: !524, identifier: "651380f2d7c231ae75361478798df683")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !6, baseType: !526, size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !504, file: !6, baseType: !560, size: 128, align: 64, offset: 128)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !6, size: 128, align: 64, elements: !561, templateParams: !18, identifier: "7aaa4600b8b1bb5ceecb4befe265d8a8")
!561 = !{!562, !574}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !560, file: !6, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !350, file: !6, size: 128, align: 64, elements: !565, templateParams: !18, identifier: "1715f8ca39c24c1465154510b099d5db")
!565 = !{!566, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !564, file: !6, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !569, file: !6, align: 8, elements: !18, identifier: "b53b9c37284ad14843698905c0a781ef")
!569 = !DINamespace(name: "{extern#0}", scope: !350)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !564, file: !6, baseType: !571, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !572, size: 64, align: 64, dwarfAddressSpace: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!376, !567, !394}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !560, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!504, !507, !560, !526, !577}
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !350, file: !6, align: 8, elements: !578, templateParams: !18, identifier: "351ac13b590d5d24af48663f31ffb4eb")
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !577, file: !6, baseType: !67, align: 8)
!580 = !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h75ca53a18234dd2eE", scope: !504, file: !372, line: 322, type: !575, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DILocalVariable(name: "pieces", arg: 1, scope: !503, file: !372, line: 323, type: !507)
!583 = !DILocalVariable(name: "args", arg: 2, scope: !503, file: !372, line: 324, type: !560)
!584 = !DILocalVariable(name: "fmt", arg: 3, scope: !503, file: !372, line: 325, type: !526)
!585 = !DILocalVariable(name: "_unsafe_arg", scope: !503, file: !372, line: 326, type: !577, align: 1)
!586 = !DILocalVariable(arg: 4, scope: !503, file: !372, line: 326, type: !577)
!587 = !DILocation(line: 326, column: 9, scope: !503)
!588 = !DILocation(line: 323, column: 9, scope: !503)
!589 = !DILocation(line: 324, column: 9, scope: !503)
!590 = !DILocation(line: 325, column: 9, scope: !503)
!591 = !DILocation(line: 328, column: 34, scope: !503)
!592 = !DILocation(line: 328, column: 9, scope: !503)
!593 = !{i64 8}
!594 = !DILocation(line: 329, column: 6, scope: !503)
!595 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hc04148547e10466dE", scope: !504, file: !372, line: 297, type: !596, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !598, retainedNodes: !599)
!596 = !DISubroutineType(types: !597)
!597 = !{!504, !507}
!598 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hc04148547e10466dE", scope: !504, file: !372, line: 297, type: !596, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!599 = !{!600}
!600 = !DILocalVariable(name: "pieces", arg: 1, scope: !595, file: !372, line: 297, type: !507)
!601 = !DILocation(line: 297, column: 28, scope: !595)
!602 = !DILocation(line: 298, column: 12, scope: !595)
!603 = !DILocation(line: 301, column: 34, scope: !595)
!604 = !DILocation(line: 301, column: 9, scope: !595)
!605 = !DILocation(line: 302, column: 6, scope: !595)
!606 = !DILocation(line: 299, column: 13, scope: !595)
!607 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h896e3cd6c7594cdbE", scope: !609, file: !608, line: 250, type: !611, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !619, retainedNodes: !616)
!608 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfb73adf0f4bb6df3856d6eaf613e707")
!609 = !DINamespace(name: "FnOnce", scope: !610)
!610 = !DINamespace(name: "function", scope: !459)
!611 = !DISubroutineType(types: !612)
!612 = !{!153, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !614, size: 64, align: 64, dwarfAddressSpace: 0)
!614 = !DISubroutineType(types: !615)
!615 = !{!153}
!616 = !{!617, !618}
!617 = !DILocalVariable(arg: 1, scope: !607, file: !608, line: 250, type: !613)
!618 = !DILocalVariable(arg: 2, scope: !607, file: !608, line: 250, type: !67)
!619 = !{!620, !621}
!620 = !DITemplateTypeParameter(name: "Self", type: !613)
!621 = !DITemplateTypeParameter(name: "Args", type: !67)
!622 = !DILocation(line: 250, column: 5, scope: !607)
!623 = !DILocalVariable(name: "global_descriptor_table", scope: !624, file: !89, line: 26, type: !156, align: 8)
!624 = distinct !DILexicalBlock(scope: !625, file: !89, line: 26, column: 9)
!625 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hd90ef1e375094997E", scope: !87, file: !80, line: 137, type: !614, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !626)
!626 = !{!623, !627, !629, !631, !633}
!627 = !DILocalVariable(name: "stack_start", scope: !628, file: !89, line: 31, type: !98, align: 8)
!628 = distinct !DILexicalBlock(scope: !624, file: !89, line: 31, column: 17)
!629 = !DILocalVariable(name: "stack_end", scope: !630, file: !89, line: 32, type: !98, align: 8)
!630 = distinct !DILexicalBlock(scope: !628, file: !89, line: 32, column: 17)
!631 = !DILocalVariable(name: "tss_selector", scope: !632, file: !89, line: 38, type: !168, align: 2)
!632 = distinct !DILexicalBlock(scope: !624, file: !89, line: 38, column: 9)
!633 = !DILocalVariable(name: "code_selector", scope: !634, file: !89, line: 39, type: !168, align: 2)
!634 = distinct !DILexicalBlock(scope: !632, file: !89, line: 39, column: 9)
!635 = !DILocation(line: 26, column: 13, scope: !624, inlinedAt: !636)
!636 = distinct !DILocation(line: 250, column: 5, scope: !607)
!637 = !DILocation(line: 26, column: 43, scope: !638, inlinedAt: !636)
!638 = !DILexicalBlockFile(scope: !625, file: !89, discriminator: 0)
!639 = !DILocation(line: 31, column: 35, scope: !624, inlinedAt: !636)
!640 = !DILocation(line: 31, column: 21, scope: !628, inlinedAt: !636)
!641 = !DILocation(line: 32, column: 33, scope: !628, inlinedAt: !636)
!642 = !DILocation(line: 32, column: 21, scope: !630, inlinedAt: !636)
!643 = !DILocation(line: 29, column: 13, scope: !624, inlinedAt: !636)
!644 = !DILocation(line: 38, column: 62, scope: !624, inlinedAt: !636)
!645 = !DILocation(line: 38, column: 28, scope: !624, inlinedAt: !636)
!646 = !DILocation(line: 38, column: 13, scope: !632, inlinedAt: !636)
!647 = !DILocation(line: 39, column: 63, scope: !632, inlinedAt: !636)
!648 = !DILocation(line: 39, column: 29, scope: !632, inlinedAt: !636)
!649 = !DILocation(line: 39, column: 13, scope: !634, inlinedAt: !636)
!650 = !DILocation(line: 41, column: 20, scope: !634, inlinedAt: !636)
!651 = !DILocation(line: 42, column: 24, scope: !634, inlinedAt: !636)
!652 = !DILocation(line: 40, column: 9, scope: !634, inlinedAt: !636)
!653 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17he41eb090f123b515E", scope: !655, file: !654, line: 497, type: !656, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !661, retainedNodes: !659)
!654 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2a4cb7b22a4db908cc4f5cfdc074e9b2")
!655 = !DINamespace(name: "ptr", scope: !17)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!659 = !{!660}
!660 = !DILocalVariable(arg: 1, scope: !653, file: !654, line: 497, type: !658)
!661 = !{!662}
!662 = !DITemplateTypeParameter(name: "T", type: !333)
!663 = !DILocation(line: 497, column: 1, scope: !653)
!664 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17h6914aafe91c7dd1cE", scope: !655, file: !654, line: 497, type: !665, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !670, retainedNodes: !668)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!668 = !{!669}
!669 = !DILocalVariable(arg: 1, scope: !664, file: !654, line: 497, type: !667)
!670 = !{!671}
!671 = !DITemplateTypeParameter(name: "T", type: !342)
!672 = !DILocation(line: 497, column: 1, scope: !664)
!673 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h029deaf41746b05bE", scope: !655, file: !654, line: 497, type: !674, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !684, retainedNodes: !682)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !677, size: 64, align: 64, dwarfAddressSpace: 0)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !678, templateParams: !18, identifier: "2df01789076e29215e87b7dd5c14643c")
!678 = !{!679, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !677, file: !6, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !677, file: !6, baseType: !333, size: 8, align: 8, offset: 64)
!682 = !{!683}
!683 = !DILocalVariable(arg: 1, scope: !673, file: !654, line: 497, type: !676)
!684 = !{!685}
!685 = !DITemplateTypeParameter(name: "T", type: !677)
!686 = !DILocation(line: 497, column: 1, scope: !673)
!687 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::InterruptDescriptorTable>", linkageName: "_ZN4core3ptr70drop_in_place$LT$x86_64..structures..idt..InterruptDescriptorTable$GT$17h4c43b05723932902E", scope: !655, file: !654, line: 497, type: !688, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !693, retainedNodes: !691)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!691 = !{!692}
!692 = !DILocalVariable(arg: 1, scope: !687, file: !654, line: 497, type: !690)
!693 = !{!694}
!694 = !DITemplateTypeParameter(name: "T", type: !190)
!695 = !DILocation(line: 497, column: 1, scope: !687)
!696 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h387f9a134fbb7b09E", scope: !655, file: !654, line: 497, type: !697, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !711, retainedNodes: !709)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !700, size: 64, align: 64, dwarfAddressSpace: 0)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !701, templateParams: !73, identifier: "871efbd9dc810309ea3a190bc31be4e8")
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !700, file: !6, baseType: !703, size: 128, align: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !704, templateParams: !73, identifier: "9d2cdcd28f376e6ca3f9a8ab060d679b")
!704 = !{!705, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !703, file: !6, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !703, file: !6, baseType: !708, size: 64, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!709 = !{!710}
!710 = !DILocalVariable(arg: 1, scope: !696, file: !654, line: 497, type: !699)
!711 = !{!712}
!712 = !DITemplateTypeParameter(name: "T", type: !700)
!713 = !DILocation(line: 497, column: 1, scope: !696)
!714 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17ha690e501d843c3e0E", scope: !655, file: !654, line: 497, type: !715, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !720, retainedNodes: !718)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !703, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !{!719}
!719 = !DILocalVariable(arg: 1, scope: !714, file: !654, line: 497, type: !717)
!720 = !{!721}
!721 = !DITemplateTypeParameter(name: "T", type: !703)
!722 = !DILocation(line: 497, column: 1, scope: !714)
!723 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h9bf2ad94f6cca645E", scope: !725, file: !724, line: 100, type: !726, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!724 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "abfb30215b829e2044a72c49db9551bc")
!725 = !DINamespace(name: "hint", scope: !17)
!726 = !DISubroutineType(types: !727)
!727 = !{null}
!728 = !DILocation(line: 104, column: 9, scope: !723)
!729 = !DILocation(line: 105, column: 9, scope: !723)
!730 = !DILocation(line: 2520, column: 21, scope: !731, inlinedAt: !734)
!731 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h3f50d638cca9e835E", scope: !733, file: !732, line: 2517, type: !726, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!732 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "056d7d4c1b797c272c70fdc2c35793d9")
!733 = !DINamespace(name: "unreachable_unchecked", scope: !725)
!734 = distinct !DILocation(line: 104, column: 9, scope: !723)
!735 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17hd9d4ddb0bd9b3db9E", scope: !24, file: !736, line: 715, type: !737, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !754, retainedNodes: !755)
!736 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "f10535d78bf61205f540f8fe0965908b")
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !706, !333, !333, !357, !357}
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !377, file: !6, size: 16, align: 8, elements: !740, templateParams: !18, identifier: "434007f5a6282cb6fb571dbcac9aeb2b")
!740 = !{!741}
!741 = !DICompositeType(tag: DW_TAG_variant_part, scope: !739, file: !6, size: 16, align: 8, elements: !742, templateParams: !18, identifier: "67174a8617ef2d4ec7f7f8d89115961", discriminator: !753)
!742 = !{!743, !749}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !741, file: !6, baseType: !744, size: 16, align: 8, extraData: i64 0)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !739, file: !6, size: 16, align: 8, elements: !745, templateParams: !747, identifier: "7a6cf33984a7c892e02a26e42d46967a")
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !744, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!747 = !{!662, !748}
!748 = !DITemplateTypeParameter(name: "E", type: !333)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !741, file: !6, baseType: !750, size: 16, align: 8, extraData: i64 1)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !739, file: !6, size: 16, align: 8, elements: !751, templateParams: !747, identifier: "16ba050e8d6144c74ff5f8222f83821e")
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !750, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!754 = !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17hd9d4ddb0bd9b3db9E", scope: !24, file: !736, line: 715, type: !737, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!755 = !{!756, !757, !758, !759, !760, !761, !763}
!756 = !DILocalVariable(name: "self", arg: 1, scope: !735, file: !736, line: 716, type: !706)
!757 = !DILocalVariable(name: "current", arg: 2, scope: !735, file: !736, line: 717, type: !333)
!758 = !DILocalVariable(name: "new", arg: 3, scope: !735, file: !736, line: 718, type: !333)
!759 = !DILocalVariable(name: "success", arg: 4, scope: !735, file: !736, line: 719, type: !357)
!760 = !DILocalVariable(name: "failure", arg: 5, scope: !735, file: !736, line: 720, type: !357)
!761 = !DILocalVariable(name: "x", scope: !762, file: !736, line: 726, type: !33, align: 1)
!762 = distinct !DILexicalBlock(scope: !735, file: !736, line: 726, column: 13)
!763 = !DILocalVariable(name: "x", scope: !764, file: !736, line: 727, type: !33, align: 1)
!764 = distinct !DILexicalBlock(scope: !735, file: !736, line: 727, column: 13)
!765 = !DILocation(line: 716, column: 9, scope: !735)
!766 = !DILocation(line: 717, column: 9, scope: !735)
!767 = !DILocation(line: 718, column: 9, scope: !735)
!768 = !DILocation(line: 719, column: 9, scope: !735)
!769 = !DILocation(line: 720, column: 9, scope: !735)
!770 = !DILocalVariable(name: "self", arg: 1, scope: !771, file: !772, line: 2073, type: !776)
!771 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha69116e11681aec7E", scope: !29, file: !772, line: 2073, type: !773, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, declaration: !777, retainedNodes: !778)
!772 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "3c11b322ef4895b2a6cf9b3a40166448")
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha69116e11681aec7E", scope: !29, file: !772, line: 2073, type: !773, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !34)
!778 = !{!770}
!779 = !DILocation(line: 2073, column: 22, scope: !771, inlinedAt: !780)
!780 = distinct !DILocation(line: 724, column: 42, scope: !735)
!781 = !DILocation(line: 724, column: 56, scope: !735)
!782 = !DILocation(line: 724, column: 71, scope: !735)
!783 = !DILocation(line: 724, column: 13, scope: !735)
!784 = !DILocation(line: 723, column: 15, scope: !735)
!785 = !{i8 0, i8 2}
!786 = !DILocation(line: 723, column: 9, scope: !735)
!787 = !DILocation(line: 726, column: 16, scope: !735)
!788 = !DILocation(line: 726, column: 16, scope: !762)
!789 = !DILocation(line: 726, column: 25, scope: !762)
!790 = !DILocation(line: 726, column: 22, scope: !762)
!791 = !DILocation(line: 726, column: 31, scope: !735)
!792 = !DILocation(line: 727, column: 17, scope: !735)
!793 = !DILocation(line: 727, column: 17, scope: !764)
!794 = !DILocation(line: 727, column: 27, scope: !764)
!795 = !DILocation(line: 727, column: 23, scope: !764)
!796 = !DILocation(line: 727, column: 33, scope: !735)
!797 = !DILocation(line: 729, column: 6, scope: !735)
!798 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17hcc0259c0524feb00E", scope: !24, file: !736, line: 495, type: !799, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !801, retainedNodes: !802)
!799 = !DISubroutineType(types: !800)
!800 = !{!333, !706, !357}
!801 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17hcc0259c0524feb00E", scope: !24, file: !736, line: 495, type: !799, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "self", arg: 1, scope: !798, file: !736, line: 495, type: !706)
!804 = !DILocalVariable(name: "order", arg: 2, scope: !798, file: !736, line: 495, type: !357)
!805 = !DILocation(line: 495, column: 17, scope: !798)
!806 = !DILocation(line: 495, column: 24, scope: !798)
!807 = !DILocation(line: 2073, column: 22, scope: !771, inlinedAt: !808)
!808 = distinct !DILocation(line: 498, column: 30, scope: !798)
!809 = !DILocation(line: 498, column: 18, scope: !798)
!810 = !DILocation(line: 499, column: 6, scope: !798)
!811 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17hf2af94069ebdcf22E", scope: !24, file: !736, line: 523, type: !812, scopeLine: 523, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !814, retainedNodes: !815)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !706, !333, !357}
!814 = !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17hf2af94069ebdcf22E", scope: !24, file: !736, line: 523, type: !812, scopeLine: 523, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!815 = !{!816, !817, !818}
!816 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !736, line: 523, type: !706)
!817 = !DILocalVariable(name: "val", arg: 2, scope: !811, file: !736, line: 523, type: !333)
!818 = !DILocalVariable(name: "order", arg: 3, scope: !811, file: !736, line: 523, type: !357)
!819 = !DILocation(line: 523, column: 18, scope: !811)
!820 = !DILocation(line: 523, column: 25, scope: !811)
!821 = !DILocation(line: 523, column: 36, scope: !811)
!822 = !DILocation(line: 2073, column: 22, scope: !771, inlinedAt: !823)
!823 = distinct !DILocation(line: 527, column: 26, scope: !811)
!824 = !DILocation(line: 527, column: 40, scope: !811)
!825 = !DILocation(line: 527, column: 13, scope: !811)
!826 = !DILocation(line: 529, column: 6, scope: !811)
!827 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hf7c87c9b12d8d28cE", scope: !131, file: !736, line: 2369, type: !828, scopeLine: 2369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !830, retainedNodes: !831)
!828 = !DISubroutineType(types: !829)
!829 = !{!137, !680, !137, !137, !357}
!830 = !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hf7c87c9b12d8d28cE", scope: !131, file: !736, line: 2369, type: !828, scopeLine: 2369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!831 = !{!832, !833, !834, !835, !836, !838}
!832 = !DILocalVariable(name: "self", arg: 1, scope: !827, file: !736, line: 2369, type: !680)
!833 = !DILocalVariable(name: "current", arg: 2, scope: !827, file: !736, line: 2370, type: !137)
!834 = !DILocalVariable(name: "new", arg: 3, scope: !827, file: !736, line: 2371, type: !137)
!835 = !DILocalVariable(name: "order", arg: 4, scope: !827, file: !736, line: 2372, type: !357)
!836 = !DILocalVariable(name: "x", scope: !837, file: !736, line: 2377, type: !137, align: 8)
!837 = distinct !DILexicalBlock(scope: !827, file: !736, line: 2377, column: 21)
!838 = !DILocalVariable(name: "x", scope: !839, file: !736, line: 2378, type: !137, align: 8)
!839 = distinct !DILexicalBlock(scope: !827, file: !736, line: 2378, column: 21)
!840 = !DILocation(line: 2369, column: 37, scope: !827)
!841 = !DILocation(line: 2370, column: 37, scope: !827)
!842 = !DILocation(line: 2371, column: 37, scope: !827)
!843 = !DILocation(line: 2372, column: 37, scope: !827)
!844 = !DILocation(line: 2376, column: 45, scope: !827)
!845 = !{i8 0, i8 5}
!846 = !DILocation(line: 2373, column: 23, scope: !827)
!847 = !{i64 0, i64 2}
!848 = !DILocation(line: 2373, column: 17, scope: !827)
!849 = !DILocation(line: 2377, column: 24, scope: !827)
!850 = !DILocation(line: 2377, column: 24, scope: !837)
!851 = !DILocation(line: 2377, column: 30, scope: !837)
!852 = !DILocation(line: 2377, column: 30, scope: !827)
!853 = !DILocation(line: 2378, column: 25, scope: !827)
!854 = !DILocation(line: 2378, column: 25, scope: !839)
!855 = !DILocation(line: 2378, column: 31, scope: !839)
!856 = !DILocation(line: 2378, column: 31, scope: !827)
!857 = !DILocation(line: 2380, column: 14, scope: !827)
!858 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17ha44092a6d8241a49E", scope: !131, file: !736, line: 2423, type: !859, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !876, retainedNodes: !877)
!859 = !DISubroutineType(types: !860)
!860 = !{!861, !680, !137, !137, !357, !357}
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !377, file: !6, size: 128, align: 64, elements: !862, templateParams: !18, identifier: "307ae12e5be9e098d6654c55ff4b1e62")
!862 = !{!863}
!863 = !DICompositeType(tag: DW_TAG_variant_part, scope: !861, file: !6, size: 128, align: 64, elements: !864, templateParams: !18, identifier: "5be2e62405ebff649a122b923b8a5a", discriminator: !875)
!864 = !{!865, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !863, file: !6, baseType: !866, size: 128, align: 64, extraData: i64 0)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !861, file: !6, size: 128, align: 64, elements: !867, templateParams: !869, identifier: "45b6112b02b5e579cf0d7db9482ba311")
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !866, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!869 = !{!139, !870}
!870 = !DITemplateTypeParameter(name: "E", type: !137)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !863, file: !6, baseType: !872, size: 128, align: 64, extraData: i64 1)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !861, file: !6, size: 128, align: 64, elements: !873, templateParams: !869, identifier: "9dc02c01ac230d8b491936b984b24baa")
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !872, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, scope: !861, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!876 = !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17ha44092a6d8241a49E", scope: !131, file: !736, line: 2423, type: !859, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DILocalVariable(name: "self", arg: 1, scope: !858, file: !736, line: 2423, type: !680)
!879 = !DILocalVariable(name: "current", arg: 2, scope: !858, file: !736, line: 2424, type: !137)
!880 = !DILocalVariable(name: "new", arg: 3, scope: !858, file: !736, line: 2425, type: !137)
!881 = !DILocalVariable(name: "success", arg: 4, scope: !858, file: !736, line: 2426, type: !357)
!882 = !DILocalVariable(name: "failure", arg: 5, scope: !858, file: !736, line: 2427, type: !357)
!883 = !DILocation(line: 2423, column: 37, scope: !858)
!884 = !DILocation(line: 2424, column: 37, scope: !858)
!885 = !DILocation(line: 2425, column: 37, scope: !858)
!886 = !DILocation(line: 2426, column: 37, scope: !858)
!887 = !DILocation(line: 2427, column: 37, scope: !858)
!888 = !DILocalVariable(name: "self", arg: 1, scope: !889, file: !772, line: 2073, type: !893)
!889 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hfd36339789c2b784E", scope: !134, file: !772, line: 2073, type: !890, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, declaration: !894, retainedNodes: !895)
!890 = !DISubroutineType(types: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!894 = !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hfd36339789c2b784E", scope: !134, file: !772, line: 2073, type: !890, scopeLine: 2073, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !138)
!895 = !{!888}
!896 = !DILocation(line: 2073, column: 22, scope: !889, inlinedAt: !897)
!897 = distinct !DILocation(line: 2429, column: 50, scope: !858)
!898 = !DILocation(line: 2429, column: 26, scope: !858)
!899 = !DILocation(line: 2430, column: 14, scope: !858)
!900 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hb02a289d04848abeE", scope: !131, file: !736, line: 2256, type: !901, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !903, retainedNodes: !904)
!901 = !DISubroutineType(types: !902)
!902 = !{!137, !680, !357}
!903 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hb02a289d04848abeE", scope: !131, file: !736, line: 2256, type: !901, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!904 = !{!905, !906}
!905 = !DILocalVariable(name: "self", arg: 1, scope: !900, file: !736, line: 2256, type: !680)
!906 = !DILocalVariable(name: "order", arg: 2, scope: !900, file: !736, line: 2256, type: !357)
!907 = !DILocation(line: 2256, column: 25, scope: !900)
!908 = !DILocation(line: 2256, column: 32, scope: !900)
!909 = !DILocation(line: 2073, column: 22, scope: !889, inlinedAt: !910)
!910 = distinct !DILocation(line: 2258, column: 38, scope: !900)
!911 = !DILocation(line: 2258, column: 26, scope: !900)
!912 = !DILocation(line: 2259, column: 14, scope: !900)
!913 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h5d2995d1e5d81bbeE", scope: !131, file: !736, line: 2283, type: !914, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, declaration: !916, retainedNodes: !917)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !680, !137, !357}
!916 = !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h5d2995d1e5d81bbeE", scope: !131, file: !736, line: 2283, type: !914, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!917 = !{!918, !919, !920}
!918 = !DILocalVariable(name: "self", arg: 1, scope: !913, file: !736, line: 2283, type: !680)
!919 = !DILocalVariable(name: "val", arg: 2, scope: !913, file: !736, line: 2283, type: !137)
!920 = !DILocalVariable(name: "order", arg: 3, scope: !913, file: !736, line: 2283, type: !357)
!921 = !DILocation(line: 2283, column: 26, scope: !913)
!922 = !DILocation(line: 2283, column: 33, scope: !913)
!923 = !DILocation(line: 2283, column: 49, scope: !913)
!924 = !DILocation(line: 2073, column: 22, scope: !889, inlinedAt: !925)
!925 = distinct !DILocation(line: 2285, column: 39, scope: !913)
!926 = !DILocation(line: 2285, column: 26, scope: !913)
!927 = !DILocation(line: 2286, column: 14, scope: !913)
!928 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h9046c4848c55ce1bE", scope: !25, file: !736, line: 3620, type: !726, scopeLine: 3620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!929 = !DILocation(line: 175, column: 18, scope: !930, inlinedAt: !931)
!930 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17hd563380615547d02E", scope: !725, file: !724, line: 165, type: !726, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!931 = distinct !DILocation(line: 3621, column: 5, scope: !928)
!932 = !DILocation(line: 3622, column: 2, scope: !928)
!933 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h3d94465e78f4e793E", scope: !25, file: !736, line: 3215, type: !934, scopeLine: 3215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!861, !892, !137, !137, !357, !357}
!936 = !{!937, !938, !939, !940, !941, !942, !944}
!937 = !DILocalVariable(name: "dst", arg: 1, scope: !933, file: !736, line: 3216, type: !892)
!938 = !DILocalVariable(name: "old", arg: 2, scope: !933, file: !736, line: 3217, type: !137)
!939 = !DILocalVariable(name: "new", arg: 3, scope: !933, file: !736, line: 3218, type: !137)
!940 = !DILocalVariable(name: "success", arg: 4, scope: !933, file: !736, line: 3219, type: !357)
!941 = !DILocalVariable(name: "failure", arg: 5, scope: !933, file: !736, line: 3220, type: !357)
!942 = !DILocalVariable(name: "val", scope: !943, file: !736, line: 3223, type: !137, align: 8)
!943 = distinct !DILexicalBlock(scope: !933, file: !736, line: 3223, column: 5)
!944 = !DILocalVariable(name: "ok", scope: !943, file: !736, line: 3223, type: !333, align: 1)
!945 = !DILocation(line: 3216, column: 5, scope: !933)
!946 = !DILocation(line: 3217, column: 5, scope: !933)
!947 = !DILocation(line: 3218, column: 5, scope: !933)
!948 = !DILocation(line: 3219, column: 5, scope: !933)
!949 = !DILocation(line: 3220, column: 5, scope: !933)
!950 = !DILocation(line: 3224, column: 15, scope: !933)
!951 = !DILocation(line: 3224, column: 9, scope: !933)
!952 = !DILocation(line: 3237, column: 34, scope: !933)
!953 = !DILocation(line: 3238, column: 34, scope: !933)
!954 = !DILocation(line: 3239, column: 33, scope: !933)
!955 = !DILocation(line: 3223, column: 10, scope: !933)
!956 = !DILocation(line: 3223, column: 10, scope: !943)
!957 = !DILocation(line: 3223, column: 15, scope: !933)
!958 = !DILocation(line: 3223, column: 15, scope: !943)
!959 = !DILocation(line: 3244, column: 8, scope: !943)
!960 = !DILocation(line: 3234, column: 34, scope: !933)
!961 = !DILocation(line: 3235, column: 34, scope: !933)
!962 = !DILocation(line: 3236, column: 33, scope: !933)
!963 = !DILocation(line: 3228, column: 35, scope: !933)
!964 = !DILocation(line: 3229, column: 35, scope: !933)
!965 = !DILocation(line: 3230, column: 34, scope: !933)
!966 = !DILocation(line: 3231, column: 35, scope: !933)
!967 = !DILocation(line: 3232, column: 35, scope: !933)
!968 = !DILocation(line: 3233, column: 34, scope: !933)
!969 = !DILocation(line: 3225, column: 35, scope: !933)
!970 = !DILocation(line: 3226, column: 35, scope: !933)
!971 = !DILocation(line: 3227, column: 34, scope: !933)
!972 = !DILocation(line: 3241, column: 29, scope: !933)
!973 = !DILocation(line: 3240, column: 28, scope: !933)
!974 = !DILocation(line: 3244, column: 30, scope: !943)
!975 = !DILocation(line: 3244, column: 5, scope: !943)
!976 = !DILocation(line: 3244, column: 13, scope: !943)
!977 = !DILocation(line: 3245, column: 2, scope: !933)
!978 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h12bf59e9d0856f90E", scope: !25, file: !736, line: 3122, type: !979, scopeLine: 3122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{!357, !357}
!981 = !{!982}
!982 = !DILocalVariable(name: "order", arg: 1, scope: !978, file: !736, line: 3122, type: !357)
!983 = !DILocation(line: 3122, column: 31, scope: !978)
!984 = !DILocation(line: 3123, column: 11, scope: !978)
!985 = !DILocation(line: 3123, column: 5, scope: !978)
!986 = !DILocation(line: 3125, column: 20, scope: !978)
!987 = !DILocation(line: 3124, column: 20, scope: !978)
!988 = !DILocation(line: 3127, column: 20, scope: !978)
!989 = !DILocation(line: 3128, column: 19, scope: !978)
!990 = !DILocation(line: 3126, column: 19, scope: !978)
!991 = !DILocation(line: 3130, column: 2, scope: !978)
!992 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17hb7b27bb9a558eac4E", scope: !25, file: !736, line: 3250, type: !993, scopeLine: 3250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !1010)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !775, !33, !33, !357, !357}
