; ModuleID = '4xhw6440wxywhhsy'
source_filename = "4xhw6440wxywhhsy"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17h66c30a221ba57870E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "cpu_interrupts/src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "3001648fc91db5bb58241b16a9b122f4")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "af6f3a8ec43d1f6c12c337ae2b19bc9e")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "79f81c459de6dca4d9657eb000118ae2")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "739be00bff07a22810bf86daf420515a")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "e2364d2a6ff719de740e5eb5e910ee4d")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "e5c1894a60a57e2d6018f7e1849f9cfb")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "f0039a9ebced358731b26b5e7305cf0f")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "704cbec41c2a43b54a6a76883cbdf978")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "6e2aa6dc121bbbddee06b586a5b4764a")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "a8eb19b2ce088a9b7e474711afc9a3ab")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "8d33ffc0710a4c2f1f458093d077c9a3")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "61129a9fb5f505dc2c1bda9fef39cabd")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "7b61641c06de0483f7557b84ccab5a8b")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h94906d1d65cd9ab0E", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "3f28a3918c27d1e642d641339a9cea50")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h1ea3db7bdfbf0ddcE", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "cpu_interrupts/src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "7c53300f616d85b9a7e15537cfc3873c")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "f319a619b938dd9d76cda81460978cdb")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17hdc0a01dd21764c33E", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h6fc25aedcad6eb96E", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "f7ac41e1137016b843066ba374ab9482")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "f2a1948117d4f0a080a4cad67ab19892")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "2430928ce830a626955c329833891eda")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "d8ddfc9344a00bdf32bf210691c75ecb")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "81e165821e1f9e74a503c68abf3b9f82")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "d3cfaff6cc530eccd3cd990e2d2fbd9b")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "6cbdcb11fe55f1132d28de31b1e7f911", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "9701277732d7df2444ef41659845ecfa")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "e5a99ae87e8762c6a0745cbc9314f8c9")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "2ad6bb718ebbc631c647351758b53848")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "f5e67aec3e43702cc1c0c9be991d6d4d")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "9898470ad31dd1d1dc3acaa30206c07b")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "60236d245ffe43c8f22daee99d6bb156")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !190, templateParams: !18, identifier: "c8e52d74f33729ec38561e0feed555af")
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !191, file: !6, size: 32768, align: 128, elements: !192, templateParams: !18, identifier: "91f0aeb55a734c21b1fffe8978ddd880")
!191 = !DINamespace(name: "idt", scope: !92)
!192 = !{!193, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !269, !270, !271, !272, !293, !294, !295, !296, !314, !315, !316, !318, !319, !320, !321}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !190, file: !6, baseType: !194, size: 128, align: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !191, file: !6, size: 128, align: 32, elements: !195, templateParams: !222, identifier: "c07090066229a58bffcd5a1a3c1c9b23")
!195 = !{!196, !197, !198, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !194, file: !6, baseType: !55, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !191, file: !6, size: 16, align: 16, elements: !200, templateParams: !18, identifier: "a1c59f7dbd6ac6ee47640e0ff182425c")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !6, baseType: !55, size: 16, align: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !194, file: !6, baseType: !206, align: 8, offset: 128)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !207, identifier: "c4f3e56443d1d21bcad3e30edc1ed3bd")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !191, file: !6, size: 320, align: 64, elements: !213, templateParams: !18, identifier: "63033cc7f76eed163ae105503ff9b538")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !6, baseType: !215, size: 320, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !191, file: !6, size: 320, align: 64, elements: !216, templateParams: !18, identifier: "287bd28ca907b477b8a6a6f125c2dc8b")
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "F", type: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !190, file: !6, baseType: !232, size: 128, align: 32, offset: 1024)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !233, templateParams: !248, identifier: "a72435b0dd29b0166ee3acf002a3ab4a")
!233 = !{!234, !235, !236, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !232, file: !6, baseType: !55, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !232, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !6, baseType: !241, align: 8, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !242, identifier: "7edb8443337f40f99cc2a2f9f8777eda")
!242 = !{!243}
!243 = !DITemplateTypeParameter(name: "T", type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !212, !102}
!247 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "F", type: !244)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1280)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !191, file: !6, size: 128, align: 32, elements: !253, templateParams: !267, identifier: "4d328d62643347aca5ed7b83c4e1d97")
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !252, file: !6, baseType: !55, size: 16, align: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !252, file: !6, baseType: !261, align: 8, offset: 128)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !262, identifier: "b18193b570c67a03d7b2a9bb7b33de6c")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !102}
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "F", type: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !190, file: !6, baseType: !273, size: 128, align: 32, offset: 1792)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !191, file: !6, size: 128, align: 32, elements: !274, templateParams: !291, identifier: "2bb7d30a8da6cd4efa106d137e234389")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !273, file: !6, baseType: !55, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !273, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !273, file: !6, baseType: !282, align: 8, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !283, identifier: "53dfd5386b895fab957f86f36109f499")
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !212, !288}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !191, file: !6, size: 64, align: 64, elements: !289, templateParams: !18, identifier: "b0f348801a108319c9c76df3aad040f2")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !288, file: !6, baseType: !102, size: 64, align: 64)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "F", type: !285)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !190, file: !6, baseType: !297, size: 128, align: 32, offset: 2304)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !298, templateParams: !312, identifier: "fa79490fb12a32ed17ef7821ac4e4de6")
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !297, file: !6, baseType: !55, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !297, file: !6, baseType: !306, align: 8, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !307, identifier: "ec39bcf007a6fcefca8f18280f160658")
!307 = !{!308}
!308 = !DITemplateTypeParameter(name: "T", type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DISubroutineType(types: !311)
!311 = !{!247, !212}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "F", type: !309)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !190, file: !6, baseType: !317, size: 1024, align: 32, offset: 2688)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 32, elements: !161)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3712)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 3968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !190, file: !6, baseType: !322, size: 28672, align: 32, offset: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 28672, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 224, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !18, identifier: "d321fdce2877c49cb091f492cd4afaa1")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !6, baseType: !186, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!333 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !18, identifier: "119735d27d91c272ddd15277cc8ea37f")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !6, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.71.0-nightly (d0f204e4d 2023-04-16))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !371, splitDebugInlining: false)
!347 = !DIFile(filename: "cpu_interrupts/src/lib.rs/@/4xhw6440wxywhhsy", directory: "/Users/yaw/self/theo")
!348 = !{!349, !358, !365}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !353)
!350 = !DINamespace(name: "v1", scope: !351)
!351 = !DINamespace(name: "rt", scope: !352)
!352 = !DINamespace(name: "fmt", scope: !17)
!353 = !{!354, !355, !356, !357}
!354 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!361 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!362 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!363 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!364 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!370 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!371 = !{!0, !77, !84, !113, !118, !181, !325, !334}
!372 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17hb7082edc9e75794bE", scope: !374, file: !373, line: 2447, type: !375, scopeLine: 2447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !424)
!373 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!374 = !DINamespace(name: "{impl#14}", scope: !352)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !342, !395}
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !378, file: !6, size: 8, align: 8, elements: !379, templateParams: !18, identifier: "1c6ce168e24238e83c13ec35dde7d382")
!378 = !DINamespace(name: "result", scope: !17)
!379 = !{!380}
!380 = !DICompositeType(tag: DW_TAG_variant_part, scope: !377, file: !6, size: 8, align: 8, elements: !381, templateParams: !18, identifier: "42dfca7da53f7734270db51480dbcc24", discriminator: !394)
!381 = !{!382, !390}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !380, file: !6, baseType: !383, size: 8, align: 8, extraData: i64 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !377, file: !6, size: 8, align: 8, elements: !384, templateParams: !386, identifier: "4d011f8c16a13f53ec25b197c7b1903")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !6, baseType: !67, align: 8, offset: 8)
!386 = !{!387, !388}
!387 = !DITemplateTypeParameter(name: "T", type: !67)
!388 = !DITemplateTypeParameter(name: "E", type: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !352, file: !6, align: 8, elements: !18, identifier: "d361babf030d8dcc5fc2146a5e622473")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !380, file: !6, baseType: !391, size: 8, align: 8, extraData: i64 1)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !377, file: !6, size: 8, align: 8, elements: !392, templateParams: !386, identifier: "c5af1e4fa5907b7a524a9ebbd4a5ec10")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !391, file: !6, baseType: !389, align: 8, offset: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !352, file: !6, size: 512, align: 64, elements: !397, templateParams: !18, identifier: "a3b888d0a58016a3ad42c934cf971ea3")
!397 = !{!398, !399, !401, !402, !414, !415}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !6, baseType: !95, size: 32, align: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !396, file: !6, baseType: !400, size: 32, align: 32, offset: 416)
!400 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !396, file: !6, baseType: !349, size: 8, align: 8, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !396, file: !6, baseType: !403, size: 128, align: 64, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !404, templateParams: !18, identifier: "8d57b0310dad0e81a52a7e1f827929d")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !403, file: !6, size: 128, align: 64, elements: !406, templateParams: !18, identifier: "1503e6327b896c262eca127cbc35ec74", discriminator: !413)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !405, file: !6, baseType: !408, size: 128, align: 64, extraData: i64 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !403, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "b9a11c756332445b5e317b2b2625f528")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !405, file: !6, baseType: !410, size: 128, align: 64, extraData: i64 1)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !403, file: !6, size: 128, align: 64, elements: !411, templateParams: !138, identifier: "87159a1745a522a36bc4a0700aab6dc3")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !396, file: !6, baseType: !403, size: 128, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !396, file: !6, baseType: !416, size: 128, align: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !417, templateParams: !18, identifier: "b58efcb3df0f0beb9aa098f750459fd2")
!417 = !{!418, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !416, file: !6, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64, dwarfAddressSpace: 0)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "bcfe988c4f0dd1d50291e24ffc6447")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !416, file: !6, baseType: !422, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!424 = !{!425, !426}
!425 = !DILocalVariable(name: "self", arg: 1, scope: !372, file: !373, line: 2447, type: !342)
!426 = !DILocalVariable(name: "f", arg: 2, scope: !372, file: !373, line: 2447, type: !395)
!427 = !DILocation(line: 2447, column: 12, scope: !372)
!428 = !DILocation(line: 2447, column: 19, scope: !372)
!429 = !DILocation(line: 2448, column: 9, scope: !372)
!430 = !DILocation(line: 2449, column: 6, scope: !372)
!431 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h362d171f2b183fa8E", scope: !433, file: !432, line: 237, type: !435, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !438)
!432 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!433 = !DINamespace(name: "{impl#2}", scope: !434)
!434 = !DINamespace(name: "bit_field", scope: null)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !437, !137, !333}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !{!439, !440, !441}
!439 = !DILocalVariable(name: "self", arg: 1, scope: !431, file: !432, line: 237, type: !437)
!440 = !DILocalVariable(name: "bit", arg: 2, scope: !431, file: !432, line: 237, type: !137)
!441 = !DILocalVariable(name: "value", arg: 3, scope: !431, file: !432, line: 237, type: !333)
!442 = !DILocation(line: 237, column: 24, scope: !431)
!443 = !DILocation(line: 237, column: 35, scope: !431)
!444 = !DILocation(line: 237, column: 47, scope: !431)
!445 = !DILocation(line: 238, column: 25, scope: !431)
!446 = !DILocation(line: 238, column: 17, scope: !431)
!447 = !DILocation(line: 240, column: 20, scope: !431)
!448 = !DILocation(line: 243, column: 31, scope: !431)
!449 = !DILocation(line: 241, column: 30, scope: !431)
!450 = !DILocation(line: 241, column: 21, scope: !431)
!451 = !DILocation(line: 240, column: 17, scope: !431)
!452 = !DILocation(line: 247, column: 14, scope: !431)
!453 = !DILocation(line: 243, column: 30, scope: !431)
!454 = !DILocation(line: 243, column: 21, scope: !431)
!455 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17hfd7ee7ca0c7fa012E", scope: !433, file: !432, line: 250, type: !456, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !474, retainedNodes: !466)
!456 = !DISubroutineType(types: !457)
!457 = !{!437, !437, !458, !55}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !459, file: !6, size: 128, align: 64, elements: !461, templateParams: !464, identifier: "affb821d2ef067ad9b92b5e9467b6ff1")
!459 = !DINamespace(name: "range", scope: !460)
!460 = !DINamespace(name: "ops", scope: !17)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !458, file: !6, baseType: !137, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !458, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!464 = !{!465}
!465 = !DITemplateTypeParameter(name: "Idx", type: !137)
!466 = !{!467, !468, !469, !470, !472}
!467 = !DILocalVariable(name: "self", arg: 1, scope: !455, file: !432, line: 250, type: !437)
!468 = !DILocalVariable(name: "range", arg: 2, scope: !455, file: !432, line: 250, type: !458)
!469 = !DILocalVariable(name: "value", arg: 3, scope: !455, file: !432, line: 250, type: !55)
!470 = !DILocalVariable(name: "range", scope: !471, file: !432, line: 251, type: !458, align: 8)
!471 = distinct !DILexicalBlock(scope: !455, file: !432, line: 251, column: 17)
!472 = !DILocalVariable(name: "bitmask", scope: !473, file: !432, line: 260, type: !55, align: 2)
!473 = distinct !DILexicalBlock(scope: !471, file: !432, line: 260, column: 17)
!474 = !{!475}
!475 = !DITemplateTypeParameter(name: "T", type: !458)
!476 = !DILocation(line: 250, column: 48, scope: !455)
!477 = !DILocation(line: 250, column: 59, scope: !455)
!478 = !DILocation(line: 250, column: 69, scope: !455)
!479 = !DILocation(line: 251, column: 29, scope: !455)
!480 = !DILocation(line: 251, column: 21, scope: !471)
!481 = !DILocation(line: 253, column: 25, scope: !471)
!482 = !DILocation(line: 253, column: 17, scope: !471)
!483 = !DILocation(line: 254, column: 25, scope: !471)
!484 = !DILocation(line: 254, column: 17, scope: !471)
!485 = !DILocation(line: 255, column: 25, scope: !471)
!486 = !DILocation(line: 255, column: 17, scope: !471)
!487 = !DILocation(line: 256, column: 54, scope: !471)
!488 = !DILocation(line: 256, column: 34, scope: !471)
!489 = !DILocation(line: 256, column: 25, scope: !471)
!490 = !DILocation(line: 257, column: 45, scope: !471)
!491 = !DILocation(line: 257, column: 25, scope: !471)
!492 = !DILocation(line: 256, column: 17, scope: !471)
!493 = !DILocation(line: 260, column: 45, scope: !471)
!494 = !DILocation(line: 260, column: 39, scope: !471)
!495 = !DILocation(line: 261, column: 37, scope: !471)
!496 = !DILocation(line: 260, column: 38, scope: !471)
!497 = !DILocation(line: 260, column: 37, scope: !471)
!498 = !DILocation(line: 260, column: 21, scope: !473)
!499 = !DILocation(line: 265, column: 26, scope: !473)
!500 = !DILocation(line: 265, column: 25, scope: !473)
!501 = !DILocation(line: 265, column: 45, scope: !473)
!502 = !DILocation(line: 265, column: 17, scope: !473)
!503 = !DILocation(line: 268, column: 14, scope: !455)
!504 = distinct !DISubprogram(name: "new<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV13new17h81a04c483c13723aE", scope: !505, file: !373, line: 340, type: !515, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !524, retainedNodes: !521)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !352, file: !6, size: 128, align: 64, elements: !506, templateParams: !18, identifier: "3c2ef6ebf262caba6e43777d9c298823")
!506 = !{!507, !511}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !505, file: !6, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !510, file: !6, align: 8, elements: !18, identifier: "43185ab61ba6b0b799bd1bef1620bc0b")
!510 = !DINamespace(name: "{extern#0}", scope: !352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !505, file: !6, baseType: !512, size: 64, align: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !513, size: 64, align: 64, dwarfAddressSpace: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{!377, !508, !395}
!515 = !DISubroutineType(types: !516)
!516 = !{!505, !517, !518}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::InterruptStackFrame", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&x86_64::structures::idt::InterruptStackFrame, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !519, size: 64, align: 64, dwarfAddressSpace: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{!377, !517, !395}
!521 = !{!522, !523}
!522 = !DILocalVariable(name: "x", arg: 1, scope: !504, file: !373, line: 340, type: !517)
!523 = !DILocalVariable(name: "f", arg: 2, scope: !504, file: !373, line: 340, type: !518)
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !212)
!526 = !DILocation(line: 340, column: 23, scope: !504)
!527 = !DILocation(line: 340, column: 33, scope: !504)
!528 = !DILocation(line: 349, column: 18, scope: !504)
!529 = !DILocation(line: 350, column: 6, scope: !504)
!530 = !{i64 1}
!531 = distinct !DISubprogram(name: "new_debug<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h71d6176e612706a8E", scope: !505, file: !373, line: 329, type: !532, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !524, retainedNodes: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!505, !517}
!534 = !{!535}
!535 = !DILocalVariable(name: "x", arg: 1, scope: !531, file: !373, line: 329, type: !517)
!536 = !DILocation(line: 329, column: 30, scope: !531)
!537 = !DILocation(line: 330, column: 13, scope: !531)
!538 = !DILocation(line: 331, column: 10, scope: !531)
!539 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hf7656413da502c3cE", scope: !540, file: !373, line: 443, type: !604, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !609)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !352, file: !6, size: 384, align: 64, elements: !541, templateParams: !18, identifier: "dc49042afee2f796a8fa4685389c4b18")
!541 = !{!542, !553, !598}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !540, file: !6, baseType: !543, size: 128, align: 64, offset: 128)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !544, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!544 = !{!545, !552}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !543, file: !6, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !548, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!548 = !{!549, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !547, file: !6, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !547, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !543, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !540, file: !6, baseType: !554, size: 128, align: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !145, file: !6, size: 128, align: 64, elements: !555, templateParams: !18, identifier: "62d362416a1eb41bf984638792a73145")
!555 = !{!556}
!556 = !DICompositeType(tag: DW_TAG_variant_part, scope: !554, file: !6, size: 128, align: 64, elements: !557, templateParams: !18, identifier: "51527d667cbd19b863d93073f3cc474", discriminator: !597)
!557 = !{!558, !593}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !556, file: !6, baseType: !559, size: 128, align: 64, extraData: i64 0)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !554, file: !6, size: 128, align: 64, elements: !18, templateParams: !560, identifier: "66a59c7143972a6588bd1a9c8246e60f")
!560 = !{!561}
!561 = !DITemplateTypeParameter(name: "T", type: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !563, templateParams: !18, identifier: "66b60dbaad43783577fb935928e2ac56")
!563 = !{!564, !592}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !562, file: !6, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !350, file: !6, size: 448, align: 64, elements: !567, templateParams: !18, identifier: "1b0f53c51c2a0850dc27a4ea7530e9b2")
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !566, file: !6, baseType: !137, size: 64, align: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !566, file: !6, baseType: !570, size: 384, align: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !350, file: !6, size: 384, align: 64, elements: !571, templateParams: !18, identifier: "4ceb8823bbeb709d93b7ffb6ddd40132")
!571 = !{!572, !573, !574, !575, !591}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !570, file: !6, baseType: !400, size: 32, align: 32, offset: 288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !570, file: !6, baseType: !349, size: 8, align: 8, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !570, file: !6, baseType: !95, size: 32, align: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !570, file: !6, baseType: !576, size: 128, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !350, file: !6, size: 128, align: 64, elements: !577, templateParams: !18, identifier: "beb49147a723c973b15fc19c2245c821")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_variant_part, scope: !576, file: !6, size: 128, align: 64, elements: !579, templateParams: !18, identifier: "c9db73f716fc865c39b9a87ace47fe10", discriminator: !590)
!579 = !{!580, !584, !588}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !578, file: !6, baseType: !581, size: 128, align: 64, extraData: i64 0)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !576, file: !6, size: 128, align: 64, elements: !582, templateParams: !18, identifier: "db0b97f002b1fae3dbc4ebdd853ff355")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !578, file: !6, baseType: !585, size: 128, align: 64, extraData: i64 1)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !576, file: !6, size: 128, align: 64, elements: !586, templateParams: !18, identifier: "49d2632f301eeedc951f3431bb382902")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !585, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !578, file: !6, baseType: !589, size: 128, align: 64, extraData: i64 2)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !576, file: !6, size: 128, align: 64, elements: !18, identifier: "afc023622f1fd60e7b29fd0e4f997a04")
!590 = !DIDerivedType(tag: DW_TAG_member, scope: !576, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !570, file: !6, baseType: !576, size: 128, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !562, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !556, file: !6, baseType: !594, size: 128, align: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !554, file: !6, size: 128, align: 64, elements: !595, templateParams: !560, identifier: "45eaeac90b0c2cad515177aa4ad012c0")
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !594, file: !6, baseType: !562, size: 128, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !540, file: !6, baseType: !599, size: 128, align: 64, offset: 256)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !600, templateParams: !18, identifier: "83fd9dd078f03ba333a6c21d9c3331b7")
!600 = !{!601, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !599, file: !6, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !599, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!540, !543, !599, !562, !606}
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !352, file: !6, align: 8, elements: !607, templateParams: !18, identifier: "4faa2d0373bebf10eea7ffc10aef50")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !606, file: !6, baseType: !67, align: 8)
!609 = !{!610, !611, !612, !613, !614}
!610 = !DILocalVariable(name: "pieces", arg: 1, scope: !539, file: !373, line: 444, type: !543)
!611 = !DILocalVariable(name: "args", arg: 2, scope: !539, file: !373, line: 445, type: !599)
!612 = !DILocalVariable(name: "fmt", arg: 3, scope: !539, file: !373, line: 446, type: !562)
!613 = !DILocalVariable(name: "_unsafe_arg", scope: !539, file: !373, line: 447, type: !606, align: 1)
!614 = !DILocalVariable(arg: 4, scope: !539, file: !373, line: 447, type: !606)
!615 = !DILocation(line: 447, column: 9, scope: !539)
!616 = !DILocation(line: 444, column: 9, scope: !539)
!617 = !DILocation(line: 445, column: 9, scope: !539)
!618 = !DILocation(line: 446, column: 9, scope: !539)
!619 = !DILocation(line: 449, column: 34, scope: !539)
!620 = !DILocation(line: 449, column: 9, scope: !539)
!621 = !{i64 8}
!622 = !DILocation(line: 450, column: 6, scope: !539)
!623 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h66f25d9658999536E", scope: !540, file: !373, line: 399, type: !624, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!540, !543}
!626 = !{!627}
!627 = !DILocalVariable(name: "pieces", arg: 1, scope: !623, file: !373, line: 399, type: !543)
!628 = !DILocation(line: 399, column: 28, scope: !623)
!629 = !DILocation(line: 400, column: 12, scope: !623)
!630 = !DILocation(line: 403, column: 34, scope: !623)
!631 = !DILocation(line: 403, column: 9, scope: !623)
!632 = !DILocation(line: 404, column: 6, scope: !623)
!633 = !DILocation(line: 401, column: 13, scope: !623)
!634 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h105e45d47c4a9f96E", scope: !636, file: !635, line: 250, type: !638, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !646, retainedNodes: !643)
!635 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!636 = !DINamespace(name: "FnOnce", scope: !637)
!637 = !DINamespace(name: "function", scope: !460)
!638 = !DISubroutineType(types: !639)
!639 = !{!153, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !641, size: 64, align: 64, dwarfAddressSpace: 0)
!641 = !DISubroutineType(types: !642)
!642 = !{!153}
!643 = !{!644, !645}
!644 = !DILocalVariable(arg: 1, scope: !634, file: !635, line: 250, type: !640)
!645 = !DILocalVariable(arg: 2, scope: !634, file: !635, line: 250, type: !67)
!646 = !{!647, !648}
!647 = !DITemplateTypeParameter(name: "Self", type: !640)
!648 = !DITemplateTypeParameter(name: "Args", type: !67)
!649 = !DILocation(line: 250, column: 5, scope: !634)
!650 = !DILocalVariable(name: "global_descriptor_table", scope: !651, file: !89, line: 26, type: !156, align: 8)
!651 = distinct !DILexicalBlock(scope: !652, file: !89, line: 26, column: 9)
!652 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hb3660f069be9e33dE", scope: !87, file: !80, line: 137, type: !641, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !653)
!653 = !{!650, !654, !656, !658, !660}
!654 = !DILocalVariable(name: "stack_start", scope: !655, file: !89, line: 31, type: !98, align: 8)
!655 = distinct !DILexicalBlock(scope: !651, file: !89, line: 31, column: 17)
!656 = !DILocalVariable(name: "stack_end", scope: !657, file: !89, line: 32, type: !98, align: 8)
!657 = distinct !DILexicalBlock(scope: !655, file: !89, line: 32, column: 17)
!658 = !DILocalVariable(name: "tss_selector", scope: !659, file: !89, line: 38, type: !168, align: 2)
!659 = distinct !DILexicalBlock(scope: !651, file: !89, line: 38, column: 9)
!660 = !DILocalVariable(name: "code_selector", scope: !661, file: !89, line: 39, type: !168, align: 2)
!661 = distinct !DILexicalBlock(scope: !659, file: !89, line: 39, column: 9)
!662 = !DILocation(line: 26, column: 13, scope: !651, inlinedAt: !663)
!663 = distinct !DILocation(line: 250, column: 5, scope: !634)
!664 = !DILocation(line: 26, column: 43, scope: !665, inlinedAt: !663)
!665 = !DILexicalBlockFile(scope: !652, file: !89, discriminator: 0)
!666 = !DILocation(line: 31, column: 35, scope: !651, inlinedAt: !663)
!667 = !DILocation(line: 31, column: 21, scope: !655, inlinedAt: !663)
!668 = !DILocation(line: 32, column: 33, scope: !655, inlinedAt: !663)
!669 = !DILocation(line: 32, column: 21, scope: !657, inlinedAt: !663)
!670 = !DILocation(line: 29, column: 13, scope: !651, inlinedAt: !663)
!671 = !DILocation(line: 38, column: 62, scope: !651, inlinedAt: !663)
!672 = !DILocation(line: 38, column: 28, scope: !651, inlinedAt: !663)
!673 = !DILocation(line: 38, column: 13, scope: !659, inlinedAt: !663)
!674 = !DILocation(line: 39, column: 63, scope: !659, inlinedAt: !663)
!675 = !DILocation(line: 39, column: 29, scope: !659, inlinedAt: !663)
!676 = !DILocation(line: 39, column: 13, scope: !661, inlinedAt: !663)
!677 = !DILocation(line: 41, column: 20, scope: !661, inlinedAt: !663)
!678 = !DILocation(line: 42, column: 24, scope: !661, inlinedAt: !663)
!679 = !DILocation(line: 40, column: 9, scope: !661, inlinedAt: !663)
!680 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17hb57844c33f76dca8E", scope: !682, file: !681, line: 490, type: !683, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !688, retainedNodes: !686)
!681 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "4b0ac29df94a7dc1bf2bc7efca5e253a")
!682 = !DINamespace(name: "ptr", scope: !17)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !{!687}
!687 = !DILocalVariable(arg: 1, scope: !680, file: !681, line: 490, type: !685)
!688 = !{!689}
!689 = !DITemplateTypeParameter(name: "T", type: !333)
!690 = !DILocation(line: 490, column: 1, scope: !680)
!691 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17h6a7526f3b077d738E", scope: !682, file: !681, line: 490, type: !692, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !697, retainedNodes: !695)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !{!696}
!696 = !DILocalVariable(arg: 1, scope: !691, file: !681, line: 490, type: !694)
!697 = !{!698}
!698 = !DITemplateTypeParameter(name: "T", type: !342)
!699 = !DILocation(line: 490, column: 1, scope: !691)
!700 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17hee23578b0b90aac0E", scope: !682, file: !681, line: 490, type: !701, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !711, retainedNodes: !709)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !704, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !705, templateParams: !18, identifier: "7a3d61ea348a2d26893c5fd74b61a8f6")
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !704, file: !6, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !704, file: !6, baseType: !333, size: 8, align: 8, offset: 64)
!709 = !{!710}
!710 = !DILocalVariable(arg: 1, scope: !700, file: !681, line: 490, type: !703)
!711 = !{!712}
!712 = !DITemplateTypeParameter(name: "T", type: !704)
!713 = !DILocation(line: 490, column: 1, scope: !700)
!714 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::InterruptDescriptorTable>", linkageName: "_ZN4core3ptr70drop_in_place$LT$x86_64..structures..idt..InterruptDescriptorTable$GT$17h36078f2de25d25ecE", scope: !682, file: !681, line: 490, type: !715, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !720, retainedNodes: !718)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !{!719}
!719 = !DILocalVariable(arg: 1, scope: !714, file: !681, line: 490, type: !717)
!720 = !{!721}
!721 = !DITemplateTypeParameter(name: "T", type: !190)
!722 = !DILocation(line: 490, column: 1, scope: !714)
!723 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17hc060ad52e0f0a588E", scope: !682, file: !681, line: 490, type: !724, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !738, retainedNodes: !736)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !727, size: 64, align: 64, dwarfAddressSpace: 0)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !728, templateParams: !73, identifier: "ea15963f2617b9f779e2485da0062a93")
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !727, file: !6, baseType: !730, size: 128, align: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !731, templateParams: !73, identifier: "d68a46f4c9d4cbdbc288d6af250d222a")
!731 = !{!732, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !730, file: !6, baseType: !733, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !730, file: !6, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!736 = !{!737}
!737 = !DILocalVariable(arg: 1, scope: !723, file: !681, line: 490, type: !726)
!738 = !{!739}
!739 = !DITemplateTypeParameter(name: "T", type: !727)
!740 = !DILocation(line: 490, column: 1, scope: !723)
!741 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h1ca5d01f7c36dbf6E", scope: !682, file: !681, line: 490, type: !742, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !747, retainedNodes: !745)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !730, size: 64, align: 64, dwarfAddressSpace: 0)
!745 = !{!746}
!746 = !DILocalVariable(arg: 1, scope: !741, file: !681, line: 490, type: !744)
!747 = !{!748}
!748 = !DITemplateTypeParameter(name: "T", type: !730)
!749 = !DILocation(line: 490, column: 1, scope: !741)
!750 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h0c1d23d053224625E", scope: !752, file: !751, line: 100, type: !753, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!751 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdccd67e2121209a433721fb94464813")
!752 = !DINamespace(name: "hint", scope: !17)
!753 = !DISubroutineType(types: !754)
!754 = !{null}
!755 = !DILocation(line: 104, column: 9, scope: !750)
!756 = !DILocation(line: 105, column: 9, scope: !750)
!757 = !DILocation(line: 2487, column: 21, scope: !758, inlinedAt: !761)
!758 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h37f6a194ad8174bbE", scope: !760, file: !759, line: 2484, type: !753, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!759 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a443bdaf0a09f89f5b2fb75aa981800")
!760 = !DINamespace(name: "unreachable_unchecked", scope: !752)
!761 = distinct !DILocation(line: 104, column: 9, scope: !750)
!762 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17h16b321a5c62164c2E", scope: !24, file: !763, line: 717, type: !764, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !781)
!763 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "cd92f8d8b05e6b3d85c324633916e8b5")
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !733, !333, !333, !358, !358}
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !378, file: !6, size: 16, align: 8, elements: !767, templateParams: !18, identifier: "d14742e3cdfbc45b2312623460910a60")
!767 = !{!768}
!768 = !DICompositeType(tag: DW_TAG_variant_part, scope: !766, file: !6, size: 16, align: 8, elements: !769, templateParams: !18, identifier: "2d16ff72bb19628f42a39c72eb930f", discriminator: !780)
!769 = !{!770, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !768, file: !6, baseType: !771, size: 16, align: 8, extraData: i64 0)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !766, file: !6, size: 16, align: 8, elements: !772, templateParams: !774, identifier: "e5915f6eed895eabe7f46af7d3b6ce96")
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !771, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!774 = !{!689, !775}
!775 = !DITemplateTypeParameter(name: "E", type: !333)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !768, file: !6, baseType: !777, size: 16, align: 8, extraData: i64 1)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !766, file: !6, size: 16, align: 8, elements: !778, templateParams: !774, identifier: "d9a4a300ea44b15355740d22673dbe8")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !777, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !766, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!781 = !{!782, !783, !784, !785, !786, !787, !789}
!782 = !DILocalVariable(name: "self", arg: 1, scope: !762, file: !763, line: 718, type: !733)
!783 = !DILocalVariable(name: "current", arg: 2, scope: !762, file: !763, line: 719, type: !333)
!784 = !DILocalVariable(name: "new", arg: 3, scope: !762, file: !763, line: 720, type: !333)
!785 = !DILocalVariable(name: "success", arg: 4, scope: !762, file: !763, line: 721, type: !358)
!786 = !DILocalVariable(name: "failure", arg: 5, scope: !762, file: !763, line: 722, type: !358)
!787 = !DILocalVariable(name: "x", scope: !788, file: !763, line: 728, type: !33, align: 1)
!788 = distinct !DILexicalBlock(scope: !762, file: !763, line: 728, column: 13)
!789 = !DILocalVariable(name: "x", scope: !790, file: !763, line: 729, type: !33, align: 1)
!790 = distinct !DILexicalBlock(scope: !762, file: !763, line: 729, column: 13)
!791 = !DILocation(line: 718, column: 9, scope: !762)
!792 = !DILocation(line: 719, column: 9, scope: !762)
!793 = !DILocation(line: 720, column: 9, scope: !762)
!794 = !DILocation(line: 721, column: 9, scope: !762)
!795 = !DILocation(line: 722, column: 9, scope: !762)
!796 = !DILocalVariable(name: "self", arg: 1, scope: !797, file: !798, line: 2054, type: !802)
!797 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h1dae7a47ef85f495E", scope: !29, file: !798, line: 2054, type: !799, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !803)
!798 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a756604d5b8adc8c373a79367d25e51")
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!803 = !{!796}
!804 = !DILocation(line: 2054, column: 22, scope: !797, inlinedAt: !805)
!805 = distinct !DILocation(line: 726, column: 42, scope: !762)
!806 = !DILocation(line: 726, column: 56, scope: !762)
!807 = !DILocation(line: 726, column: 71, scope: !762)
!808 = !DILocation(line: 726, column: 13, scope: !762)
!809 = !DILocation(line: 725, column: 15, scope: !762)
!810 = !{i8 0, i8 2}
!811 = !DILocation(line: 725, column: 9, scope: !762)
!812 = !DILocation(line: 728, column: 16, scope: !762)
!813 = !DILocation(line: 728, column: 16, scope: !788)
!814 = !DILocation(line: 728, column: 25, scope: !788)
!815 = !DILocation(line: 728, column: 22, scope: !788)
!816 = !DILocation(line: 728, column: 31, scope: !762)
!817 = !DILocation(line: 729, column: 17, scope: !762)
!818 = !DILocation(line: 729, column: 17, scope: !790)
!819 = !DILocation(line: 729, column: 27, scope: !790)
!820 = !DILocation(line: 729, column: 23, scope: !790)
!821 = !DILocation(line: 729, column: 33, scope: !762)
!822 = !DILocation(line: 731, column: 6, scope: !762)
!823 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17h30ea13e1dbce3c31E", scope: !24, file: !763, line: 497, type: !824, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!333, !733, !358}
!826 = !{!827, !828}
!827 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !763, line: 497, type: !733)
!828 = !DILocalVariable(name: "order", arg: 2, scope: !823, file: !763, line: 497, type: !358)
!829 = !DILocation(line: 497, column: 17, scope: !823)
!830 = !DILocation(line: 497, column: 24, scope: !823)
!831 = !DILocation(line: 2054, column: 22, scope: !797, inlinedAt: !832)
!832 = distinct !DILocation(line: 500, column: 30, scope: !823)
!833 = !DILocation(line: 500, column: 18, scope: !823)
!834 = !DILocation(line: 501, column: 6, scope: !823)
!835 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h47a008ef88fe0af6E", scope: !24, file: !763, line: 525, type: !836, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !733, !333, !358}
!838 = !{!839, !840, !841}
!839 = !DILocalVariable(name: "self", arg: 1, scope: !835, file: !763, line: 525, type: !733)
!840 = !DILocalVariable(name: "val", arg: 2, scope: !835, file: !763, line: 525, type: !333)
!841 = !DILocalVariable(name: "order", arg: 3, scope: !835, file: !763, line: 525, type: !358)
!842 = !DILocation(line: 525, column: 18, scope: !835)
!843 = !DILocation(line: 525, column: 25, scope: !835)
!844 = !DILocation(line: 525, column: 36, scope: !835)
!845 = !DILocation(line: 2054, column: 22, scope: !797, inlinedAt: !846)
!846 = distinct !DILocation(line: 529, column: 26, scope: !835)
!847 = !DILocation(line: 529, column: 40, scope: !835)
!848 = !DILocation(line: 529, column: 13, scope: !835)
!849 = !DILocation(line: 531, column: 6, scope: !835)
!850 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hc5d0800b4e1fdfecE", scope: !131, file: !763, line: 2375, type: !851, scopeLine: 2375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{!137, !707, !137, !137, !358}
!853 = !{!854, !855, !856, !857, !858, !860}
!854 = !DILocalVariable(name: "self", arg: 1, scope: !850, file: !763, line: 2375, type: !707)
!855 = !DILocalVariable(name: "current", arg: 2, scope: !850, file: !763, line: 2376, type: !137)
!856 = !DILocalVariable(name: "new", arg: 3, scope: !850, file: !763, line: 2377, type: !137)
!857 = !DILocalVariable(name: "order", arg: 4, scope: !850, file: !763, line: 2378, type: !358)
!858 = !DILocalVariable(name: "x", scope: !859, file: !763, line: 2383, type: !137, align: 8)
!859 = distinct !DILexicalBlock(scope: !850, file: !763, line: 2383, column: 21)
!860 = !DILocalVariable(name: "x", scope: !861, file: !763, line: 2384, type: !137, align: 8)
!861 = distinct !DILexicalBlock(scope: !850, file: !763, line: 2384, column: 21)
!862 = !DILocation(line: 2375, column: 37, scope: !850)
!863 = !DILocation(line: 2376, column: 37, scope: !850)
!864 = !DILocation(line: 2377, column: 37, scope: !850)
!865 = !DILocation(line: 2378, column: 37, scope: !850)
!866 = !DILocation(line: 2382, column: 45, scope: !850)
!867 = !{i8 0, i8 5}
!868 = !DILocation(line: 2379, column: 23, scope: !850)
!869 = !{i64 0, i64 2}
!870 = !DILocation(line: 2379, column: 17, scope: !850)
!871 = !DILocation(line: 2383, column: 24, scope: !850)
!872 = !DILocation(line: 2383, column: 24, scope: !859)
!873 = !DILocation(line: 2383, column: 30, scope: !859)
!874 = !DILocation(line: 2383, column: 30, scope: !850)
!875 = !DILocation(line: 2384, column: 25, scope: !850)
!876 = !DILocation(line: 2384, column: 25, scope: !861)
!877 = !DILocation(line: 2384, column: 31, scope: !861)
!878 = !DILocation(line: 2384, column: 31, scope: !850)
!879 = !DILocation(line: 2386, column: 14, scope: !850)
!880 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17he5633eeaf01b115dE", scope: !131, file: !763, line: 2429, type: !881, scopeLine: 2429, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !898)
!881 = !DISubroutineType(types: !882)
!882 = !{!883, !707, !137, !137, !358, !358}
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !378, file: !6, size: 128, align: 64, elements: !884, templateParams: !18, identifier: "565c6d9cdf8700eaf3f223f92f649dec")
!884 = !{!885}
!885 = !DICompositeType(tag: DW_TAG_variant_part, scope: !883, file: !6, size: 128, align: 64, elements: !886, templateParams: !18, identifier: "7184d1df8210091c7c039bdb64aedb2a", discriminator: !897)
!886 = !{!887, !893}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !885, file: !6, baseType: !888, size: 128, align: 64, extraData: i64 0)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !883, file: !6, size: 128, align: 64, elements: !889, templateParams: !891, identifier: "a0b77fff8010b746fe863a8fc42bcc7a")
!889 = !{!890}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !888, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!891 = !{!139, !892}
!892 = !DITemplateTypeParameter(name: "E", type: !137)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !885, file: !6, baseType: !894, size: 128, align: 64, extraData: i64 1)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !883, file: !6, size: 128, align: 64, elements: !895, templateParams: !891, identifier: "847c9cf2064844b16232bca7c7d2a4e")
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !894, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!898 = !{!899, !900, !901, !902, !903}
!899 = !DILocalVariable(name: "self", arg: 1, scope: !880, file: !763, line: 2429, type: !707)
!900 = !DILocalVariable(name: "current", arg: 2, scope: !880, file: !763, line: 2430, type: !137)
!901 = !DILocalVariable(name: "new", arg: 3, scope: !880, file: !763, line: 2431, type: !137)
!902 = !DILocalVariable(name: "success", arg: 4, scope: !880, file: !763, line: 2432, type: !358)
!903 = !DILocalVariable(name: "failure", arg: 5, scope: !880, file: !763, line: 2433, type: !358)
!904 = !DILocation(line: 2429, column: 37, scope: !880)
!905 = !DILocation(line: 2430, column: 37, scope: !880)
!906 = !DILocation(line: 2431, column: 37, scope: !880)
!907 = !DILocation(line: 2432, column: 37, scope: !880)
!908 = !DILocation(line: 2433, column: 37, scope: !880)
!909 = !DILocalVariable(name: "self", arg: 1, scope: !910, file: !798, line: 2054, type: !914)
!910 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17heed17663f91d50caE", scope: !134, file: !798, line: 2054, type: !911, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !915)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!915 = !{!909}
!916 = !DILocation(line: 2054, column: 22, scope: !910, inlinedAt: !917)
!917 = distinct !DILocation(line: 2435, column: 50, scope: !880)
!918 = !DILocation(line: 2435, column: 26, scope: !880)
!919 = !DILocation(line: 2436, column: 14, scope: !880)
!920 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h5a28a38a55695f7eE", scope: !131, file: !763, line: 2262, type: !921, scopeLine: 2262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{!137, !707, !358}
!923 = !{!924, !925}
!924 = !DILocalVariable(name: "self", arg: 1, scope: !920, file: !763, line: 2262, type: !707)
!925 = !DILocalVariable(name: "order", arg: 2, scope: !920, file: !763, line: 2262, type: !358)
!926 = !DILocation(line: 2262, column: 25, scope: !920)
!927 = !DILocation(line: 2262, column: 32, scope: !920)
!928 = !DILocation(line: 2054, column: 22, scope: !910, inlinedAt: !929)
!929 = distinct !DILocation(line: 2264, column: 38, scope: !920)
!930 = !DILocation(line: 2264, column: 26, scope: !920)
!931 = !DILocation(line: 2265, column: 14, scope: !920)
!932 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h1e54ea0473d1dc3aE", scope: !131, file: !763, line: 2289, type: !933, scopeLine: 2289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !707, !137, !358}
!935 = !{!936, !937, !938}
!936 = !DILocalVariable(name: "self", arg: 1, scope: !932, file: !763, line: 2289, type: !707)
!937 = !DILocalVariable(name: "val", arg: 2, scope: !932, file: !763, line: 2289, type: !137)
!938 = !DILocalVariable(name: "order", arg: 3, scope: !932, file: !763, line: 2289, type: !358)
!939 = !DILocation(line: 2289, column: 26, scope: !932)
!940 = !DILocation(line: 2289, column: 33, scope: !932)
!941 = !DILocation(line: 2289, column: 49, scope: !932)
!942 = !DILocation(line: 2054, column: 22, scope: !910, inlinedAt: !943)
!943 = distinct !DILocation(line: 2291, column: 39, scope: !932)
!944 = !DILocation(line: 2291, column: 26, scope: !932)
!945 = !DILocation(line: 2292, column: 14, scope: !932)
!946 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h672cd9eba4280658E", scope: !25, file: !763, line: 3626, type: !753, scopeLine: 3626, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!947 = !DILocation(line: 175, column: 18, scope: !948, inlinedAt: !949)
!948 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h3071c5bbd432a2dbE", scope: !752, file: !751, line: 165, type: !753, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!949 = distinct !DILocation(line: 3627, column: 5, scope: !946)
!950 = !DILocation(line: 3628, column: 2, scope: !946)
!951 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h951996a4a0bfd9b7E", scope: !25, file: !763, line: 3221, type: !952, scopeLine: 3221, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !954)
!952 = !DISubroutineType(types: !953)
!953 = !{!883, !913, !137, !137, !358, !358}
!954 = !{!955, !956, !957, !958, !959, !960, !962}
!955 = !DILocalVariable(name: "dst", arg: 1, scope: !951, file: !763, line: 3222, type: !913)
!956 = !DILocalVariable(name: "old", arg: 2, scope: !951, file: !763, line: 3223, type: !137)
!957 = !DILocalVariable(name: "new", arg: 3, scope: !951, file: !763, line: 3224, type: !137)
!958 = !DILocalVariable(name: "success", arg: 4, scope: !951, file: !763, line: 3225, type: !358)
!959 = !DILocalVariable(name: "failure", arg: 5, scope: !951, file: !763, line: 3226, type: !358)
!960 = !DILocalVariable(name: "val", scope: !961, file: !763, line: 3229, type: !137, align: 8)
!961 = distinct !DILexicalBlock(scope: !951, file: !763, line: 3229, column: 5)
!962 = !DILocalVariable(name: "ok", scope: !961, file: !763, line: 3229, type: !333, align: 1)
!963 = !DILocation(line: 3222, column: 5, scope: !951)
!964 = !DILocation(line: 3223, column: 5, scope: !951)
!965 = !DILocation(line: 3224, column: 5, scope: !951)
!966 = !DILocation(line: 3225, column: 5, scope: !951)
!967 = !DILocation(line: 3226, column: 5, scope: !951)
!968 = !DILocation(line: 3230, column: 15, scope: !951)
!969 = !DILocation(line: 3230, column: 9, scope: !951)
!970 = !DILocation(line: 3243, column: 34, scope: !951)
!971 = !DILocation(line: 3244, column: 34, scope: !951)
!972 = !DILocation(line: 3245, column: 33, scope: !951)
!973 = !DILocation(line: 3229, column: 10, scope: !951)
!974 = !DILocation(line: 3229, column: 10, scope: !961)
!975 = !DILocation(line: 3229, column: 15, scope: !951)
!976 = !DILocation(line: 3229, column: 15, scope: !961)
!977 = !DILocation(line: 3250, column: 8, scope: !961)
!978 = !DILocation(line: 3240, column: 34, scope: !951)
!979 = !DILocation(line: 3241, column: 34, scope: !951)
!980 = !DILocation(line: 3242, column: 33, scope: !951)
!981 = !DILocation(line: 3234, column: 35, scope: !951)
!982 = !DILocation(line: 3235, column: 35, scope: !951)
!983 = !DILocation(line: 3236, column: 34, scope: !951)
!984 = !DILocation(line: 3237, column: 35, scope: !951)
!985 = !DILocation(line: 3238, column: 35, scope: !951)
!986 = !DILocation(line: 3239, column: 34, scope: !951)
!987 = !DILocation(line: 3231, column: 35, scope: !951)
!988 = !DILocation(line: 3232, column: 35, scope: !951)
!989 = !DILocation(line: 3233, column: 34, scope: !951)
!990 = !DILocation(line: 3247, column: 29, scope: !951)
!991 = !DILocation(line: 3246, column: 28, scope: !951)
!992 = !DILocation(line: 3250, column: 30, scope: !961)
!993 = !DILocation(line: 3250, column: 5, scope: !961)
!994 = !DILocation(line: 3250, column: 13, scope: !961)
!995 = !DILocation(line: 3251, column: 2, scope: !951)
!996 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h00356692c6024835E", scope: !25, file: !763, line: 3128, type: !997, scopeLine: 3128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!358, !358}
!999 = !{!1000}
!1000 = !DILocalVariable(name: "order", arg: 1, scope: !996, file: !763, line: 3128, type: !358)
!1001 = !DILocation(line: 3128, column: 31, scope: !996)
!1002 = !DILocation(line: 3129, column: 11, scope: !996)
!1003 = !DILocation(line: 3129, column: 5, scope: !996)
!1004 = !DILocation(line: 3131, column: 20, scope: !996)
!1005 = !DILocation(line: 3130, column: 20, scope: !996)
!1006 = !DILocation(line: 3133, column: 20, scope: !996)
!1007 = !DILocation(line: 3134, column: 19, scope: !996)
!1008 = !DILocation(line: 3132, column: 19, scope: !996)
!1009 = !DILocation(line: 3136, column: 2, scope: !996)
!1010 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17hbaf99bd44237c9b3E", scope: !25, file: !763, line: 3256, type: !1011, scopeLine: 3256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !1028)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!1013, !801, !33, !33, !358, !358}
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !378, file: !6, size: 16, align: 8, elements: !1014, templateParams: !18, identifier: "ae4cf7aa557f9f218fcc885c973c6c6e")
!1014 = !{!1015}
!1015 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1013, file: !6, size: 16, align: 8, elements: !1016, templateParams: !18, identifier: "654017a428148ef5c2198bc9634aa127", discriminator: !1027)
!1016 = !{!1017, !1023}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !1015, file: !6, baseType: !1018, size: 16, align: 8, extraData: i64 0)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !1013, file: !6, size: 16, align: 8, elements: !1019, templateParams: !1021, identifier: "9f456b00bd188f849133b2646e479328")
!1019 = !{!1020}
