; ModuleID = '3z5y49vxoddmc8tf'
source_filename = "3z5y49vxoddmc8tf"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17he7e23d2117120c08E", scope: !2, file: !4, line: 161, type: !5, isLocal: false, isDefinition: true, align: 8)
!2 = !DINamespace(name: "global_descriptor_table", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !2, file: !6, align: 8, elements: !7, templateParams: !10, identifier: "b1f3370f85d4b312a09df09fbbff976f")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !5, file: !6, baseType: !9, align: 8)
!9 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!10 = !{}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17ha8f7e7904d560b6bE", scope: !13, file: !16, line: 27, type: !17, isLocal: true, isDefinition: true, align: 32)
!13 = !DINamespace(name: "__static_ref_initialize", scope: !14)
!14 = !DINamespace(name: "deref", scope: !15)
!15 = !DINamespace(name: "{impl#0}", scope: !2)
!16 = !DIFile(filename: "cpu_interrupts/src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !18, file: !6, size: 832, align: 32, elements: !21, templateParams: !10, identifier: "246e1d1a29a8c74cd6d990f91befd562")
!18 = !DINamespace(name: "tss", scope: !19)
!19 = !DINamespace(name: "structures", scope: !20)
!20 = !DINamespace(name: "x86_64", scope: null)
!21 = !{!22, !24, !33, !34, !38, !39, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !17, file: !6, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !17, file: !6, baseType: !25, size: 192, align: 64, offset: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 64, elements: !31)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !27, file: !6, size: 64, align: 64, elements: !28, templateParams: !10, identifier: "afe3d0f8912d8c5af15e54c0b0ea533b")
!27 = !DINamespace(name: "addr", scope: !20)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !26, file: !6, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 3, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !17, file: !6, baseType: !35, size: 448, align: 64, offset: 288)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, align: 64, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 7, lowerBound: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 736)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 800)
!40 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 816)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h481fed300c5d41e5E", scope: !13, file: !16, line: 30, type: !44, isLocal: true, isDefinition: true, align: 8)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 163840, align: 8, elements: !46)
!45 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!46 = !{!47}
!47 = !DISubrange(count: 20480, lowerBound: 0)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17haabd18d8e752a400E", scope: !50, file: !51, line: 29, type: !52, isLocal: true, isDefinition: true, align: 64)
!50 = !DINamespace(name: "__stability", scope: !14)
!51 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !53, file: !6, size: 768, align: 64, elements: !55, templateParams: !86, identifier: "a3d8bce26ed65f9c96b9a5f68aa9b94")
!53 = !DINamespace(name: "lazy", scope: !54)
!54 = !DINamespace(name: "lazy_static", scope: null)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !52, file: !6, baseType: !57, size: 768, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !58, file: !6, size: 768, align: 64, elements: !60, templateParams: !86, identifier: "bf7e3ca76c0c0927564f1a96f0cc2f16")
!58 = !DINamespace(name: "once", scope: !59)
!59 = !DINamespace(name: "spin", scope: null)
!60 = !{!61, !75}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !57, file: !6, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !63, file: !6, size: 64, align: 64, elements: !66, templateParams: !10, identifier: "e00fd022714aa819cef83a74a4523c4")
!63 = !DINamespace(name: "atomic", scope: !64)
!64 = !DINamespace(name: "sync", scope: !65)
!65 = !DINamespace(name: "core", scope: null)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !62, file: !6, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !69, file: !6, size: 64, align: 64, elements: !70, templateParams: !73, identifier: "8f2b43c3fe89fd793c6f616cb378bdef")
!69 = !DINamespace(name: "cell", scope: !65)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !6, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !6, baseType: !76, size: 704, align: 64, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !69, file: !6, size: 704, align: 64, elements: !77, templateParams: !114, identifier: "9dc0df22a7bcc37a44adedc71827ff25")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !6, baseType: !79, size: 704, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !80, file: !6, size: 704, align: 64, elements: !81, templateParams: !10, identifier: "3d2c879531d53e3433222a38757aeb49")
!80 = !DINamespace(name: "option", scope: !65)
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_variant_part, scope: !79, file: !6, size: 704, align: 64, elements: !83, templateParams: !10, identifier: "e9afc16259f0fb2b85acb3b6ccc6765d", discriminator: !113)
!83 = !{!84, !109}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !82, file: !6, baseType: !85, size: 704, align: 64, extraData: i64 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !79, file: !6, size: 704, align: 64, elements: !10, templateParams: !86, identifier: "284a469600a3b91f453cac2f869cf45")
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "T", type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !2, file: !6, size: 640, align: 64, elements: !89, templateParams: !10, identifier: "344dc0890ec68e49d066596983ca9c")
!89 = !{!90, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !88, file: !6, baseType: !91, size: 576, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !92, file: !6, size: 576, align: 64, elements: !93, templateParams: !10, identifier: "f192ac5866bf202015f728b16add077e")
!92 = !DINamespace(name: "gdt", scope: !19)
!93 = !{!94, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !91, file: !6, baseType: !95, size: 512, align: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 64, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 8, lowerBound: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, file: !6, baseType: !72, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !88, file: !6, baseType: !100, size: 32, align: 16, offset: 576)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !2, file: !6, size: 32, align: 16, elements: !101, templateParams: !10, identifier: "3d8f60182c4868df11c4ac6e599fab15")
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !100, file: !6, baseType: !103, size: 16, align: 16)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !104, file: !6, size: 16, align: 16, elements: !106, templateParams: !10, identifier: "8156139e62673a02db0f807cb9bc4c58")
!104 = !DINamespace(name: "segmentation", scope: !105)
!105 = !DINamespace(name: "registers", scope: !20)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !103, file: !6, baseType: !40, size: 16, align: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !100, file: !6, baseType: !103, size: 16, align: 16, offset: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !82, file: !6, baseType: !110, size: 704, align: 64, extraData: i64 1)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !79, file: !6, size: 704, align: 64, elements: !111, templateParams: !86, identifier: "72b62adb477ed3bc376b23a575cb13d1")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !110, file: !6, baseType: !88, size: 640, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, scope: !79, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !79)
!116 = !{i32 7, !"PIC Level", i32 2}
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !120, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !144, splitDebugInlining: false)
!120 = !DIFile(filename: "cpu_interrupts/src/lib.rs/@/3z5y49vxoddmc8tf", directory: "/Users/yaw/self/theo")
!121 = !{!122, !131, !138}
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !123, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !126)
!123 = !DINamespace(name: "v1", scope: !124)
!124 = !DINamespace(name: "rt", scope: !125)
!125 = !DINamespace(name: "fmt", scope: !65)
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !63, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!137 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !20, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !139)
!139 = !{!140, !141, !142, !143}
!140 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!143 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!144 = !{!0, !11, !42, !48}
!145 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h3c978b0fb1c7e21dE", scope: !147, file: !146, line: 237, type: !149, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !153)
!146 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!147 = !DINamespace(name: "{impl#2}", scope: !148)
!148 = !DINamespace(name: "bit_field", scope: null)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !151, !72, !152}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!153 = !{!154, !155, !156}
!154 = !DILocalVariable(name: "self", arg: 1, scope: !145, file: !146, line: 237, type: !151)
!155 = !DILocalVariable(name: "bit", arg: 2, scope: !145, file: !146, line: 237, type: !72)
!156 = !DILocalVariable(name: "value", arg: 3, scope: !145, file: !146, line: 237, type: !152)
!157 = !DILocation(line: 237, column: 24, scope: !145)
!158 = !DILocation(line: 237, column: 35, scope: !145)
!159 = !DILocation(line: 237, column: 47, scope: !145)
!160 = !DILocation(line: 238, column: 25, scope: !145)
!161 = !DILocation(line: 238, column: 17, scope: !145)
!162 = !DILocation(line: 240, column: 20, scope: !145)
!163 = !DILocation(line: 243, column: 31, scope: !145)
!164 = !DILocation(line: 241, column: 30, scope: !145)
!165 = !DILocation(line: 241, column: 21, scope: !145)
!166 = !DILocation(line: 240, column: 17, scope: !145)
!167 = !DILocation(line: 247, column: 14, scope: !145)
!168 = !DILocation(line: 243, column: 30, scope: !145)
!169 = !DILocation(line: 243, column: 21, scope: !145)
!170 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17hc3d169ef166ff76fE", scope: !147, file: !146, line: 250, type: !171, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !189, retainedNodes: !181)
!171 = !DISubroutineType(types: !172)
!172 = !{!151, !151, !173, !40}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !174, file: !6, size: 128, align: 64, elements: !176, templateParams: !179, identifier: "a38539fb613303b2a542584743e0908e")
!174 = !DINamespace(name: "range", scope: !175)
!175 = !DINamespace(name: "ops", scope: !65)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !173, file: !6, baseType: !72, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !173, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "Idx", type: !72)
!181 = !{!182, !183, !184, !185, !187}
!182 = !DILocalVariable(name: "self", arg: 1, scope: !170, file: !146, line: 250, type: !151)
!183 = !DILocalVariable(name: "range", arg: 2, scope: !170, file: !146, line: 250, type: !173)
!184 = !DILocalVariable(name: "value", arg: 3, scope: !170, file: !146, line: 250, type: !40)
!185 = !DILocalVariable(name: "range", scope: !186, file: !146, line: 251, type: !173, align: 8)
!186 = distinct !DILexicalBlock(scope: !170, file: !146, line: 251, column: 17)
!187 = !DILocalVariable(name: "bitmask", scope: !188, file: !146, line: 260, type: !40, align: 2)
!188 = distinct !DILexicalBlock(scope: !186, file: !146, line: 260, column: 17)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "T", type: !173)
!191 = !DILocation(line: 250, column: 48, scope: !170)
!192 = !DILocation(line: 250, column: 59, scope: !170)
!193 = !DILocation(line: 250, column: 69, scope: !170)
!194 = !DILocation(line: 251, column: 29, scope: !170)
!195 = !DILocation(line: 251, column: 21, scope: !186)
!196 = !DILocation(line: 253, column: 25, scope: !186)
!197 = !DILocation(line: 253, column: 17, scope: !186)
!198 = !DILocation(line: 254, column: 25, scope: !186)
!199 = !DILocation(line: 254, column: 17, scope: !186)
!200 = !DILocation(line: 255, column: 25, scope: !186)
!201 = !DILocation(line: 255, column: 17, scope: !186)
!202 = !DILocation(line: 256, column: 54, scope: !186)
!203 = !DILocation(line: 256, column: 34, scope: !186)
!204 = !DILocation(line: 256, column: 25, scope: !186)
!205 = !DILocation(line: 257, column: 45, scope: !186)
!206 = !DILocation(line: 257, column: 25, scope: !186)
!207 = !DILocation(line: 256, column: 17, scope: !186)
!208 = !DILocation(line: 260, column: 45, scope: !186)
!209 = !DILocation(line: 260, column: 39, scope: !186)
!210 = !DILocation(line: 261, column: 37, scope: !186)
!211 = !DILocation(line: 260, column: 38, scope: !186)
!212 = !DILocation(line: 260, column: 37, scope: !186)
!213 = !DILocation(line: 260, column: 21, scope: !188)
!214 = !DILocation(line: 265, column: 26, scope: !188)
!215 = !DILocation(line: 265, column: 25, scope: !188)
!216 = !DILocation(line: 265, column: 45, scope: !188)
!217 = !DILocation(line: 265, column: 17, scope: !188)
!218 = !DILocation(line: 268, column: 14, scope: !170)
!219 = distinct !DISubprogram(name: "new<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV13new17h3f2c2d0550327182E", scope: !221, file: !220, line: 340, type: !278, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !298, retainedNodes: !295)
!220 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !125, file: !6, size: 128, align: 64, elements: !222, templateParams: !10, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !221, file: !6, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !226, file: !6, align: 8, elements: !10, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!226 = !DINamespace(name: "{extern#0}", scope: !125)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !221, file: !6, baseType: !228, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !229, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !224, !249}
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !232, file: !6, size: 8, align: 8, elements: !233, templateParams: !10, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!232 = !DINamespace(name: "result", scope: !65)
!233 = !{!234}
!234 = !DICompositeType(tag: DW_TAG_variant_part, scope: !231, file: !6, size: 8, align: 8, elements: !235, templateParams: !10, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !248)
!235 = !{!236, !244}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !234, file: !6, baseType: !237, size: 8, align: 8, extraData: i64 0)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !231, file: !6, size: 8, align: 8, elements: !238, templateParams: !240, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !237, file: !6, baseType: !9, align: 8, offset: 8)
!240 = !{!241, !242}
!241 = !DITemplateTypeParameter(name: "T", type: !9)
!242 = !DITemplateTypeParameter(name: "E", type: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !125, file: !6, align: 8, elements: !10, identifier: "c2c8f2f945c37359aa57422093183824")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !234, file: !6, baseType: !245, size: 8, align: 8, extraData: i64 1)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !231, file: !6, size: 8, align: 8, elements: !246, templateParams: !240, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !6, baseType: !243, align: 8, offset: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, scope: !231, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagArtificial)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !250, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !125, file: !6, size: 512, align: 64, elements: !251, templateParams: !10, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!251 = !{!252, !253, !255, !256, !268, !269}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !250, file: !6, baseType: !23, size: 32, align: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !250, file: !6, baseType: !254, size: 32, align: 32, offset: 416)
!254 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !250, file: !6, baseType: !122, size: 8, align: 8, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !250, file: !6, baseType: !257, size: 128, align: 64, offset: 128)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !80, file: !6, size: 128, align: 64, elements: !258, templateParams: !10, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!258 = !{!259}
!259 = !DICompositeType(tag: DW_TAG_variant_part, scope: !257, file: !6, size: 128, align: 64, elements: !260, templateParams: !10, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !267)
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !259, file: !6, baseType: !262, size: 128, align: 64, extraData: i64 0)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !257, file: !6, size: 128, align: 64, elements: !10, templateParams: !73, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !259, file: !6, baseType: !264, size: 128, align: 64, extraData: i64 1)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !257, file: !6, size: 128, align: 64, elements: !265, templateParams: !73, identifier: "eec942390a307d7c8c2162b2092f63f3")
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !264, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !250, file: !6, baseType: !257, size: 128, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !6, baseType: !270, size: 128, align: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !271, templateParams: !10, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !270, file: !6, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !10, identifier: "bb744bac75d5d19249a16512e8e296c")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !270, file: !6, baseType: !276, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, align: 64, elements: !31)
!278 = !DISubroutineType(types: !279)
!279 = !{!221, !280, !292}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::InterruptStackFrame", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !282, file: !6, size: 320, align: 64, elements: !283, templateParams: !10, identifier: "6007e2919f59c7becb9943d0a87acc59")
!282 = !DINamespace(name: "idt", scope: !19)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !6, baseType: !285, size: 320, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !282, file: !6, size: 320, align: 64, elements: !286, templateParams: !10, identifier: "e9e6f8d6601e2a53522357f02d2149ab")
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !285, file: !6, baseType: !26, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !285, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !285, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !285, file: !6, baseType: !26, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !285, file: !6, baseType: !30, size: 64, align: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&x86_64::structures::idt::InterruptStackFrame, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !293, size: 64, align: 64, dwarfAddressSpace: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{!231, !280, !249}
!295 = !{!296, !297}
!296 = !DILocalVariable(name: "x", arg: 1, scope: !219, file: !220, line: 340, type: !280)
!297 = !DILocalVariable(name: "f", arg: 2, scope: !219, file: !220, line: 340, type: !292)
!298 = !{!299}
!299 = !DITemplateTypeParameter(name: "T", type: !281)
!300 = !DILocation(line: 340, column: 23, scope: !219)
!301 = !DILocation(line: 340, column: 33, scope: !219)
!302 = !DILocation(line: 349, column: 42, scope: !219)
!303 = !DILocation(line: 349, column: 68, scope: !219)
!304 = !{i64 1}
!305 = !DILocation(line: 349, column: 18, scope: !219)
!306 = !DILocation(line: 350, column: 6, scope: !219)
!307 = distinct !DISubprogram(name: "new_debug<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17heb96befbdf026fd2E", scope: !221, file: !220, line: 329, type: !308, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !298, retainedNodes: !310)
!308 = !DISubroutineType(types: !309)
!309 = !{!221, !280}
!310 = !{!311}
!311 = !DILocalVariable(name: "x", arg: 1, scope: !307, file: !220, line: 329, type: !280)
!312 = !DILocation(line: 329, column: 30, scope: !307)
!313 = !DILocation(line: 330, column: 13, scope: !307)
!314 = !DILocation(line: 331, column: 10, scope: !307)
!315 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h335eac4105b4b058E", scope: !316, file: !220, line: 421, type: !380, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !385)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !125, file: !6, size: 384, align: 64, elements: !317, templateParams: !10, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!317 = !{!318, !329, !374}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !316, file: !6, baseType: !319, size: 128, align: 64, offset: 128)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !320, templateParams: !10, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!320 = !{!321, !328}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !319, file: !6, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !324, templateParams: !10, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !323, file: !6, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !323, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !319, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !316, file: !6, baseType: !330, size: 128, align: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !80, file: !6, size: 128, align: 64, elements: !331, templateParams: !10, identifier: "37e4e944ba32344d635147f54bf9f4df")
!331 = !{!332}
!332 = !DICompositeType(tag: DW_TAG_variant_part, scope: !330, file: !6, size: 128, align: 64, elements: !333, templateParams: !10, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !373)
!333 = !{!334, !369}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !332, file: !6, baseType: !335, size: 128, align: 64, extraData: i64 0)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !330, file: !6, size: 128, align: 64, elements: !10, templateParams: !336, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!336 = !{!337}
!337 = !DITemplateTypeParameter(name: "T", type: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !339, templateParams: !10, identifier: "2225a8a3217ca2e4230086a86939d931")
!339 = !{!340, !368}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !338, file: !6, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !123, file: !6, size: 448, align: 64, elements: !343, templateParams: !10, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !342, file: !6, baseType: !72, size: 64, align: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !342, file: !6, baseType: !346, size: 384, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !123, file: !6, size: 384, align: 64, elements: !347, templateParams: !10, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!347 = !{!348, !349, !350, !351, !367}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !346, file: !6, baseType: !254, size: 32, align: 32, offset: 288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !346, file: !6, baseType: !122, size: 8, align: 8, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !6, baseType: !23, size: 32, align: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !346, file: !6, baseType: !352, size: 128, align: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !123, file: !6, size: 128, align: 64, elements: !353, templateParams: !10, identifier: "32660758978696a09244873a5d6fbb61")
!353 = !{!354}
!354 = !DICompositeType(tag: DW_TAG_variant_part, scope: !352, file: !6, size: 128, align: 64, elements: !355, templateParams: !10, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !366)
!355 = !{!356, !360, !364}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !354, file: !6, baseType: !357, size: 128, align: 64, extraData: i64 0)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !352, file: !6, size: 128, align: 64, elements: !358, templateParams: !10, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !357, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !354, file: !6, baseType: !361, size: 128, align: 64, extraData: i64 1)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !352, file: !6, size: 128, align: 64, elements: !362, templateParams: !10, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !361, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !354, file: !6, baseType: !365, size: 128, align: 64, extraData: i64 2)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !352, file: !6, size: 128, align: 64, elements: !10, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !346, file: !6, baseType: !352, size: 128, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !338, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !332, file: !6, baseType: !370, size: 128, align: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !330, file: !6, size: 128, align: 64, elements: !371, templateParams: !336, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !370, file: !6, baseType: !338, size: 128, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !330, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !316, file: !6, baseType: !375, size: 128, align: 64, offset: 256)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !376, templateParams: !10, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !375, file: !6, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64, dwarfAddressSpace: 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !375, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!316, !319, !375, !338, !382}
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !125, file: !6, align: 8, elements: !383, templateParams: !10, identifier: "9da388efda58098f3ebab1da42679df")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !382, file: !6, baseType: !9, align: 8)
!385 = !{!386, !387, !388, !389}
!386 = !DILocalVariable(name: "pieces", arg: 1, scope: !315, file: !220, line: 422, type: !319)
!387 = !DILocalVariable(name: "args", arg: 2, scope: !315, file: !220, line: 423, type: !375)
!388 = !DILocalVariable(name: "fmt", arg: 3, scope: !315, file: !220, line: 424, type: !338)
!389 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !315, file: !220, line: 425, type: !382)
!390 = !DILocation(line: 422, column: 9, scope: !315)
!391 = !DILocation(line: 423, column: 9, scope: !315)
!392 = !DILocation(line: 424, column: 9, scope: !315)
!393 = !DILocation(line: 425, column: 9, scope: !315)
!394 = !DILocation(line: 427, column: 34, scope: !315)
!395 = !DILocation(line: 427, column: 9, scope: !315)
!396 = !{i64 8}
!397 = !DILocation(line: 428, column: 6, scope: !315)
!398 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hce9bc4be31d390b3E", scope: !316, file: !220, line: 401, type: !399, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!316, !319, !375}
!401 = !{!402, !403}
!402 = !DILocalVariable(name: "pieces", arg: 1, scope: !398, file: !220, line: 401, type: !319)
!403 = !DILocalVariable(name: "args", arg: 2, scope: !398, file: !220, line: 401, type: !375)
!404 = !DILocation(line: 401, column: 25, scope: !398)
!405 = !DILocation(line: 401, column: 53, scope: !398)
!406 = !DILocation(line: 402, column: 12, scope: !398)
!407 = !DILocation(line: 402, column: 56, scope: !398)
!408 = !{i8 0, i8 2}
!409 = !DILocation(line: 402, column: 41, scope: !398)
!410 = !DILocation(line: 405, column: 34, scope: !398)
!411 = !DILocation(line: 405, column: 9, scope: !398)
!412 = !DILocation(line: 406, column: 6, scope: !398)
!413 = !DILocation(line: 403, column: 13, scope: !398)
!414 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h21747a7155dba549E", scope: !416, file: !415, line: 250, type: !418, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !426, retainedNodes: !423)
!415 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!416 = !DINamespace(name: "FnOnce", scope: !417)
!417 = !DINamespace(name: "function", scope: !175)
!418 = !DISubroutineType(types: !419)
!419 = !{!88, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !421, size: 64, align: 64, dwarfAddressSpace: 0)
!421 = !DISubroutineType(types: !422)
!422 = !{!88}
!423 = !{!424, !425}
!424 = !DILocalVariable(arg: 1, scope: !414, file: !415, line: 250, type: !420)
!425 = !DILocalVariable(arg: 2, scope: !414, file: !415, line: 250, type: !9)
!426 = !{!427, !428}
!427 = !DITemplateTypeParameter(name: "Self", type: !420)
!428 = !DITemplateTypeParameter(name: "Args", type: !9)
!429 = !DILocation(line: 250, column: 5, scope: !414)
!430 = !DILocalVariable(name: "global_descriptor_table", scope: !431, file: !16, line: 26, type: !91, align: 8)
!431 = distinct !DILexicalBlock(scope: !432, file: !16, line: 26, column: 9)
!432 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h65b97960c600f43eE", scope: !14, file: !4, line: 137, type: !421, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !433)
!433 = !{!430, !434, !436, !438, !440}
!434 = !DILocalVariable(name: "stack_start", scope: !435, file: !16, line: 31, type: !26, align: 8)
!435 = distinct !DILexicalBlock(scope: !431, file: !16, line: 31, column: 17)
!436 = !DILocalVariable(name: "stack_end", scope: !437, file: !16, line: 32, type: !26, align: 8)
!437 = distinct !DILexicalBlock(scope: !435, file: !16, line: 32, column: 17)
!438 = !DILocalVariable(name: "tss_selector", scope: !439, file: !16, line: 38, type: !103, align: 2)
!439 = distinct !DILexicalBlock(scope: !431, file: !16, line: 38, column: 9)
!440 = !DILocalVariable(name: "code_selector", scope: !441, file: !16, line: 39, type: !103, align: 2)
!441 = distinct !DILexicalBlock(scope: !439, file: !16, line: 39, column: 9)
!442 = !DILocation(line: 26, column: 13, scope: !431, inlinedAt: !443)
!443 = distinct !DILocation(line: 250, column: 5, scope: !414)
!444 = !DILocation(line: 26, column: 43, scope: !445, inlinedAt: !443)
!445 = !DILexicalBlockFile(scope: !432, file: !16, discriminator: 0)
!446 = !DILocation(line: 31, column: 35, scope: !431, inlinedAt: !443)
!447 = !DILocation(line: 31, column: 21, scope: !435, inlinedAt: !443)
!448 = !DILocation(line: 32, column: 33, scope: !435, inlinedAt: !443)
!449 = !DILocation(line: 32, column: 21, scope: !437, inlinedAt: !443)
!450 = !DILocation(line: 29, column: 13, scope: !431, inlinedAt: !443)
!451 = !DILocation(line: 38, column: 62, scope: !431, inlinedAt: !443)
!452 = !DILocation(line: 38, column: 28, scope: !431, inlinedAt: !443)
!453 = !DILocation(line: 38, column: 13, scope: !439, inlinedAt: !443)
!454 = !DILocation(line: 39, column: 63, scope: !439, inlinedAt: !443)
!455 = !DILocation(line: 39, column: 29, scope: !439, inlinedAt: !443)
!456 = !DILocation(line: 39, column: 13, scope: !441, inlinedAt: !443)
!457 = !DILocation(line: 41, column: 20, scope: !441, inlinedAt: !443)
!458 = !DILocation(line: 42, column: 24, scope: !441, inlinedAt: !443)
!459 = !DILocation(line: 40, column: 9, scope: !441, inlinedAt: !443)
!460 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17hf1128a77d20865ecE", scope: !462, file: !461, line: 490, type: !463, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !473, retainedNodes: !471)
!461 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!462 = !DINamespace(name: "ptr", scope: !65)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !58, file: !6, size: 128, align: 64, elements: !467, templateParams: !10, identifier: "a416b89de55d44d62da3644dba97a7fc")
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !466, file: !6, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !466, file: !6, baseType: !152, size: 8, align: 8, offset: 64)
!471 = !{!472}
!472 = !DILocalVariable(arg: 1, scope: !460, file: !461, line: 490, type: !465)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !466)
!475 = !DILocation(line: 490, column: 1, scope: !460)
!476 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h56ad6ffd98f196daE", scope: !478, file: !477, line: 100, type: !479, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!477 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c5ec66aac3b7b220f0974f6b880e36c")
!478 = !DINamespace(name: "hint", scope: !65)
!479 = !DISubroutineType(types: !480)
!480 = !{null}
!481 = !DILocation(line: 2244, column: 21, scope: !482, inlinedAt: !485)
!482 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h305e73259a5d2adcE", scope: !484, file: !483, line: 2241, type: !479, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!483 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!484 = !DINamespace(name: "unreachable_unchecked", scope: !478)
!485 = distinct !DILocation(line: 104, column: 9, scope: !476)
!486 = !DILocation(line: 105, column: 9, scope: !476)
!487 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h2eaf79969b08437fE", scope: !62, file: !488, line: 2374, type: !489, scopeLine: 2374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !491)
!488 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece39eca309c3b2a21b91ed3770bad24")
!489 = !DISubroutineType(types: !490)
!490 = !{!72, !469, !72, !72, !131}
!491 = !{!492, !493, !494, !495, !496, !498}
!492 = !DILocalVariable(name: "self", arg: 1, scope: !487, file: !488, line: 2374, type: !469)
!493 = !DILocalVariable(name: "current", arg: 2, scope: !487, file: !488, line: 2375, type: !72)
!494 = !DILocalVariable(name: "new", arg: 3, scope: !487, file: !488, line: 2376, type: !72)
!495 = !DILocalVariable(name: "order", arg: 4, scope: !487, file: !488, line: 2377, type: !131)
!496 = !DILocalVariable(name: "x", scope: !497, file: !488, line: 2382, type: !72, align: 8)
!497 = distinct !DILexicalBlock(scope: !487, file: !488, line: 2382, column: 21)
!498 = !DILocalVariable(name: "x", scope: !499, file: !488, line: 2383, type: !72, align: 8)
!499 = distinct !DILexicalBlock(scope: !487, file: !488, line: 2383, column: 21)
!500 = !DILocation(line: 2374, column: 37, scope: !487)
!501 = !DILocation(line: 2375, column: 37, scope: !487)
!502 = !DILocation(line: 2376, column: 37, scope: !487)
!503 = !DILocation(line: 2377, column: 37, scope: !487)
!504 = !DILocation(line: 2381, column: 45, scope: !487)
!505 = !{i8 0, i8 5}
!506 = !DILocation(line: 2378, column: 23, scope: !487)
!507 = !{i64 0, i64 2}
!508 = !DILocation(line: 2378, column: 17, scope: !487)
!509 = !DILocation(line: 2382, column: 24, scope: !487)
!510 = !DILocation(line: 2382, column: 24, scope: !497)
!511 = !DILocation(line: 2382, column: 30, scope: !497)
!512 = !DILocation(line: 2382, column: 30, scope: !487)
!513 = !DILocation(line: 2383, column: 25, scope: !487)
!514 = !DILocation(line: 2383, column: 25, scope: !499)
!515 = !DILocation(line: 2383, column: 31, scope: !499)
!516 = !DILocation(line: 2383, column: 31, scope: !487)
!517 = !DILocation(line: 2385, column: 14, scope: !487)
!518 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17hf7626177cd164056E", scope: !62, file: !488, line: 2428, type: !519, scopeLine: 2428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !536)
!519 = !DISubroutineType(types: !520)
!520 = !{!521, !469, !72, !72, !131, !131}
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !232, file: !6, size: 128, align: 64, elements: !522, templateParams: !10, identifier: "5579df6104a82f0c746794ad7f2aed62")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_variant_part, scope: !521, file: !6, size: 128, align: 64, elements: !524, templateParams: !10, identifier: "7e508de376a90f54f3fcef7824c806a6", discriminator: !535)
!524 = !{!525, !531}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !523, file: !6, baseType: !526, size: 128, align: 64, extraData: i64 0)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !521, file: !6, size: 128, align: 64, elements: !527, templateParams: !529, identifier: "aca05aa4b9341eadc3e13899788bdf69")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!529 = !{!74, !530}
!530 = !DITemplateTypeParameter(name: "E", type: !72)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !523, file: !6, baseType: !532, size: 128, align: 64, extraData: i64 1)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !521, file: !6, size: 128, align: 64, elements: !533, templateParams: !529, identifier: "70e806ef3110231932692cff225e8728")
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !532, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !521, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!536 = !{!537, !538, !539, !540, !541}
!537 = !DILocalVariable(name: "self", arg: 1, scope: !518, file: !488, line: 2428, type: !469)
!538 = !DILocalVariable(name: "current", arg: 2, scope: !518, file: !488, line: 2429, type: !72)
!539 = !DILocalVariable(name: "new", arg: 3, scope: !518, file: !488, line: 2430, type: !72)
!540 = !DILocalVariable(name: "success", arg: 4, scope: !518, file: !488, line: 2431, type: !131)
!541 = !DILocalVariable(name: "failure", arg: 5, scope: !518, file: !488, line: 2432, type: !131)
!542 = !DILocation(line: 2428, column: 37, scope: !518)
!543 = !DILocation(line: 2429, column: 37, scope: !518)
!544 = !DILocation(line: 2430, column: 37, scope: !518)
!545 = !DILocation(line: 2431, column: 37, scope: !518)
!546 = !DILocation(line: 2432, column: 37, scope: !518)
!547 = !DILocalVariable(name: "self", arg: 1, scope: !548, file: !549, line: 2005, type: !553)
!548 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h4552ff02931e90daE", scope: !68, file: !549, line: 2005, type: !550, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !73, retainedNodes: !554)
!549 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "533ae9b9d5d15fd7608d43889fd78bf4")
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !{!547}
!555 = !DILocation(line: 2005, column: 22, scope: !548, inlinedAt: !556)
!556 = distinct !DILocation(line: 2434, column: 50, scope: !518)
!557 = !DILocation(line: 2434, column: 26, scope: !518)
!558 = !DILocation(line: 2435, column: 14, scope: !518)
!559 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hcf9be0ab27f25773E", scope: !62, file: !488, line: 2261, type: !560, scopeLine: 2261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{!72, !469, !131}
!562 = !{!563, !564}
!563 = !DILocalVariable(name: "self", arg: 1, scope: !559, file: !488, line: 2261, type: !469)
!564 = !DILocalVariable(name: "order", arg: 2, scope: !559, file: !488, line: 2261, type: !131)
!565 = !DILocation(line: 2261, column: 25, scope: !559)
!566 = !DILocation(line: 2261, column: 32, scope: !559)
!567 = !DILocation(line: 2005, column: 22, scope: !548, inlinedAt: !568)
!568 = distinct !DILocation(line: 2263, column: 38, scope: !559)
!569 = !DILocation(line: 2263, column: 26, scope: !559)
!570 = !DILocation(line: 2264, column: 14, scope: !559)
!571 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h084a3aae52e58dadE", scope: !62, file: !488, line: 2288, type: !572, scopeLine: 2288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !469, !72, !131}
!574 = !{!575, !576, !577}
!575 = !DILocalVariable(name: "self", arg: 1, scope: !571, file: !488, line: 2288, type: !469)
!576 = !DILocalVariable(name: "val", arg: 2, scope: !571, file: !488, line: 2288, type: !72)
!577 = !DILocalVariable(name: "order", arg: 3, scope: !571, file: !488, line: 2288, type: !131)
!578 = !DILocation(line: 2288, column: 26, scope: !571)
!579 = !DILocation(line: 2288, column: 33, scope: !571)
!580 = !DILocation(line: 2288, column: 49, scope: !571)
!581 = !DILocation(line: 2005, column: 22, scope: !548, inlinedAt: !582)
!582 = distinct !DILocation(line: 2290, column: 39, scope: !571)
!583 = !DILocation(line: 2290, column: 26, scope: !571)
!584 = !DILocation(line: 2291, column: 14, scope: !571)
!585 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h2aaa1f29e927c4b8E", scope: !63, file: !488, line: 3640, type: !479, scopeLine: 3640, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!586 = !DILocation(line: 175, column: 18, scope: !587, inlinedAt: !588)
!587 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17he5fd86094f85d608E", scope: !478, file: !477, line: 165, type: !479, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!588 = distinct !DILocation(line: 3641, column: 5, scope: !585)
!589 = !DILocation(line: 3642, column: 2, scope: !585)
!590 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h5d4d5c14e5d962f5E", scope: !63, file: !488, line: 3226, type: !591, scopeLine: 3226, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !73, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{!521, !552, !72, !72, !131, !131}
!593 = !{!594, !595, !596, !597, !598, !599, !601}
!594 = !DILocalVariable(name: "dst", arg: 1, scope: !590, file: !488, line: 3227, type: !552)
!595 = !DILocalVariable(name: "old", arg: 2, scope: !590, file: !488, line: 3228, type: !72)
!596 = !DILocalVariable(name: "new", arg: 3, scope: !590, file: !488, line: 3229, type: !72)
!597 = !DILocalVariable(name: "success", arg: 4, scope: !590, file: !488, line: 3230, type: !131)
!598 = !DILocalVariable(name: "failure", arg: 5, scope: !590, file: !488, line: 3231, type: !131)
!599 = !DILocalVariable(name: "val", scope: !600, file: !488, line: 3234, type: !72, align: 8)
!600 = distinct !DILexicalBlock(scope: !590, file: !488, line: 3234, column: 5)
!601 = !DILocalVariable(name: "ok", scope: !600, file: !488, line: 3234, type: !152, align: 1)
!602 = !DILocation(line: 3227, column: 5, scope: !590)
!603 = !DILocation(line: 3228, column: 5, scope: !590)
!604 = !DILocation(line: 3229, column: 5, scope: !590)
!605 = !DILocation(line: 3230, column: 5, scope: !590)
!606 = !DILocation(line: 3231, column: 5, scope: !590)
!607 = !DILocation(line: 3235, column: 15, scope: !590)
!608 = !DILocation(line: 3235, column: 9, scope: !590)
!609 = !DILocation(line: 3248, column: 34, scope: !590)
!610 = !DILocation(line: 3249, column: 34, scope: !590)
!611 = !DILocation(line: 3250, column: 33, scope: !590)
!612 = !DILocation(line: 3234, column: 10, scope: !590)
!613 = !DILocation(line: 3234, column: 10, scope: !600)
!614 = !DILocation(line: 3234, column: 15, scope: !590)
!615 = !DILocation(line: 3234, column: 15, scope: !600)
!616 = !DILocation(line: 3255, column: 8, scope: !600)
!617 = !DILocation(line: 3245, column: 34, scope: !590)
!618 = !DILocation(line: 3246, column: 34, scope: !590)
!619 = !DILocation(line: 3247, column: 33, scope: !590)
!620 = !DILocation(line: 3239, column: 35, scope: !590)
!621 = !DILocation(line: 3240, column: 35, scope: !590)
!622 = !DILocation(line: 3241, column: 34, scope: !590)
!623 = !DILocation(line: 3242, column: 35, scope: !590)
!624 = !DILocation(line: 3243, column: 35, scope: !590)
!625 = !DILocation(line: 3244, column: 34, scope: !590)
!626 = !DILocation(line: 3236, column: 35, scope: !590)
!627 = !DILocation(line: 3237, column: 35, scope: !590)
!628 = !DILocation(line: 3238, column: 34, scope: !590)
!629 = !DILocation(line: 3252, column: 29, scope: !590)
!630 = !DILocation(line: 3251, column: 28, scope: !590)
!631 = !DILocation(line: 3255, column: 30, scope: !600)
!632 = !DILocation(line: 3255, column: 5, scope: !600)
!633 = !DILocation(line: 3255, column: 13, scope: !600)
!634 = !DILocation(line: 3256, column: 2, scope: !590)
!635 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17hcd1d801f38249ea6E", scope: !63, file: !488, line: 3129, type: !636, scopeLine: 3129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!131, !131}
!638 = !{!639}
!639 = !DILocalVariable(name: "order", arg: 1, scope: !635, file: !488, line: 3129, type: !131)
!640 = !DILocation(line: 3129, column: 31, scope: !635)
!641 = !DILocation(line: 3130, column: 11, scope: !635)
!642 = !DILocation(line: 3130, column: 5, scope: !635)
!643 = !DILocation(line: 3132, column: 20, scope: !635)
!644 = !DILocation(line: 3131, column: 20, scope: !635)
!645 = !DILocation(line: 3134, column: 20, scope: !635)
!646 = !DILocation(line: 3135, column: 19, scope: !635)
!647 = !DILocation(line: 3133, column: 19, scope: !635)
!648 = !DILocation(line: 3137, column: 2, scope: !635)
!649 = distinct !DISubprogram(name: "as_ref<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17h93cb07b7436d8733E", scope: !79, file: !650, line: 675, type: !651, scopeLine: 675, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !86, retainedNodes: !668)
!650 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "d6f90b4fba5d6fbabc4ac99b183a8294")
!651 = !DISubroutineType(types: !652)
!652 = !{!653, !667}
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !80, file: !6, size: 64, align: 64, elements: !654, templateParams: !10, identifier: "195ddbe31b9317afb2b45b11a539f81b")
!654 = !{!655}
!655 = !DICompositeType(tag: DW_TAG_variant_part, scope: !653, file: !6, size: 64, align: 64, elements: !656, templateParams: !10, identifier: "a2cd12994d386602c9b5447a6aef67be", discriminator: !666)
!656 = !{!657, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !655, file: !6, baseType: !658, size: 64, align: 64, extraData: i64 0)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !653, file: !6, size: 64, align: 64, elements: !10, templateParams: !659, identifier: "ae5bf363d119a4f98aa533cb8ab5ef2f")
!659 = !{!660}
!660 = !DITemplateTypeParameter(name: "T", type: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !655, file: !6, baseType: !663, size: 64, align: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !653, file: !6, size: 64, align: 64, elements: !664, templateParams: !659, identifier: "9a37d5ebf1417b4e97a1f7988c1d458d")
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !663, file: !6, baseType: !661, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, scope: !653, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!668 = !{!669, !670}
!669 = !DILocalVariable(name: "self", arg: 1, scope: !649, file: !650, line: 675, type: !667)
!670 = !DILocalVariable(name: "x", scope: !671, file: !650, line: 677, type: !661, align: 8)
!671 = distinct !DILexicalBlock(scope: !649, file: !650, line: 677, column: 13)
!672 = !DILocation(line: 675, column: 25, scope: !649)
!673 = !DILocation(line: 676, column: 15, scope: !649)
!674 = !DILocation(line: 676, column: 9, scope: !649)
!675 = !DILocation(line: 678, column: 21, scope: !649)
!676 = !DILocation(line: 677, column: 18, scope: !649)
!677 = !DILocation(line: 677, column: 18, scope: !671)
!678 = !DILocation(line: 677, column: 28, scope: !671)
!679 = !DILocation(line: 677, column: 34, scope: !649)
!680 = !DILocation(line: 680, column: 6, scope: !649)
!681 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17h855426417a8de2dbE", scope: !683, file: !682, line: 22, type: !479, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!682 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "e9362aaa9be7b181a44e347703862012")
!683 = !DINamespace(name: "sse2", scope: !684)
!684 = !DINamespace(name: "x86", scope: !685)
!685 = !DINamespace(name: "core_arch", scope: !65)
!686 = !DILocation(line: 25, column: 5, scope: !681)
!687 = !DILocation(line: 26, column: 2, scope: !681)
!688 = distinct !DISubprogram(name: "call_once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9call_once17h0f658fd9d178897fE", scope: !57, file: !689, line: 98, type: !690, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !700, retainedNodes: !693)
!689 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.5.2/src/once.rs", directory: "", checksumkind: CSK_MD5, checksum: "69004968d2d982c22c33586bc6b4d134")
!690 = !DISubroutineType(types: !691)
!691 = !{!661, !692, !420}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&spin::once::Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!693 = !{!694, !695, !696, !698}
!694 = !DILocalVariable(name: "self", arg: 1, scope: !688, file: !689, line: 98, type: !692)
!695 = !DILocalVariable(name: "builder", arg: 2, scope: !688, file: !689, line: 98, type: !420)
!696 = !DILocalVariable(name: "status", scope: !697, file: !689, line: 101, type: !72, align: 8)
!697 = distinct !DILexicalBlock(scope: !688, file: !689, line: 101, column: 9)
!698 = !DILocalVariable(name: "finish", scope: !699, file: !689, line: 109, type: !466, align: 8)
!699 = distinct !DILexicalBlock(scope: !697, file: !689, line: 109, column: 17)
!700 = !{!87, !701}
!701 = !DITemplateTypeParameter(name: "F", type: !420)
!702 = !DILocation(line: 98, column: 29, scope: !688)
!703 = !DILocation(line: 98, column: 39, scope: !688)
!704 = !DILocation(line: 101, column: 13, scope: !697)
!705 = !DILocation(line: 109, column: 21, scope: !699)
!706 = !DILocation(line: 121, column: 9, scope: !688)
!707 = !DILocation(line: 101, column: 26, scope: !688)
!708 = !DILocation(line: 103, column: 12, scope: !697)
!709 = !DILocation(line: 122, column: 13, scope: !697)
!710 = !DILocation(line: 104, column: 22, scope: !697)
!711 = !DILocation(line: 104, column: 13, scope: !697)
!712 = !DILocation(line: 107, column: 16, scope: !697)
!713 = !DILocation(line: 109, column: 34, scope: !697)
!714 = !DILocation(line: 110, column: 50, scope: !699)
!715 = !DILocation(line: 110, column: 45, scope: !699)
!716 = !DILocation(line: 110, column: 27, scope: !699)
!717 = !DILocalVariable(name: "self", arg: 1, scope: !718, file: !549, line: 2005, type: !722)
!718 = distinct !DISubprogram(name: "get<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hdca3da25e080ca5fE", scope: !76, file: !549, line: 2005, type: !719, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !114, retainedNodes: !723)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!723 = !{!717}
!724 = !DILocation(line: 2005, column: 22, scope: !718, inlinedAt: !725)
!725 = distinct !DILocation(line: 110, column: 27, scope: !699)
!726 = !DILocation(line: 110, column: 26, scope: !699)
!727 = !DILocation(line: 111, column: 17, scope: !699)
!728 = !DILocation(line: 113, column: 17, scope: !699)
!729 = !DILocation(line: 114, column: 17, scope: !699)
!730 = !DILocation(line: 117, column: 24, scope: !699)
!731 = !DILocation(line: 118, column: 13, scope: !697)
!732 = !DILocation(line: 133, column: 5, scope: !688)
!733 = !DILocation(line: 130, column: 31, scope: !697)
!734 = !DILocation(line: 123, column: 31, scope: !697)
!735 = !DILocation(line: 125, column: 21, scope: !697)
!736 = !DILocation(line: 126, column: 30, scope: !697)
!737 = !DILocation(line: 126, column: 21, scope: !697)
!738 = !DILocation(line: 126, column: 62, scope: !697)
!739 = !DILocation(line: 128, column: 29, scope: !697)
!740 = !DILocation(line: 129, column: 36, scope: !697)
!741 = !DILocation(line: 1, column: 1, scope: !742)
!742 = !DILexicalBlockFile(scope: !697, file: !743, discriminator: 0)
!743 = !DIFile(filename: "cpu_interrupts/src/lib.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "7dc9c02a7f4e542b5c3995d104240d2c")
!744 = !DILocation(line: 133, column: 6, scope: !688)
!745 = distinct !DISubprogram(name: "force_get<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9force_get17h68f759ad73da0d2eE", scope: !57, file: !689, line: 63, type: !746, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !86, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!661, !692}
!748 = !{!749, !750}
!749 = !DILocalVariable(name: "self", arg: 1, scope: !745, file: !689, line: 63, type: !692)
!750 = !DILocalVariable(name: "p", scope: !751, file: !689, line: 66, type: !661, align: 8)
!751 = distinct !DILexicalBlock(scope: !745, file: !689, line: 66, column: 13)
!752 = !DILocation(line: 63, column: 22, scope: !745)
!753 = !DILocation(line: 64, column: 26, scope: !745)
!754 = !DILocation(line: 2005, column: 22, scope: !718, inlinedAt: !755)
!755 = distinct !DILocation(line: 64, column: 26, scope: !745)
!756 = !DILocation(line: 64, column: 15, scope: !745)
!757 = !DILocation(line: 64, column: 9, scope: !745)
!758 = !DILocation(line: 65, column: 33, scope: !745)
!759 = !DILocation(line: 66, column: 18, scope: !745)
!760 = !DILocation(line: 66, column: 18, scope: !751)
!761 = !DILocation(line: 68, column: 6, scope: !745)
!762 = distinct !DISubprogram(name: "tss_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor11tss_segment17h492da82b27164dd5E", scope: !764, file: !763, line: 323, type: !778, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !781)
!763 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/gdt.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ab116ff7379e959850155eb85cfd2d8")
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", scope: !92, file: !6, size: 192, align: 64, elements: !765, templateParams: !10, identifier: "5dd0f19b24e6dcc3bc70de8f383e5e54")
!765 = !{!766}
!766 = !DICompositeType(tag: DW_TAG_variant_part, scope: !764, file: !6, size: 192, align: 64, elements: !767, templateParams: !10, identifier: "a022d8973192fa4ca1f654ce08b4e214", discriminator: !777)
!767 = !{!768, !772}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "UserSegment", scope: !766, file: !6, baseType: !769, size: 192, align: 64, extraData: i64 0)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserSegment", scope: !764, file: !6, size: 192, align: 64, elements: !770, templateParams: !10, identifier: "500aab04d1631f719101f6c294fbb70")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !769, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "SystemSegment", scope: !766, file: !6, baseType: !773, size: 192, align: 64, extraData: i64 1)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "SystemSegment", scope: !764, file: !6, size: 192, align: 64, elements: !774, templateParams: !10, identifier: "e6c4d33fe2c963513921d4c484376632")
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !773, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !773, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!778 = !DISubroutineType(types: !779)
!779 = !{!764, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::tss::TaskStateSegment", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!781 = !{!782, !783, !785, !787}
!782 = !DILocalVariable(name: "tss", arg: 1, scope: !762, file: !763, line: 323, type: !780)
!783 = !DILocalVariable(name: "ptr", scope: !784, file: !763, line: 327, type: !30, align: 8)
!784 = distinct !DILexicalBlock(scope: !762, file: !763, line: 327, column: 9)
!785 = !DILocalVariable(name: "low", scope: !786, file: !763, line: 329, type: !30, align: 8)
!786 = distinct !DILexicalBlock(scope: !784, file: !763, line: 329, column: 9)
!787 = !DILocalVariable(name: "high", scope: !788, file: !763, line: 338, type: !30, align: 8)
!788 = distinct !DILexicalBlock(scope: !786, file: !763, line: 338, column: 9)
!789 = !DILocation(line: 323, column: 24, scope: !762)
!790 = !DILocation(line: 327, column: 13, scope: !784)
!791 = !DILocation(line: 329, column: 13, scope: !786)
!792 = !DILocation(line: 338, column: 13, scope: !788)
!793 = !DILocation(line: 327, column: 19, scope: !762)
!794 = !DILocation(line: 329, column: 23, scope: !784)
!795 = !DILocation(line: 331, column: 22, scope: !786)
!796 = !DILocation(line: 331, column: 43, scope: !786)
!797 = !DILocation(line: 331, column: 30, scope: !786)
!798 = !DILocation(line: 331, column: 9, scope: !786)
!799 = !DILocation(line: 332, column: 22, scope: !786)
!800 = !DILocation(line: 332, column: 43, scope: !786)
!801 = !DILocation(line: 332, column: 30, scope: !786)
!802 = !DILocation(line: 332, column: 9, scope: !786)
!803 = !DILocation(line: 334, column: 22, scope: !786)
!804 = !DILocation(line: 334, column: 29, scope: !786)
!805 = !DILocation(line: 334, column: 9, scope: !786)
!806 = !DILocation(line: 336, column: 22, scope: !786)
!807 = !DILocation(line: 336, column: 9, scope: !786)
!808 = !DILocation(line: 338, column: 24, scope: !786)
!809 = !DILocation(line: 339, column: 23, scope: !788)
!810 = !DILocation(line: 339, column: 43, scope: !788)
!811 = !DILocation(line: 339, column: 30, scope: !788)
!812 = !DILocation(line: 339, column: 9, scope: !788)
!813 = !DILocation(line: 341, column: 35, scope: !788)
!814 = !DILocation(line: 341, column: 40, scope: !788)
!815 = !DILocation(line: 341, column: 9, scope: !788)
!816 = !DILocation(line: 342, column: 6, scope: !762)
!817 = distinct !DISubprogram(name: "kernel_code_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor19kernel_code_segment17h043e8e39848106adE", scope: !764, file: !763, line: 289, type: !818, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!818 = !DISubroutineType(types: !819)
!819 = !{!764}
!820 = !DILocation(line: 290, column: 33, scope: !817)
!821 = !DILocation(line: 290, column: 9, scope: !817)
!822 = !DILocation(line: 291, column: 6, scope: !817)
!823 = distinct !DISubprogram(name: "from_bits_truncate", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags18from_bits_truncate17h00fc6d401e904279E", scope: !825, file: !824, line: 563, type: !828, scopeLine: 563, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !830)
!824 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-1.3.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "a71177c4b92801136d960c3c8e5a0a3c")
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "DescriptorFlags", scope: !92, file: !6, size: 64, align: 64, elements: !826, templateParams: !10, identifier: "b054fc22da14182788e684a6a58baeef")
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !825, file: !6, baseType: !30, size: 64, align: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!825, !30}
!830 = !{!831}
!831 = !DILocalVariable(name: "bits", arg: 1, scope: !823, file: !824, line: 563, type: !30)
!832 = !DILocation(line: 563, column: 45, scope: !823)
!833 = !DILocation(line: 564, column: 37, scope: !823)
!834 = !DILocation(line: 564, column: 30, scope: !823)
!835 = !DILocation(line: 564, column: 17, scope: !823)
!836 = !DILocation(line: 565, column: 14, scope: !823)
!837 = distinct !DISubprogram(name: "all", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags3all17h693e5a25a6e2b280E", scope: !825, file: !824, line: 532, type: !838, scopeLine: 532, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!838 = !DISubroutineType(types: !839)
!839 = !{!825}
!840 = !DILocation(line: 541, column: 14, scope: !837)
!841 = distinct !DISubprogram(name: "bits", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags4bits17h97848d1907e8fba3E", scope: !825, file: !824, line: 545, type: !842, scopeLine: 545, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !845)
!842 = !DISubroutineType(types: !843)
!843 = !{!30, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::DescriptorFlags", baseType: !825, size: 64, align: 64, dwarfAddressSpace: 0)
!845 = !{!846}
!846 = !DILocalVariable(name: "self", arg: 1, scope: !841, file: !824, line: 545, type: !844)
!847 = !DILocation(line: 545, column: 31, scope: !841)
!848 = !DILocation(line: 546, column: 17, scope: !841)
!849 = !DILocation(line: 547, column: 14, scope: !841)
!850 = distinct !DISubprogram(name: "contains", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags8contains17he471e5a243ed49edE", scope: !825, file: !824, line: 603, type: !851, scopeLine: 603, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{!152, !844, !825}
!853 = !{!854, !855}
!854 = !DILocalVariable(name: "self", arg: 1, scope: !850, file: !824, line: 603, type: !844)
!855 = !DILocalVariable(name: "other", arg: 2, scope: !850, file: !824, line: 603, type: !825)
!856 = !DILocation(line: 603, column: 35, scope: !850)
!857 = !DILocation(line: 603, column: 42, scope: !850)
!858 = !DILocation(line: 604, column: 18, scope: !850)
!859 = !DILocation(line: 604, column: 17, scope: !850)
!860 = !DILocation(line: 605, column: 14, scope: !850)
!861 = distinct !DISubprogram(name: "load_unsafe", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable11load_unsafe17ha943adda397a06feE", scope: !91, file: !763, line: 158, type: !862, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !865)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::GlobalDescriptorTable", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!865 = !{!866}
!866 = !DILocalVariable(name: "self", arg: 1, scope: !861, file: !763, line: 158, type: !864)
!867 = !DILocation(line: 158, column: 31, scope: !861)
!868 = !DILocation(line: 161, column: 19, scope: !861)
!869 = !DILocation(line: 161, column: 13, scope: !861)
!870 = !DILocation(line: 163, column: 6, scope: !861)
!871 = distinct !DISubprogram(name: "new", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable3new17h4a475ada7dde72e1E", scope: !91, file: !763, line: 56, type: !872, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!872 = !DISubroutineType(types: !873)
!873 = !{!91}
!874 = !DILocation(line: 58, column: 20, scope: !871)
!875 = !DILocation(line: 57, column: 9, scope: !871)
!876 = !DILocation(line: 61, column: 6, scope: !871)
!877 = distinct !DISubprogram(name: "load", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4load17hed07b2aec5269388E", scope: !91, file: !763, line: 140, type: !862, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !878)
!878 = !{!879}
!879 = !DILocalVariable(name: "self", arg: 1, scope: !877, file: !763, line: 140, type: !864)
!880 = !DILocation(line: 140, column: 17, scope: !877)
!881 = !DILocation(line: 142, column: 18, scope: !877)
!882 = !DILocation(line: 143, column: 6, scope: !877)
!883 = distinct !DISubprogram(name: "push", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4push17h4d59ea7d460b4e44E", scope: !91, file: !763, line: 166, type: !884, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !887)
!884 = !DISubroutineType(types: !885)
!885 = !{!72, !886, !30}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::gdt::GlobalDescriptorTable", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!887 = !{!888, !889, !890}
!888 = !DILocalVariable(name: "self", arg: 1, scope: !883, file: !763, line: 167, type: !886)
!889 = !DILocalVariable(name: "value", arg: 2, scope: !883, file: !763, line: 167, type: !30)
!890 = !DILocalVariable(name: "index", scope: !891, file: !763, line: 168, type: !72, align: 8)
!891 = distinct !DILexicalBlock(scope: !883, file: !763, line: 168, column: 9)
!892 = !DILocation(line: 167, column: 13, scope: !883)
!893 = !DILocation(line: 167, column: 24, scope: !883)
!894 = !DILocation(line: 168, column: 21, scope: !883)
!895 = !DILocation(line: 168, column: 13, scope: !891)
!896 = !DILocation(line: 169, column: 9, scope: !891)
!897 = !DILocation(line: 170, column: 9, scope: !891)
!898 = !DILocation(line: 172, column: 6, scope: !883)
!899 = distinct !DISubprogram(name: "add_entry", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable9add_entry17h93df13de8b10c06cE", scope: !91, file: !763, line: 101, type: !900, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!103, !886, !764}
!902 = !{!903, !904, !905, !907, !909, !911, !912, !914, !916}
!903 = !DILocalVariable(name: "self", arg: 1, scope: !899, file: !763, line: 101, type: !886)
!904 = !DILocalVariable(name: "entry", arg: 2, scope: !899, file: !763, line: 101, type: !764)
!905 = !DILocalVariable(name: "index", scope: !906, file: !763, line: 102, type: !72, align: 8)
!906 = distinct !DILexicalBlock(scope: !899, file: !763, line: 102, column: 9)
!907 = !DILocalVariable(name: "value", scope: !908, file: !763, line: 103, type: !30, align: 8)
!908 = distinct !DILexicalBlock(scope: !899, file: !763, line: 103, column: 13)
!909 = !DILocalVariable(name: "value_low", scope: !910, file: !763, line: 109, type: !30, align: 8)
!910 = distinct !DILexicalBlock(scope: !899, file: !763, line: 109, column: 13)
!911 = !DILocalVariable(name: "value_high", scope: !910, file: !763, line: 109, type: !30, align: 8)
!912 = !DILocalVariable(name: "index", scope: !913, file: !763, line: 113, type: !72, align: 8)
!913 = distinct !DILexicalBlock(scope: !910, file: !763, line: 113, column: 17)
!914 = !DILocalVariable(name: "rpl", scope: !915, file: !763, line: 119, type: !138, align: 1)
!915 = distinct !DILexicalBlock(scope: !906, file: !763, line: 119, column: 9)
!916 = !DILocalVariable(name: "value", scope: !917, file: !763, line: 120, type: !30, align: 8)
!917 = distinct !DILexicalBlock(scope: !906, file: !763, line: 120, column: 13)
!918 = !DILocation(line: 101, column: 22, scope: !899)
!919 = !DILocation(line: 101, column: 33, scope: !899)
!920 = !DILocation(line: 102, column: 13, scope: !906)
!921 = !DILocation(line: 119, column: 13, scope: !915)
!922 = !DILocation(line: 102, column: 27, scope: !899)
!923 = !DILocation(line: 102, column: 21, scope: !899)
!924 = !DILocation(line: 103, column: 37, scope: !899)
!925 = !DILocation(line: 103, column: 37, scope: !908)
!926 = !DILocation(line: 104, column: 20, scope: !908)
!927 = !DILocalVariable(name: "self", arg: 1, scope: !928, file: !929, line: 1096, type: !72)
!928 = distinct !DISubprogram(name: "saturating_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$14saturating_sub17hc80a096e699f98d2E", scope: !930, file: !929, line: 1096, type: !932, scopeLine: 1096, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !934)
!929 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "3eed1b8baad53fb1e7d6811c678f60f8")
!930 = !DINamespace(name: "{impl#11}", scope: !931)
!931 = !DINamespace(name: "num", scope: !65)
!932 = !DISubroutineType(types: !933)
!933 = !{!72, !72, !72}
!934 = !{!927, !935}
!935 = !DILocalVariable(name: "rhs", arg: 2, scope: !928, file: !929, line: 1096, type: !72)
!936 = !DILocation(line: 1096, column: 37, scope: !928, inlinedAt: !937)
!937 = distinct !DILocation(line: 104, column: 31, scope: !908)
!938 = !DILocation(line: 1096, column: 43, scope: !928, inlinedAt: !937)
!939 = !DILocation(line: 1097, column: 13, scope: !928, inlinedAt: !937)
!940 = !DILocation(line: 109, column: 39, scope: !899)
!941 = !DILocation(line: 109, column: 39, scope: !910)
!942 = !DILocation(line: 109, column: 50, scope: !899)
!943 = !DILocation(line: 109, column: 50, scope: !910)
!944 = !DILocation(line: 110, column: 20, scope: !910)
!945 = !DILocation(line: 1096, column: 37, scope: !928, inlinedAt: !946)
!946 = distinct !DILocation(line: 110, column: 31, scope: !910)
!947 = !DILocation(line: 1096, column: 43, scope: !928, inlinedAt: !946)
!948 = !DILocation(line: 1097, column: 13, scope: !928, inlinedAt: !946)
!949 = !DILocation(line: 113, column: 29, scope: !910)
!950 = !DILocation(line: 113, column: 21, scope: !913)
!951 = !DILocation(line: 114, column: 17, scope: !913)
!952 = !DILocation(line: 115, column: 17, scope: !913)
!953 = !DILocation(line: 116, column: 13, scope: !899)
!954 = !DILocation(line: 111, column: 21, scope: !910)
!955 = !DILocation(line: 119, column: 25, scope: !906)
!956 = !DILocation(line: 119, column: 19, scope: !906)
!957 = !DILocation(line: 107, column: 17, scope: !908)
!958 = !DILocation(line: 105, column: 21, scope: !908)
!959 = !DILocation(line: 120, column: 37, scope: !906)
!960 = !DILocation(line: 120, column: 37, scope: !917)
!961 = !DILocation(line: 121, column: 20, scope: !917)
!962 = !DILocation(line: 128, column: 48, scope: !906)
!963 = !DILocation(line: 131, column: 30, scope: !915)
!964 = !DILocation(line: 131, column: 44, scope: !915)
!965 = !{i8 0, i8 4}
!966 = !DILocation(line: 131, column: 9, scope: !915)
!967 = !DILocation(line: 132, column: 6, scope: !899)
!968 = !DILocation(line: 125, column: 21, scope: !917)
!969 = !DILocation(line: 121, column: 17, scope: !917)
!970 = !DILocation(line: 123, column: 21, scope: !917)
!971 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt106Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$RP$$GT$14set_handler_fn17h687ebaae3314df85E", scope: !973, file: !972, line: 763, type: !994, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !998)
!972 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !282, file: !6, size: 128, align: 32, elements: !974, templateParams: !992, identifier: "f3b71fc3ea892a017c872019a37736c4")
!974 = !{!975, !976, !977, !981, !982, !983, !984}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !973, file: !6, baseType: !40, size: 16, align: 16)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !973, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !973, file: !6, baseType: !978, size: 16, align: 16, offset: 32)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !282, file: !6, size: 16, align: 16, elements: !979, templateParams: !10, identifier: "4e168dddb4172bfdce975db78bebadd0")
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !978, file: !6, baseType: !40, size: 16, align: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !973, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !973, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !973, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !973, file: !6, baseType: !985, align: 8, offset: 128)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !986, file: !6, align: 8, elements: !10, templateParams: !987, identifier: "777cad959e485a99edf3edbcc2e68815")
!986 = !DINamespace(name: "marker", scope: !65)
!987 = !{!988}
!988 = !DITemplateTypeParameter(name: "T", type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !990, size: 64, align: 64, dwarfAddressSpace: 0)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !281}
!992 = !{!993}
!993 = !DITemplateTypeParameter(name: "F", type: !989)
!994 = !DISubroutineType(types: !995)
!995 = !{!996, !997, !989}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::EntryOptions", baseType: !978, size: 64, align: 64, dwarfAddressSpace: 0)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !973, size: 64, align: 64, dwarfAddressSpace: 0)
!998 = !{!999, !1000, !1001}
!999 = !DILocalVariable(name: "self", arg: 1, scope: !971, file: !972, line: 763, type: !997)
!1000 = !DILocalVariable(name: "handler", arg: 2, scope: !971, file: !972, line: 763, type: !989)
!1001 = !DILocalVariable(name: "handler", scope: !1002, file: !972, line: 764, type: !26, align: 8)
!1002 = distinct !DILexicalBlock(scope: !971, file: !972, line: 764, column: 17)
!1003 = !DILocation(line: 763, column: 35, scope: !971)
!1004 = !DILocation(line: 763, column: 46, scope: !971)
!1005 = !DILocation(line: 764, column: 45, scope: !971)
!1006 = !DILocation(line: 764, column: 31, scope: !971)
!1007 = !DILocation(line: 764, column: 21, scope: !1002)
!1008 = !DILocation(line: 765, column: 26, scope: !1002)
!1009 = !DILocation(line: 766, column: 14, scope: !971)
!1010 = distinct !DISubprogram(name: "set_present", linkageName: "_ZN6x86_6410structures3idt12EntryOptions11set_present17h9aa533affa29d711E", scope: !978, file: !972, line: 799, type: !1011, scopeLine: 799, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!996, !996, !152}
!1013 = !{!1014, !1015}
!1014 = !DILocalVariable(name: "self", arg: 1, scope: !1010, file: !972, line: 799, type: !996)
!1015 = !DILocalVariable(name: "present", arg: 2, scope: !1010, file: !972, line: 799, type: !152)
!1016 = !DILocation(line: 799, column: 24, scope: !1010)
!1017 = !DILocation(line: 799, column: 35, scope: !1010)
!1018 = !DILocation(line: 800, column: 9, scope: !1010)
!1019 = !DILocation(line: 802, column: 6, scope: !1010)
!1020 = distinct !DISubprogram(name: "set_stack_index", linkageName: "_ZN6x86_6410structures3idt12EntryOptions15set_stack_index17hded055e4da8fb38aE", scope: !978, file: !972, line: 834, type: !1021, scopeLine: 834, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1023)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!996, !996, !40}
!1023 = !{!1024, !1025}
!1024 = !DILocalVariable(name: "self", arg: 1, scope: !1020, file: !972, line: 834, type: !996)
!1025 = !DILocalVariable(name: "index", arg: 2, scope: !1020, file: !972, line: 834, type: !40)
!1026 = !DILocation(line: 834, column: 35, scope: !1020)
!1027 = !DILocation(line: 834, column: 46, scope: !1020)
!1028 = !DILocation(line: 837, column: 25, scope: !1020)
!1029 = !DILocation(line: 837, column: 31, scope: !1020)
!1030 = !DILocation(line: 837, column: 9, scope: !1020)
!1031 = !DILocation(line: 839, column: 6, scope: !1020)
!1032 = distinct !DISubprogram(name: "minimal", linkageName: "_ZN6x86_6410structures3idt12EntryOptions7minimal17hfec5b59536f696c4E", scope: !978, file: !972, line: 793, type: !1033, scopeLine: 793, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!978}
!1035 = !DILocation(line: 795, column: 6, scope: !1032)
!1036 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt132Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$C$u64$RP$$u20$.$GT$$u20$$u21$$GT$14set_handler_fn17h38a3325a583a81beE", scope: !1037, file: !972, line: 763, type: !1055, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1058)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !282, file: !6, size: 128, align: 32, elements: !1038, templateParams: !1053, identifier: "b9ada982f937cd9d11760dbee3e77ac7")
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !1037, file: !6, baseType: !40, size: 16, align: 16)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !1037, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1037, file: !6, baseType: !978, size: 16, align: 16, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !1037, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !1037, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1037, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !1037, file: !6, baseType: !1046, align: 8, offset: 128)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !986, file: !6, align: 8, elements: !10, templateParams: !1047, identifier: "2ff042e5a650063253b3b7c22f531873")
!1047 = !{!1048}
!1048 = !DITemplateTypeParameter(name: "T", type: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !1050, size: 64, align: 64, dwarfAddressSpace: 0)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052, !281, !30}
!1052 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!1053 = !{!1054}
!1054 = !DITemplateTypeParameter(name: "F", type: !1049)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!996, !1057, !1049}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", baseType: !1037, size: 64, align: 64, dwarfAddressSpace: 0)
!1058 = !{!1059, !1060, !1061}
!1059 = !DILocalVariable(name: "self", arg: 1, scope: !1036, file: !972, line: 763, type: !1057)
!1060 = !DILocalVariable(name: "handler", arg: 2, scope: !1036, file: !972, line: 763, type: !1049)
!1061 = !DILocalVariable(name: "handler", scope: !1062, file: !972, line: 764, type: !26, align: 8)
!1062 = distinct !DILexicalBlock(scope: !1036, file: !972, line: 764, column: 17)
!1063 = !DILocation(line: 763, column: 35, scope: !1036)
!1064 = !DILocation(line: 763, column: 46, scope: !1036)
!1065 = !DILocation(line: 764, column: 45, scope: !1036)
!1066 = !DILocation(line: 764, column: 31, scope: !1036)
!1067 = !DILocation(line: 764, column: 21, scope: !1062)
!1068 = !DILocation(line: 765, column: 26, scope: !1062)
!1069 = !DILocation(line: 766, column: 14, scope: !1036)
!1070 = distinct !DISubprogram(name: "set_handler_addr<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$16set_handler_addr17h2f007ed90562460bE", scope: !973, file: !972, line: 721, type: !1071, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !992, retainedNodes: !1073)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!996, !997, !26}
!1073 = !{!1074, !1075, !1076}
!1074 = !DILocalVariable(name: "self", arg: 1, scope: !1070, file: !972, line: 721, type: !997)
!1075 = !DILocalVariable(name: "addr", arg: 2, scope: !1070, file: !972, line: 721, type: !26)
!1076 = !DILocalVariable(name: "addr", scope: !1077, file: !972, line: 724, type: !30, align: 8)
!1077 = distinct !DILexicalBlock(scope: !1070, file: !972, line: 724, column: 9)
!1078 = !DILocation(line: 721, column: 36, scope: !1070)
!1079 = !DILocation(line: 721, column: 47, scope: !1070)
!1080 = !DILocation(line: 724, column: 20, scope: !1070)
!1081 = !DILocation(line: 724, column: 13, scope: !1077)
!1082 = !DILocation(line: 726, column: 9, scope: !1077)
!1083 = !DILocation(line: 727, column: 31, scope: !1077)
!1084 = !DILocation(line: 727, column: 9, scope: !1077)
