; ModuleID = '4tgyit82buyqwjzs'
source_filename = "4tgyit82buyqwjzs"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17hd12008e8a52001d6E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "cpu_interrupts/src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "a421a375e1e8c73fd3287f0ef4101440")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "2caed7826259efbd1fd6354ebc93d6ee")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "654e5abd0a68b517efe9e35818723e7")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "aa56fd8bf7b4a9474bab87bcd4d2adf2")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "2bcf00addec99610fece29022aee9099")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "adfcaeab38fa36477571dde47092f616")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "7ad0d187f3bd352c96742442d23a99c")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "e5eb12d05e9a4835365b7330c29ba8e2")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "571a085c851d27febe20fb8cad91e249")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "bd9d8e27ff3730aac49a8a703d817ecc")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "c724cc2ae7038b092b411f0b79ab562d")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "e8aad301e6073a6aa24aaba8d9ab37")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "ba04084ef85741dbd6d664ae725b308f")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17hb4eb29dc8827e260E", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "edaca57f353e982a397ea8e1026c07")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h8798269eeb708317E", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "cpu_interrupts/src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "2ca1a407323085b469bd69e08d767598")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "5a28dcf4f354050c3ac7a5b07bf235ac")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17he86bd9bb00263e84E", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h844842a5b7d6b1e0E", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "53146df6f7dad5e7c9e379cf15af9443")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "bf836c18f020535c7922d5e9fd341093")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "7334789c7964499f26a3691f065c7c5c")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "17ef71fde2bfb75e3df1e3c3d08b39ea")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "113f1dfa083193e5a0e40ab5887801bc")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "184b03ac1c06a16f7c89335170072a4c")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "8152b9f0e1094913687c27ec0e18734e", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "b331cd5f6021e9569e5583f604f3f19")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "17b8cbbf9bc6ef474ab1a72ca842e34")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "27cb6eab6660068964e434c82e8dfb11")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "b6414b332d69480111ce1ee035893464")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "6a2a080d81dc4e3e582e337daa5c4657")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "9da8a874e8060f093425d8aa707aa959")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !190, templateParams: !18, identifier: "9d69fae13f7c5dea1f1d92e197f8e043")
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !191, file: !6, size: 32768, align: 128, elements: !192, templateParams: !18, identifier: "cc414d17cfc7b5e488752e19d028aea9")
!191 = !DINamespace(name: "idt", scope: !92)
!192 = !{!193, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !269, !270, !271, !272, !293, !294, !295, !296, !314, !315, !316, !318, !319, !320, !321}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !190, file: !6, baseType: !194, size: 128, align: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !191, file: !6, size: 128, align: 32, elements: !195, templateParams: !222, identifier: "d5fea4160813ba31987dfd76a0f5ac5")
!195 = !{!196, !197, !198, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !194, file: !6, baseType: !55, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !191, file: !6, size: 16, align: 16, elements: !200, templateParams: !18, identifier: "1ee6632dc0c3107f76fcb732d91d1d2e")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !6, baseType: !55, size: 16, align: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !194, file: !6, baseType: !206, align: 8, offset: 128)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !207, identifier: "a75d9e8a47842130b2b10ed1f6162e53")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !191, file: !6, size: 320, align: 64, elements: !213, templateParams: !18, identifier: "d25abcef9ab6d40718b7e5d1cb73cf58")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !6, baseType: !215, size: 320, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !191, file: !6, size: 320, align: 64, elements: !216, templateParams: !18, identifier: "2db2d33d7939a4b8668e00888dbcbe0")
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "F", type: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !190, file: !6, baseType: !232, size: 128, align: 32, offset: 1024)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !233, templateParams: !248, identifier: "4863daef6c123d3b7594bbe49f9b6853")
!233 = !{!234, !235, !236, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !232, file: !6, baseType: !55, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !232, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !6, baseType: !241, align: 8, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !242, identifier: "6e0f1d90e13f78089d816af324eccf0e")
!242 = !{!243}
!243 = !DITemplateTypeParameter(name: "T", type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !212, !102}
!247 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "F", type: !244)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1280)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !191, file: !6, size: 128, align: 32, elements: !253, templateParams: !267, identifier: "faaef7b262ea55333291c6688b68371f")
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !252, file: !6, baseType: !55, size: 16, align: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !252, file: !6, baseType: !261, align: 8, offset: 128)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !262, identifier: "6110566e78e0c6fdf26a61d6d469ae14")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !102}
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "F", type: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !190, file: !6, baseType: !273, size: 128, align: 32, offset: 1792)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !191, file: !6, size: 128, align: 32, elements: !274, templateParams: !291, identifier: "2705be5a63456afb4dc44360cc6352bb")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !273, file: !6, baseType: !55, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !273, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !273, file: !6, baseType: !282, align: 8, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !283, identifier: "d80780a6c7fcb2c183eb7f7b2aafbb4a")
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !212, !288}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !191, file: !6, size: 64, align: 64, elements: !289, templateParams: !18, identifier: "e7f1babe1817b9f3f5e27f49f9e42b27")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !288, file: !6, baseType: !102, size: 64, align: 64)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "F", type: !285)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !190, file: !6, baseType: !297, size: 128, align: 32, offset: 2304)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !298, templateParams: !312, identifier: "6bce1dd95fda3406b7a03b3584d2dae2")
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !297, file: !6, baseType: !55, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !297, file: !6, baseType: !306, align: 8, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !307, identifier: "364d3e0afb1e5835b59a6b56d8becf18")
!307 = !{!308}
!308 = !DITemplateTypeParameter(name: "T", type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DISubroutineType(types: !311)
!311 = !{!247, !212}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "F", type: !309)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !190, file: !6, baseType: !317, size: 1024, align: 32, offset: 2688)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 32, elements: !161)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3712)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 3968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !190, file: !6, baseType: !322, size: 28672, align: 32, offset: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 28672, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 224, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !18, identifier: "5cd6cbc0564cf2939460f02570f611bd")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !6, baseType: !186, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!333 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !18, identifier: "7b351d5192b0ec6b5810658ee58d473b")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !6, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.71.0-nightly (f49560538 2023-04-28))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !370, splitDebugInlining: false)
!347 = !DIFile(filename: "cpu_interrupts/src/lib.rs/@/4tgyit82buyqwjzs", directory: "/Users/yaw/self/theo")
!348 = !{!349, !357, !364}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !352)
!350 = !DINamespace(name: "rt", scope: !351)
!351 = !DINamespace(name: "fmt", scope: !17)
!352 = !{!353, !354, !355, !356}
!353 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!362 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!363 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!367 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!370 = !{!0, !77, !84, !113, !118, !181, !325, !334}
!371 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h197ca037a3099b84E", scope: !373, file: !372, line: 2298, type: !374, scopeLine: 2298, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !423)
!372 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "6b0c81a808d92ec5841ea47424002502")
!373 = !DINamespace(name: "{impl#12}", scope: !351)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !342, !394}
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !377, file: !6, size: 8, align: 8, elements: !378, templateParams: !18, identifier: "2fd86163cab7c59d321f813815445f61")
!377 = !DINamespace(name: "result", scope: !17)
!378 = !{!379}
!379 = !DICompositeType(tag: DW_TAG_variant_part, scope: !376, file: !6, size: 8, align: 8, elements: !380, templateParams: !18, identifier: "54f01c7802f052a075c25065a54e3108", discriminator: !393)
!380 = !{!381, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !379, file: !6, baseType: !382, size: 8, align: 8, extraData: i64 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !376, file: !6, size: 8, align: 8, elements: !383, templateParams: !385, identifier: "199ca63b65771145c1ecaa36e0c45446")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !6, baseType: !67, align: 8, offset: 8)
!385 = !{!386, !387}
!386 = !DITemplateTypeParameter(name: "T", type: !67)
!387 = !DITemplateTypeParameter(name: "E", type: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !351, file: !6, align: 8, elements: !18, identifier: "e8cc4da9d962b0d25409a133a5d42c")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !379, file: !6, baseType: !390, size: 8, align: 8, extraData: i64 1)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !376, file: !6, size: 8, align: 8, elements: !391, templateParams: !385, identifier: "42ce6621199a4384f72edb2ce280fbba")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !6, baseType: !388, align: 8, offset: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !351, file: !6, size: 512, align: 64, elements: !396, templateParams: !18, identifier: "ba1c66510e28e89fe66e924337088184")
!396 = !{!397, !398, !400, !401, !413, !414}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !395, file: !6, baseType: !95, size: 32, align: 32, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !395, file: !6, baseType: !399, size: 32, align: 32, offset: 416)
!399 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !395, file: !6, baseType: !349, size: 8, align: 8, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !395, file: !6, baseType: !402, size: 128, align: 64, offset: 128)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !403, templateParams: !18, identifier: "7182c598151f2d841d4f46050c57b41c")
!403 = !{!404}
!404 = !DICompositeType(tag: DW_TAG_variant_part, scope: !402, file: !6, size: 128, align: 64, elements: !405, templateParams: !18, identifier: "cbec1a373e2f23dd816907c50c746fd0", discriminator: !412)
!405 = !{!406, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !404, file: !6, baseType: !407, size: 128, align: 64, extraData: i64 0)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !402, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "656d115187d98681854f3179cd6091aa")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !404, file: !6, baseType: !409, size: 128, align: 64, extraData: i64 1)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !402, file: !6, size: 128, align: 64, elements: !410, templateParams: !138, identifier: "8a80ba7685ed458a9d770fc472f6a3ea")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !395, file: !6, baseType: !402, size: 128, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !395, file: !6, baseType: !415, size: 128, align: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !416, templateParams: !18, identifier: "5db60ab68e9a33842ed84c98957b092f")
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !415, file: !6, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64, dwarfAddressSpace: 0)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "2bf51e8df80b66cd32f422ed18b7c106")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !415, file: !6, baseType: !421, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !422, size: 64, align: 64, dwarfAddressSpace: 0)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!423 = !{!424, !425}
!424 = !DILocalVariable(name: "self", arg: 1, scope: !371, file: !372, line: 2298, type: !342)
!425 = !DILocalVariable(name: "f", arg: 2, scope: !371, file: !372, line: 2298, type: !394)
!426 = !DILocation(line: 2298, column: 12, scope: !371)
!427 = !DILocation(line: 2298, column: 19, scope: !371)
!428 = !DILocation(line: 2299, column: 9, scope: !371)
!429 = !DILocation(line: 2300, column: 6, scope: !371)
!430 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17hf0b474f2bfc4c2cbE", scope: !432, file: !431, line: 237, type: !434, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !437)
!431 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!432 = !DINamespace(name: "{impl#2}", scope: !433)
!433 = !DINamespace(name: "bit_field", scope: null)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !436, !137, !333}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !{!438, !439, !440}
!438 = !DILocalVariable(name: "self", arg: 1, scope: !430, file: !431, line: 237, type: !436)
!439 = !DILocalVariable(name: "bit", arg: 2, scope: !430, file: !431, line: 237, type: !137)
!440 = !DILocalVariable(name: "value", arg: 3, scope: !430, file: !431, line: 237, type: !333)
!441 = !DILocation(line: 237, column: 24, scope: !430)
!442 = !DILocation(line: 237, column: 35, scope: !430)
!443 = !DILocation(line: 237, column: 47, scope: !430)
!444 = !DILocation(line: 238, column: 25, scope: !430)
!445 = !DILocation(line: 238, column: 17, scope: !430)
!446 = !DILocation(line: 240, column: 20, scope: !430)
!447 = !DILocation(line: 243, column: 31, scope: !430)
!448 = !DILocation(line: 241, column: 30, scope: !430)
!449 = !DILocation(line: 241, column: 21, scope: !430)
!450 = !DILocation(line: 240, column: 17, scope: !430)
!451 = !DILocation(line: 247, column: 14, scope: !430)
!452 = !DILocation(line: 243, column: 30, scope: !430)
!453 = !DILocation(line: 243, column: 21, scope: !430)
!454 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17h5398ae7c0a5286baE", scope: !432, file: !431, line: 250, type: !455, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !473, retainedNodes: !465)
!455 = !DISubroutineType(types: !456)
!456 = !{!436, !436, !457, !55}
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !458, file: !6, size: 128, align: 64, elements: !460, templateParams: !463, identifier: "18cd61c87dbf51eb4088b653e33d00b5")
!458 = !DINamespace(name: "range", scope: !459)
!459 = !DINamespace(name: "ops", scope: !17)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !457, file: !6, baseType: !137, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !457, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!463 = !{!464}
!464 = !DITemplateTypeParameter(name: "Idx", type: !137)
!465 = !{!466, !467, !468, !469, !471}
!466 = !DILocalVariable(name: "self", arg: 1, scope: !454, file: !431, line: 250, type: !436)
!467 = !DILocalVariable(name: "range", arg: 2, scope: !454, file: !431, line: 250, type: !457)
!468 = !DILocalVariable(name: "value", arg: 3, scope: !454, file: !431, line: 250, type: !55)
!469 = !DILocalVariable(name: "range", scope: !470, file: !431, line: 251, type: !457, align: 8)
!470 = distinct !DILexicalBlock(scope: !454, file: !431, line: 251, column: 17)
!471 = !DILocalVariable(name: "bitmask", scope: !472, file: !431, line: 260, type: !55, align: 2)
!472 = distinct !DILexicalBlock(scope: !470, file: !431, line: 260, column: 17)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !457)
!475 = !DILocation(line: 250, column: 48, scope: !454)
!476 = !DILocation(line: 250, column: 59, scope: !454)
!477 = !DILocation(line: 250, column: 69, scope: !454)
!478 = !DILocation(line: 251, column: 29, scope: !454)
!479 = !DILocation(line: 251, column: 21, scope: !470)
!480 = !DILocation(line: 253, column: 25, scope: !470)
!481 = !DILocation(line: 253, column: 17, scope: !470)
!482 = !DILocation(line: 254, column: 25, scope: !470)
!483 = !DILocation(line: 254, column: 17, scope: !470)
!484 = !DILocation(line: 255, column: 25, scope: !470)
!485 = !DILocation(line: 255, column: 17, scope: !470)
!486 = !DILocation(line: 256, column: 54, scope: !470)
!487 = !DILocation(line: 256, column: 34, scope: !470)
!488 = !DILocation(line: 256, column: 25, scope: !470)
!489 = !DILocation(line: 257, column: 45, scope: !470)
!490 = !DILocation(line: 257, column: 25, scope: !470)
!491 = !DILocation(line: 256, column: 17, scope: !470)
!492 = !DILocation(line: 260, column: 45, scope: !470)
!493 = !DILocation(line: 260, column: 39, scope: !470)
!494 = !DILocation(line: 261, column: 37, scope: !470)
!495 = !DILocation(line: 260, column: 38, scope: !470)
!496 = !DILocation(line: 260, column: 37, scope: !470)
!497 = !DILocation(line: 260, column: 21, scope: !472)
!498 = !DILocation(line: 265, column: 26, scope: !472)
!499 = !DILocation(line: 265, column: 25, scope: !472)
!500 = !DILocation(line: 265, column: 45, scope: !472)
!501 = !DILocation(line: 265, column: 17, scope: !472)
!502 = !DILocation(line: 268, column: 14, scope: !454)
!503 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h380cc52f519ef127E", scope: !504, file: !372, line: 333, type: !575, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !580)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !351, file: !6, size: 384, align: 64, elements: !505, templateParams: !18, identifier: "3fe42376b1215e3c513455baf65e326c")
!505 = !{!506, !517, !559}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !504, file: !6, baseType: !507, size: 128, align: 64, offset: 128)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !508, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!508 = !{!509, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !507, file: !6, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !512, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!512 = !{!513, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !511, file: !6, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !511, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !504, file: !6, baseType: !518, size: 128, align: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !145, file: !6, size: 128, align: 64, elements: !519, templateParams: !18, identifier: "df5933aa3c6a9722742184851af5033a")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_variant_part, scope: !518, file: !6, size: 128, align: 64, elements: !521, templateParams: !18, identifier: "1646963b667c96d9a442c2d3b1073220", discriminator: !558)
!521 = !{!522, !554}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !520, file: !6, baseType: !523, size: 128, align: 64, extraData: i64 0)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !518, file: !6, size: 128, align: 64, elements: !18, templateParams: !524, identifier: "97766f76e39853db3159b250c9d78db0")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !6, size: 128, align: 64, elements: !527, templateParams: !18, identifier: "ccd3fb5103664797cd5b567c3f0fd7e9")
!527 = !{!528, !553}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !526, file: !6, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !350, file: !6, size: 448, align: 64, elements: !531, templateParams: !18, identifier: "c260d6150bb5bc8c142c245d8170b89c")
!531 = !{!532, !533, !534, !535, !536, !552}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !530, file: !6, baseType: !137, size: 64, align: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !530, file: !6, baseType: !399, size: 32, align: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !530, file: !6, baseType: !349, size: 8, align: 8, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !6, baseType: !95, size: 32, align: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !530, file: !6, baseType: !537, size: 128, align: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !350, file: !6, size: 128, align: 64, elements: !538, templateParams: !18, identifier: "b949088d80ce83b320d7a7cb28de90d")
!538 = !{!539}
!539 = !DICompositeType(tag: DW_TAG_variant_part, scope: !537, file: !6, size: 128, align: 64, elements: !540, templateParams: !18, identifier: "f47c4848087d9b8effa8dd614cb9155f", discriminator: !551)
!540 = !{!541, !545, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !539, file: !6, baseType: !542, size: 128, align: 64, extraData: i64 0)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !537, file: !6, size: 128, align: 64, elements: !543, templateParams: !18, identifier: "e05070f661b792797efd4a004b55064e")
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !542, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !539, file: !6, baseType: !546, size: 128, align: 64, extraData: i64 1)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !537, file: !6, size: 128, align: 64, elements: !547, templateParams: !18, identifier: "9f51e9afc132ad1f315ce258130e8a4")
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !546, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !539, file: !6, baseType: !550, size: 128, align: 64, extraData: i64 2)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !537, file: !6, size: 128, align: 64, elements: !18, identifier: "ada4c6a7bf59be7476587d993c5cac36")
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !530, file: !6, baseType: !537, size: 128, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !526, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !520, file: !6, baseType: !555, size: 128, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !518, file: !6, size: 128, align: 64, elements: !556, templateParams: !524, identifier: "10a9ef3e4ebadceee41170cc5ddfec96")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !6, baseType: !526, size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !504, file: !6, baseType: !560, size: 128, align: 64, offset: 256)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !6, size: 128, align: 64, elements: !561, templateParams: !18, identifier: "b7d08e53003fad3855fb5c1b5ddc2cc6")
!561 = !{!562, !574}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !560, file: !6, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !350, file: !6, size: 128, align: 64, elements: !565, templateParams: !18, identifier: "b2e8380e554a80515b7493dbea0eb626")
!565 = !{!566, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !564, file: !6, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !569, file: !6, align: 8, elements: !18, identifier: "4f858257f67fe311ee5b9d89fb7a346")
!569 = !DINamespace(name: "{extern#0}", scope: !350)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !564, file: !6, baseType: !571, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !572, size: 64, align: 64, dwarfAddressSpace: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!376, !567, !394}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !560, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!504, !507, !560, !526, !577}
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !350, file: !6, align: 8, elements: !578, templateParams: !18, identifier: "705e11c2ff919d421903976528c2")
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !577, file: !6, baseType: !67, align: 8)
!580 = !{!581, !582, !583, !584, !585}
!581 = !DILocalVariable(name: "pieces", arg: 1, scope: !503, file: !372, line: 334, type: !507)
!582 = !DILocalVariable(name: "args", arg: 2, scope: !503, file: !372, line: 335, type: !560)
!583 = !DILocalVariable(name: "fmt", arg: 3, scope: !503, file: !372, line: 336, type: !526)
!584 = !DILocalVariable(name: "_unsafe_arg", scope: !503, file: !372, line: 337, type: !577, align: 1)
!585 = !DILocalVariable(arg: 4, scope: !503, file: !372, line: 337, type: !577)
!586 = !DILocation(line: 337, column: 9, scope: !503)
!587 = !DILocation(line: 334, column: 9, scope: !503)
!588 = !DILocation(line: 335, column: 9, scope: !503)
!589 = !DILocation(line: 336, column: 9, scope: !503)
!590 = !DILocation(line: 339, column: 34, scope: !503)
!591 = !DILocation(line: 339, column: 9, scope: !503)
!592 = !{i64 8}
!593 = !DILocation(line: 340, column: 6, scope: !503)
!594 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h4d3872a537aad4f3E", scope: !504, file: !372, line: 297, type: !595, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!504, !507}
!597 = !{!598}
!598 = !DILocalVariable(name: "pieces", arg: 1, scope: !594, file: !372, line: 297, type: !507)
!599 = !DILocation(line: 297, column: 28, scope: !594)
!600 = !DILocation(line: 298, column: 12, scope: !594)
!601 = !DILocation(line: 301, column: 34, scope: !594)
!602 = !DILocation(line: 301, column: 9, scope: !594)
!603 = !DILocation(line: 302, column: 6, scope: !594)
!604 = !DILocation(line: 299, column: 13, scope: !594)
!605 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h14c9cbfca606cf7fE", scope: !607, file: !606, line: 250, type: !609, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !617, retainedNodes: !614)
!606 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfb73adf0f4bb6df3856d6eaf613e707")
!607 = !DINamespace(name: "FnOnce", scope: !608)
!608 = !DINamespace(name: "function", scope: !459)
!609 = !DISubroutineType(types: !610)
!610 = !{!153, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !612, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!153}
!614 = !{!615, !616}
!615 = !DILocalVariable(arg: 1, scope: !605, file: !606, line: 250, type: !611)
!616 = !DILocalVariable(arg: 2, scope: !605, file: !606, line: 250, type: !67)
!617 = !{!618, !619}
!618 = !DITemplateTypeParameter(name: "Self", type: !611)
!619 = !DITemplateTypeParameter(name: "Args", type: !67)
!620 = !DILocation(line: 250, column: 5, scope: !605)
!621 = !DILocalVariable(name: "global_descriptor_table", scope: !622, file: !89, line: 26, type: !156, align: 8)
!622 = distinct !DILexicalBlock(scope: !623, file: !89, line: 26, column: 9)
!623 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h03f7d6bcd9611d50E", scope: !87, file: !80, line: 137, type: !612, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !624)
!624 = !{!621, !625, !627, !629, !631}
!625 = !DILocalVariable(name: "stack_start", scope: !626, file: !89, line: 31, type: !98, align: 8)
!626 = distinct !DILexicalBlock(scope: !622, file: !89, line: 31, column: 17)
!627 = !DILocalVariable(name: "stack_end", scope: !628, file: !89, line: 32, type: !98, align: 8)
!628 = distinct !DILexicalBlock(scope: !626, file: !89, line: 32, column: 17)
!629 = !DILocalVariable(name: "tss_selector", scope: !630, file: !89, line: 38, type: !168, align: 2)
!630 = distinct !DILexicalBlock(scope: !622, file: !89, line: 38, column: 9)
!631 = !DILocalVariable(name: "code_selector", scope: !632, file: !89, line: 39, type: !168, align: 2)
!632 = distinct !DILexicalBlock(scope: !630, file: !89, line: 39, column: 9)
!633 = !DILocation(line: 26, column: 13, scope: !622, inlinedAt: !634)
!634 = distinct !DILocation(line: 250, column: 5, scope: !605)
!635 = !DILocation(line: 26, column: 43, scope: !636, inlinedAt: !634)
!636 = !DILexicalBlockFile(scope: !623, file: !89, discriminator: 0)
!637 = !DILocation(line: 31, column: 35, scope: !622, inlinedAt: !634)
!638 = !DILocation(line: 31, column: 21, scope: !626, inlinedAt: !634)
!639 = !DILocation(line: 32, column: 33, scope: !626, inlinedAt: !634)
!640 = !DILocation(line: 32, column: 21, scope: !628, inlinedAt: !634)
!641 = !DILocation(line: 29, column: 13, scope: !622, inlinedAt: !634)
!642 = !DILocation(line: 38, column: 62, scope: !622, inlinedAt: !634)
!643 = !DILocation(line: 38, column: 28, scope: !622, inlinedAt: !634)
!644 = !DILocation(line: 38, column: 13, scope: !630, inlinedAt: !634)
!645 = !DILocation(line: 39, column: 63, scope: !630, inlinedAt: !634)
!646 = !DILocation(line: 39, column: 29, scope: !630, inlinedAt: !634)
!647 = !DILocation(line: 39, column: 13, scope: !632, inlinedAt: !634)
!648 = !DILocation(line: 41, column: 20, scope: !632, inlinedAt: !634)
!649 = !DILocation(line: 42, column: 24, scope: !632, inlinedAt: !634)
!650 = !DILocation(line: 40, column: 9, scope: !632, inlinedAt: !634)
!651 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17h2d77e388e058a3cdE", scope: !653, file: !652, line: 490, type: !654, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !659, retainedNodes: !657)
!652 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "61e00314733b7b7d5fdfe8b675068ee3")
!653 = !DINamespace(name: "ptr", scope: !17)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !{!658}
!658 = !DILocalVariable(arg: 1, scope: !651, file: !652, line: 490, type: !656)
!659 = !{!660}
!660 = !DITemplateTypeParameter(name: "T", type: !333)
!661 = !DILocation(line: 490, column: 1, scope: !651)
!662 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17haae8abf6e167a352E", scope: !653, file: !652, line: 490, type: !663, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !668, retainedNodes: !666)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!666 = !{!667}
!667 = !DILocalVariable(arg: 1, scope: !662, file: !652, line: 490, type: !665)
!668 = !{!669}
!669 = !DITemplateTypeParameter(name: "T", type: !342)
!670 = !DILocation(line: 490, column: 1, scope: !662)
!671 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h8f5a9ba84c0c0ddeE", scope: !653, file: !652, line: 490, type: !672, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !682, retainedNodes: !680)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !675, size: 64, align: 64, dwarfAddressSpace: 0)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !676, templateParams: !18, identifier: "dbe45b895dc03d23ebe29849a3d5b2be")
!676 = !{!677, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !6, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !675, file: !6, baseType: !333, size: 8, align: 8, offset: 64)
!680 = !{!681}
!681 = !DILocalVariable(arg: 1, scope: !671, file: !652, line: 490, type: !674)
!682 = !{!683}
!683 = !DITemplateTypeParameter(name: "T", type: !675)
!684 = !DILocation(line: 490, column: 1, scope: !671)
!685 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::InterruptDescriptorTable>", linkageName: "_ZN4core3ptr70drop_in_place$LT$x86_64..structures..idt..InterruptDescriptorTable$GT$17heabba80a136aa6e0E", scope: !653, file: !652, line: 490, type: !686, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !691, retainedNodes: !689)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!689 = !{!690}
!690 = !DILocalVariable(arg: 1, scope: !685, file: !652, line: 490, type: !688)
!691 = !{!692}
!692 = !DITemplateTypeParameter(name: "T", type: !190)
!693 = !DILocation(line: 490, column: 1, scope: !685)
!694 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17hf6d9134e26591941E", scope: !653, file: !652, line: 490, type: !695, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !709, retainedNodes: !707)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !699, templateParams: !73, identifier: "3bedd4ce783542479c318a149ec065e2")
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !698, file: !6, baseType: !701, size: 128, align: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !702, templateParams: !73, identifier: "28b6d82ffbc3b1f74751abfe011f8aac")
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !701, file: !6, baseType: !704, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !6, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!707 = !{!708}
!708 = !DILocalVariable(arg: 1, scope: !694, file: !652, line: 490, type: !697)
!709 = !{!710}
!710 = !DITemplateTypeParameter(name: "T", type: !698)
!711 = !DILocation(line: 490, column: 1, scope: !694)
!712 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17he85e1b0f9e7c5e6eE", scope: !653, file: !652, line: 490, type: !713, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !718, retainedNodes: !716)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !701, size: 64, align: 64, dwarfAddressSpace: 0)
!716 = !{!717}
!717 = !DILocalVariable(arg: 1, scope: !712, file: !652, line: 490, type: !715)
!718 = !{!719}
!719 = !DITemplateTypeParameter(name: "T", type: !701)
!720 = !DILocation(line: 490, column: 1, scope: !712)
!721 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17hcfd03657669cc920E", scope: !723, file: !722, line: 100, type: !724, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!722 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "abfb30215b829e2044a72c49db9551bc")
!723 = !DINamespace(name: "hint", scope: !17)
!724 = !DISubroutineType(types: !725)
!725 = !{null}
!726 = !DILocation(line: 104, column: 9, scope: !721)
!727 = !DILocation(line: 105, column: 9, scope: !721)
!728 = !DILocation(line: 2513, column: 21, scope: !729, inlinedAt: !732)
!729 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17hee16452d50314a39E", scope: !731, file: !730, line: 2510, type: !724, scopeLine: 2510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!730 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "b961ce15748c96c32140721627355748")
!731 = !DINamespace(name: "unreachable_unchecked", scope: !723)
!732 = distinct !DILocation(line: 104, column: 9, scope: !721)
!733 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17ha561aa3a9e01c68bE", scope: !24, file: !734, line: 715, type: !735, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !752)
!734 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "93a0089cd11c622e97239c13f01ff0c9")
!735 = !DISubroutineType(types: !736)
!736 = !{!737, !704, !333, !333, !357, !357}
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !377, file: !6, size: 16, align: 8, elements: !738, templateParams: !18, identifier: "224756955f4cfbd2a732e10d0bfbffb7")
!738 = !{!739}
!739 = !DICompositeType(tag: DW_TAG_variant_part, scope: !737, file: !6, size: 16, align: 8, elements: !740, templateParams: !18, identifier: "7c8748954214b68bcbe612d232cf554e", discriminator: !751)
!740 = !{!741, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !739, file: !6, baseType: !742, size: 16, align: 8, extraData: i64 0)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !737, file: !6, size: 16, align: 8, elements: !743, templateParams: !745, identifier: "9ee965581775c69483832bc851083383")
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !742, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!745 = !{!660, !746}
!746 = !DITemplateTypeParameter(name: "E", type: !333)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !739, file: !6, baseType: !748, size: 16, align: 8, extraData: i64 1)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !737, file: !6, size: 16, align: 8, elements: !749, templateParams: !745, identifier: "26c0994fc79f21929202ba08c0541160")
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !748, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, scope: !737, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!752 = !{!753, !754, !755, !756, !757, !758, !760}
!753 = !DILocalVariable(name: "self", arg: 1, scope: !733, file: !734, line: 716, type: !704)
!754 = !DILocalVariable(name: "current", arg: 2, scope: !733, file: !734, line: 717, type: !333)
!755 = !DILocalVariable(name: "new", arg: 3, scope: !733, file: !734, line: 718, type: !333)
!756 = !DILocalVariable(name: "success", arg: 4, scope: !733, file: !734, line: 719, type: !357)
!757 = !DILocalVariable(name: "failure", arg: 5, scope: !733, file: !734, line: 720, type: !357)
!758 = !DILocalVariable(name: "x", scope: !759, file: !734, line: 726, type: !33, align: 1)
!759 = distinct !DILexicalBlock(scope: !733, file: !734, line: 726, column: 13)
!760 = !DILocalVariable(name: "x", scope: !761, file: !734, line: 727, type: !33, align: 1)
!761 = distinct !DILexicalBlock(scope: !733, file: !734, line: 727, column: 13)
!762 = !DILocation(line: 716, column: 9, scope: !733)
!763 = !DILocation(line: 717, column: 9, scope: !733)
!764 = !DILocation(line: 718, column: 9, scope: !733)
!765 = !DILocation(line: 719, column: 9, scope: !733)
!766 = !DILocation(line: 720, column: 9, scope: !733)
!767 = !DILocalVariable(name: "self", arg: 1, scope: !768, file: !769, line: 2052, type: !773)
!768 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h29ac6ea2e64b9ee4E", scope: !29, file: !769, line: 2052, type: !770, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !774)
!769 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "8d01b740129a4b9c32202a274c61d632")
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !{!767}
!775 = !DILocation(line: 2052, column: 22, scope: !768, inlinedAt: !776)
!776 = distinct !DILocation(line: 724, column: 42, scope: !733)
!777 = !DILocation(line: 724, column: 56, scope: !733)
!778 = !DILocation(line: 724, column: 71, scope: !733)
!779 = !DILocation(line: 724, column: 13, scope: !733)
!780 = !DILocation(line: 723, column: 15, scope: !733)
!781 = !{i8 0, i8 2}
!782 = !DILocation(line: 723, column: 9, scope: !733)
!783 = !DILocation(line: 726, column: 16, scope: !733)
!784 = !DILocation(line: 726, column: 16, scope: !759)
!785 = !DILocation(line: 726, column: 25, scope: !759)
!786 = !DILocation(line: 726, column: 22, scope: !759)
!787 = !DILocation(line: 726, column: 31, scope: !733)
!788 = !DILocation(line: 727, column: 17, scope: !733)
!789 = !DILocation(line: 727, column: 17, scope: !761)
!790 = !DILocation(line: 727, column: 27, scope: !761)
!791 = !DILocation(line: 727, column: 23, scope: !761)
!792 = !DILocation(line: 727, column: 33, scope: !733)
!793 = !DILocation(line: 729, column: 6, scope: !733)
!794 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17h8345db2505256886E", scope: !24, file: !734, line: 495, type: !795, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!333, !704, !357}
!797 = !{!798, !799}
!798 = !DILocalVariable(name: "self", arg: 1, scope: !794, file: !734, line: 495, type: !704)
!799 = !DILocalVariable(name: "order", arg: 2, scope: !794, file: !734, line: 495, type: !357)
!800 = !DILocation(line: 495, column: 17, scope: !794)
!801 = !DILocation(line: 495, column: 24, scope: !794)
!802 = !DILocation(line: 2052, column: 22, scope: !768, inlinedAt: !803)
!803 = distinct !DILocation(line: 498, column: 30, scope: !794)
!804 = !DILocation(line: 498, column: 18, scope: !794)
!805 = !DILocation(line: 499, column: 6, scope: !794)
!806 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h27bdd5b7da8cd580E", scope: !24, file: !734, line: 523, type: !807, scopeLine: 523, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !704, !333, !357}
!809 = !{!810, !811, !812}
!810 = !DILocalVariable(name: "self", arg: 1, scope: !806, file: !734, line: 523, type: !704)
!811 = !DILocalVariable(name: "val", arg: 2, scope: !806, file: !734, line: 523, type: !333)
!812 = !DILocalVariable(name: "order", arg: 3, scope: !806, file: !734, line: 523, type: !357)
!813 = !DILocation(line: 523, column: 18, scope: !806)
!814 = !DILocation(line: 523, column: 25, scope: !806)
!815 = !DILocation(line: 523, column: 36, scope: !806)
!816 = !DILocation(line: 2052, column: 22, scope: !768, inlinedAt: !817)
!817 = distinct !DILocation(line: 527, column: 26, scope: !806)
!818 = !DILocation(line: 527, column: 40, scope: !806)
!819 = !DILocation(line: 527, column: 13, scope: !806)
!820 = !DILocation(line: 529, column: 6, scope: !806)
!821 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hae148dff839707cdE", scope: !131, file: !734, line: 2369, type: !822, scopeLine: 2369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{!137, !678, !137, !137, !357}
!824 = !{!825, !826, !827, !828, !829, !831}
!825 = !DILocalVariable(name: "self", arg: 1, scope: !821, file: !734, line: 2369, type: !678)
!826 = !DILocalVariable(name: "current", arg: 2, scope: !821, file: !734, line: 2370, type: !137)
!827 = !DILocalVariable(name: "new", arg: 3, scope: !821, file: !734, line: 2371, type: !137)
!828 = !DILocalVariable(name: "order", arg: 4, scope: !821, file: !734, line: 2372, type: !357)
!829 = !DILocalVariable(name: "x", scope: !830, file: !734, line: 2377, type: !137, align: 8)
!830 = distinct !DILexicalBlock(scope: !821, file: !734, line: 2377, column: 21)
!831 = !DILocalVariable(name: "x", scope: !832, file: !734, line: 2378, type: !137, align: 8)
!832 = distinct !DILexicalBlock(scope: !821, file: !734, line: 2378, column: 21)
!833 = !DILocation(line: 2369, column: 37, scope: !821)
!834 = !DILocation(line: 2370, column: 37, scope: !821)
!835 = !DILocation(line: 2371, column: 37, scope: !821)
!836 = !DILocation(line: 2372, column: 37, scope: !821)
!837 = !DILocation(line: 2376, column: 45, scope: !821)
!838 = !{i8 0, i8 5}
!839 = !DILocation(line: 2373, column: 23, scope: !821)
!840 = !{i64 0, i64 2}
!841 = !DILocation(line: 2373, column: 17, scope: !821)
!842 = !DILocation(line: 2377, column: 24, scope: !821)
!843 = !DILocation(line: 2377, column: 24, scope: !830)
!844 = !DILocation(line: 2377, column: 30, scope: !830)
!845 = !DILocation(line: 2377, column: 30, scope: !821)
!846 = !DILocation(line: 2378, column: 25, scope: !821)
!847 = !DILocation(line: 2378, column: 25, scope: !832)
!848 = !DILocation(line: 2378, column: 31, scope: !832)
!849 = !DILocation(line: 2378, column: 31, scope: !821)
!850 = !DILocation(line: 2380, column: 14, scope: !821)
!851 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17h6906b72f4e87a135E", scope: !131, file: !734, line: 2423, type: !852, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !869)
!852 = !DISubroutineType(types: !853)
!853 = !{!854, !678, !137, !137, !357, !357}
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !377, file: !6, size: 128, align: 64, elements: !855, templateParams: !18, identifier: "e6bb44516b3ea981cefd7f4e89ebc89")
!855 = !{!856}
!856 = !DICompositeType(tag: DW_TAG_variant_part, scope: !854, file: !6, size: 128, align: 64, elements: !857, templateParams: !18, identifier: "83c1d0f226c647451f256c0838539e2b", discriminator: !868)
!857 = !{!858, !864}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !856, file: !6, baseType: !859, size: 128, align: 64, extraData: i64 0)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !854, file: !6, size: 128, align: 64, elements: !860, templateParams: !862, identifier: "b73928a5c326b4f771e4b3573236ffc9")
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !859, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!862 = !{!139, !863}
!863 = !DITemplateTypeParameter(name: "E", type: !137)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !856, file: !6, baseType: !865, size: 128, align: 64, extraData: i64 1)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !854, file: !6, size: 128, align: 64, elements: !866, templateParams: !862, identifier: "4a74b40f2a475f86651bd5e926746893")
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !865, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, scope: !854, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!869 = !{!870, !871, !872, !873, !874}
!870 = !DILocalVariable(name: "self", arg: 1, scope: !851, file: !734, line: 2423, type: !678)
!871 = !DILocalVariable(name: "current", arg: 2, scope: !851, file: !734, line: 2424, type: !137)
!872 = !DILocalVariable(name: "new", arg: 3, scope: !851, file: !734, line: 2425, type: !137)
!873 = !DILocalVariable(name: "success", arg: 4, scope: !851, file: !734, line: 2426, type: !357)
!874 = !DILocalVariable(name: "failure", arg: 5, scope: !851, file: !734, line: 2427, type: !357)
!875 = !DILocation(line: 2423, column: 37, scope: !851)
!876 = !DILocation(line: 2424, column: 37, scope: !851)
!877 = !DILocation(line: 2425, column: 37, scope: !851)
!878 = !DILocation(line: 2426, column: 37, scope: !851)
!879 = !DILocation(line: 2427, column: 37, scope: !851)
!880 = !DILocalVariable(name: "self", arg: 1, scope: !881, file: !769, line: 2052, type: !885)
!881 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h2e509448716cce23E", scope: !134, file: !769, line: 2052, type: !882, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !886)
!882 = !DISubroutineType(types: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!886 = !{!880}
!887 = !DILocation(line: 2052, column: 22, scope: !881, inlinedAt: !888)
!888 = distinct !DILocation(line: 2429, column: 50, scope: !851)
!889 = !DILocation(line: 2429, column: 26, scope: !851)
!890 = !DILocation(line: 2430, column: 14, scope: !851)
!891 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hfcfd209127756b38E", scope: !131, file: !734, line: 2256, type: !892, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !894)
!892 = !DISubroutineType(types: !893)
!893 = !{!137, !678, !357}
!894 = !{!895, !896}
!895 = !DILocalVariable(name: "self", arg: 1, scope: !891, file: !734, line: 2256, type: !678)
!896 = !DILocalVariable(name: "order", arg: 2, scope: !891, file: !734, line: 2256, type: !357)
!897 = !DILocation(line: 2256, column: 25, scope: !891)
!898 = !DILocation(line: 2256, column: 32, scope: !891)
!899 = !DILocation(line: 2052, column: 22, scope: !881, inlinedAt: !900)
!900 = distinct !DILocation(line: 2258, column: 38, scope: !891)
!901 = !DILocation(line: 2258, column: 26, scope: !891)
!902 = !DILocation(line: 2259, column: 14, scope: !891)
!903 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h8d8ef29931230ce0E", scope: !131, file: !734, line: 2283, type: !904, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !906)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !678, !137, !357}
!906 = !{!907, !908, !909}
!907 = !DILocalVariable(name: "self", arg: 1, scope: !903, file: !734, line: 2283, type: !678)
!908 = !DILocalVariable(name: "val", arg: 2, scope: !903, file: !734, line: 2283, type: !137)
!909 = !DILocalVariable(name: "order", arg: 3, scope: !903, file: !734, line: 2283, type: !357)
!910 = !DILocation(line: 2283, column: 26, scope: !903)
!911 = !DILocation(line: 2283, column: 33, scope: !903)
!912 = !DILocation(line: 2283, column: 49, scope: !903)
!913 = !DILocation(line: 2052, column: 22, scope: !881, inlinedAt: !914)
!914 = distinct !DILocation(line: 2285, column: 39, scope: !903)
!915 = !DILocation(line: 2285, column: 26, scope: !903)
!916 = !DILocation(line: 2286, column: 14, scope: !903)
!917 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h05271bb85361a40fE", scope: !25, file: !734, line: 3620, type: !724, scopeLine: 3620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!918 = !DILocation(line: 175, column: 18, scope: !919, inlinedAt: !920)
!919 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17hfc524f21fc32cf6eE", scope: !723, file: !722, line: 165, type: !724, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!920 = distinct !DILocation(line: 3621, column: 5, scope: !917)
!921 = !DILocation(line: 3622, column: 2, scope: !917)
!922 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h771919ebcaea084bE", scope: !25, file: !734, line: 3215, type: !923, scopeLine: 3215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{!854, !884, !137, !137, !357, !357}
!925 = !{!926, !927, !928, !929, !930, !931, !933}
!926 = !DILocalVariable(name: "dst", arg: 1, scope: !922, file: !734, line: 3216, type: !884)
!927 = !DILocalVariable(name: "old", arg: 2, scope: !922, file: !734, line: 3217, type: !137)
!928 = !DILocalVariable(name: "new", arg: 3, scope: !922, file: !734, line: 3218, type: !137)
!929 = !DILocalVariable(name: "success", arg: 4, scope: !922, file: !734, line: 3219, type: !357)
!930 = !DILocalVariable(name: "failure", arg: 5, scope: !922, file: !734, line: 3220, type: !357)
!931 = !DILocalVariable(name: "val", scope: !932, file: !734, line: 3223, type: !137, align: 8)
!932 = distinct !DILexicalBlock(scope: !922, file: !734, line: 3223, column: 5)
!933 = !DILocalVariable(name: "ok", scope: !932, file: !734, line: 3223, type: !333, align: 1)
!934 = !DILocation(line: 3216, column: 5, scope: !922)
!935 = !DILocation(line: 3217, column: 5, scope: !922)
!936 = !DILocation(line: 3218, column: 5, scope: !922)
!937 = !DILocation(line: 3219, column: 5, scope: !922)
!938 = !DILocation(line: 3220, column: 5, scope: !922)
!939 = !DILocation(line: 3224, column: 15, scope: !922)
!940 = !DILocation(line: 3224, column: 9, scope: !922)
!941 = !DILocation(line: 3237, column: 34, scope: !922)
!942 = !DILocation(line: 3238, column: 34, scope: !922)
!943 = !DILocation(line: 3239, column: 33, scope: !922)
!944 = !DILocation(line: 3223, column: 10, scope: !922)
!945 = !DILocation(line: 3223, column: 10, scope: !932)
!946 = !DILocation(line: 3223, column: 15, scope: !922)
!947 = !DILocation(line: 3223, column: 15, scope: !932)
!948 = !DILocation(line: 3244, column: 8, scope: !932)
!949 = !DILocation(line: 3234, column: 34, scope: !922)
!950 = !DILocation(line: 3235, column: 34, scope: !922)
!951 = !DILocation(line: 3236, column: 33, scope: !922)
!952 = !DILocation(line: 3228, column: 35, scope: !922)
!953 = !DILocation(line: 3229, column: 35, scope: !922)
!954 = !DILocation(line: 3230, column: 34, scope: !922)
!955 = !DILocation(line: 3231, column: 35, scope: !922)
!956 = !DILocation(line: 3232, column: 35, scope: !922)
!957 = !DILocation(line: 3233, column: 34, scope: !922)
!958 = !DILocation(line: 3225, column: 35, scope: !922)
!959 = !DILocation(line: 3226, column: 35, scope: !922)
!960 = !DILocation(line: 3227, column: 34, scope: !922)
!961 = !DILocation(line: 3241, column: 29, scope: !922)
!962 = !DILocation(line: 3240, column: 28, scope: !922)
!963 = !DILocation(line: 3244, column: 30, scope: !932)
!964 = !DILocation(line: 3244, column: 5, scope: !932)
!965 = !DILocation(line: 3244, column: 13, scope: !932)
!966 = !DILocation(line: 3245, column: 2, scope: !922)
!967 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h43cd0e87c11bd6b9E", scope: !25, file: !734, line: 3122, type: !968, scopeLine: 3122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!357, !357}
!970 = !{!971}
!971 = !DILocalVariable(name: "order", arg: 1, scope: !967, file: !734, line: 3122, type: !357)
!972 = !DILocation(line: 3122, column: 31, scope: !967)
!973 = !DILocation(line: 3123, column: 11, scope: !967)
!974 = !DILocation(line: 3123, column: 5, scope: !967)
!975 = !DILocation(line: 3125, column: 20, scope: !967)
!976 = !DILocation(line: 3124, column: 20, scope: !967)
!977 = !DILocation(line: 3127, column: 20, scope: !967)
!978 = !DILocation(line: 3128, column: 19, scope: !967)
!979 = !DILocation(line: 3126, column: 19, scope: !967)
!980 = !DILocation(line: 3130, column: 2, scope: !967)
!981 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17hbe1909ebada172e1E", scope: !25, file: !734, line: 3250, type: !982, scopeLine: 3250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !999)
!982 = !DISubroutineType(types: !983)
!983 = !{!984, !772, !33, !33, !357, !357}
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !377, file: !6, size: 16, align: 8, elements: !985, templateParams: !18, identifier: "49fe65abfdf3b14af8221f50bcda9f92")
!985 = !{!986}
!986 = !DICompositeType(tag: DW_TAG_variant_part, scope: !984, file: !6, size: 16, align: 8, elements: !987, templateParams: !18, identifier: "8ec70f4c61c745b01cd438efc292162", discriminator: !998)
!987 = !{!988, !994}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !986, file: !6, baseType: !989, size: 16, align: 8, extraData: i64 0)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !984, file: !6, size: 16, align: 8, elements: !990, templateParams: !992, identifier: "4ea01b737d724316934105f47f9fa401")
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !989, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!992 = !{!35, !993}
!993 = !DITemplateTypeParameter(name: "E", type: !33)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !986, file: !6, baseType: !995, size: 16, align: 8, extraData: i64 1)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !984, file: !6, size: 16, align: 8, elements: !996, templateParams: !992, identifier: "fa35741ebd6785ada2edf5b37e5c79b6")
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !995, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!998 = !DIDerivedType(tag: DW_TAG_member, scope: !984, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1007}
!1000 = !DILocalVariable(name: "dst", arg: 1, scope: !981, file: !734, line: 3251, type: !772)
!1001 = !DILocalVariable(name: "old", arg: 2, scope: !981, file: !734, line: 3252, type: !33)
!1002 = !DILocalVariable(name: "new", arg: 3, scope: !981, file: !734, line: 3253, type: !33)
!1003 = !DILocalVariable(name: "success", arg: 4, scope: !981, file: !734, line: 3254, type: !357)
!1004 = !DILocalVariable(name: "failure", arg: 5, scope: !981, file: !734, line: 3255, type: !357)
!1005 = !DILocalVariable(name: "val", scope: !1006, file: !734, line: 3258, type: !33, align: 1)
!1006 = distinct !DILexicalBlock(scope: !981, file: !734, line: 3258, column: 5)
!1007 = !DILocalVariable(name: "ok", scope: !1006, file: !734, line: 3258, type: !333, align: 1)
!1008 = !DILocation(line: 3251, column: 5, scope: !981)
!1009 = !DILocation(line: 3252, column: 5, scope: !981)
!1010 = !DILocation(line: 3253, column: 5, scope: !981)
!1011 = !DILocation(line: 3254, column: 5, scope: !981)
!1012 = !DILocation(line: 3255, column: 5, scope: !981)
!1013 = !DILocation(line: 3259, column: 15, scope: !981)
!1014 = !DILocation(line: 3259, column: 9, scope: !981)
!1015 = !DILocation(line: 3272, column: 34, scope: !981)
!1016 = !DILocation(line: 3273, column: 34, scope: !981)
!1017 = !DILocation(line: 3274, column: 33, scope: !981)
!1018 = !DILocation(line: 3258, column: 10, scope: !981)
!1019 = !DILocation(line: 3258, column: 10, scope: !1006)
!1020 = !DILocation(line: 3258, column: 15, scope: !981)
!1021 = !DILocation(line: 3258, column: 15, scope: !1006)
!1022 = !DILocation(line: 3279, column: 8, scope: !1006)
