; ModuleID = '4lv4ot62mtzjqsus'
source_filename = "4lv4ot62mtzjqsus"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "aced79d1f9b7cb7d6f82837244f1645a")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "ad617f2cb364de4d947c4a19aff26048")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "7892d556e0756cc7ae57a4875bee92c4")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "5ab2a828a6f7aaafba6adb5c7bf2d262")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "a15b239e031edc168eb6a971605531d3")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "aec6044d21eb6867fd137b6da32ab3a")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "e54a2e9c097b77f13c62ace0a2416989")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17hdf161ef19fccc61fE", scope: !56, file: !58, line: 161, type: !59, isLocal: true, isDefinition: true, align: 8)
!56 = !DINamespace(name: "interrupts", scope: !57)
!57 = !DINamespace(name: "theo", scope: null)
!58 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !56, file: !2, align: 8, elements: !60, templateParams: !27, identifier: "9909480715dbc0e61c838859822f00f5")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !59, file: !2, baseType: !7, align: 8)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h708cc54bd0b209b2E", scope: !64, file: !67, line: 29, type: !68, isLocal: true, isDefinition: true, align: 128)
!64 = !DINamespace(name: "__stability", scope: !65)
!65 = !DINamespace(name: "deref", scope: !66)
!66 = !DINamespace(name: "{impl#0}", scope: !56)
!67 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !69, file: !2, size: 33024, align: 128, elements: !71, templateParams: !101, identifier: "52160c30bed9d63353e43f27a46a94ab")
!69 = !DINamespace(name: "lazy", scope: !70)
!70 = !DINamespace(name: "lazy_static", scope: null)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !73, size: 33024, align: 128)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !74, file: !2, size: 33024, align: 128, elements: !76, templateParams: !101, identifier: "28df400f6b10dcbf61d13830c772b6cb")
!74 = !DINamespace(name: "once", scope: !75)
!75 = !DINamespace(name: "spin", scope: null)
!76 = !{!77, !90}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !2, baseType: !78, size: 64, align: 64, offset: 32896)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !79, file: !2, size: 64, align: 64, elements: !82, templateParams: !27, identifier: "2430928ce830a626955c329833891eda")
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !81)
!81 = !DINamespace(name: "core", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !78, file: !2, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !85, file: !2, size: 64, align: 64, elements: !86, templateParams: !88, identifier: "d8ddfc9344a00bdf32bf210691c75ecb")
!85 = !DINamespace(name: "cell", scope: !81)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !2, baseType: !9, size: 64, align: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !2, baseType: !91, size: 32896, align: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !85, file: !2, size: 32896, align: 128, elements: !92, templateParams: !264, identifier: "3438beef7e45e9d4dba3c371cbd5a176")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !94, size: 32896, align: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !95, file: !2, size: 32896, align: 128, elements: !96, templateParams: !27, identifier: "6993180dcd0f6e2e943a8912eeb70bec")
!95 = !DINamespace(name: "option", scope: !81)
!96 = !{!97}
!97 = !DICompositeType(tag: DW_TAG_variant_part, scope: !94, file: !2, size: 32896, align: 128, elements: !98, templateParams: !27, identifier: "dd0e86f61f0e270ce21be333f6b9e8c5", discriminator: !263)
!98 = !{!99, !259}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !97, file: !2, baseType: !100, size: 32896, align: 128, extraData: i64 2)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !94, file: !2, size: 32896, align: 128, elements: !27, templateParams: !101, identifier: "b4633697879bef08515a485fa6fda5a3")
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !104, file: !2, size: 32896, align: 128, elements: !106, templateParams: !27, identifier: "273c03f4b35a1e10f2e279ea96516229")
!104 = !DINamespace(name: "interrupt_descriptor_table", scope: !105)
!105 = !DINamespace(name: "cpu_interrupts", scope: null)
!106 = !{!107, !255, !257, !258}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !103, file: !2, baseType: !108, size: 32768, align: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !109, file: !2, size: 32768, align: 128, elements: !112, templateParams: !27, identifier: "91f0aeb55a734c21b1fffe8978ddd880")
!109 = !DINamespace(name: "idt", scope: !110)
!110 = !DINamespace(name: "structures", scope: !111)
!111 = !DINamespace(name: "x86_64", scope: null)
!112 = !{!113, !152, !153, !154, !155, !156, !157, !158, !159, !178, !179, !197, !198, !199, !200, !221, !222, !223, !224, !242, !243, !244, !248, !249, !250, !251}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !108, file: !2, baseType: !114, size: 128, align: 32)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !109, file: !2, size: 128, align: 32, elements: !115, templateParams: !150, identifier: "c07090066229a58bffcd5a1a3c1c9b23")
!115 = !{!116, !118, !119, !123, !124, !126, !127}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !114, file: !2, baseType: !117, size: 16, align: 16)
!117 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !109, file: !2, size: 16, align: 16, elements: !121, templateParams: !27, identifier: "a1c59f7dbd6ac6ee47640e0ff182425c")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !117, size: 16, align: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !114, file: !2, baseType: !128, align: 8, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !130, identifier: "c4f3e56443d1d21bcad3e30edc1ed3bd")
!129 = !DINamespace(name: "marker", scope: !81)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !109, file: !2, size: 320, align: 64, elements: !136, templateParams: !27, identifier: "63033cc7f76eed163ae105503ff9b538")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !2, baseType: !138, size: 320, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !109, file: !2, size: 320, align: 64, elements: !139, templateParams: !27, identifier: "287bd28ca907b477b8a6a6f125c2dc8b")
!139 = !{!140, !146, !147, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !142, file: !2, size: 64, align: 64, elements: !143, templateParams: !27, identifier: "f319a619b938dd9d76cda81460978cdb")
!142 = !DINamespace(name: "addr", scope: !111)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !141, file: !2, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 256)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "F", type: !132)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !108, file: !2, baseType: !160, size: 128, align: 32, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !161, templateParams: !176, identifier: "a72435b0dd29b0166ee3acf002a3ab4a")
!161 = !{!162, !163, !164, !165, !166, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !160, file: !2, baseType: !117, size: 16, align: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !160, file: !2, baseType: !169, align: 8, offset: 128)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !170, identifier: "7edb8443337f40f99cc2a2f9f8777eda")
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !135, !145}
!175 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "F", type: !172)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1280)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !109, file: !2, size: 128, align: 32, elements: !181, templateParams: !195, identifier: "4d328d62643347aca5ed7b83c4e1d97")
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !180, file: !2, baseType: !117, size: 16, align: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !180, file: !2, baseType: !189, align: 8, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !190, identifier: "b18193b570c67a03d7b2a9bb7b33de6c")
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !135, !145}
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "F", type: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1664)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !108, file: !2, baseType: !201, size: 128, align: 32, offset: 1792)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !109, file: !2, size: 128, align: 32, elements: !202, templateParams: !219, identifier: "2bb7d30a8da6cd4efa106d137e234389")
!202 = !{!203, !204, !205, !206, !207, !208, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !201, file: !2, baseType: !117, size: 16, align: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !201, file: !2, baseType: !210, align: 8, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !211, identifier: "53dfd5386b895fab957f86f36109f499")
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "T", type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !135, !216}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !109, file: !2, size: 64, align: 64, elements: !217, templateParams: !27, identifier: "b0f348801a108319c9c76df3aad040f2")
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !216, file: !2, baseType: !145, size: 64, align: 64)
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "F", type: !213)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1920)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !108, file: !2, baseType: !225, size: 128, align: 32, offset: 2304)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !226, templateParams: !240, identifier: "fa79490fb12a32ed17ef7821ac4e4de6")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !225, file: !2, baseType: !117, size: 16, align: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !225, file: !2, baseType: !234, align: 8, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !235, identifier: "ec39bcf007a6fcefca8f18280f160658")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubroutineType(types: !239)
!239 = !{!175, !135}
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "F", type: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !108, file: !2, baseType: !245, size: 1024, align: 32, offset: 2688)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, align: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8, lowerBound: 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3712)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3840)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 3968)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !108, file: !2, baseType: !252, size: 28672, align: 32, offset: 4096)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 28672, align: 32, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 224, lowerBound: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32768)
!256 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32776)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32784)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !97, file: !2, baseType: !260, size: 32896, align: 128)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !94, file: !2, size: 32896, align: 128, elements: !261, templateParams: !101, identifier: "dade41c847053b5c9b1cc2d60154aa32")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !103, size: 32896, align: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !2, baseType: !39, size: 8, align: 8, offset: 32768, flags: DIFlagArtificial)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !94)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17h3c6d2a9d0b31e28eE", scope: !268, file: !58, line: 161, type: !269, isLocal: true, isDefinition: true, align: 8)
!268 = !DINamespace(name: "peripherals", scope: !57)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !268, file: !2, align: 8, elements: !270, templateParams: !27, identifier: "2aa00bfefb58ebb081f25a8e9b33243b")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !269, file: !2, baseType: !7, align: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h5c0d439728776f48E", scope: !274, file: !67, line: 29, type: !277, isLocal: true, isDefinition: true, align: 64)
!274 = !DINamespace(name: "__stability", scope: !275)
!275 = !DINamespace(name: "deref", scope: !276)
!276 = !DINamespace(name: "{impl#0}", scope: !268)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !69, file: !2, size: 1920, align: 64, elements: !278, templateParams: !293, identifier: "3df4fedb46b1c7a2303d5de7842656a8")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !2, baseType: !280, size: 1920, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !74, file: !2, size: 1920, align: 64, elements: !281, templateParams: !293, identifier: "bd92ff6e2bc9ae2dbfbd981d417e66a7")
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !2, baseType: !78, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !2, baseType: !284, size: 1856, align: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !85, file: !2, size: 1856, align: 64, elements: !285, templateParams: !330, identifier: "2a2e7c05ffe42ff797b680c885e72acc")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 1856, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !95, file: !2, size: 1856, align: 64, elements: !288, templateParams: !27, identifier: "22c8479f4f473bf4e6cdb24c71bb7494")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 1856, align: 64, elements: !290, templateParams: !27, identifier: "6fcc2863d8c1ebe9a5fefa01cc761868", discriminator: !329)
!290 = !{!291, !325}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 1856, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 1856, align: 64, elements: !27, templateParams: !293, identifier: "ae0824040bf744c1a7c9352d49cf364d")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !296, file: !2, size: 1792, align: 64, elements: !297, templateParams: !323, identifier: "b737f4da57470107d9c92cca444179bf")
!296 = !DINamespace(name: "mutex", scope: !75)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !295, file: !2, baseType: !299, size: 1792, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !300, file: !2, size: 1792, align: 64, elements: !301, templateParams: !323, identifier: "4d0cbce15542d513be7e81aed0b886a4")
!300 = !DINamespace(name: "spin", scope: !296)
!301 = !{!302, !308, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !299, file: !2, baseType: !303, align: 8)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !304, identifier: "79f81c459de6dca4d9657eb000118ae2")
!304 = !{!305}
!305 = !DITemplateTypeParameter(name: "T", type: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !307, file: !2, align: 8, elements: !27, identifier: "739be00bff07a22810bf86daf420515a")
!307 = !DINamespace(name: "relax", scope: !75)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !2, baseType: !309, size: 8, align: 8)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !79, file: !2, size: 8, align: 8, elements: !310, templateParams: !27, identifier: "e2364d2a6ff719de740e5eb5e910ee4d")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !309, file: !2, baseType: !312, size: 8, align: 8)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !85, file: !2, size: 8, align: 8, elements: !313, templateParams: !315, identifier: "e5c1894a60a57e2d6018f7e1849f9cfb")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !2, baseType: !39, size: 8, align: 8)
!315 = !{!316}
!316 = !DITemplateTypeParameter(name: "T", type: !39)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !2, baseType: !318, size: 1728, align: 64, offset: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !85, file: !2, size: 1728, align: 64, elements: !319, templateParams: !321, identifier: "31ac09484fb692514c78e02a5e706aeb")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !2, baseType: !15, size: 1728, align: 64)
!321 = !{!322}
!322 = !DITemplateTypeParameter(name: "T", type: !15)
!323 = !{!322, !324}
!324 = !DITemplateTypeParameter(name: "R", type: !306)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !326, size: 1856, align: 64, extraData: i64 1)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 1856, align: 64, elements: !327, templateParams: !293, identifier: "6e9cc192cab81f8c6b6da67b67374f11")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !295, size: 1792, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !287)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117ha2d70d0d8c9ed613E", scope: !334, file: !58, line: 161, type: !335, isLocal: true, isDefinition: true, align: 8)
!334 = !DINamespace(name: "serial", scope: !57)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !334, file: !2, align: 8, elements: !336, templateParams: !27, identifier: "b7adb2d385d4e44d435269c801623e8")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !335, file: !2, baseType: !7, align: 8)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hfa41533a5c45a4d7E", scope: !340, file: !67, line: 29, type: !343, isLocal: true, isDefinition: true, align: 64)
!340 = !DINamespace(name: "__stability", scope: !341)
!341 = !DINamespace(name: "deref", scope: !342)
!342 = !DINamespace(name: "{impl#0}", scope: !334)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !69, file: !2, size: 192, align: 64, elements: !344, templateParams: !359, identifier: "1839b30fcaeb93bb45b4de5ee87a77ce")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !346, size: 192, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !74, file: !2, size: 192, align: 64, elements: !347, templateParams: !359, identifier: "250711710e896e064fca84ab264bd58")
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !346, file: !2, baseType: !78, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !2, baseType: !350, size: 128, align: 16)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !85, file: !2, size: 128, align: 16, elements: !351, templateParams: !440, identifier: "995d60e477154b4fc2187f16029c5423")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !2, baseType: !353, size: 128, align: 16)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !95, file: !2, size: 128, align: 16, elements: !354, templateParams: !27, identifier: "3ea5fd59cff3a4b96429e9cd383b691c")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_variant_part, scope: !353, file: !2, size: 128, align: 16, elements: !356, templateParams: !27, identifier: "438d1dca4273a7daa4be63e89401673e", discriminator: !439)
!356 = !{!357, !435}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !355, file: !2, baseType: !358, size: 128, align: 16, extraData: i64 0)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !353, file: !2, size: 128, align: 16, elements: !27, templateParams: !359, identifier: "4ae9ceac518b3101efcfdff869986906")
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !296, file: !2, size: 112, align: 16, elements: !362, templateParams: !434, identifier: "1aa186e41b1e6a4423357e6108ff9197")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !361, file: !2, baseType: !364, size: 112, align: 16)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !300, file: !2, size: 112, align: 16, elements: !365, templateParams: !434, identifier: "8c4034cdfcd4be10108e0a142069e7b1")
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !364, file: !2, baseType: !303, align: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !364, file: !2, baseType: !309, size: 8, align: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !2, baseType: !369, size: 96, align: 16, offset: 16)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !85, file: !2, size: 96, align: 16, elements: !370, templateParams: !432, identifier: "6c8af0789d40e1b91c077de03bbb0f0d")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !2, baseType: !372, size: 96, align: 16)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !373, file: !2, size: 96, align: 16, elements: !375, templateParams: !27, identifier: "6c510780e0485fd28e2b31dbed860fd4")
!373 = !DINamespace(name: "port", scope: !374)
!374 = !DINamespace(name: "uart_16550", scope: null)
!375 = !{!376, !395, !412, !413, !414, !415}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !372, file: !2, baseType: !377, size: 16, align: 16)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !380, templateParams: !393, identifier: "a8eb19b2ce088a9b7e474711afc9a3ab")
!378 = !DINamespace(name: "port", scope: !379)
!379 = !DINamespace(name: "instructions", scope: !111)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !377, file: !2, baseType: !117, size: 16, align: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !377, file: !2, baseType: !383, align: 8)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !384, identifier: "8d33ffc0710a4c2f1f458093d077c9a3")
!384 = !{!385}
!385 = !DITemplateTypeParameter(name: "T", type: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !387, templateParams: !27, identifier: "61129a9fb5f505dc2c1bda9fef39cabd")
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !386, file: !2, baseType: !39, size: 8, align: 8)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !386, file: !2, baseType: !390, align: 8, offset: 8)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !378, file: !2, align: 8, elements: !391, templateParams: !27, identifier: "7b61641c06de0483f7557b84ccab5a8b")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !7, align: 8)
!393 = !{!316, !394}
!394 = !DITemplateTypeParameter(name: "A", type: !390)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 16)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !397, templateParams: !410, identifier: "550c9cc19a4cb4e49a85e4180dcb750d")
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !396, file: !2, baseType: !117, size: 16, align: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !396, file: !2, baseType: !400, align: 8)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !401, identifier: "28c51fa43b12fc7ea0512a3de568eae")
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !404, templateParams: !27, identifier: "ea50742d5ed69251b6c8fa71a4c76d63")
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !39, size: 8, align: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !403, file: !2, baseType: !407, align: 8, offset: 8)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !378, file: !2, align: 8, elements: !408, templateParams: !27, identifier: "ad2eebbeb6c16677e2cecf7281405b3a")
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !407, file: !2, baseType: !7, align: 8)
!410 = !{!316, !411}
!411 = !DITemplateTypeParameter(name: "A", type: !407)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 48)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !372, file: !2, baseType: !416, size: 16, align: 16, offset: 80)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !417, templateParams: !430, identifier: "f491eca81b00aee76f9218cba6b4bf5f")
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !416, file: !2, baseType: !117, size: 16, align: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !416, file: !2, baseType: !420, align: 8)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !421, identifier: "69524a05c8dcee762fc634bf4ae0eadd")
!421 = !{!422}
!422 = !DITemplateTypeParameter(name: "T", type: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !424, templateParams: !27, identifier: "913df7bdd9f6ee5c80105c0817f3c8da")
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !423, file: !2, baseType: !39, size: 8, align: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !423, file: !2, baseType: !427, align: 8, offset: 8)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !378, file: !2, align: 8, elements: !428, templateParams: !27, identifier: "90201ce8d3293861bd06adb8c990f9b0")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !427, file: !2, baseType: !7, align: 8)
!430 = !{!316, !431}
!431 = !DITemplateTypeParameter(name: "A", type: !427)
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !372)
!434 = !{!433, !324}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !355, file: !2, baseType: !436, size: 128, align: 16, extraData: i64 1)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !353, file: !2, size: 128, align: 16, elements: !437, templateParams: !359, identifier: "b1c3698651920f2a8c03f53836dc5483")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !436, file: !2, baseType: !361, size: 112, align: 16, offset: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!440 = !{!441}
!441 = !DITemplateTypeParameter(name: "T", type: !353)
!442 = !{i32 8, !"PIC Level", i32 2}
!443 = !{i32 7, !"PIE Level", i32 2}
!444 = !{i32 2, !"Dwarf Version", i32 4}
!445 = !{i32 2, !"Debug Info Version", i32 3}
!446 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !447, producer: "clang LLVM (rustc version 1.71.0-nightly (d0f204e4d 2023-04-16))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, globals: !465, splitDebugInlining: false)
!447 = !DIFile(filename: "src/main.rs/@/4lv4ot62mtzjqsus", directory: "/Users/yaw/self/theo")
!448 = !{!49, !449, !458}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !450, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !453)
!450 = !DINamespace(name: "v1", scope: !451)
!451 = !DINamespace(name: "rt", scope: !452)
!452 = !DINamespace(name: "fmt", scope: !81)
!453 = !{!454, !455, !456, !457}
!454 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!455 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!456 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!457 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !459)
!459 = !{!460, !461, !462, !463, !464}
!460 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!464 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!465 = !{!0, !54, !62, !266, !272, !332, !338}
!466 = distinct !DISubprogram(name: "index_mut", linkageName: "_ZN109_$LT$x86_64..structures..idt..InterruptDescriptorTable$u20$as$u20$core..ops..index..IndexMut$LT$usize$GT$$GT$9index_mut17h0791657b94505111E", scope: !468, file: !467, line: 575, type: !469, scopeLine: 575, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !486)
!467 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!468 = !DINamespace(name: "{impl#2}", scope: !109)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !472, !9, !473}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !475, file: !2, size: 192, align: 64, elements: !477, templateParams: !27, identifier: "24a132ec608676bf484e0b39817cad59")
!475 = !DINamespace(name: "location", scope: !476)
!476 = !DINamespace(name: "panic", scope: !81)
!477 = !{!478, !484, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !474, file: !2, baseType: !479, size: 128, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !480, templateParams: !27, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!480 = !{!481, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !479, file: !2, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !479, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !474, file: !2, baseType: !125, size: 32, align: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !474, file: !2, baseType: !125, size: 32, align: 32, offset: 160)
!486 = !{!487, !488, !489, !491, !493, !495, !497}
!487 = !DILocalVariable(name: "self", arg: 1, scope: !466, file: !467, line: 575, type: !472)
!488 = !DILocalVariable(name: "index", arg: 2, scope: !466, file: !467, line: 575, type: !9)
!489 = !DILocalVariable(name: "i", scope: !490, file: !467, line: 589, type: !9, align: 8)
!490 = distinct !DILexicalBlock(scope: !466, file: !467, line: 589, column: 13)
!491 = !DILocalVariable(name: "i", scope: !492, file: !467, line: 590, type: !9, align: 8)
!492 = distinct !DILexicalBlock(scope: !466, file: !467, line: 590, column: 13)
!493 = !DILocalVariable(name: "i", scope: !494, file: !467, line: 591, type: !9, align: 8)
!494 = distinct !DILexicalBlock(scope: !466, file: !467, line: 591, column: 13)
!495 = !DILocalVariable(name: "i", scope: !496, file: !467, line: 594, type: !9, align: 8)
!496 = distinct !DILexicalBlock(scope: !466, file: !467, line: 594, column: 13)
!497 = !DILocalVariable(name: "i", scope: !498, file: !467, line: 595, type: !9, align: 8)
!498 = distinct !DILexicalBlock(scope: !466, file: !467, line: 595, column: 13)
!499 = !DILocation(line: 575, column: 18, scope: !466)
!500 = !DILocation(line: 575, column: 29, scope: !466)
!501 = !DILocation(line: 589, column: 13, scope: !490)
!502 = !DILocation(line: 590, column: 13, scope: !492)
!503 = !DILocation(line: 591, column: 13, scope: !494)
!504 = !DILocation(line: 594, column: 13, scope: !496)
!505 = !DILocation(line: 595, column: 13, scope: !498)
!506 = !DILocation(line: 576, column: 9, scope: !466)
!507 = !DILocation(line: 589, column: 17, scope: !466)
!508 = !DILocation(line: 577, column: 18, scope: !466)
!509 = !DILocation(line: 577, column: 39, scope: !466)
!510 = !DILocation(line: 578, column: 18, scope: !466)
!511 = !DILocation(line: 578, column: 32, scope: !466)
!512 = !DILocation(line: 579, column: 18, scope: !466)
!513 = !DILocation(line: 579, column: 49, scope: !466)
!514 = !DILocation(line: 580, column: 18, scope: !466)
!515 = !DILocation(line: 580, column: 37, scope: !466)
!516 = !DILocation(line: 581, column: 18, scope: !466)
!517 = !DILocation(line: 581, column: 35, scope: !466)
!518 = !DILocation(line: 582, column: 18, scope: !466)
!519 = !DILocation(line: 582, column: 47, scope: !466)
!520 = !DILocation(line: 583, column: 18, scope: !466)
!521 = !DILocation(line: 583, column: 41, scope: !466)
!522 = !DILocation(line: 584, column: 18, scope: !466)
!523 = !DILocation(line: 584, column: 47, scope: !466)
!524 = !DILocation(line: 585, column: 18, scope: !466)
!525 = !DILocation(line: 585, column: 54, scope: !466)
!526 = !DILocation(line: 586, column: 19, scope: !466)
!527 = !DILocation(line: 586, column: 46, scope: !466)
!528 = !DILocation(line: 587, column: 19, scope: !466)
!529 = !DILocation(line: 587, column: 47, scope: !466)
!530 = !DILocation(line: 588, column: 19, scope: !466)
!531 = !DILocation(line: 588, column: 42, scope: !466)
!532 = !DILocation(line: 590, column: 13, scope: !466)
!533 = !DILocation(line: 590, column: 22, scope: !466)
!534 = !DILocation(line: 591, column: 13, scope: !466)
!535 = !DILocation(line: 591, column: 35, scope: !466)
!536 = !DILocation(line: 591, column: 44, scope: !466)
!537 = !DILocation(line: 591, column: 53, scope: !466)
!538 = !DILocation(line: 594, column: 13, scope: !466)
!539 = !DILocation(line: 594, column: 23, scope: !496)
!540 = !DILocation(line: 590, column: 35, scope: !466)
!541 = !DILocation(line: 589, column: 50, scope: !490)
!542 = !DILocation(line: 589, column: 34, scope: !490)
!543 = !DILocation(line: 589, column: 29, scope: !490)
!544 = !DILocation(line: 589, column: 56, scope: !466)
!545 = !{i64 4}
!546 = !DILocation(line: 597, column: 6, scope: !466)
!547 = !DILocation(line: 591, column: 25, scope: !466)
!548 = !DILocation(line: 590, column: 31, scope: !466)
!549 = !DILocation(line: 590, column: 46, scope: !492)
!550 = !DILocation(line: 595, column: 13, scope: !466)
!551 = !DILocation(line: 595, column: 18, scope: !498)
!552 = !DILocation(line: 591, column: 21, scope: !466)
!553 = !DILocation(line: 592, column: 17, scope: !494)
!554 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h68f9d3d702cafb5eE", scope: !556, file: !555, line: 2418, type: !557, scopeLine: 2418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !709, retainedNodes: !706)
!555 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!556 = !DINamespace(name: "{impl#59}", scope: !452)
!557 = !DISubroutineType(types: !558)
!558 = !{!559, !577, !672}
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !560, file: !2, size: 8, align: 8, elements: !561, templateParams: !27, identifier: "1c6ce168e24238e83c13ec35dde7d382")
!560 = !DINamespace(name: "result", scope: !81)
!561 = !{!562}
!562 = !DICompositeType(tag: DW_TAG_variant_part, scope: !559, file: !2, size: 8, align: 8, elements: !563, templateParams: !27, identifier: "42dfca7da53f7734270db51480dbcc24", discriminator: !576)
!563 = !{!564, !572}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !562, file: !2, baseType: !565, size: 8, align: 8, extraData: i64 0)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !559, file: !2, size: 8, align: 8, elements: !566, templateParams: !568, identifier: "4d011f8c16a13f53ec25b197c7b1903")
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !565, file: !2, baseType: !7, align: 8, offset: 8)
!568 = !{!569, !570}
!569 = !DITemplateTypeParameter(name: "T", type: !7)
!570 = !DITemplateTypeParameter(name: "E", type: !571)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !452, file: !2, align: 8, elements: !27, identifier: "d361babf030d8dcc5fc2146a5e622473")
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !562, file: !2, baseType: !573, size: 8, align: 8, extraData: i64 1)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !559, file: !2, size: 8, align: 8, elements: !574, templateParams: !568, identifier: "c5af1e4fa5907b7a524a9ebbd4a5ec10")
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !573, file: !2, baseType: !571, align: 8, offset: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !559, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !578, size: 64, align: 64, dwarfAddressSpace: 0)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !579, size: 64, align: 64, dwarfAddressSpace: 0)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !580, file: !2, size: 320, align: 64, elements: !581, templateParams: !27, identifier: "f021ee8e74e9b8bd5402783ac36f072c")
!580 = !DINamespace(name: "panic_info", scope: !476)
!581 = !{!582, !593, !704, !705}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !579, file: !2, baseType: !583, size: 128, align: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !584, templateParams: !27, identifier: "64dc80e930eabcc853ede33f57ab4a7e")
!584 = !{!585, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !583, file: !2, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64, dwarfAddressSpace: 0)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "4380427c56820b044faf14f89b3ae09e")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !583, file: !2, baseType: !589, size: 64, align: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 3, lowerBound: 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !579, file: !2, baseType: !594, size: 64, align: 64, offset: 128)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !95, file: !2, size: 64, align: 64, elements: !595, templateParams: !27, identifier: "3d7f18b28e5e5d58ed1d103f7c2a05e1")
!595 = !{!596}
!596 = !DICompositeType(tag: DW_TAG_variant_part, scope: !594, file: !2, size: 64, align: 64, elements: !597, templateParams: !27, identifier: "906edb5c2b8c5add1a6895bb1758c245", discriminator: !703)
!597 = !{!598, !699}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !596, file: !2, baseType: !599, size: 64, align: 64, extraData: i64 0)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !594, file: !2, size: 64, align: 64, elements: !27, templateParams: !600, identifier: "b3ca1b3231a1e235eb182d343128bc4a")
!600 = !{!601}
!601 = !DITemplateTypeParameter(name: "T", type: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !603, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !452, file: !2, size: 384, align: 64, elements: !604, templateParams: !27, identifier: "dc49042afee2f796a8fa4685389c4b18")
!604 = !{!605, !611, !657}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !603, file: !2, baseType: !606, size: 128, align: 64, offset: 128)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !607, templateParams: !27, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!607 = !{!608, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !606, file: !2, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64, dwarfAddressSpace: 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !606, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !603, file: !2, baseType: !612, size: 128, align: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !95, file: !2, size: 128, align: 64, elements: !613, templateParams: !27, identifier: "62d362416a1eb41bf984638792a73145")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_variant_part, scope: !612, file: !2, size: 128, align: 64, elements: !615, templateParams: !27, identifier: "51527d667cbd19b863d93073f3cc474", discriminator: !656)
!615 = !{!616, !652}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !614, file: !2, baseType: !617, size: 128, align: 64, extraData: i64 0)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !612, file: !2, size: 128, align: 64, elements: !27, templateParams: !618, identifier: "66a59c7143972a6588bd1a9c8246e60f")
!618 = !{!619}
!619 = !DITemplateTypeParameter(name: "T", type: !620)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !621, templateParams: !27, identifier: "66b60dbaad43783577fb935928e2ac56")
!621 = !{!622, !651}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !620, file: !2, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64, dwarfAddressSpace: 0)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !450, file: !2, size: 448, align: 64, elements: !625, templateParams: !27, identifier: "1b0f53c51c2a0850dc27a4ea7530e9b2")
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !624, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !624, file: !2, baseType: !628, size: 384, align: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !450, file: !2, size: 384, align: 64, elements: !629, templateParams: !27, identifier: "4ceb8823bbeb709d93b7ffb6ddd40132")
!629 = !{!630, !632, !633, !634, !650}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !628, file: !2, baseType: !631, size: 32, align: 32, offset: 288)
!631 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !628, file: !2, baseType: !449, size: 8, align: 8, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !2, baseType: !125, size: 32, align: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !628, file: !2, baseType: !635, size: 128, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !450, file: !2, size: 128, align: 64, elements: !636, templateParams: !27, identifier: "beb49147a723c973b15fc19c2245c821")
!636 = !{!637}
!637 = !DICompositeType(tag: DW_TAG_variant_part, scope: !635, file: !2, size: 128, align: 64, elements: !638, templateParams: !27, identifier: "c9db73f716fc865c39b9a87ace47fe10", discriminator: !649)
!638 = !{!639, !643, !647}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !637, file: !2, baseType: !640, size: 128, align: 64, extraData: i64 0)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !635, file: !2, size: 128, align: 64, elements: !641, templateParams: !27, identifier: "db0b97f002b1fae3dbc4ebdd853ff355")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !640, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !637, file: !2, baseType: !644, size: 128, align: 64, extraData: i64 1)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !635, file: !2, size: 128, align: 64, elements: !645, templateParams: !27, identifier: "49d2632f301eeedc951f3431bb382902")
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !644, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !637, file: !2, baseType: !648, size: 128, align: 64, extraData: i64 2)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !635, file: !2, size: 128, align: 64, elements: !27, identifier: "afc023622f1fd60e7b29fd0e4f997a04")
!649 = !DIDerivedType(tag: DW_TAG_member, scope: !635, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !628, file: !2, baseType: !635, size: 128, align: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !620, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !614, file: !2, baseType: !653, size: 128, align: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !612, file: !2, size: 128, align: 64, elements: !654, templateParams: !618, identifier: "45eaeac90b0c2cad515177aa4ad012c0")
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !653, file: !2, baseType: !620, size: 128, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !603, file: !2, baseType: !658, size: 128, align: 64, offset: 256)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !659, templateParams: !27, identifier: "83fd9dd078f03ba333a6c21d9c3331b7")
!659 = !{!660, !698}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !658, file: !2, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64, dwarfAddressSpace: 0)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !452, file: !2, size: 128, align: 64, elements: !663, templateParams: !27, identifier: "3c2ef6ebf262caba6e43777d9c298823")
!663 = !{!664, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !2, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !666, size: 64, align: 64, dwarfAddressSpace: 0)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !667, file: !2, align: 8, elements: !27, identifier: "43185ab61ba6b0b799bd1bef1620bc0b")
!667 = !DINamespace(name: "{extern#0}", scope: !452)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !662, file: !2, baseType: !669, size: 64, align: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !670, size: 64, align: 64, dwarfAddressSpace: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{!559, !665, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !673, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !452, file: !2, size: 512, align: 64, elements: !674, templateParams: !27, identifier: "a3b888d0a58016a3ad42c934cf971ea3")
!674 = !{!675, !676, !677, !678, !690, !691}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !673, file: !2, baseType: !125, size: 32, align: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !673, file: !2, baseType: !631, size: 32, align: 32, offset: 416)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !673, file: !2, baseType: !449, size: 8, align: 8, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !673, file: !2, baseType: !679, size: 128, align: 64, offset: 128)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !95, file: !2, size: 128, align: 64, elements: !680, templateParams: !27, identifier: "8d57b0310dad0e81a52a7e1f827929d")
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_variant_part, scope: !679, file: !2, size: 128, align: 64, elements: !682, templateParams: !27, identifier: "1503e6327b896c262eca127cbc35ec74", discriminator: !689)
!682 = !{!683, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !681, file: !2, baseType: !684, size: 128, align: 64, extraData: i64 0)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !679, file: !2, size: 128, align: 64, elements: !27, templateParams: !88, identifier: "b9a11c756332445b5e317b2b2625f528")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !681, file: !2, baseType: !686, size: 128, align: 64, extraData: i64 1)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !679, file: !2, size: 128, align: 64, elements: !687, templateParams: !88, identifier: "87159a1745a522a36bc4a0700aab6dc3")
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !686, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !673, file: !2, baseType: !679, size: 128, align: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !673, file: !2, baseType: !692, size: 128, align: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !693, templateParams: !27, identifier: "b58efcb3df0f0beb9aa098f750459fd2")
!693 = !{!694, !697}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !692, file: !2, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64, dwarfAddressSpace: 0)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "bcfe988c4f0dd1d50291e24ffc6447")
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !692, file: !2, baseType: !589, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !658, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !596, file: !2, baseType: !700, size: 64, align: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !594, file: !2, size: 64, align: 64, elements: !701, templateParams: !600, identifier: "f5e9873069f167a5d30db50d2b54707d")
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !700, file: !2, baseType: !602, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !579, file: !2, baseType: !473, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !579, file: !2, baseType: !256, size: 8, align: 8, offset: 256)
!706 = !{!707, !708}
!707 = !DILocalVariable(name: "self", arg: 1, scope: !554, file: !555, line: 2418, type: !577)
!708 = !DILocalVariable(name: "f", arg: 2, scope: !554, file: !555, line: 2418, type: !672)
!709 = !{!710}
!710 = !DITemplateTypeParameter(name: "T", type: !579)
!711 = !DILocation(line: 2418, column: 20, scope: !554)
!712 = !DILocation(line: 2418, column: 27, scope: !554)
!713 = !DILocation(line: 2418, column: 71, scope: !554)
!714 = !{i64 8}
!715 = !DILocation(line: 2418, column: 62, scope: !554)
!716 = !DILocation(line: 2418, column: 84, scope: !554)
!717 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17hfd36a30651c45ae8E", scope: !719, file: !718, line: 237, type: !721, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !724)
!718 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!719 = !DINamespace(name: "{impl#2}", scope: !720)
!720 = !DINamespace(name: "bit_field", scope: null)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !723, !9, !256}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!724 = !{!725, !726, !727}
!725 = !DILocalVariable(name: "self", arg: 1, scope: !717, file: !718, line: 237, type: !723)
!726 = !DILocalVariable(name: "bit", arg: 2, scope: !717, file: !718, line: 237, type: !9)
!727 = !DILocalVariable(name: "value", arg: 3, scope: !717, file: !718, line: 237, type: !256)
!728 = !DILocation(line: 237, column: 24, scope: !717)
!729 = !DILocation(line: 237, column: 35, scope: !717)
!730 = !DILocation(line: 237, column: 47, scope: !717)
!731 = !DILocation(line: 238, column: 25, scope: !717)
!732 = !DILocation(line: 238, column: 17, scope: !717)
!733 = !DILocation(line: 240, column: 20, scope: !717)
!734 = !DILocation(line: 243, column: 31, scope: !717)
!735 = !DILocation(line: 241, column: 30, scope: !717)
!736 = !DILocation(line: 241, column: 21, scope: !717)
!737 = !DILocation(line: 240, column: 17, scope: !717)
!738 = !DILocation(line: 247, column: 14, scope: !717)
!739 = !DILocation(line: 243, column: 30, scope: !717)
!740 = !DILocation(line: 243, column: 21, scope: !717)
!741 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17hd93725a3405c43c1E", scope: !662, file: !555, line: 340, type: !742, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !748, retainedNodes: !745)
!742 = !DISubroutineType(types: !743)
!743 = !{!662, !577, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !557, size: 64, align: 64, dwarfAddressSpace: 0)
!745 = !{!746, !747}
!746 = !DILocalVariable(name: "x", arg: 1, scope: !741, file: !555, line: 340, type: !577)
!747 = !DILocalVariable(name: "f", arg: 2, scope: !741, file: !555, line: 340, type: !744)
!748 = !{!749}
!749 = !DITemplateTypeParameter(name: "T", type: !578)
!750 = !DILocation(line: 340, column: 23, scope: !741)
!751 = !DILocation(line: 340, column: 33, scope: !741)
!752 = !DILocation(line: 349, column: 18, scope: !741)
!753 = !DILocation(line: 350, column: 6, scope: !741)
!754 = !{i64 1}
!755 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17hccf6b570b5ba5093E", scope: !662, file: !555, line: 329, type: !756, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !748, retainedNodes: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{!662, !577}
!758 = !{!759}
!759 = !DILocalVariable(name: "x", arg: 1, scope: !755, file: !555, line: 329, type: !577)
!760 = !DILocation(line: 329, column: 30, scope: !755)
!761 = !DILocation(line: 330, column: 13, scope: !755)
!762 = !DILocation(line: 331, column: 10, scope: !755)
!763 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17h6eaf48fc57e4eb03E", scope: !764, file: !555, line: 168, type: !765, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !770, retainedNodes: !767)
!764 = !DINamespace(name: "Write", scope: !452)
!765 = !DISubroutineType(types: !766)
!766 = !{!559, !14, !631}
!767 = !{!768, !769}
!768 = !DILocalVariable(name: "self", arg: 1, scope: !763, file: !555, line: 168, type: !14)
!769 = !DILocalVariable(name: "c", arg: 2, scope: !763, file: !555, line: 168, type: !631)
!770 = !{!771}
!771 = !DITemplateTypeParameter(name: "Self", type: !15)
!772 = !DILocation(line: 168, column: 19, scope: !763)
!773 = !DILocation(line: 168, column: 30, scope: !763)
!774 = !DILocation(line: 169, column: 43, scope: !763)
!775 = !DILocation(line: 169, column: 24, scope: !763)
!776 = !DILocation(line: 169, column: 9, scope: !763)
!777 = !DILocation(line: 170, column: 6, scope: !763)
!778 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17hc329000ec7f8a126E", scope: !764, file: !555, line: 196, type: !779, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !770, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!559, !14, !603}
!781 = !{!782, !783}
!782 = !DILocalVariable(name: "self", arg: 1, scope: !778, file: !555, line: 196, type: !14)
!783 = !DILocalVariable(name: "args", arg: 2, scope: !778, file: !555, line: 196, type: !603)
!784 = !DILocation(line: 196, column: 18, scope: !778)
!785 = !DILocation(line: 196, column: 39, scope: !778)
!786 = !DILocation(line: 197, column: 9, scope: !778)
!787 = !DILocation(line: 198, column: 6, scope: !778)
!788 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hc3c0d98c20c5b6f3E", scope: !603, file: !555, line: 443, type: !789, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !794)
!789 = !DISubroutineType(types: !790)
!790 = !{!603, !606, !658, !620, !791}
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !452, file: !2, align: 8, elements: !792, templateParams: !27, identifier: "4faa2d0373bebf10eea7ffc10aef50")
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !791, file: !2, baseType: !7, align: 8)
!794 = !{!795, !796, !797, !798, !799}
!795 = !DILocalVariable(name: "pieces", arg: 1, scope: !788, file: !555, line: 444, type: !606)
!796 = !DILocalVariable(name: "args", arg: 2, scope: !788, file: !555, line: 445, type: !658)
!797 = !DILocalVariable(name: "fmt", arg: 3, scope: !788, file: !555, line: 446, type: !620)
!798 = !DILocalVariable(name: "_unsafe_arg", scope: !788, file: !555, line: 447, type: !791, align: 1)
!799 = !DILocalVariable(arg: 4, scope: !788, file: !555, line: 447, type: !791)
!800 = !DILocation(line: 447, column: 9, scope: !788)
!801 = !DILocation(line: 444, column: 9, scope: !788)
!802 = !DILocation(line: 445, column: 9, scope: !788)
!803 = !DILocation(line: 446, column: 9, scope: !788)
!804 = !DILocation(line: 449, column: 34, scope: !788)
!805 = !DILocation(line: 449, column: 9, scope: !788)
!806 = !DILocation(line: 450, column: 6, scope: !788)
!807 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h101a25302464d0b4E", scope: !603, file: !555, line: 412, type: !808, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!603, !606, !658}
!810 = !{!811, !812}
!811 = !DILocalVariable(name: "pieces", arg: 1, scope: !807, file: !555, line: 412, type: !606)
!812 = !DILocalVariable(name: "args", arg: 2, scope: !807, file: !555, line: 412, type: !658)
!813 = !DILocation(line: 412, column: 19, scope: !807)
!814 = !DILocation(line: 412, column: 47, scope: !807)
!815 = !DILocation(line: 413, column: 12, scope: !807)
!816 = !DILocation(line: 413, column: 56, scope: !807)
!817 = !{i8 0, i8 2}
!818 = !DILocation(line: 413, column: 41, scope: !807)
!819 = !DILocation(line: 416, column: 34, scope: !807)
!820 = !DILocation(line: 416, column: 9, scope: !807)
!821 = !DILocation(line: 417, column: 6, scope: !807)
!822 = !DILocation(line: 414, column: 13, scope: !807)
!823 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17ha5ec35877dc072c5E", scope: !603, file: !555, line: 399, type: !824, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!603, !606}
!826 = !{!827}
!827 = !DILocalVariable(name: "pieces", arg: 1, scope: !823, file: !555, line: 399, type: !606)
!828 = !DILocation(line: 399, column: 28, scope: !823)
!829 = !DILocation(line: 400, column: 12, scope: !823)
!830 = !DILocation(line: 403, column: 34, scope: !823)
!831 = !DILocation(line: 403, column: 9, scope: !823)
!832 = !DILocation(line: 404, column: 6, scope: !823)
!833 = !DILocation(line: 401, column: 13, scope: !823)
!834 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h2efa1d8b0e3d424dE", scope: !836, file: !835, line: 250, type: !839, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !847, retainedNodes: !844)
!835 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!836 = !DINamespace(name: "FnOnce", scope: !837)
!837 = !DINamespace(name: "function", scope: !838)
!838 = !DINamespace(name: "ops", scope: !81)
!839 = !DISubroutineType(types: !840)
!840 = !{!295, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !842, size: 64, align: 64, dwarfAddressSpace: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!295}
!844 = !{!845, !846}
!845 = !DILocalVariable(arg: 1, scope: !834, file: !835, line: 250, type: !841)
!846 = !DILocalVariable(arg: 2, scope: !834, file: !835, line: 250, type: !7)
!847 = !{!848, !849}
!848 = !DITemplateTypeParameter(name: "Self", type: !841)
!849 = !DITemplateTypeParameter(name: "Args", type: !7)
!850 = !DILocation(line: 250, column: 5, scope: !834)
!851 = !DILocation(line: 8, column: 32, scope: !852, inlinedAt: !855)
!852 = !DILexicalBlockFile(scope: !854, file: !853, discriminator: 0)
!853 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "7ceca569a5fc9ab32f07c2a32c5c7776")
!854 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hd4a8043f93d4ce7dE", scope: !275, file: !58, line: 137, type: !842, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !27)
!855 = distinct !DILocation(line: 250, column: 5, scope: !834)
!856 = !DILocation(line: 8, column: 20, scope: !852, inlinedAt: !855)
!857 = !DILocalVariable(name: "value", arg: 1, scope: !858, file: !859, line: 148, type: !15)
!858 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17he8a11800ef5015bbE", scope: !295, file: !859, line: 148, type: !860, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !323, retainedNodes: !862)
!859 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bd51efe234d6d30883585776287c8e6")
!860 = !DISubroutineType(types: !861)
!861 = !{!295, !15}
!862 = !{!857}
!863 = !DILocation(line: 148, column: 22, scope: !858, inlinedAt: !864)
!864 = distinct !DILocation(line: 8, column: 9, scope: !852, inlinedAt: !855)
!865 = !DILocalVariable(name: "data", arg: 1, scope: !866, file: !867, line: 110, type: !15)
!866 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17h835cc6b8ea13b0a2E", scope: !299, file: !867, line: 110, type: !868, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !323, retainedNodes: !870)
!867 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "eafec6adab68eecd5bf401d2ab27702c")
!868 = !DISubroutineType(types: !869)
!869 = !{!299, !15}
!870 = !{!865}
!871 = !DILocation(line: 110, column: 22, scope: !866, inlinedAt: !872)
!872 = distinct !DILocation(line: 150, column: 20, scope: !858, inlinedAt: !864)
!873 = !DILocation(line: 112, column: 19, scope: !866, inlinedAt: !872)
!874 = !DILocalVariable(name: "value", arg: 1, scope: !875, file: !876, line: 2011, type: !15)
!875 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h131451903da2b8a9E", scope: !318, file: !876, line: 2011, type: !877, scopeLine: 2011, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !321, retainedNodes: !879)
!876 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a756604d5b8adc8c373a79367d25e51")
!877 = !DISubroutineType(types: !878)
!878 = !{!318, !15}
!879 = !{!874}
!880 = !DILocation(line: 2011, column: 22, scope: !875, inlinedAt: !881)
!881 = distinct !DILocation(line: 113, column: 19, scope: !866, inlinedAt: !872)
!882 = !DILocation(line: 2012, column: 9, scope: !875, inlinedAt: !881)
!883 = !DILocation(line: 111, column: 9, scope: !866, inlinedAt: !872)
!884 = !DILocation(line: 149, column: 9, scope: !858, inlinedAt: !864)
!885 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hec03f4d0d7a59010E", scope: !836, file: !835, line: 250, type: !886, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !894, retainedNodes: !891)
!886 = !DISubroutineType(types: !887)
!887 = !{!103, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable", baseType: !889, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{!103}
!891 = !{!892, !893}
!892 = !DILocalVariable(arg: 1, scope: !885, file: !835, line: 250, type: !888)
!893 = !DILocalVariable(arg: 2, scope: !885, file: !835, line: 250, type: !7)
!894 = !{!895, !849}
!895 = !DITemplateTypeParameter(name: "Self", type: !888)
!896 = !DILocation(line: 250, column: 5, scope: !885)
!897 = !DILocalVariable(name: "idt", scope: !898, file: !899, line: 15, type: !108, align: 16)
!898 = distinct !DILexicalBlock(scope: !900, file: !899, line: 15, column: 9)
!899 = !DIFile(filename: "src/interrupts.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "0c1159aed2d55811d4bb038cf310bc72")
!900 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hf32d9d1ed2b0da5dE", scope: !65, file: !58, line: 137, type: !889, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !901)
!901 = !{!897}
!902 = !DILocation(line: 15, column: 13, scope: !898, inlinedAt: !903)
!903 = distinct !DILocation(line: 250, column: 5, scope: !885)
!904 = !DILocation(line: 15, column: 23, scope: !905, inlinedAt: !903)
!905 = !DILexicalBlockFile(scope: !900, file: !899, discriminator: 0)
!906 = !DILocation(line: 17, column: 13, scope: !898, inlinedAt: !903)
!907 = !DILocation(line: 20, column: 13, scope: !898, inlinedAt: !903)
!908 = !DILocation(line: 21, column: 17, scope: !898, inlinedAt: !903)
!909 = !DILocation(line: 21, column: 13, scope: !898, inlinedAt: !903)
!910 = !DILocation(line: 25, column: 44, scope: !898, inlinedAt: !903)
!911 = !DILocation(line: 25, column: 9, scope: !898, inlinedAt: !903)
!912 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17h3a2708ddd19d1a71E", scope: !914, file: !913, line: 490, type: !915, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !920, retainedNodes: !918)
!913 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "4b0ac29df94a7dc1bf2bc7efca5e253a")
!914 = !DINamespace(name: "ptr", scope: !81)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!918 = !{!919}
!919 = !DILocalVariable(arg: 1, scope: !912, file: !913, line: 490, type: !917)
!920 = !{!921}
!921 = !DITemplateTypeParameter(name: "T", type: !14)
!922 = !DILocation(line: 490, column: 1, scope: !912)
!923 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17h16d5eba6381e97b7E", scope: !914, file: !913, line: 490, type: !924, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !938, retainedNodes: !936)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !927, size: 64, align: 64, dwarfAddressSpace: 0)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !296, file: !2, size: 128, align: 64, elements: !928, templateParams: !321, identifier: "781ac3317934ae07c0a003c933072f3e")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !927, file: !2, baseType: !930, size: 128, align: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !300, file: !2, size: 128, align: 64, elements: !931, templateParams: !321, identifier: "6bd7a1f5e2a8f9325d79786c9e35c7b2")
!931 = !{!932, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !930, file: !2, baseType: !933, size: 64, align: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !930, file: !2, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !{!937}
!937 = !DILocalVariable(arg: 1, scope: !923, file: !913, line: 490, type: !926)
!938 = !{!939}
!939 = !DITemplateTypeParameter(name: "T", type: !927)
!940 = !DILocation(line: 490, column: 1, scope: !923)
!941 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17h33dc6526831bc0c9E", scope: !914, file: !913, line: 490, type: !942, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !947, retainedNodes: !945)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !930, size: 64, align: 64, dwarfAddressSpace: 0)
!945 = !{!946}
!946 = !DILocalVariable(arg: 1, scope: !941, file: !913, line: 490, type: !944)
!947 = !{!948}
!948 = !DITemplateTypeParameter(name: "T", type: !930)
!949 = !DILocation(line: 490, column: 1, scope: !941)
!950 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17h4958ac863a40785bE", scope: !952, file: !951, line: 197, type: !954, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !964)
!951 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "197638d8a57725d685b49f7f7ce80004")
!952 = !DINamespace(name: "converts", scope: !953)
!953 = !DINamespace(name: "str", scope: !81)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !960}
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut str", file: !2, size: 128, align: 64, elements: !957, templateParams: !27, identifier: "1a4aa5533b001911d33734073aafaa29")
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !956, file: !2, baseType: !482, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !956, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !961, templateParams: !27, identifier: "5acbf15c847666982b641ea58cf98317")
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !960, file: !2, baseType: !482, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !960, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!964 = !{!965}
!965 = !DILocalVariable(name: "v", arg: 1, scope: !950, file: !951, line: 197, type: !960)
!966 = !DILocation(line: 197, column: 45, scope: !950)
!967 = !DILocation(line: 203, column: 2, scope: !950)
!968 = distinct !DISubprogram(name: "encode_utf8_raw", linkageName: "_ZN4core4char7methods15encode_utf8_raw17h6fa50e2ac70e7f0dE", scope: !970, file: !969, line: 1713, type: !972, scopeLine: 1713, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !974)
!969 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/methods.rs", directory: "", checksumkind: CSK_MD5, checksum: "6639fd939de0cc71e2551f3e27d008ab")
!970 = !DINamespace(name: "methods", scope: !971)
!971 = !DINamespace(name: "char", scope: !81)
!972 = !DISubroutineType(types: !973)
!973 = !{!960, !125, !960}
!974 = !{!975, !976, !977, !979, !982, !984, !985, !987, !988, !989, !991, !992, !993}
!975 = !DILocalVariable(name: "code", arg: 1, scope: !968, file: !969, line: 1713, type: !125)
!976 = !DILocalVariable(name: "dst", arg: 2, scope: !968, file: !969, line: 1713, type: !960)
!977 = !DILocalVariable(name: "len", scope: !978, file: !969, line: 1714, type: !9, align: 8)
!978 = distinct !DILexicalBlock(scope: !968, file: !969, line: 1714, column: 5)
!979 = !DILocalVariable(name: "a", scope: !980, file: !969, line: 1716, type: !981, align: 8)
!980 = distinct !DILexicalBlock(scope: !978, file: !969, line: 1716, column: 9)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!982 = !DILocalVariable(name: "a", scope: !983, file: !969, line: 1719, type: !981, align: 8)
!983 = distinct !DILexicalBlock(scope: !978, file: !969, line: 1719, column: 9)
!984 = !DILocalVariable(name: "b", scope: !983, file: !969, line: 1719, type: !981, align: 8)
!985 = !DILocalVariable(name: "a", scope: !986, file: !969, line: 1723, type: !981, align: 8)
!986 = distinct !DILexicalBlock(scope: !978, file: !969, line: 1723, column: 9)
!987 = !DILocalVariable(name: "b", scope: !986, file: !969, line: 1723, type: !981, align: 8)
!988 = !DILocalVariable(name: "c", scope: !986, file: !969, line: 1723, type: !981, align: 8)
!989 = !DILocalVariable(name: "a", scope: !990, file: !969, line: 1728, type: !981, align: 8)
!990 = distinct !DILexicalBlock(scope: !978, file: !969, line: 1728, column: 9)
!991 = !DILocalVariable(name: "b", scope: !990, file: !969, line: 1728, type: !981, align: 8)
!992 = !DILocalVariable(name: "c", scope: !990, file: !969, line: 1728, type: !981, align: 8)
!993 = !DILocalVariable(name: "d", scope: !990, file: !969, line: 1728, type: !981, align: 8)
!994 = !DILocation(line: 1713, column: 24, scope: !968)
!995 = !DILocation(line: 1713, column: 35, scope: !968)
!996 = !DILocation(line: 1714, column: 9, scope: !978)
!997 = !DILocation(line: 1714, column: 15, scope: !968)
!998 = !DILocation(line: 1715, column: 12, scope: !978)
!999 = !DILocation(line: 1715, column: 22, scope: !978)
!1000 = !DILocation(line: 1715, column: 11, scope: !978)
!1001 = !DILocation(line: 1715, column: 5, scope: !978)
!1002 = !DILocation(line: 1734, column: 14, scope: !978)
!1003 = !DILocation(line: 1738, column: 13, scope: !978)
!1004 = !DILocation(line: 1716, column: 13, scope: !978)
