; ModuleID = '3l64ifo9h7mxks0t'
source_filename = "3l64ifo9h7mxks0t"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "d78c07529c25b30ccc249e6d01c05c63")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "efeec8511d48ab73b6094368323c0b2b")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 128)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "644a8aaed1b9de837bad1e368b93bf93")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "eeeb82ca7dcafd9d90a3c07a045a3863")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "1b1055d0d14801caa87489f384e2476a")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "e6bb63aa86f93414bbc648bc8d13cf00")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "52a3b1fbcbeed20ebe5a3e9c40d1066c")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8, offset: 384)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17he302f5fd00e5ec72E", scope: !56, file: !58, line: 161, type: !59, isLocal: true, isDefinition: true, align: 8)
!56 = !DINamespace(name: "interrupts", scope: !57)
!57 = !DINamespace(name: "theo", scope: null)
!58 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !56, file: !2, align: 8, elements: !60, templateParams: !27, identifier: "50d129b8886e7f03baf482425377f80")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !59, file: !2, baseType: !7, align: 8)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17he9b98dbae06506daE", scope: !64, file: !67, line: 29, type: !68, isLocal: true, isDefinition: true, align: 128)
!64 = !DINamespace(name: "__stability", scope: !65)
!65 = !DINamespace(name: "deref", scope: !66)
!66 = !DINamespace(name: "{impl#0}", scope: !56)
!67 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !69, file: !2, size: 33024, align: 128, elements: !71, templateParams: !101, identifier: "7815ce947924a3c424562853a5514a2d")
!69 = !DINamespace(name: "lazy", scope: !70)
!70 = !DINamespace(name: "lazy_static", scope: null)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !73, size: 33024, align: 128)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !74, file: !2, size: 33024, align: 128, elements: !76, templateParams: !101, identifier: "f75d05e6ecbee7facb7262d075da1922")
!74 = !DINamespace(name: "once", scope: !75)
!75 = !DINamespace(name: "spin", scope: null)
!76 = !{!77, !90}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !2, baseType: !78, size: 64, align: 64, offset: 32896)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !79, file: !2, size: 64, align: 64, elements: !82, templateParams: !27, identifier: "bc29413ac92bd4d5368e07244b51db87")
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !81)
!81 = !DINamespace(name: "core", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !78, file: !2, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !85, file: !2, size: 64, align: 64, elements: !86, templateParams: !88, identifier: "e476c5763eb9a9e7aa18b139ff514fa8")
!85 = !DINamespace(name: "cell", scope: !81)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !2, baseType: !9, size: 64, align: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !2, baseType: !91, size: 32896, align: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !85, file: !2, size: 32896, align: 128, elements: !92, templateParams: !264, identifier: "8354c79311d4f76084f3c566bf4b53c")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !94, size: 32896, align: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !95, file: !2, size: 32896, align: 128, elements: !96, templateParams: !27, identifier: "120589ceda4e27711f62c6bd41146fe0")
!95 = !DINamespace(name: "option", scope: !81)
!96 = !{!97}
!97 = !DICompositeType(tag: DW_TAG_variant_part, scope: !94, file: !2, size: 32896, align: 128, elements: !98, templateParams: !27, identifier: "4074e13df4854d52e39be00997c57ae9", discriminator: !263)
!98 = !{!99, !259}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !97, file: !2, baseType: !100, size: 32896, align: 128, extraData: i64 2)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !94, file: !2, size: 32896, align: 128, elements: !27, templateParams: !101, identifier: "bf47184c6bd4c3d26427232b005d6fd6")
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !104, file: !2, size: 32896, align: 128, elements: !106, templateParams: !27, identifier: "2969ea79cdb49a04aaeccccf679bfef1")
!104 = !DINamespace(name: "interrupt_descriptor_table", scope: !105)
!105 = !DINamespace(name: "cpu_interrupts", scope: null)
!106 = !{!107, !255, !257, !258}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !103, file: !2, baseType: !108, size: 32768, align: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !109, file: !2, size: 32768, align: 128, elements: !112, templateParams: !27, identifier: "5c4c3e76673da2bd2091f53183d0a05c")
!109 = !DINamespace(name: "idt", scope: !110)
!110 = !DINamespace(name: "structures", scope: !111)
!111 = !DINamespace(name: "x86_64", scope: null)
!112 = !{!113, !152, !153, !154, !155, !156, !157, !158, !159, !178, !179, !197, !198, !199, !200, !221, !222, !223, !224, !242, !243, !244, !248, !249, !250, !251}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !108, file: !2, baseType: !114, size: 128, align: 32)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !109, file: !2, size: 128, align: 32, elements: !115, templateParams: !150, identifier: "faadf7ede953b057de02b7c1c2d5cb05")
!115 = !{!116, !118, !119, !123, !124, !126, !127}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !114, file: !2, baseType: !117, size: 16, align: 16)
!117 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !109, file: !2, size: 16, align: 16, elements: !121, templateParams: !27, identifier: "83015f7fbbbc819fe904b83a69f874e")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !117, size: 16, align: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !114, file: !2, baseType: !128, align: 8, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !130, identifier: "260f223f8ccc113914795cba94a8e1c")
!129 = !DINamespace(name: "marker", scope: !81)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !109, file: !2, size: 320, align: 64, elements: !136, templateParams: !27, identifier: "e7d2e56075d75aebba6db76ba17b398")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !2, baseType: !138, size: 320, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !109, file: !2, size: 320, align: 64, elements: !139, templateParams: !27, identifier: "4dc99250c92f406cd52973fbf3f72954")
!139 = !{!140, !146, !147, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !142, file: !2, size: 64, align: 64, elements: !143, templateParams: !27, identifier: "f169134d2a325d75b6c9b230c4025ee3")
!142 = !DINamespace(name: "addr", scope: !111)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !141, file: !2, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 256)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "F", type: !132)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !108, file: !2, baseType: !160, size: 128, align: 32, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !161, templateParams: !176, identifier: "9ee73657aeab7f891205618e50214248")
!161 = !{!162, !163, !164, !165, !166, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !160, file: !2, baseType: !117, size: 16, align: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !160, file: !2, baseType: !169, align: 8, offset: 128)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !170, identifier: "f9722995abd3e944c5394853fc9227ee")
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !135, !145}
!175 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "F", type: !172)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1280)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !109, file: !2, size: 128, align: 32, elements: !181, templateParams: !195, identifier: "a0b436d30d43f9b95e038326d3920bae")
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !180, file: !2, baseType: !117, size: 16, align: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !180, file: !2, baseType: !189, align: 8, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !190, identifier: "98fb01c16b0a3a6598a8f11ebb86f551")
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !135, !145}
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "F", type: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1664)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !108, file: !2, baseType: !201, size: 128, align: 32, offset: 1792)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !109, file: !2, size: 128, align: 32, elements: !202, templateParams: !219, identifier: "c997a9590cbfa0b44c6a247b6eda4524")
!202 = !{!203, !204, !205, !206, !207, !208, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !201, file: !2, baseType: !117, size: 16, align: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !201, file: !2, baseType: !210, align: 8, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !211, identifier: "85d1453625f84904f83bcab45ef54532")
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "T", type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !135, !216}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !109, file: !2, size: 64, align: 64, elements: !217, templateParams: !27, identifier: "171c2d6c6655c48bed88b1c501a1c951")
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !216, file: !2, baseType: !145, size: 64, align: 64)
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "F", type: !213)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1920)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !108, file: !2, baseType: !225, size: 128, align: 32, offset: 2304)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !226, templateParams: !240, identifier: "88bf995a7f441d9cbb54f3da93afaa71")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !225, file: !2, baseType: !117, size: 16, align: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !225, file: !2, baseType: !234, align: 8, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !235, identifier: "63848a00f43b936d6f2e692792231205")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubroutineType(types: !239)
!239 = !{!175, !135}
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "F", type: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !108, file: !2, baseType: !245, size: 1024, align: 32, offset: 2688)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, align: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8, lowerBound: 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3712)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3840)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 3968)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !108, file: !2, baseType: !252, size: 28672, align: 32, offset: 4096)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 28672, align: 32, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 224, lowerBound: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32768)
!256 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32776)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32784)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !97, file: !2, baseType: !260, size: 32896, align: 128)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !94, file: !2, size: 32896, align: 128, elements: !261, templateParams: !101, identifier: "a19345e372c76ec8b1227f30d5ad544")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !103, size: 32896, align: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !2, baseType: !39, size: 8, align: 8, offset: 32784, flags: DIFlagArtificial)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !94)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17hc5765e9a5bf2e51eE", scope: !268, file: !58, line: 161, type: !269, isLocal: true, isDefinition: true, align: 8)
!268 = !DINamespace(name: "peripherals", scope: !57)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !268, file: !2, align: 8, elements: !270, templateParams: !27, identifier: "b9b70df045459b960d018b28ee2e486")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !269, file: !2, baseType: !7, align: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h21f5e0b9c7a453e3E", scope: !274, file: !67, line: 29, type: !277, isLocal: true, isDefinition: true, align: 64)
!274 = !DINamespace(name: "__stability", scope: !275)
!275 = !DINamespace(name: "deref", scope: !276)
!276 = !DINamespace(name: "{impl#0}", scope: !268)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !69, file: !2, size: 1920, align: 64, elements: !278, templateParams: !293, identifier: "4ba85c890357f749b6a9355d6475bd5a")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !2, baseType: !280, size: 1920, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !74, file: !2, size: 1920, align: 64, elements: !281, templateParams: !293, identifier: "ca64065926045afaae3d4950cec43bf6")
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !2, baseType: !78, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !2, baseType: !284, size: 1856, align: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !85, file: !2, size: 1856, align: 64, elements: !285, templateParams: !330, identifier: "c2c68625ecd8758e2a6158e8a2cc7e9e")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 1856, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !95, file: !2, size: 1856, align: 64, elements: !288, templateParams: !27, identifier: "ca7d1e3c23cd4642608316c269c9ea1d")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 1856, align: 64, elements: !290, templateParams: !27, identifier: "937884b9710af9b86e6301ef68681432", discriminator: !329)
!290 = !{!291, !325}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 1856, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 1856, align: 64, elements: !27, templateParams: !293, identifier: "9d7dc35cd48abe4a7fbd04c7a99e200a")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !296, file: !2, size: 1792, align: 64, elements: !297, templateParams: !323, identifier: "1f7e3094dfc859384d3094fbfa9eb6df")
!296 = !DINamespace(name: "mutex", scope: !75)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !295, file: !2, baseType: !299, size: 1792, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !300, file: !2, size: 1792, align: 64, elements: !301, templateParams: !323, identifier: "d4190668c27631e066a2e9652ea74a3b")
!300 = !DINamespace(name: "spin", scope: !296)
!301 = !{!302, !308, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !299, file: !2, baseType: !303, align: 8)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !304, identifier: "ec6cd28331a70f7670a95477ece5dc7d")
!304 = !{!305}
!305 = !DITemplateTypeParameter(name: "T", type: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !307, file: !2, align: 8, elements: !27, identifier: "4d0c517016440d5af2e22862b8f22c6")
!307 = !DINamespace(name: "relax", scope: !75)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !2, baseType: !309, size: 8, align: 8)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !79, file: !2, size: 8, align: 8, elements: !310, templateParams: !27, identifier: "52427f54eaec5c40c63e6292edfa119f")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !309, file: !2, baseType: !312, size: 8, align: 8)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !85, file: !2, size: 8, align: 8, elements: !313, templateParams: !315, identifier: "9bc61996c48b34f8fbc757ecb83e5380")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !2, baseType: !39, size: 8, align: 8)
!315 = !{!316}
!316 = !DITemplateTypeParameter(name: "T", type: !39)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !2, baseType: !318, size: 1728, align: 64, offset: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !85, file: !2, size: 1728, align: 64, elements: !319, templateParams: !321, identifier: "87b937ad33b7e4acfc7b67faf76aa924")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !2, baseType: !15, size: 1728, align: 64)
!321 = !{!322}
!322 = !DITemplateTypeParameter(name: "T", type: !15)
!323 = !{!322, !324}
!324 = !DITemplateTypeParameter(name: "R", type: !306)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !326, size: 1856, align: 64, extraData: i64 1)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 1856, align: 64, elements: !327, templateParams: !293, identifier: "91eff010c4ad8c2f8a82d62a3fee2027")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !295, size: 1792, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !287)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "KEYBOARD", linkageName: "_ZN4theo11peripherals8KEYBOARD17ha5a7dbc4627531ffE", scope: !268, file: !58, line: 161, type: !334, isLocal: true, isDefinition: true, align: 8)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "KEYBOARD", scope: !268, file: !2, align: 8, elements: !335, templateParams: !27, identifier: "2bb76d6ce0f836ead85bcb52d5c1dca7")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !334, file: !2, baseType: !7, align: 8)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN71_$LT$theo..peripherals..KEYBOARD$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h3f019baf21fede24E", scope: !339, file: !67, line: 29, type: !342, isLocal: true, isDefinition: true, align: 64)
!339 = !DINamespace(name: "__stability", scope: !340)
!340 = !DINamespace(name: "deref", scope: !341)
!341 = !DINamespace(name: "{impl#2}", scope: !268)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !69, file: !2, size: 256, align: 64, elements: !343, templateParams: !358, identifier: "a6c62f377b29f3a6d5c88e5b2f3d1132")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !342, file: !2, baseType: !345, size: 256, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !74, file: !2, size: 256, align: 64, elements: !346, templateParams: !358, identifier: "48e09827057fb8fe476e5e6be441921")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !2, baseType: !78, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !2, baseType: !349, size: 160, align: 16, offset: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>>", scope: !85, file: !2, size: 160, align: 16, elements: !350, templateParams: !451, identifier: "b8807382cab977d4b98767b67050d80d")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !349, file: !2, baseType: !352, size: 160, align: 16)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !95, file: !2, size: 160, align: 16, elements: !353, templateParams: !27, identifier: "e8ba0b57b4969cc8eb6e0abb1bed2ccc")
!353 = !{!354}
!354 = !DICompositeType(tag: DW_TAG_variant_part, scope: !352, file: !2, size: 160, align: 16, elements: !355, templateParams: !27, identifier: "5cea26d0552b12a7474ecd08fbf3c353", discriminator: !450)
!355 = !{!356, !446}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !354, file: !2, baseType: !357, size: 160, align: 16, extraData: i64 0)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !352, file: !2, size: 160, align: 16, elements: !27, templateParams: !358, identifier: "c7cb830824415beeda62e16cff2e25ac")
!358 = !{!359}
!359 = !DITemplateTypeParameter(name: "T", type: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !296, file: !2, size: 144, align: 16, elements: !361, templateParams: !445, identifier: "124708c34ebbb609e4054bff7ce989fd")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !360, file: !2, baseType: !363, size: 144, align: 16)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !300, file: !2, size: 144, align: 16, elements: !364, templateParams: !445, identifier: "4bdee98b67278785dd5d5fb9e1e5cc06")
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !363, file: !2, baseType: !303, align: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !363, file: !2, baseType: !309, size: 8, align: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !2, baseType: !368, size: 128, align: 16, offset: 16)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>>", scope: !85, file: !2, size: 128, align: 16, elements: !369, templateParams: !443, identifier: "c57f1a16418a8cee31a6f5d108157d06")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !2, baseType: !371, size: 128, align: 16)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !372, file: !2, size: 128, align: 16, elements: !373, templateParams: !422, identifier: "d53e7c4f6b48eb612532b0a6dfe268ad")
!372 = !DINamespace(name: "keyboard", scope: null)
!373 = !{!374, !424}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !371, file: !2, baseType: !375, size: 112, align: 16)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !376, file: !2, size: 112, align: 16, elements: !377, templateParams: !422, identifier: "c927ab4bf5be0e4b5c1a3ef038300b2")
!376 = !DINamespace(name: "pc_keyboard", scope: null)
!377 = !{!378, !383, !397}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ps2_decoder", scope: !375, file: !2, baseType: !379, size: 32, align: 16)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ps2Decoder", scope: !376, file: !2, size: 32, align: 16, elements: !380, templateParams: !27, identifier: "e40039d6a487b35b8a4989d57e59ed40")
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !379, file: !2, baseType: !117, size: 16, align: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !379, file: !2, baseType: !39, size: 8, align: 8, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scancode_set", scope: !375, file: !2, baseType: !384, size: 8, align: 8, offset: 104)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScancodeSet1", scope: !385, file: !2, size: 8, align: 8, elements: !387, templateParams: !27, identifier: "f62cf831b9318e1a216784719b59e0c3")
!385 = !DINamespace(name: "set1", scope: !386)
!386 = !DINamespace(name: "scancodes", scope: !376)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !384, file: !2, baseType: !389, size: 8, align: 8)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!396 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "event_decoder", scope: !375, file: !2, baseType: !398, size: 72, align: 8, offset: 32)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventDecoder<pc_keyboard::layouts::us104::Us104Key>", scope: !376, file: !2, size: 72, align: 8, elements: !399, templateParams: !420, identifier: "a1fb77a8a8b7269e74f0ddf7957c092b")
!399 = !{!400, !405, !416}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "handle_ctrl", scope: !398, file: !2, baseType: !401, size: 8, align: 8)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !402)
!402 = !{!403, !404}
!403 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !398, file: !2, baseType: !406, size: 64, align: 8, offset: 8)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !376, file: !2, size: 64, align: 8, elements: !407, templateParams: !27, identifier: "990d1be1cefca8d8d72d16e01166fab2")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !406, file: !2, baseType: !256, size: 8, align: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 24)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 40)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 48)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 56)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !398, file: !2, baseType: !417, align: 8)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !418, file: !2, align: 8, elements: !27, identifier: "99399beaa4772597d9c93749182360c4")
!418 = !DINamespace(name: "us104", scope: !419)
!419 = !DINamespace(name: "layouts", scope: !376)
!420 = !{!421}
!421 = !DITemplateTypeParameter(name: "L", type: !417)
!422 = !{!421, !423}
!423 = !DITemplateTypeParameter(name: "S", type: !384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !371, file: !2, baseType: !425, size: 16, align: 16, offset: 112)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !426, file: !2, size: 16, align: 16, elements: !428, templateParams: !441, identifier: "4b12898567953ccb89a976eba0e99fc0")
!426 = !DINamespace(name: "port", scope: !427)
!427 = !DINamespace(name: "instructions", scope: !111)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !425, file: !2, baseType: !117, size: 16, align: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !425, file: !2, baseType: !431, align: 8)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !432, identifier: "538f72ccf3ab078e254409063b3c7e28")
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !435, templateParams: !27, identifier: "c63b33a766f4562937ae4ab71f46f2a4")
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !434, file: !2, baseType: !39, size: 8, align: 8)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !434, file: !2, baseType: !438, align: 8, offset: 8)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !426, file: !2, align: 8, elements: !439, templateParams: !27, identifier: "d429144c1bc1902a7cefd52c8fdac5e2")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !438, file: !2, baseType: !7, align: 8)
!441 = !{!316, !442}
!442 = !DITemplateTypeParameter(name: "A", type: !438)
!443 = !{!444}
!444 = !DITemplateTypeParameter(name: "T", type: !371)
!445 = !{!444, !324}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !354, file: !2, baseType: !447, size: 160, align: 16, extraData: i64 1)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !352, file: !2, size: 160, align: 16, elements: !448, templateParams: !358, identifier: "ecc6fbdda8d567c292e2de35da55cf29")
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !447, file: !2, baseType: !360, size: 144, align: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!451 = !{!452}
!452 = !DITemplateTypeParameter(name: "T", type: !352)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h4d6b801ea16f9f52E", scope: !455, file: !58, line: 161, type: !456, isLocal: true, isDefinition: true, align: 8)
!455 = !DINamespace(name: "serial", scope: !57)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !455, file: !2, align: 8, elements: !457, templateParams: !27, identifier: "fca8e08ed4aa4dd0a6cca777113370f")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !456, file: !2, baseType: !7, align: 8)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h9ee93c50489f1b89E", scope: !461, file: !67, line: 29, type: !464, isLocal: true, isDefinition: true, align: 64)
!461 = !DINamespace(name: "__stability", scope: !462)
!462 = !DINamespace(name: "deref", scope: !463)
!463 = !DINamespace(name: "{impl#0}", scope: !455)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !69, file: !2, size: 192, align: 64, elements: !465, templateParams: !480, identifier: "4d0ab1062db41251fae29e256a682e93")
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !464, file: !2, baseType: !467, size: 192, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !74, file: !2, size: 192, align: 64, elements: !468, templateParams: !480, identifier: "2c1f8806690c875aa09d73582641eeb1")
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !467, file: !2, baseType: !78, size: 64, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !2, baseType: !471, size: 128, align: 16)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !85, file: !2, size: 128, align: 16, elements: !472, templateParams: !543, identifier: "bf6dc3854097412d6d75859c6c771b02")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !471, file: !2, baseType: !474, size: 128, align: 16)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !95, file: !2, size: 128, align: 16, elements: !475, templateParams: !27, identifier: "ae41def8e1303f145861d5732d7065ce")
!475 = !{!476}
!476 = !DICompositeType(tag: DW_TAG_variant_part, scope: !474, file: !2, size: 128, align: 16, elements: !477, templateParams: !27, identifier: "1722eb77617e3c0f1f33ae6f3b273bab", discriminator: !542)
!477 = !{!478, !538}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !476, file: !2, baseType: !479, size: 128, align: 16, extraData: i64 0)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !474, file: !2, size: 128, align: 16, elements: !27, templateParams: !480, identifier: "b57fb589b096ca47ce05551b0363c195")
!480 = !{!481}
!481 = !DITemplateTypeParameter(name: "T", type: !482)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !296, file: !2, size: 112, align: 16, elements: !483, templateParams: !537, identifier: "f7af00ddac1f08465c3ee594a44083cd")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !482, file: !2, baseType: !485, size: 112, align: 16)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !300, file: !2, size: 112, align: 16, elements: !486, templateParams: !537, identifier: "bd1f7baab003fea94d19f01f37c5d9b9")
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !485, file: !2, baseType: !303, align: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !485, file: !2, baseType: !309, size: 8, align: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !2, baseType: !490, size: 96, align: 16, offset: 16)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !85, file: !2, size: 96, align: 16, elements: !491, templateParams: !535, identifier: "309a1f43f624cb25272e18c35d4bcba1")
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !490, file: !2, baseType: !493, size: 96, align: 16)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !494, file: !2, size: 96, align: 16, elements: !496, templateParams: !27, identifier: "ce28453a593ade26efe0f8f3e6653ff0")
!494 = !DINamespace(name: "port", scope: !495)
!495 = !DINamespace(name: "uart_16550", scope: null)
!496 = !{!497, !498, !515, !516, !517, !518}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !2, baseType: !425, size: 16, align: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !493, file: !2, baseType: !499, size: 16, align: 16, offset: 16)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !426, file: !2, size: 16, align: 16, elements: !500, templateParams: !513, identifier: "703c87224c06ddc95994b4b41173ae86")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !499, file: !2, baseType: !117, size: 16, align: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !499, file: !2, baseType: !503, align: 8)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !504, identifier: "e162f093cc0e36eb5fa4b97a94c4234f")
!504 = !{!505}
!505 = !DITemplateTypeParameter(name: "T", type: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !507, templateParams: !27, identifier: "296f26db30c5c0c2df3b46916949dce4")
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !506, file: !2, baseType: !39, size: 8, align: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !506, file: !2, baseType: !510, align: 8, offset: 8)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !426, file: !2, align: 8, elements: !511, templateParams: !27, identifier: "f67375438b4aa88e77c0935429c8bcec")
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !510, file: !2, baseType: !7, align: 8)
!513 = !{!316, !514}
!514 = !DITemplateTypeParameter(name: "A", type: !510)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !493, file: !2, baseType: !499, size: 16, align: 16, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !493, file: !2, baseType: !499, size: 16, align: 16, offset: 48)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !493, file: !2, baseType: !499, size: 16, align: 16, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !493, file: !2, baseType: !519, size: 16, align: 16, offset: 80)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !426, file: !2, size: 16, align: 16, elements: !520, templateParams: !533, identifier: "65781468441d37904eed8e0973f8ddd6")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !519, file: !2, baseType: !117, size: 16, align: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !519, file: !2, baseType: !523, align: 8)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !524, identifier: "ff07f82fd626d9e7dc8d21c215073b4b")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !527, templateParams: !27, identifier: "e3ea432da0bd6c4613d6b38eb5bd7b")
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !2, baseType: !39, size: 8, align: 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !526, file: !2, baseType: !530, align: 8, offset: 8)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !426, file: !2, align: 8, elements: !531, templateParams: !27, identifier: "34d67813040e78e3a6c0f40243a662c")
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !530, file: !2, baseType: !7, align: 8)
!533 = !{!316, !534}
!534 = !DITemplateTypeParameter(name: "A", type: !530)
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !493)
!537 = !{!536, !324}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !476, file: !2, baseType: !539, size: 128, align: 16, extraData: i64 1)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !474, file: !2, size: 128, align: 16, elements: !540, templateParams: !480, identifier: "2d700062e5d27c08bd23888a7b13d3c2")
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !539, file: !2, baseType: !482, size: 112, align: 16, offset: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, scope: !474, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!543 = !{!544}
!544 = !DITemplateTypeParameter(name: "T", type: !474)
!545 = !{i32 8, !"PIC Level", i32 2}
!546 = !{i32 7, !"PIE Level", i32 2}
!547 = !{i32 2, !"Dwarf Version", i32 4}
!548 = !{i32 2, !"Debug Info Version", i32 3}
!549 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !550, producer: "clang LLVM (rustc version 1.71.0-nightly (5ea3f0ae0 2023-05-23))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, globals: !705, splitDebugInlining: false)
!550 = !DIFile(filename: "src/main.rs/@/3l64ifo9h7mxks0t", directory: "/Users/yaw/self/theo")
!551 = !{!49, !389, !401, !552, !678, !683, !690, !698}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyCode", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!554 = !DIEnumerator(name: "Escape", value: 0, isUnsigned: true)
!555 = !DIEnumerator(name: "F1", value: 1, isUnsigned: true)
!556 = !DIEnumerator(name: "F2", value: 2, isUnsigned: true)
!557 = !DIEnumerator(name: "F3", value: 3, isUnsigned: true)
!558 = !DIEnumerator(name: "F4", value: 4, isUnsigned: true)
!559 = !DIEnumerator(name: "F5", value: 5, isUnsigned: true)
!560 = !DIEnumerator(name: "F6", value: 6, isUnsigned: true)
!561 = !DIEnumerator(name: "F7", value: 7, isUnsigned: true)
!562 = !DIEnumerator(name: "F8", value: 8, isUnsigned: true)
!563 = !DIEnumerator(name: "F9", value: 9, isUnsigned: true)
!564 = !DIEnumerator(name: "F10", value: 10, isUnsigned: true)
!565 = !DIEnumerator(name: "F11", value: 11, isUnsigned: true)
!566 = !DIEnumerator(name: "F12", value: 12, isUnsigned: true)
!567 = !DIEnumerator(name: "PrintScreen", value: 13, isUnsigned: true)
!568 = !DIEnumerator(name: "SysRq", value: 14, isUnsigned: true)
!569 = !DIEnumerator(name: "ScrollLock", value: 15, isUnsigned: true)
!570 = !DIEnumerator(name: "PauseBreak", value: 16, isUnsigned: true)
!571 = !DIEnumerator(name: "Oem8", value: 17, isUnsigned: true)
!572 = !DIEnumerator(name: "Key1", value: 18, isUnsigned: true)
!573 = !DIEnumerator(name: "Key2", value: 19, isUnsigned: true)
!574 = !DIEnumerator(name: "Key3", value: 20, isUnsigned: true)
!575 = !DIEnumerator(name: "Key4", value: 21, isUnsigned: true)
!576 = !DIEnumerator(name: "Key5", value: 22, isUnsigned: true)
!577 = !DIEnumerator(name: "Key6", value: 23, isUnsigned: true)
!578 = !DIEnumerator(name: "Key7", value: 24, isUnsigned: true)
!579 = !DIEnumerator(name: "Key8", value: 25, isUnsigned: true)
!580 = !DIEnumerator(name: "Key9", value: 26, isUnsigned: true)
!581 = !DIEnumerator(name: "Key0", value: 27, isUnsigned: true)
!582 = !DIEnumerator(name: "OemMinus", value: 28, isUnsigned: true)
!583 = !DIEnumerator(name: "OemPlus", value: 29, isUnsigned: true)
!584 = !DIEnumerator(name: "Backspace", value: 30, isUnsigned: true)
!585 = !DIEnumerator(name: "Insert", value: 31, isUnsigned: true)
!586 = !DIEnumerator(name: "Home", value: 32, isUnsigned: true)
!587 = !DIEnumerator(name: "PageUp", value: 33, isUnsigned: true)
!588 = !DIEnumerator(name: "NumpadLock", value: 34, isUnsigned: true)
!589 = !DIEnumerator(name: "NumpadDivide", value: 35, isUnsigned: true)
!590 = !DIEnumerator(name: "NumpadMultiply", value: 36, isUnsigned: true)
!591 = !DIEnumerator(name: "NumpadSubtract", value: 37, isUnsigned: true)
!592 = !DIEnumerator(name: "Tab", value: 38, isUnsigned: true)
!593 = !DIEnumerator(name: "Q", value: 39, isUnsigned: true)
!594 = !DIEnumerator(name: "W", value: 40, isUnsigned: true)
!595 = !DIEnumerator(name: "E", value: 41, isUnsigned: true)
!596 = !DIEnumerator(name: "R", value: 42, isUnsigned: true)
!597 = !DIEnumerator(name: "T", value: 43, isUnsigned: true)
!598 = !DIEnumerator(name: "Y", value: 44, isUnsigned: true)
!599 = !DIEnumerator(name: "U", value: 45, isUnsigned: true)
!600 = !DIEnumerator(name: "I", value: 46, isUnsigned: true)
!601 = !DIEnumerator(name: "O", value: 47, isUnsigned: true)
!602 = !DIEnumerator(name: "P", value: 48, isUnsigned: true)
!603 = !DIEnumerator(name: "Oem4", value: 49, isUnsigned: true)
!604 = !DIEnumerator(name: "Oem6", value: 50, isUnsigned: true)
!605 = !DIEnumerator(name: "Oem5", value: 51, isUnsigned: true)
!606 = !DIEnumerator(name: "Oem7", value: 52, isUnsigned: true)
!607 = !DIEnumerator(name: "Delete", value: 53, isUnsigned: true)
!608 = !DIEnumerator(name: "End", value: 54, isUnsigned: true)
!609 = !DIEnumerator(name: "PageDown", value: 55, isUnsigned: true)
!610 = !DIEnumerator(name: "Numpad7", value: 56, isUnsigned: true)
!611 = !DIEnumerator(name: "Numpad8", value: 57, isUnsigned: true)
!612 = !DIEnumerator(name: "Numpad9", value: 58, isUnsigned: true)
!613 = !DIEnumerator(name: "NumpadAdd", value: 59, isUnsigned: true)
!614 = !DIEnumerator(name: "CapsLock", value: 60, isUnsigned: true)
!615 = !DIEnumerator(name: "A", value: 61, isUnsigned: true)
!616 = !DIEnumerator(name: "S", value: 62, isUnsigned: true)
!617 = !DIEnumerator(name: "D", value: 63, isUnsigned: true)
!618 = !DIEnumerator(name: "F", value: 64, isUnsigned: true)
!619 = !DIEnumerator(name: "G", value: 65, isUnsigned: true)
!620 = !DIEnumerator(name: "H", value: 66, isUnsigned: true)
!621 = !DIEnumerator(name: "J", value: 67, isUnsigned: true)
!622 = !DIEnumerator(name: "K", value: 68, isUnsigned: true)
!623 = !DIEnumerator(name: "L", value: 69, isUnsigned: true)
!624 = !DIEnumerator(name: "Oem1", value: 70, isUnsigned: true)
!625 = !DIEnumerator(name: "Oem3", value: 71, isUnsigned: true)
!626 = !DIEnumerator(name: "Return", value: 72, isUnsigned: true)
!627 = !DIEnumerator(name: "Numpad4", value: 73, isUnsigned: true)
!628 = !DIEnumerator(name: "Numpad5", value: 74, isUnsigned: true)
!629 = !DIEnumerator(name: "Numpad6", value: 75, isUnsigned: true)
!630 = !DIEnumerator(name: "LShift", value: 76, isUnsigned: true)
!631 = !DIEnumerator(name: "Z", value: 77, isUnsigned: true)
!632 = !DIEnumerator(name: "X", value: 78, isUnsigned: true)
!633 = !DIEnumerator(name: "C", value: 79, isUnsigned: true)
!634 = !DIEnumerator(name: "V", value: 80, isUnsigned: true)
!635 = !DIEnumerator(name: "B", value: 81, isUnsigned: true)
!636 = !DIEnumerator(name: "N", value: 82, isUnsigned: true)
!637 = !DIEnumerator(name: "M", value: 83, isUnsigned: true)
!638 = !DIEnumerator(name: "OemComma", value: 84, isUnsigned: true)
!639 = !DIEnumerator(name: "OemPeriod", value: 85, isUnsigned: true)
!640 = !DIEnumerator(name: "Oem2", value: 86, isUnsigned: true)
!641 = !DIEnumerator(name: "RShift", value: 87, isUnsigned: true)
!642 = !DIEnumerator(name: "ArrowUp", value: 88, isUnsigned: true)
!643 = !DIEnumerator(name: "Numpad1", value: 89, isUnsigned: true)
!644 = !DIEnumerator(name: "Numpad2", value: 90, isUnsigned: true)
!645 = !DIEnumerator(name: "Numpad3", value: 91, isUnsigned: true)
!646 = !DIEnumerator(name: "NumpadEnter", value: 92, isUnsigned: true)
!647 = !DIEnumerator(name: "LControl", value: 93, isUnsigned: true)
!648 = !DIEnumerator(name: "LWin", value: 94, isUnsigned: true)
!649 = !DIEnumerator(name: "LAlt", value: 95, isUnsigned: true)
!650 = !DIEnumerator(name: "Spacebar", value: 96, isUnsigned: true)
!651 = !DIEnumerator(name: "RAltGr", value: 97, isUnsigned: true)
!652 = !DIEnumerator(name: "RWin", value: 98, isUnsigned: true)
!653 = !DIEnumerator(name: "Apps", value: 99, isUnsigned: true)
!654 = !DIEnumerator(name: "RControl", value: 100, isUnsigned: true)
!655 = !DIEnumerator(name: "ArrowLeft", value: 101, isUnsigned: true)
!656 = !DIEnumerator(name: "ArrowDown", value: 102, isUnsigned: true)
!657 = !DIEnumerator(name: "ArrowRight", value: 103, isUnsigned: true)
!658 = !DIEnumerator(name: "Numpad0", value: 104, isUnsigned: true)
!659 = !DIEnumerator(name: "NumpadPeriod", value: 105, isUnsigned: true)
!660 = !DIEnumerator(name: "Oem9", value: 106, isUnsigned: true)
!661 = !DIEnumerator(name: "Oem10", value: 107, isUnsigned: true)
!662 = !DIEnumerator(name: "Oem11", value: 108, isUnsigned: true)
!663 = !DIEnumerator(name: "Oem12", value: 109, isUnsigned: true)
!664 = !DIEnumerator(name: "Oem13", value: 110, isUnsigned: true)
!665 = !DIEnumerator(name: "PrevTrack", value: 111, isUnsigned: true)
!666 = !DIEnumerator(name: "NextTrack", value: 112, isUnsigned: true)
!667 = !DIEnumerator(name: "Mute", value: 113, isUnsigned: true)
!668 = !DIEnumerator(name: "Calculator", value: 114, isUnsigned: true)
!669 = !DIEnumerator(name: "Play", value: 115, isUnsigned: true)
!670 = !DIEnumerator(name: "Stop", value: 116, isUnsigned: true)
!671 = !DIEnumerator(name: "VolumeDown", value: 117, isUnsigned: true)
!672 = !DIEnumerator(name: "VolumeUp", value: 118, isUnsigned: true)
!673 = !DIEnumerator(name: "WWWHome", value: 119, isUnsigned: true)
!674 = !DIEnumerator(name: "PowerOnTestOk", value: 120, isUnsigned: true)
!675 = !DIEnumerator(name: "TooManyKeys", value: 121, isUnsigned: true)
!676 = !DIEnumerator(name: "RControl2", value: 122, isUnsigned: true)
!677 = !DIEnumerator(name: "RAlt2", value: 123, isUnsigned: true)
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyState", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !679)
!679 = !{!680, !681, !682}
!680 = !DIEnumerator(name: "Up", value: 0, isUnsigned: true)
!681 = !DIEnumerator(name: "Down", value: 1, isUnsigned: true)
!682 = !DIEnumerator(name: "SingleShot", value: 2, isUnsigned: true)
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Error", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !684)
!684 = !{!685, !686, !687, !688, !689}
!685 = !DIEnumerator(name: "BadStartBit", value: 0, isUnsigned: true)
!686 = !DIEnumerator(name: "BadStopBit", value: 1, isUnsigned: true)
!687 = !DIEnumerator(name: "ParityError", value: 2, isUnsigned: true)
!688 = !DIEnumerator(name: "UnknownKeyCode", value: 3, isUnsigned: true)
!689 = !DIEnumerator(name: "InvalidState", value: 4, isUnsigned: true)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !691, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !693)
!691 = !DINamespace(name: "rt", scope: !692)
!692 = !DINamespace(name: "fmt", scope: !81)
!693 = !{!694, !695, !696, !697}
!694 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!695 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!696 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!697 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !699)
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!701 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!702 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!703 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!704 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!705 = !{!0, !54, !62, !266, !272, !332, !337, !453, !459}
!706 = distinct !DISubprogram(name: "index_mut", linkageName: "_ZN109_$LT$x86_64..structures..idt..InterruptDescriptorTable$u20$as$u20$core..ops..index..IndexMut$LT$usize$GT$$GT$9index_mut17h635b8838e405e54bE", scope: !708, file: !707, line: 575, type: !709, scopeLine: 575, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !27, retainedNodes: !726)
!707 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!708 = !DINamespace(name: "{impl#2}", scope: !109)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !712, !9, !713}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !714, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !715, file: !2, size: 192, align: 64, elements: !717, templateParams: !27, identifier: "20ef1a484ea0863fc9e4151fe212b612")
!715 = !DINamespace(name: "location", scope: !716)
!716 = !DINamespace(name: "panic", scope: !81)
!717 = !{!718, !724, !725}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !714, file: !2, baseType: !719, size: 128, align: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !720, templateParams: !27, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!720 = !{!721, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !719, file: !2, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !719, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !714, file: !2, baseType: !125, size: 32, align: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !714, file: !2, baseType: !125, size: 32, align: 32, offset: 160)
!726 = !{!727, !728, !729, !731, !733, !735, !737}
!727 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !707, line: 575, type: !712)
!728 = !DILocalVariable(name: "index", arg: 2, scope: !706, file: !707, line: 575, type: !9)
!729 = !DILocalVariable(name: "i", scope: !730, file: !707, line: 589, type: !9, align: 8)
!730 = distinct !DILexicalBlock(scope: !706, file: !707, line: 589, column: 13)
!731 = !DILocalVariable(name: "i", scope: !732, file: !707, line: 590, type: !9, align: 8)
!732 = distinct !DILexicalBlock(scope: !706, file: !707, line: 590, column: 13)
!733 = !DILocalVariable(name: "i", scope: !734, file: !707, line: 591, type: !9, align: 8)
!734 = distinct !DILexicalBlock(scope: !706, file: !707, line: 591, column: 13)
!735 = !DILocalVariable(name: "i", scope: !736, file: !707, line: 594, type: !9, align: 8)
!736 = distinct !DILexicalBlock(scope: !706, file: !707, line: 594, column: 13)
!737 = !DILocalVariable(name: "i", scope: !738, file: !707, line: 595, type: !9, align: 8)
!738 = distinct !DILexicalBlock(scope: !706, file: !707, line: 595, column: 13)
!739 = !DILocation(line: 575, column: 18, scope: !706)
!740 = !DILocation(line: 575, column: 29, scope: !706)
!741 = !DILocation(line: 589, column: 13, scope: !730)
!742 = !DILocation(line: 590, column: 13, scope: !732)
!743 = !DILocation(line: 591, column: 13, scope: !734)
!744 = !DILocation(line: 594, column: 13, scope: !736)
!745 = !DILocation(line: 595, column: 13, scope: !738)
!746 = !DILocation(line: 576, column: 9, scope: !706)
!747 = !DILocation(line: 589, column: 17, scope: !706)
!748 = !DILocation(line: 577, column: 18, scope: !706)
!749 = !DILocation(line: 577, column: 39, scope: !706)
!750 = !DILocation(line: 578, column: 18, scope: !706)
!751 = !DILocation(line: 578, column: 32, scope: !706)
!752 = !DILocation(line: 579, column: 18, scope: !706)
!753 = !DILocation(line: 579, column: 49, scope: !706)
!754 = !DILocation(line: 580, column: 18, scope: !706)
!755 = !DILocation(line: 580, column: 37, scope: !706)
!756 = !DILocation(line: 581, column: 18, scope: !706)
!757 = !DILocation(line: 581, column: 35, scope: !706)
!758 = !DILocation(line: 582, column: 18, scope: !706)
!759 = !DILocation(line: 582, column: 47, scope: !706)
!760 = !DILocation(line: 583, column: 18, scope: !706)
!761 = !DILocation(line: 583, column: 41, scope: !706)
!762 = !DILocation(line: 584, column: 18, scope: !706)
!763 = !DILocation(line: 584, column: 47, scope: !706)
!764 = !DILocation(line: 585, column: 18, scope: !706)
!765 = !DILocation(line: 585, column: 54, scope: !706)
!766 = !DILocation(line: 586, column: 19, scope: !706)
!767 = !DILocation(line: 586, column: 46, scope: !706)
!768 = !DILocation(line: 587, column: 19, scope: !706)
!769 = !DILocation(line: 587, column: 47, scope: !706)
!770 = !DILocation(line: 588, column: 19, scope: !706)
!771 = !DILocation(line: 588, column: 42, scope: !706)
!772 = !DILocation(line: 590, column: 13, scope: !706)
!773 = !DILocation(line: 590, column: 22, scope: !706)
!774 = !DILocation(line: 591, column: 13, scope: !706)
!775 = !DILocation(line: 591, column: 35, scope: !706)
!776 = !DILocation(line: 591, column: 44, scope: !706)
!777 = !DILocation(line: 591, column: 53, scope: !706)
!778 = !DILocation(line: 594, column: 13, scope: !706)
!779 = !DILocalVariable(name: "x", arg: 1, scope: !780, file: !781, line: 96, type: !843)
!780 = distinct !DISubprogram(name: "new_display<usize>", linkageName: "_ZN4core3fmt2rt8Argument11new_display17hb95af6d33081b6a5E", scope: !782, file: !781, line: 96, type: !841, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !88, declaration: !844, retainedNodes: !845)
!781 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "31eddffc1303c18bd294e608e49a0de2")
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !691, file: !2, size: 128, align: 64, elements: !783, templateParams: !27, identifier: "1715f8ca39c24c1465154510b099d5db")
!783 = !{!784, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !782, file: !2, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !786, size: 64, align: 64, dwarfAddressSpace: 0)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !787, file: !2, align: 8, elements: !27, identifier: "b53b9c37284ad14843698905c0a781ef")
!787 = !DINamespace(name: "{extern#0}", scope: !691)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !782, file: !2, baseType: !789, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !790, size: 64, align: 64, dwarfAddressSpace: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !785, !810}
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !793, file: !2, size: 8, align: 8, elements: !794, templateParams: !27, identifier: "22c75a34514fa785fe8d5e5737b404a")
!793 = !DINamespace(name: "result", scope: !81)
!794 = !{!795}
!795 = !DICompositeType(tag: DW_TAG_variant_part, scope: !792, file: !2, size: 8, align: 8, elements: !796, templateParams: !27, identifier: "318b8b14c370a5a4f50890e5a30a4497", discriminator: !809)
!796 = !{!797, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !795, file: !2, baseType: !798, size: 8, align: 8, extraData: i64 0)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !792, file: !2, size: 8, align: 8, elements: !799, templateParams: !801, identifier: "5b323728d71ad8b54f91e8647fb6c225")
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !798, file: !2, baseType: !7, align: 8, offset: 8)
!801 = !{!802, !803}
!802 = !DITemplateTypeParameter(name: "T", type: !7)
!803 = !DITemplateTypeParameter(name: "E", type: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !692, file: !2, align: 8, elements: !27, identifier: "fc30e04e843f09017d3a1f431d2f6e0c")
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !795, file: !2, baseType: !806, size: 8, align: 8, extraData: i64 1)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !792, file: !2, size: 8, align: 8, elements: !807, templateParams: !801, identifier: "a4826728ee7be77ec8568eb24e01c72")
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !806, file: !2, baseType: !804, align: 8, offset: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, scope: !792, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !811, size: 64, align: 64, dwarfAddressSpace: 0)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !692, file: !2, size: 512, align: 64, elements: !812, templateParams: !27, identifier: "a84a5bdbf0499ca1d68196c4b862c039")
!812 = !{!813, !814, !816, !817, !829, !830}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !2, baseType: !125, size: 32, align: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !811, file: !2, baseType: !815, size: 32, align: 32, offset: 384)
!815 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !811, file: !2, baseType: !690, size: 8, align: 8, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !811, file: !2, baseType: !818, size: 128, align: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !95, file: !2, size: 128, align: 64, elements: !819, templateParams: !27, identifier: "9ff7c8d78ada7de0ac9d763d1c46855f")
!819 = !{!820}
!820 = !DICompositeType(tag: DW_TAG_variant_part, scope: !818, file: !2, size: 128, align: 64, elements: !821, templateParams: !27, identifier: "4121c4c375fd14965cbbd4a52ee80751", discriminator: !828)
!821 = !{!822, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !820, file: !2, baseType: !823, size: 128, align: 64, extraData: i64 0)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !818, file: !2, size: 128, align: 64, elements: !27, templateParams: !88, identifier: "2820df4bdcb3911085cbffae781ae71")
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !820, file: !2, baseType: !825, size: 128, align: 64, extraData: i64 1)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !818, file: !2, size: 128, align: 64, elements: !826, templateParams: !88, identifier: "3de76324e4613a017cfb22686952e8ce")
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !825, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !811, file: !2, baseType: !818, size: 128, align: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !811, file: !2, baseType: !831, size: 128, align: 64, offset: 256)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !832, templateParams: !27, identifier: "841e47680ccca04665b2034bf5815694")
!832 = !{!833, !836}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !831, file: !2, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64, dwarfAddressSpace: 0)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "d63695003f7c60186849daf2e0ab45a2")
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !831, file: !2, baseType: !837, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !838, size: 64, align: 64, dwarfAddressSpace: 0)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 3, lowerBound: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!782, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!844 = !DISubprogram(name: "new_display<usize>", linkageName: "_ZN4core3fmt2rt8Argument11new_display17hb95af6d33081b6a5E", scope: !782, file: !781, line: 96, type: !841, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !88)
!845 = !{!779}
!846 = !DILocation(line: 96, column: 40, scope: !780, inlinedAt: !847)
!847 = distinct !DILocation(line: 594, column: 23, scope: !736)
!848 = !DILocalVariable(name: "x", arg: 1, scope: !849, file: !781, line: 83, type: !843)
!849 = distinct !DISubprogram(name: "new<usize>", linkageName: "_ZN4core3fmt2rt8Argument3new17hb587d66584f5e491E", scope: !782, file: !781, line: 83, type: !850, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !88, declaration: !855, retainedNodes: !856)
!850 = !DISubroutineType(types: !851)
!851 = !{!782, !843, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&usize, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !853, size: 64, align: 64, dwarfAddressSpace: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!792, !843, !810}
!855 = !DISubprogram(name: "new<usize>", linkageName: "_ZN4core3fmt2rt8Argument3new17hb587d66584f5e491E", scope: !782, file: !781, line: 83, type: !850, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !88)
!856 = !{!848, !857}
!857 = !DILocalVariable(name: "f", arg: 2, scope: !849, file: !781, line: 83, type: !852)
!858 = !DILocation(line: 83, column: 19, scope: !849, inlinedAt: !859)
!859 = distinct !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !847)
!860 = !DILocation(line: 83, column: 29, scope: !849, inlinedAt: !859)
!861 = !DILocation(line: 92, column: 18, scope: !849, inlinedAt: !859)
!862 = !DILocation(line: 93, column: 6, scope: !849, inlinedAt: !859)
!863 = !{i64 1}
!864 = !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !847)
!865 = !DILocation(line: 594, column: 23, scope: !736)
!866 = !DILocation(line: 590, column: 35, scope: !706)
!867 = !DILocation(line: 589, column: 50, scope: !730)
!868 = !DILocation(line: 589, column: 34, scope: !730)
!869 = !DILocation(line: 589, column: 29, scope: !730)
!870 = !DILocation(line: 589, column: 56, scope: !706)
!871 = !{i64 4}
!872 = !DILocation(line: 597, column: 6, scope: !706)
!873 = !DILocation(line: 591, column: 25, scope: !706)
!874 = !DILocation(line: 590, column: 31, scope: !706)
!875 = !DILocation(line: 96, column: 40, scope: !780, inlinedAt: !876)
!876 = distinct !DILocation(line: 590, column: 46, scope: !732)
!877 = !DILocation(line: 83, column: 19, scope: !849, inlinedAt: !878)
!878 = distinct !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !876)
!879 = !DILocation(line: 83, column: 29, scope: !849, inlinedAt: !878)
!880 = !DILocation(line: 92, column: 18, scope: !849, inlinedAt: !878)
!881 = !DILocation(line: 93, column: 6, scope: !849, inlinedAt: !878)
!882 = !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !876)
!883 = !DILocation(line: 590, column: 46, scope: !732)
!884 = !DILocation(line: 595, column: 13, scope: !706)
!885 = !DILocation(line: 96, column: 40, scope: !780, inlinedAt: !886)
!886 = distinct !DILocation(line: 595, column: 18, scope: !738)
!887 = !DILocation(line: 83, column: 19, scope: !849, inlinedAt: !888)
!888 = distinct !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !886)
!889 = !DILocation(line: 83, column: 29, scope: !849, inlinedAt: !888)
!890 = !DILocation(line: 92, column: 18, scope: !849, inlinedAt: !888)
!891 = !DILocation(line: 93, column: 6, scope: !849, inlinedAt: !888)
!892 = !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !886)
!893 = !DILocation(line: 595, column: 18, scope: !738)
!894 = !DILocation(line: 591, column: 21, scope: !706)
!895 = !DILocation(line: 96, column: 40, scope: !780, inlinedAt: !896)
!896 = distinct !DILocation(line: 592, column: 17, scope: !734)
!897 = !DILocation(line: 83, column: 19, scope: !849, inlinedAt: !898)
!898 = distinct !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !896)
!899 = !DILocation(line: 83, column: 29, scope: !849, inlinedAt: !898)
!900 = !DILocation(line: 92, column: 18, scope: !849, inlinedAt: !898)
!901 = !DILocation(line: 93, column: 6, scope: !849, inlinedAt: !898)
!902 = !DILocation(line: 97, column: 9, scope: !780, inlinedAt: !896)
!903 = !DILocation(line: 592, column: 17, scope: !734)
!904 = distinct !DISubprogram(name: "process_keyevent<pc_keyboard::layouts::us104::Us104Key>", linkageName: "_ZN11pc_keyboard21EventDecoder$LT$L$GT$16process_keyevent17h1a13f579ac231d4cE", scope: !398, file: !905, line: 680, type: !906, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !420, declaration: !939, retainedNodes: !940)
!905 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "6bec53fc8eab0fe8f28a81b677ce329c")
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !934, !935}
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<pc_keyboard::DecodedKey>", scope: !95, file: !2, size: 64, align: 32, elements: !909, templateParams: !27, identifier: "4b216c323ee6b466d70b5c6310bd8431")
!909 = !{!910}
!910 = !DICompositeType(tag: DW_TAG_variant_part, scope: !908, file: !2, size: 64, align: 32, elements: !911, templateParams: !27, identifier: "296c3e55d34498d8676dcb0b15494405", discriminator: !933)
!911 = !{!912, !929}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !910, file: !2, baseType: !913, size: 64, align: 32, extraData: i64 2)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !908, file: !2, size: 64, align: 32, elements: !27, templateParams: !914, identifier: "739979341521b910d581fdeeda6d19df")
!914 = !{!915}
!915 = !DITemplateTypeParameter(name: "T", type: !916)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodedKey", scope: !376, file: !2, size: 64, align: 32, elements: !917, templateParams: !27, identifier: "96b9e932c7821f9365792ebde49b2e4f")
!917 = !{!918}
!918 = !DICompositeType(tag: DW_TAG_variant_part, scope: !916, file: !2, size: 64, align: 32, elements: !919, templateParams: !27, identifier: "7f32660d3e6c3943efeab9d6a4b1a8b3", discriminator: !928)
!919 = !{!920, !924}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RawKey", scope: !918, file: !2, baseType: !921, size: 64, align: 32, extraData: i64 0)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawKey", scope: !916, file: !2, size: 64, align: 32, elements: !922, templateParams: !27, identifier: "12c48f60287b96cb2be5588899f17b23")
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !921, file: !2, baseType: !552, size: 8, align: 8, offset: 8)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Unicode", scope: !918, file: !2, baseType: !925, size: 64, align: 32, extraData: i64 1)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unicode", scope: !916, file: !2, size: 64, align: 32, elements: !926, templateParams: !27, identifier: "301a9a21cd1433643ca73de3fd481477")
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !925, file: !2, baseType: !815, size: 32, align: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, scope: !916, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !910, file: !2, baseType: !930, size: 64, align: 32)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !908, file: !2, size: 64, align: 32, elements: !931, templateParams: !914, identifier: "6a3878e60d10c60c361c6585c013090f")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !2, baseType: !916, size: 64, align: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, scope: !908, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut pc_keyboard::EventDecoder<pc_keyboard::layouts::us104::Us104Key>", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEvent", scope: !376, file: !2, size: 16, align: 8, elements: !936, templateParams: !27, identifier: "b96cfb925720901617132735215f5d74")
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !935, file: !2, baseType: !552, size: 8, align: 8, offset: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !935, file: !2, baseType: !678, size: 8, align: 8)
!939 = !DISubprogram(name: "process_keyevent<pc_keyboard::layouts::us104::Us104Key>", linkageName: "_ZN11pc_keyboard21EventDecoder$LT$L$GT$16process_keyevent17h1a13f579ac231d4cE", scope: !398, file: !905, line: 680, type: !906, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !420)
!940 = !{!941, !942, !943}
!941 = !DILocalVariable(name: "self", arg: 1, scope: !904, file: !905, line: 680, type: !934)
!942 = !DILocalVariable(name: "ev", arg: 2, scope: !904, file: !905, line: 680, type: !935)
!943 = !DILocalVariable(name: "c", scope: !944, file: !905, line: 788, type: !552, align: 1)
!944 = distinct !DILexicalBlock(scope: !904, file: !905, line: 787, column: 13)
!945 = !DILocation(line: 680, column: 29, scope: !904)
!946 = !DILocation(line: 680, column: 40, scope: !904)
!947 = !DILocation(line: 681, column: 15, scope: !904)
!948 = !{i8 0, i8 124}
!949 = !DILocation(line: 681, column: 9, scope: !904)
!950 = !{i8 0, i8 3}
!951 = !DILocation(line: 784, column: 17, scope: !904)
!952 = !DILocation(line: 785, column: 17, scope: !904)
!953 = !DILocation(line: 777, column: 17, scope: !904)
!954 = !DILocation(line: 778, column: 41, scope: !904)
!955 = !DILocation(line: 778, column: 22, scope: !904)
!956 = !DILocation(line: 778, column: 17, scope: !904)
!957 = !DILocation(line: 778, column: 60, scope: !904)
!958 = !DILocation(line: 796, column: 6, scope: !904)
!959 = !DILocation(line: 756, column: 17, scope: !904)
!960 = !DILocation(line: 757, column: 17, scope: !904)
!961 = !DILocation(line: 749, column: 17, scope: !904)
!962 = !DILocation(line: 750, column: 41, scope: !904)
!963 = !DILocation(line: 750, column: 22, scope: !904)
!964 = !DILocation(line: 750, column: 17, scope: !904)
!965 = !DILocation(line: 750, column: 59, scope: !904)
!966 = !DILocation(line: 770, column: 17, scope: !904)
!967 = !DILocation(line: 771, column: 17, scope: !904)
!968 = !DILocation(line: 763, column: 17, scope: !904)
!969 = !DILocation(line: 764, column: 41, scope: !904)
!970 = !DILocation(line: 764, column: 22, scope: !904)
!971 = !DILocation(line: 764, column: 17, scope: !904)
!972 = !DILocation(line: 764, column: 57, scope: !904)
!973 = !DILocation(line: 742, column: 17, scope: !904)
!974 = !DILocation(line: 743, column: 17, scope: !904)
!975 = !DILocation(line: 735, column: 17, scope: !904)
!976 = !DILocation(line: 736, column: 41, scope: !904)
!977 = !DILocation(line: 736, column: 22, scope: !904)
!978 = !DILocation(line: 736, column: 17, scope: !904)
!979 = !DILocation(line: 736, column: 59, scope: !904)
!980 = !DILocation(line: 707, column: 17, scope: !904)
!981 = !DILocation(line: 708, column: 17, scope: !904)
!982 = !DILocation(line: 693, column: 17, scope: !904)
!983 = !DILocation(line: 694, column: 41, scope: !904)
!984 = !DILocation(line: 694, column: 22, scope: !904)
!985 = !DILocation(line: 694, column: 17, scope: !904)
!986 = !DILocation(line: 694, column: 57, scope: !904)
!987 = !DILocation(line: 700, column: 17, scope: !904)
!988 = !DILocation(line: 701, column: 17, scope: !904)
!989 = !DILocation(line: 686, column: 17, scope: !904)
!990 = !DILocation(line: 687, column: 41, scope: !904)
!991 = !DILocation(line: 687, column: 22, scope: !904)
!992 = !DILocation(line: 687, column: 17, scope: !904)
!993 = !DILocation(line: 687, column: 57, scope: !904)
!994 = !DILocation(line: 714, column: 44, scope: !904)
!995 = !{i8 0, i8 2}
!996 = !DILocation(line: 714, column: 17, scope: !904)
!997 = !DILocation(line: 715, column: 41, scope: !904)
!998 = !DILocation(line: 715, column: 22, scope: !904)
!999 = !DILocation(line: 715, column: 17, scope: !904)
!1000 = !DILocation(line: 715, column: 59, scope: !904)
!1001 = !DILocation(line: 721, column: 20, scope: !904)
!1002 = !DILocation(line: 788, column: 23, scope: !904)
!1003 = !DILocation(line: 788, column: 23, scope: !944)
!1004 = !DILocation(line: 792, column: 37, scope: !944)
!1005 = !DILocation(line: 792, column: 54, scope: !944)
!1006 = !DILocation(line: 791, column: 17, scope: !944)
!1007 = !DILocation(line: 790, column: 18, scope: !944)
!1008 = !DILocation(line: 793, column: 13, scope: !904)
!1009 = !DILocation(line: 794, column: 18, scope: !904)
!1010 = !DILocation(line: 727, column: 47, scope: !904)
!1011 = !DILocation(line: 727, column: 21, scope: !904)
!1012 = !DILocation(line: 728, column: 45, scope: !904)
!1013 = !DILocation(line: 728, column: 26, scope: !904)
!1014 = !DILocation(line: 728, column: 21, scope: !904)
!1015 = !DILocation(line: 721, column: 17, scope: !904)
!1016 = !DILocation(line: 724, column: 45, scope: !904)
!1017 = !DILocation(line: 724, column: 26, scope: !904)
!1018 = !DILocation(line: 724, column: 21, scope: !904)
!1019 = distinct !DISubprogram(name: "new<pc_keyboard::layouts::us104::Us104Key>", linkageName: "_ZN11pc_keyboard21EventDecoder$LT$L$GT$3new17hd9478c1cf01e35c1E", scope: !398, file: !905, line: 647, type: !1020, scopeLine: 647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !420, declaration: !1022, retainedNodes: !1023)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!398, !417, !401}
!1022 = !DISubprogram(name: "new<pc_keyboard::layouts::us104::Us104Key>", linkageName: "_ZN11pc_keyboard21EventDecoder$LT$L$GT$3new17hd9478c1cf01e35c1E", scope: !398, file: !905, line: 647, type: !1020, scopeLine: 647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !420)
!1023 = !{!1024, !1025}
!1024 = !DILocalVariable(name: "layout", arg: 1, scope: !1019, file: !905, line: 647, type: !417)
!1025 = !DILocalVariable(name: "handle_ctrl", arg: 2, scope: !1019, file: !905, line: 647, type: !401)
!1026 = !DILocation(line: 647, column: 22, scope: !1019)
!1027 = !DILocation(line: 647, column: 33, scope: !1019)
!1028 = !DILocation(line: 650, column: 24, scope: !1019)
!1029 = !DILocation(line: 648, column: 9, scope: !1019)
!1030 = !DILocation(line: 662, column: 6, scope: !1019)
!1031 = distinct !DISubprogram(name: "process_keyevent<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", linkageName: "_ZN11pc_keyboard21Keyboard$LT$L$C$S$GT$16process_keyevent17h0eef9edd83e74de9E", scope: !375, file: !905, line: 561, type: !1032, scopeLine: 561, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !549, templateParams: !422, declaration: !1035, retainedNodes: !1036)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!908, !1034, !935}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut pc_keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
