; ModuleID = '4wmz2o8gvmsq2c7x'
source_filename = "4wmz2o8gvmsq2c7x"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"spin::mutex::Mutex<vga::Screen>" = type { %"spin::mutex::spin::SpinMutex<vga::Screen>" }
%"spin::mutex::spin::SpinMutex<vga::Screen>" = type { %"core::marker::PhantomData<spin::relax::Spin>", %"core::sync::atomic::AtomicBool", [7 x i8], %"core::cell::UnsafeCell<vga::Screen>" }
%"core::marker::PhantomData<spin::relax::Spin>" = type {}
%"core::sync::atomic::AtomicBool" = type { i8 }
%"core::cell::UnsafeCell<vga::Screen>" = type { %"vga::Screen" }
%"vga::Screen" = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }
%"spin::mutex::Mutex<uart_16550::port::SerialPort>" = type { %"spin::mutex::spin::SpinMutex<uart_16550::port::SerialPort>" }
%"spin::mutex::spin::SpinMutex<uart_16550::port::SerialPort>" = type { %"core::marker::PhantomData<spin::relax::Spin>", %"core::sync::atomic::AtomicBool", [1 x i8], %"core::cell::UnsafeCell<uart_16550::port::SerialPort>" }
%"core::cell::UnsafeCell<uart_16550::port::SerialPort>" = type { %"uart_16550::port::SerialPort" }
%"uart_16550::port::SerialPort" = type { i16, i16, i16, i16, i16, i16 }
%"core::ptr::metadata::PtrComponents<&dyn traits::Testable>" = type { ptr, {} }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "a19f3c2b6bc29eed208ec0df1b282ee")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "9a5297ba223d5893bfc6e1cb4ac9abc2")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "fef07ce6f62b05eeaed5e01808914f67")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "58f08dfb5743ec90e9f8168435f6db1a")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "9a92220af44fce06ad9393250f526940")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "a1bb210fc458d887785ffae30c1a624")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "f64d3b5b69c6192e63f6d65c05a24d9")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "<&mut uart_16550::port::SerialPort as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut uart_16550::port::SerialPort as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !57, vtableHolder: !64, templateParams: !27, identifier: "8ebacf0b8e7a867ea43f54c48389b60")
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !56, file: !2, baseType: !6, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !56, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !56, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !56, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::port::SerialPort", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !66, file: !2, size: 96, align: 16, elements: !68, templateParams: !27, identifier: "cd0e78a1223020139b26741e646bf7e1")
!66 = !DINamespace(name: "port", scope: !67)
!67 = !DINamespace(name: "uart_16550", scope: null)
!68 = !{!69, !93, !110, !111, !112, !113}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !2, baseType: !70, size: 16, align: 16)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !71, file: !2, size: 16, align: 16, elements: !74, templateParams: !90, identifier: "487b5835ba017090554a699a3b37275a")
!71 = !DINamespace(name: "port", scope: !72)
!72 = !DINamespace(name: "instructions", scope: !73)
!73 = !DINamespace(name: "x86_64", scope: null)
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !70, file: !2, baseType: !76, size: 16, align: 16)
!76 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !70, file: !2, baseType: !78, align: 8)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !79, file: !2, align: 8, elements: !27, templateParams: !81, identifier: "88cc4282f6d1c4352c5ca6f9ab263a1a")
!79 = !DINamespace(name: "marker", scope: !80)
!80 = !DINamespace(name: "core", scope: null)
!81 = !{!82}
!82 = !DITemplateTypeParameter(name: "T", type: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !84, templateParams: !27, identifier: "3dc30ca0c00117692b3c1c6176279d7b")
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !83, file: !2, baseType: !39, size: 8, align: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !83, file: !2, baseType: !87, align: 8, offset: 8)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !71, file: !2, align: 8, elements: !88, templateParams: !27, identifier: "a11bb1c53865c7ec5fd0108bdee572a")
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !87, file: !2, baseType: !7, align: 8)
!90 = !{!91, !92}
!91 = !DITemplateTypeParameter(name: "T", type: !39)
!92 = !DITemplateTypeParameter(name: "A", type: !87)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !65, file: !2, baseType: !94, size: 16, align: 16, offset: 16)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !71, file: !2, size: 16, align: 16, elements: !95, templateParams: !108, identifier: "25cab3ea99bffd7ba4230c1588763083")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !94, file: !2, baseType: !76, size: 16, align: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !94, file: !2, baseType: !98, align: 8)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !79, file: !2, align: 8, elements: !27, templateParams: !99, identifier: "299e7dd98773499a114b88ec7a08255f")
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "T", type: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !102, templateParams: !27, identifier: "5da5c04d90082913db0fd00925311505")
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !101, file: !2, baseType: !39, size: 8, align: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !101, file: !2, baseType: !105, align: 8, offset: 8)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !71, file: !2, align: 8, elements: !106, templateParams: !27, identifier: "b9f6145b3470dd1ff4311424ce761374")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !7, align: 8)
!108 = !{!91, !109}
!109 = !DITemplateTypeParameter(name: "A", type: !105)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !65, file: !2, baseType: !94, size: 16, align: 16, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !65, file: !2, baseType: !94, size: 16, align: 16, offset: 48)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !65, file: !2, baseType: !94, size: 16, align: 16, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !65, file: !2, baseType: !114, size: 16, align: 16, offset: 80)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !71, file: !2, size: 16, align: 16, elements: !115, templateParams: !128, identifier: "23781e8935d55c8b86a6bee10347e55")
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !114, file: !2, baseType: !76, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !114, file: !2, baseType: !118, align: 8)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !79, file: !2, align: 8, elements: !27, templateParams: !119, identifier: "cca00b18374ad9d462bfb22b2f76a310")
!119 = !{!120}
!120 = !DITemplateTypeParameter(name: "T", type: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !122, templateParams: !27, identifier: "6dc76304a3391c81a20b0390492e7497")
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !121, file: !2, baseType: !39, size: 8, align: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !121, file: !2, baseType: !125, align: 8, offset: 8)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !71, file: !2, align: 8, elements: !126, templateParams: !27, identifier: "ca28d1df1e3260019943234f5ef9b57")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !7, align: 8)
!128 = !{!91, !129}
!129 = !DITemplateTypeParameter(name: "A", type: !125)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !133, vtableHolder: !138, templateParams: !27, identifier: "cbc30e9d1c67c3bacd3c24ae45c6139b")
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !132, file: !2, baseType: !6, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !132, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !139, file: !2, align: 8, elements: !27, identifier: "ba7ee7bf0217687128c0134bf159d064")
!139 = !DINamespace(name: "fmt", scope: !80)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !143, vtableHolder: !148, templateParams: !27, identifier: "65bb21aafd345e7480f6ec23b96724ec")
!143 = !{!144, !145, !146, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !142, file: !2, baseType: !6, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !142, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !142, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !142, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN__TEXT_MODE", linkageName: "_ZN4theo11peripherals25VGA_DISPLAY_IN__TEXT_MODE17hd2e6ba0582129c6dE", scope: !152, file: !154, line: 161, type: !155, isLocal: true, isDefinition: true, align: 8)
!152 = !DINamespace(name: "peripherals", scope: !153)
!153 = !DINamespace(name: "theo", scope: null)
!154 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN__TEXT_MODE", scope: !152, file: !2, align: 8, elements: !156, templateParams: !27, identifier: "f44fbd27c26745a67586f1038edd694")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !155, file: !2, baseType: !7, align: 8)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h9e0f4b12685821f1E", scope: !160, file: !163, line: 29, type: !164, isLocal: true, isDefinition: true, align: 64)
!160 = !DINamespace(name: "__stability", scope: !161)
!161 = !DINamespace(name: "deref", scope: !162)
!162 = !DINamespace(name: "{impl#0}", scope: !152)
!163 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !165, file: !2, size: 1920, align: 64, elements: !167, templateParams: !196, identifier: "69b8d51a99e29add56a96a6ad8570d3e")
!165 = !DINamespace(name: "lazy", scope: !166)
!166 = !DINamespace(name: "lazy_static", scope: null)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !169, size: 1920, align: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !170, file: !2, size: 1920, align: 64, elements: !172, templateParams: !196, identifier: "112259ef06b0e6c9dc7a43f72584978d")
!170 = !DINamespace(name: "once", scope: !171)
!171 = !DINamespace(name: "spin", scope: null)
!172 = !{!173, !185}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !2, baseType: !174, size: 64, align: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !175, file: !2, size: 64, align: 64, elements: !177, templateParams: !27, identifier: "2c415d1e4d24645a991671e87ccbaa5f")
!175 = !DINamespace(name: "atomic", scope: !176)
!176 = !DINamespace(name: "sync", scope: !80)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !174, file: !2, baseType: !179, size: 64, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !180, file: !2, size: 64, align: 64, elements: !181, templateParams: !183, identifier: "babea2ccf1eb19d33f369462af1aa4f6")
!180 = !DINamespace(name: "cell", scope: !80)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !2, baseType: !9, size: 64, align: 64)
!183 = !{!184}
!184 = !DITemplateTypeParameter(name: "T", type: !9)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !2, baseType: !186, size: 1856, align: 64, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !180, file: !2, size: 1856, align: 64, elements: !187, templateParams: !233, identifier: "4969387a371fe7d7810e57d9a5e4b069")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !186, file: !2, baseType: !189, size: 1856, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !190, file: !2, size: 1856, align: 64, elements: !191, templateParams: !27, identifier: "2758bea62d924e3bbafd9c918d63b54c")
!190 = !DINamespace(name: "option", scope: !80)
!191 = !{!192}
!192 = !DICompositeType(tag: DW_TAG_variant_part, scope: !189, file: !2, size: 1856, align: 64, elements: !193, templateParams: !27, identifier: "3c888d2b5c9c84403ae9ecf68d0abcae", discriminator: !231)
!193 = !{!194, !227}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !192, file: !2, baseType: !195, size: 1856, align: 64, extraData: i64 0)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !189, file: !2, size: 1856, align: 64, elements: !27, templateParams: !196, identifier: "1476d992eb3288b6480de5299bb99283")
!196 = !{!197}
!197 = !DITemplateTypeParameter(name: "T", type: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !199, file: !2, size: 1792, align: 64, elements: !200, templateParams: !225, identifier: "45ac00ce9ca2d98f61a4b45f3b061b7e")
!199 = !DINamespace(name: "mutex", scope: !171)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !198, file: !2, baseType: !202, size: 1792, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !203, file: !2, size: 1792, align: 64, elements: !204, templateParams: !225, identifier: "ad8f77e6b1845850f6df017c544e3bdb")
!203 = !DINamespace(name: "spin", scope: !199)
!204 = !{!205, !211, !219}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !202, file: !2, baseType: !206, align: 8)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !79, file: !2, align: 8, elements: !27, templateParams: !207, identifier: "cbb974b4e082f78d5a4962bd25f54772")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !210, file: !2, align: 8, elements: !27, identifier: "8f5ab90fe569cec87cb4e3eb70e215b1")
!210 = !DINamespace(name: "relax", scope: !171)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !202, file: !2, baseType: !212, size: 8, align: 8)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !175, file: !2, size: 8, align: 8, elements: !213, templateParams: !27, identifier: "95b963659e6262948e25685a50a88e1")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !212, file: !2, baseType: !215, size: 8, align: 8)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !180, file: !2, size: 8, align: 8, elements: !216, templateParams: !218, identifier: "1938c2049c44efc3b1f0b66531b9f2d1")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !215, file: !2, baseType: !39, size: 8, align: 8)
!218 = !{!91}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !2, baseType: !220, size: 1728, align: 64, offset: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !180, file: !2, size: 1728, align: 64, elements: !221, templateParams: !223, identifier: "ce4e92c593fa53d18bac29cf43b79009")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !220, file: !2, baseType: !15, size: 1728, align: 64)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !15)
!225 = !{!224, !226}
!226 = !DITemplateTypeParameter(name: "R", type: !209)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !192, file: !2, baseType: !228, size: 1856, align: 64, extraData: i64 1)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !189, file: !2, size: 1856, align: 64, elements: !229, templateParams: !196, identifier: "33a771ed44125c1d4edb42eb5f64efb")
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !228, file: !2, baseType: !198, size: 1792, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !2, baseType: !232, size: 64, align: 64, flags: DIFlagArtificial)
!232 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!233 = !{!234}
!234 = !DITemplateTypeParameter(name: "T", type: !189)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117hefec66e10784916eE", scope: !237, file: !154, line: 161, type: !238, isLocal: true, isDefinition: true, align: 8)
!237 = !DINamespace(name: "serial", scope: !153)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !237, file: !2, align: 8, elements: !239, templateParams: !27, identifier: "12a12c71dc1ff756c9e546db96ac9446")
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !238, file: !2, baseType: !7, align: 8)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h534a5205537e1c69E", scope: !243, file: !163, line: 29, type: !246, isLocal: true, isDefinition: true, align: 64)
!243 = !DINamespace(name: "__stability", scope: !244)
!244 = !DINamespace(name: "deref", scope: !245)
!245 = !DINamespace(name: "{impl#0}", scope: !237)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !165, file: !2, size: 192, align: 64, elements: !247, templateParams: !262, identifier: "6b9bcc35ef56c6941624cbc27ebb9e60")
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !246, file: !2, baseType: !249, size: 192, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !170, file: !2, size: 192, align: 64, elements: !250, templateParams: !262, identifier: "4f50770fb6c50e32a28f8963fb05c48f")
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !249, file: !2, baseType: !174, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !2, baseType: !253, size: 128, align: 16)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !180, file: !2, size: 128, align: 16, elements: !254, templateParams: !283, identifier: "5ed2b048ebd3f130a3ce56e445e1b22e")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !253, file: !2, baseType: !256, size: 128, align: 16)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !190, file: !2, size: 128, align: 16, elements: !257, templateParams: !27, identifier: "c10ab543d56d139e75a609a06e64b26e")
!257 = !{!258}
!258 = !DICompositeType(tag: DW_TAG_variant_part, scope: !256, file: !2, size: 128, align: 16, elements: !259, templateParams: !27, identifier: "ae799903b3fd23359cf3029801d5ccd", discriminator: !282)
!259 = !{!260, !278}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !258, file: !2, baseType: !261, size: 128, align: 16, extraData: i64 0)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !256, file: !2, size: 128, align: 16, elements: !27, templateParams: !262, identifier: "865f6aa880e39b4959bd70996f3f36e3")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !199, file: !2, size: 112, align: 16, elements: !265, templateParams: !277, identifier: "d8a691e4b3cc76aedd3ead71b60b0c68")
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !264, file: !2, baseType: !267, size: 112, align: 16)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !203, file: !2, size: 112, align: 16, elements: !268, templateParams: !277, identifier: "954ff6facfc87c03254ca13436e56984")
!268 = !{!269, !270, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !267, file: !2, baseType: !206, align: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !267, file: !2, baseType: !212, size: 8, align: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !2, baseType: !272, size: 96, align: 16, offset: 16)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !180, file: !2, size: 96, align: 16, elements: !273, templateParams: !275, identifier: "956dfbfd67cb64b08faf9c9a6f789bd8")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !2, baseType: !65, size: 96, align: 16)
!275 = !{!276}
!276 = !DITemplateTypeParameter(name: "T", type: !65)
!277 = !{!276, !226}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !258, file: !2, baseType: !279, size: 128, align: 16, extraData: i64 1)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !256, file: !2, size: 128, align: 16, elements: !280, templateParams: !262, identifier: "b0a9c072806f6a664bf68c4567aff36e")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !279, file: !2, baseType: !264, size: 112, align: 16, offset: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !2, baseType: !76, size: 16, align: 16, flags: DIFlagArtificial)
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !256)
!285 = !{i32 7, !"PIC Level", i32 2}
!286 = !{i32 7, !"PIE Level", i32 2}
!287 = !{i32 2, !"Dwarf Version", i32 4}
!288 = !{i32 2, !"Debug Info Version", i32 3}
!289 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !290, producer: "clang LLVM (rustc version 1.69.0-nightly (5b8f28453 2023-02-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !291, globals: !319, splitDebugInlining: false)
!290 = !DIFile(filename: "src/main.rs/@/4wmz2o8gvmsq2c7x", directory: "/Users/yaw/self/theo")
!291 = !{!49, !292, !300, !307, !313}
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !293, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !295)
!293 = !DINamespace(name: "v1", scope: !294)
!294 = !DINamespace(name: "rt", scope: !139)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !175, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !301)
!301 = !{!302, !303, !304, !305, !306}
!302 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !308, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !309)
!308 = !DINamespace(name: "panicking", scope: !80)
!309 = !{!310, !311, !312}
!310 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!311 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!312 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QemuExitCode", scope: !314, file: !2, baseType: !315, size: 32, align: 32, flags: DIFlagEnumClass, elements: !316)
!314 = !DINamespace(name: "qemu", scope: !153)
!315 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!316 = !{!317, !318}
!317 = !DIEnumerator(name: "Success", value: 100, isUnsigned: true)
!318 = !DIEnumerator(name: "_Failed", value: 200, isUnsigned: true)
!319 = !{!0, !54, !130, !140, !150, !158, !235, !241}
!320 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3330ba932b9ef817E", scope: !322, file: !321, line: 2396, type: !323, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !488, retainedNodes: !485)
!321 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!322 = !DINamespace(name: "{impl#59}", scope: !139)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !342, !443}
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !326, file: !2, size: 8, align: 8, elements: !327, templateParams: !27, identifier: "439b0028cce69ada54f55b3e334b6ecd")
!326 = !DINamespace(name: "result", scope: !80)
!327 = !{!328}
!328 = !DICompositeType(tag: DW_TAG_variant_part, scope: !325, file: !2, size: 8, align: 8, elements: !329, templateParams: !27, identifier: "be95a66ec545b971daf5682acfef386a", discriminator: !341)
!329 = !{!330, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !328, file: !2, baseType: !331, size: 8, align: 8, extraData: i64 0)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !325, file: !2, size: 8, align: 8, elements: !332, templateParams: !334, identifier: "970917c63ec9d7b58016c128bd3204c")
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !331, file: !2, baseType: !7, align: 8, offset: 8)
!334 = !{!335, !336}
!335 = !DITemplateTypeParameter(name: "T", type: !7)
!336 = !DITemplateTypeParameter(name: "E", type: !138)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !328, file: !2, baseType: !338, size: 8, align: 8, extraData: i64 1)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !325, file: !2, size: 8, align: 8, elements: !339, templateParams: !334, identifier: "277298c56e69e6ae4141f3824479ae34")
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !338, file: !2, baseType: !138, align: 8, offset: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !343, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !344, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !345, file: !2, size: 320, align: 64, elements: !347, templateParams: !27, identifier: "81230acdbe9fa0dc603bbe23630352ea")
!345 = !DINamespace(name: "panic_info", scope: !346)
!346 = !DINamespace(name: "panic", scope: !80)
!347 = !{!348, !359, !475, !483}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !344, file: !2, baseType: !349, size: 128, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !350, templateParams: !27, identifier: "86990cf948ea1f0588c68b7fd2ef934b")
!350 = !{!351, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !349, file: !2, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64, dwarfAddressSpace: 0)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "d9c239261a04408e6355de26497b9ee")
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !349, file: !2, baseType: !355, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !356, size: 64, align: 64, dwarfAddressSpace: 0)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 3, lowerBound: 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !344, file: !2, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !190, file: !2, size: 64, align: 64, elements: !361, templateParams: !27, identifier: "8a4f2cf2acaef5b694f3fe1d4b7d54aa")
!361 = !{!362}
!362 = !DICompositeType(tag: DW_TAG_variant_part, scope: !360, file: !2, size: 64, align: 64, elements: !363, templateParams: !27, identifier: "77de836c0463e92c6497c68878e2fec", discriminator: !474)
!363 = !{!364, !470}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !362, file: !2, baseType: !365, size: 64, align: 64, extraData: i64 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !360, file: !2, size: 64, align: 64, elements: !27, templateParams: !366, identifier: "d42125665173328ccf21b1fd664ed9a7")
!366 = !{!367}
!367 = !DITemplateTypeParameter(name: "T", type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !369, size: 64, align: 64, dwarfAddressSpace: 0)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !139, file: !2, size: 384, align: 64, elements: !370, templateParams: !27, identifier: "aa4495e11001eeb7a8dec7abda538011")
!370 = !{!371, !382, !428}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !369, file: !2, baseType: !372, size: 128, align: 64, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !373, templateParams: !27, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!373 = !{!374, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !372, file: !2, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64, dwarfAddressSpace: 0)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !377, templateParams: !27, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!377 = !{!378, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !376, file: !2, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !376, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !372, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !369, file: !2, baseType: !383, size: 128, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !190, file: !2, size: 128, align: 64, elements: !384, templateParams: !27, identifier: "f20f93edc9b6759569bd27834bca2867")
!384 = !{!385}
!385 = !DICompositeType(tag: DW_TAG_variant_part, scope: !383, file: !2, size: 128, align: 64, elements: !386, templateParams: !27, identifier: "4c2bc57bba010026e96c6b272990e455", discriminator: !427)
!386 = !{!387, !423}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !385, file: !2, baseType: !388, size: 128, align: 64, extraData: i64 0)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !383, file: !2, size: 128, align: 64, elements: !27, templateParams: !389, identifier: "b03d968f2fa497fccf294fb725789344")
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "T", type: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !392, templateParams: !27, identifier: "fbc7473a1424cb3193ffa7a7ee24653a")
!392 = !{!393, !422}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !391, file: !2, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !293, file: !2, size: 448, align: 64, elements: !396, templateParams: !27, identifier: "5baa9876693e95e5feb1bff2f29eab42")
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !395, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !395, file: !2, baseType: !399, size: 384, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !293, file: !2, size: 384, align: 64, elements: !400, templateParams: !27, identifier: "af655e92005115efb855d950904d628d")
!400 = !{!401, !403, !404, !405, !421}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !399, file: !2, baseType: !402, size: 32, align: 32, offset: 288)
!402 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !399, file: !2, baseType: !292, size: 8, align: 8, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !2, baseType: !315, size: 32, align: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !399, file: !2, baseType: !406, size: 128, align: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !293, file: !2, size: 128, align: 64, elements: !407, templateParams: !27, identifier: "bb4b398e5f72abfe68675895ae5e57c7")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_variant_part, scope: !406, file: !2, size: 128, align: 64, elements: !409, templateParams: !27, identifier: "9d0217852ba0cec4f3ca8286384a753f", discriminator: !420)
!409 = !{!410, !414, !418}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !408, file: !2, baseType: !411, size: 128, align: 64, extraData: i64 0)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !406, file: !2, size: 128, align: 64, elements: !412, templateParams: !27, identifier: "1bffdda99d4ba93b3632eb9b10e0d6c2")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !411, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !408, file: !2, baseType: !415, size: 128, align: 64, extraData: i64 1)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !406, file: !2, size: 128, align: 64, elements: !416, templateParams: !27, identifier: "93a126390616414615f290788924acea")
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !415, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !408, file: !2, baseType: !419, size: 128, align: 64, extraData: i64 2)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !406, file: !2, size: 128, align: 64, elements: !27, identifier: "bee9d1aff1e2e0def3297d379f780bc3")
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !406, file: !2, baseType: !232, size: 64, align: 64, flags: DIFlagArtificial)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !399, file: !2, baseType: !406, size: 128, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !391, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !385, file: !2, baseType: !424, size: 128, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !383, file: !2, size: 128, align: 64, elements: !425, templateParams: !389, identifier: "76c5d43fc2261c18f3f3f9fcdeb1ea19")
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !424, file: !2, baseType: !391, size: 128, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, scope: !383, file: !2, baseType: !232, size: 64, align: 64, flags: DIFlagArtificial)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !369, file: !2, baseType: !429, size: 128, align: 64, offset: 256)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !430, templateParams: !27, identifier: "7fd253a118f8ffbba43d5247c666a8bb")
!430 = !{!431, !469}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !429, file: !2, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64, dwarfAddressSpace: 0)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !139, file: !2, size: 128, align: 64, elements: !434, templateParams: !27, identifier: "71f0688e928e59cfa8d2e89ebf7ebc37")
!434 = !{!435, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !433, file: !2, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !438, file: !2, align: 8, elements: !27, identifier: "8ad1d27c01883c0662373925bfb88afd")
!438 = !DINamespace(name: "{extern#0}", scope: !139)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !433, file: !2, baseType: !440, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !441, size: 64, align: 64, dwarfAddressSpace: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!325, !436, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !139, file: !2, size: 512, align: 64, elements: !445, templateParams: !27, identifier: "a90501ff6e2f2af5c6a6372291169d97")
!445 = !{!446, !447, !448, !449, !461, !462}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !444, file: !2, baseType: !315, size: 32, align: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !444, file: !2, baseType: !402, size: 32, align: 32, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !444, file: !2, baseType: !292, size: 8, align: 8, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !444, file: !2, baseType: !450, size: 128, align: 64, offset: 128)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !190, file: !2, size: 128, align: 64, elements: !451, templateParams: !27, identifier: "a061711948cade3933e2c15b599cef32")
!451 = !{!452}
!452 = !DICompositeType(tag: DW_TAG_variant_part, scope: !450, file: !2, size: 128, align: 64, elements: !453, templateParams: !27, identifier: "a12832ba19fc53c9fdb0c372f0b3354e", discriminator: !460)
!453 = !{!454, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !452, file: !2, baseType: !455, size: 128, align: 64, extraData: i64 0)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !450, file: !2, size: 128, align: 64, elements: !27, templateParams: !183, identifier: "c3705e48f19ae18cdc2a5519f6e6f5cb")
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !452, file: !2, baseType: !457, size: 128, align: 64, extraData: i64 1)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !450, file: !2, size: 128, align: 64, elements: !458, templateParams: !183, identifier: "be8b31308e3e31c866943c8d7b3fd52a")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !457, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !2, baseType: !232, size: 64, align: 64, flags: DIFlagArtificial)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !444, file: !2, baseType: !450, size: 128, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !444, file: !2, baseType: !463, size: 128, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !464, templateParams: !27, identifier: "a3f442e004e09e017868002c1c14e7e3")
!464 = !{!465, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !463, file: !2, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "fad07e960ab186f2781ffe1a5cde3e23")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !463, file: !2, baseType: !355, size: 64, align: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !429, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !362, file: !2, baseType: !471, size: 64, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !360, file: !2, size: 64, align: 64, elements: !472, templateParams: !366, identifier: "19d73f3b2ef9d032d85b94c86450fafc")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !471, file: !2, baseType: !368, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !360, file: !2, baseType: !232, size: 64, align: 64, flags: DIFlagArtificial)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !344, file: !2, baseType: !476, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !477, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !478, file: !2, size: 192, align: 64, elements: !479, templateParams: !27, identifier: "bba63b46120dd64776bc3bc3b13a6ca8")
!478 = !DINamespace(name: "location", scope: !346)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !477, file: !2, baseType: !376, size: 128, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !477, file: !2, baseType: !315, size: 32, align: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !477, file: !2, baseType: !315, size: 32, align: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !344, file: !2, baseType: !484, size: 8, align: 8, offset: 256)
!484 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!485 = !{!486, !487}
!486 = !DILocalVariable(name: "self", arg: 1, scope: !320, file: !321, line: 2396, type: !342)
!487 = !DILocalVariable(name: "f", arg: 2, scope: !320, file: !321, line: 2396, type: !443)
!488 = !{!489}
!489 = !DITemplateTypeParameter(name: "T", type: !344)
!490 = !DILocation(line: 2396, column: 20, scope: !320)
!491 = !DILocation(line: 2396, column: 27, scope: !320)
!492 = !DILocation(line: 2396, column: 71, scope: !320)
!493 = !{i64 8}
!494 = !DILocation(line: 2396, column: 62, scope: !320)
!495 = !DILocation(line: 2396, column: 84, scope: !320)
!496 = distinct !DISubprogram(name: "type_name<fn()>", linkageName: "_ZN4core3any9type_name17h004646328f24e765E", scope: !498, file: !497, line: 726, type: !499, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !501, retainedNodes: !27)
!497 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/any.rs", directory: "", checksumkind: CSK_MD5, checksum: "d8cb3b5ca9369b389e3f60910d0a5bd3")
!498 = !DINamespace(name: "any", scope: !80)
!499 = !DISubroutineType(types: !500)
!500 = !{!376}
!501 = !{!502}
!502 = !DITemplateTypeParameter(name: "T", type: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !504, size: 64, align: 64, dwarfAddressSpace: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{null}
!506 = !DILocation(line: 727, column: 5, scope: !496)
!507 = !{i64 1}
!508 = !DILocation(line: 728, column: 2, scope: !496)
!509 = distinct !DISubprogram(name: "type_name<fn()>", linkageName: "_ZN4core3any9type_name17h9513db2da53bf993E", scope: !498, file: !497, line: 726, type: !499, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !501, retainedNodes: !27)
!510 = !DILocation(line: 727, column: 5, scope: !509)
!511 = !DILocation(line: 728, column: 2, scope: !509)
!512 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17h5f345beab5f227ddE", scope: !433, file: !321, line: 340, type: !513, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !519, retainedNodes: !516)
!513 = !DISubroutineType(types: !514)
!514 = !{!433, !342, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!516 = !{!517, !518}
!517 = !DILocalVariable(name: "x", arg: 1, scope: !512, file: !321, line: 340, type: !342)
!518 = !DILocalVariable(name: "f", arg: 2, scope: !512, file: !321, line: 340, type: !515)
!519 = !{!520}
!520 = !DITemplateTypeParameter(name: "T", type: !343)
!521 = !DILocation(line: 340, column: 23, scope: !512)
!522 = !DILocation(line: 340, column: 33, scope: !512)
!523 = !DILocation(line: 349, column: 42, scope: !512)
!524 = !DILocation(line: 349, column: 68, scope: !512)
!525 = !DILocation(line: 349, column: 18, scope: !512)
!526 = !DILocation(line: 350, column: 6, scope: !512)
!527 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h9878c663dfdd300eE", scope: !433, file: !321, line: 329, type: !528, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !519, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!433, !342}
!530 = !{!531}
!531 = !DILocalVariable(name: "x", arg: 1, scope: !527, file: !321, line: 329, type: !342)
!532 = !DILocation(line: 329, column: 30, scope: !527)
!533 = !DILocation(line: 330, column: 13, scope: !527)
!534 = !DILocation(line: 331, column: 10, scope: !527)
!535 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17h28ce07df7bf5583eE", scope: !536, file: !321, line: 168, type: !537, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !542, retainedNodes: !539)
!536 = !DINamespace(name: "Write", scope: !139)
!537 = !DISubroutineType(types: !538)
!538 = !{!325, !14, !402}
!539 = !{!540, !541}
!540 = !DILocalVariable(name: "self", arg: 1, scope: !535, file: !321, line: 168, type: !14)
!541 = !DILocalVariable(name: "c", arg: 2, scope: !535, file: !321, line: 168, type: !402)
!542 = !{!543}
!543 = !DITemplateTypeParameter(name: "Self", type: !15)
!544 = !DILocation(line: 168, column: 19, scope: !535)
!545 = !DILocation(line: 168, column: 30, scope: !535)
!546 = !DILocation(line: 169, column: 43, scope: !535)
!547 = !DILocation(line: 169, column: 24, scope: !535)
!548 = !DILocation(line: 169, column: 9, scope: !535)
!549 = !DILocation(line: 170, column: 6, scope: !535)
!550 = distinct !DISubprogram(name: "write_char<uart_16550::port::SerialPort>", linkageName: "_ZN4core3fmt5Write10write_char17h7849b57effdc8123E", scope: !536, file: !321, line: 168, type: !551, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !556, retainedNodes: !553)
!551 = !DISubroutineType(types: !552)
!552 = !{!325, !64, !402}
!553 = !{!554, !555}
!554 = !DILocalVariable(name: "self", arg: 1, scope: !550, file: !321, line: 168, type: !64)
!555 = !DILocalVariable(name: "c", arg: 2, scope: !550, file: !321, line: 168, type: !402)
!556 = !{!557}
!557 = !DITemplateTypeParameter(name: "Self", type: !65)
!558 = !DILocation(line: 168, column: 19, scope: !550)
!559 = !DILocation(line: 168, column: 30, scope: !550)
!560 = !DILocation(line: 169, column: 43, scope: !550)
!561 = !DILocation(line: 169, column: 24, scope: !550)
!562 = !DILocation(line: 169, column: 9, scope: !550)
!563 = !DILocation(line: 170, column: 6, scope: !550)
!564 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17h50c0e2548c7a0d17E", scope: !536, file: !321, line: 196, type: !565, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !542, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!325, !14, !369}
!567 = !{!568, !569}
!568 = !DILocalVariable(name: "self", arg: 1, scope: !564, file: !321, line: 196, type: !14)
!569 = !DILocalVariable(name: "args", arg: 2, scope: !564, file: !321, line: 196, type: !369)
!570 = !DILocation(line: 196, column: 18, scope: !564)
!571 = !DILocation(line: 196, column: 39, scope: !564)
!572 = !DILocation(line: 197, column: 26, scope: !564)
!573 = !DILocation(line: 197, column: 9, scope: !564)
!574 = !DILocation(line: 198, column: 6, scope: !564)
!575 = distinct !DISubprogram(name: "write_fmt<uart_16550::port::SerialPort>", linkageName: "_ZN4core3fmt5Write9write_fmt17hcaec693dfbc2e6acE", scope: !536, file: !321, line: 196, type: !576, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !556, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!325, !64, !369}
!578 = !{!579, !580}
!579 = !DILocalVariable(name: "self", arg: 1, scope: !575, file: !321, line: 196, type: !64)
!580 = !DILocalVariable(name: "args", arg: 2, scope: !575, file: !321, line: 196, type: !369)
!581 = !DILocation(line: 196, column: 18, scope: !575)
!582 = !DILocation(line: 196, column: 39, scope: !575)
!583 = !DILocation(line: 197, column: 26, scope: !575)
!584 = !DILocation(line: 197, column: 9, scope: !575)
!585 = !DILocation(line: 198, column: 6, scope: !575)
!586 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h6cd2a3cb061bbd90E", scope: !369, file: !321, line: 421, type: !587, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !592)
!587 = !DISubroutineType(types: !588)
!588 = !{!369, !372, !429, !391, !589}
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !139, file: !2, align: 8, elements: !590, templateParams: !27, identifier: "48d3faea63f21d23fea6805f3d697a9e")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !589, file: !2, baseType: !7, align: 8)
!592 = !{!593, !594, !595, !596}
!593 = !DILocalVariable(name: "pieces", arg: 1, scope: !586, file: !321, line: 422, type: !372)
!594 = !DILocalVariable(name: "args", arg: 2, scope: !586, file: !321, line: 423, type: !429)
!595 = !DILocalVariable(name: "fmt", arg: 3, scope: !586, file: !321, line: 424, type: !391)
!596 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !586, file: !321, line: 425, type: !589)
!597 = !DILocation(line: 422, column: 9, scope: !586)
!598 = !DILocation(line: 423, column: 9, scope: !586)
!599 = !DILocation(line: 424, column: 9, scope: !586)
!600 = !DILocation(line: 425, column: 9, scope: !586)
!601 = !DILocation(line: 427, column: 34, scope: !586)
!602 = !DILocation(line: 427, column: 9, scope: !586)
!603 = !DILocation(line: 428, column: 6, scope: !586)
!604 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h0d7a98d7609ed979E", scope: !369, file: !321, line: 401, type: !605, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{!369, !372, !429}
!607 = !{!608, !609}
!608 = !DILocalVariable(name: "pieces", arg: 1, scope: !604, file: !321, line: 401, type: !372)
!609 = !DILocalVariable(name: "args", arg: 2, scope: !604, file: !321, line: 401, type: !429)
!610 = !DILocation(line: 401, column: 25, scope: !604)
!611 = !DILocation(line: 401, column: 53, scope: !604)
!612 = !DILocation(line: 402, column: 12, scope: !604)
!613 = !DILocation(line: 402, column: 56, scope: !604)
!614 = !{i8 0, i8 2}
!615 = !DILocation(line: 402, column: 41, scope: !604)
!616 = !DILocation(line: 405, column: 34, scope: !604)
!617 = !DILocation(line: 405, column: 9, scope: !604)
!618 = !DILocation(line: 406, column: 6, scope: !604)
!619 = !DILocation(line: 403, column: 13, scope: !604)
!620 = distinct !DISubprogram(name: "call<fn(), ()>", linkageName: "_ZN4core3ops8function2Fn4call17h53b34f13e2406d50E", scope: !622, file: !621, line: 79, type: !625, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !632, retainedNodes: !628)
!621 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!622 = !DINamespace(name: "Fn", scope: !623)
!623 = !DINamespace(name: "function", scope: !624)
!624 = !DINamespace(name: "ops", scope: !80)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&fn()", baseType: !503, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !{!629, !631}
!629 = !DILocalVariable(arg: 1, scope: !620, file: !621, line: 79, type: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const fn()", baseType: !503, size: 64, align: 64, dwarfAddressSpace: 0)
!631 = !DILocalVariable(arg: 2, scope: !620, file: !621, line: 79, type: !7)
!632 = !{!633, !634}
!633 = !DITemplateTypeParameter(name: "Self", type: !503)
!634 = !DITemplateTypeParameter(name: "Args", type: !7)
!635 = !DILocation(line: 79, column: 5, scope: !620)
!636 = distinct !DISubprogram(name: "call<fn(), ()>", linkageName: "_ZN4core3ops8function2Fn4call17h7f08f509fe0a4c21E", scope: !622, file: !621, line: 79, type: !625, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !632, retainedNodes: !637)
!637 = !{!638, !639}
!638 = !DILocalVariable(arg: 1, scope: !636, file: !621, line: 79, type: !630)
!639 = !DILocalVariable(arg: 2, scope: !636, file: !621, line: 79, type: !7)
!640 = !DILocation(line: 79, column: 5, scope: !636)
!641 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h3a94146fb8d840e8E", scope: !642, file: !621, line: 250, type: !643, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !651, retainedNodes: !648)
!642 = !DINamespace(name: "FnOnce", scope: !623)
!643 = !DISubroutineType(types: !644)
!644 = !{!198, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !646, size: 64, align: 64, dwarfAddressSpace: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!198}
!648 = !{!649, !650}
!649 = !DILocalVariable(arg: 1, scope: !641, file: !621, line: 250, type: !645)
!650 = !DILocalVariable(arg: 2, scope: !641, file: !621, line: 250, type: !7)
!651 = !{!652, !634}
!652 = !DITemplateTypeParameter(name: "Self", type: !645)
!653 = !DILocation(line: 250, column: 5, scope: !641)
!654 = !DILocation(line: 8, column: 20, scope: !655, inlinedAt: !658)
!655 = !DILexicalBlockFile(scope: !657, file: !656, discriminator: 0)
!656 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a9f733008b5882d285bb953998165fcd")
!657 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17ha4d1fb2cf49264b4E", scope: !161, file: !154, line: 137, type: !646, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !27)
!658 = distinct !DILocation(line: 250, column: 5, scope: !641)
!659 = !DILocalVariable(name: "value", arg: 1, scope: !660, file: !661, line: 134, type: !15)
!660 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17haa0e0906b1765983E", scope: !198, file: !661, line: 134, type: !662, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !225, retainedNodes: !664)
!661 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c58534ad96d8dc14eb87ebe3c1afa1b")
!662 = !DISubroutineType(types: !663)
!663 = !{!198, !15}
!664 = !{!659}
!665 = !DILocation(line: 134, column: 22, scope: !660, inlinedAt: !666)
!666 = distinct !DILocation(line: 8, column: 9, scope: !655, inlinedAt: !658)
!667 = !DILocation(line: 135, column: 39, scope: !660, inlinedAt: !666)
!668 = !DILocalVariable(name: "data", arg: 1, scope: !669, file: !670, line: 99, type: !15)
!669 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17hd94c7b10a35d1ecdE", scope: !202, file: !670, line: 99, type: !671, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !225, retainedNodes: !673)
!670 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c66351a136ee4537f9723cd15dd8f9b")
!671 = !DISubroutineType(types: !672)
!672 = !{!202, !15}
!673 = !{!668}
!674 = !DILocation(line: 99, column: 22, scope: !669, inlinedAt: !675)
!675 = distinct !DILocation(line: 135, column: 23, scope: !660, inlinedAt: !666)
!676 = !DILocation(line: 101, column: 19, scope: !669, inlinedAt: !675)
!677 = !DILocation(line: 102, column: 35, scope: !669, inlinedAt: !675)
!678 = !DILocalVariable(name: "value", arg: 1, scope: !679, file: !680, line: 1962, type: !15)
!679 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h1861c94937848f54E", scope: !220, file: !680, line: 1962, type: !681, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !223, retainedNodes: !683)
!680 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "0a931b3cf4e155135af9f41e879646f7")
!681 = !DISubroutineType(types: !682)
!682 = !{!220, !15}
!683 = !{!678}
!684 = !DILocation(line: 1962, column: 22, scope: !679, inlinedAt: !685)
!685 = distinct !DILocation(line: 102, column: 19, scope: !669, inlinedAt: !675)
!686 = !DILocation(line: 1963, column: 22, scope: !679, inlinedAt: !685)
!687 = !DILocation(line: 1963, column: 9, scope: !679, inlinedAt: !685)
!688 = !DILocation(line: 100, column: 9, scope: !669, inlinedAt: !675)
!689 = !DILocation(line: 135, column: 9, scope: !660, inlinedAt: !666)
!690 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h85734d8c8e4b6357E", scope: !642, file: !621, line: 250, type: !691, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !699, retainedNodes: !696)
!691 = !DISubroutineType(types: !692)
!692 = !{!264, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", baseType: !694, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{!264}
!696 = !{!697, !698}
!697 = !DILocalVariable(arg: 1, scope: !690, file: !621, line: 250, type: !693)
!698 = !DILocalVariable(arg: 2, scope: !690, file: !621, line: 250, type: !7)
!699 = !{!700, !634}
!700 = !DITemplateTypeParameter(name: "Self", type: !693)
!701 = !DILocation(line: 250, column: 5, scope: !690)
!702 = !DILocalVariable(name: "serial_via_uart_16550", scope: !703, file: !704, line: 9, type: !65, align: 2)
!703 = distinct !DILexicalBlock(scope: !705, file: !704, line: 9, column: 9)
!704 = !DIFile(filename: "src/serial.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "2eb42f47f3e400b21e60cc8b57dafb58")
!705 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h3cef95df25ddc639E", scope: !244, file: !154, line: 137, type: !694, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !706)
!706 = !{!702}
!707 = !DILocation(line: 9, column: 13, scope: !703, inlinedAt: !708)
!708 = distinct !DILocation(line: 250, column: 5, scope: !690)
!709 = !DILocation(line: 9, column: 50, scope: !710, inlinedAt: !708)
!710 = !DILexicalBlockFile(scope: !705, file: !704, discriminator: 0)
!711 = !DILocation(line: 10, column: 9, scope: !703, inlinedAt: !708)
!712 = !DILocation(line: 11, column: 20, scope: !703, inlinedAt: !708)
!713 = !DILocalVariable(name: "value", arg: 1, scope: !714, file: !661, line: 134, type: !65)
!714 = distinct !DISubprogram(name: "new<uart_16550::port::SerialPort, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17haf9ccde7d8c0ad6cE", scope: !264, file: !661, line: 134, type: !715, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !277, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!264, !65}
!717 = !{!713}
!718 = !DILocation(line: 134, column: 22, scope: !714, inlinedAt: !719)
!719 = distinct !DILocation(line: 11, column: 9, scope: !703, inlinedAt: !708)
!720 = !DILocation(line: 135, column: 39, scope: !714, inlinedAt: !719)
!721 = !DILocalVariable(name: "data", arg: 1, scope: !722, file: !670, line: 99, type: !65)
!722 = distinct !DISubprogram(name: "new<uart_16550::port::SerialPort, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17h0ce8264111031351E", scope: !267, file: !670, line: 99, type: !723, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !277, retainedNodes: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!267, !65}
!725 = !{!721}
!726 = !DILocation(line: 99, column: 22, scope: !722, inlinedAt: !727)
!727 = distinct !DILocation(line: 135, column: 23, scope: !714, inlinedAt: !719)
!728 = !DILocation(line: 101, column: 19, scope: !722, inlinedAt: !727)
!729 = !DILocation(line: 102, column: 35, scope: !722, inlinedAt: !727)
!730 = !DILocalVariable(name: "value", arg: 1, scope: !731, file: !680, line: 1962, type: !65)
!731 = distinct !DISubprogram(name: "new<uart_16550::port::SerialPort>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h4441bd5d628b0fecE", scope: !272, file: !680, line: 1962, type: !732, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !275, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{!272, !65}
!734 = !{!730}
!735 = !DILocation(line: 1962, column: 22, scope: !731, inlinedAt: !736)
!736 = distinct !DILocation(line: 102, column: 19, scope: !722, inlinedAt: !727)
!737 = !DILocation(line: 1963, column: 22, scope: !731, inlinedAt: !736)
!738 = !DILocation(line: 1963, column: 9, scope: !731, inlinedAt: !736)
!739 = !DILocation(line: 100, column: 9, scope: !722, inlinedAt: !727)
!740 = !DILocation(line: 135, column: 9, scope: !714, inlinedAt: !719)
!741 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17hc7db094f58a176b4E", scope: !743, file: !742, line: 490, type: !744, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !749, retainedNodes: !747)
!742 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!743 = !DINamespace(name: "ptr", scope: !80)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !148, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !{!748}
!748 = !DILocalVariable(arg: 1, scope: !741, file: !742, line: 490, type: !746)
!749 = !{!750}
!750 = !DITemplateTypeParameter(name: "T", type: !148)
!751 = !DILocation(line: 490, column: 1, scope: !741)
!752 = distinct !DISubprogram(name: "drop_in_place<core::fmt::Error>", linkageName: "_ZN4core3ptr37drop_in_place$LT$core..fmt..Error$GT$17h6371dd73c7b94028E", scope: !743, file: !742, line: 490, type: !753, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !758, retainedNodes: !756)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::fmt::Error", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!756 = !{!757}
!757 = !DILocalVariable(arg: 1, scope: !752, file: !742, line: 490, type: !755)
!758 = !{!759}
!759 = !DITemplateTypeParameter(name: "T", type: !138)
!760 = !DILocation(line: 490, column: 1, scope: !752)
!761 = distinct !DISubprogram(name: "drop_in_place<fn()>", linkageName: "_ZN4core3ptr37drop_in_place$LT$theo..panic_test$GT$17hab57f128a72d7bf1E", scope: !743, file: !742, line: 490, type: !762, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !501, retainedNodes: !765)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut fn()", baseType: !503, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !{!766}
!766 = !DILocalVariable(arg: 1, scope: !761, file: !742, line: 490, type: !764)
!767 = !DILocation(line: 490, column: 1, scope: !761)
!768 = distinct !DISubprogram(name: "drop_in_place<fn()>", linkageName: "_ZN4core3ptr38drop_in_place$LT$theo..assert_true$GT$17h89b24b9b0201a624E", scope: !743, file: !742, line: 490, type: !762, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !501, retainedNodes: !769)
!769 = !{!770}
!770 = !DILocalVariable(arg: 1, scope: !768, file: !742, line: 490, type: !764)
!771 = !DILocation(line: 490, column: 1, scope: !768)
!772 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h3b3c5cd272d9f0bfE", scope: !743, file: !742, line: 490, type: !773, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !783, retainedNodes: !781)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !776, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !170, file: !2, size: 128, align: 64, elements: !777, templateParams: !27, identifier: "1adc313fbb4052cea2933d3c702452")
!777 = !{!778, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !776, file: !2, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !776, file: !2, baseType: !484, size: 8, align: 8, offset: 64)
!781 = !{!782}
!782 = !DILocalVariable(arg: 1, scope: !772, file: !742, line: 490, type: !775)
!783 = !{!784}
!784 = !DITemplateTypeParameter(name: "T", type: !776)
!785 = !DILocation(line: 490, column: 1, scope: !772)
!786 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17he2088a1361001c8eE", scope: !743, file: !742, line: 490, type: !787, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !792, retainedNodes: !790)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!790 = !{!791}
!791 = !DILocalVariable(arg: 1, scope: !786, file: !742, line: 490, type: !789)
!792 = !{!793}
!793 = !DITemplateTypeParameter(name: "T", type: !14)
!794 = !DILocation(line: 490, column: 1, scope: !786)
!795 = distinct !DISubprogram(name: "drop_in_place<&mut uart_16550::port::SerialPort>", linkageName: "_ZN4core3ptr61drop_in_place$LT$$RF$mut$u20$uart_16550..port..SerialPort$GT$17h27c4f8e5bcf8b054E", scope: !743, file: !742, line: 490, type: !796, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !801, retainedNodes: !799)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut uart_16550::port::SerialPort", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !{!800}
!800 = !DILocalVariable(arg: 1, scope: !795, file: !742, line: 490, type: !798)
!801 = !{!802}
!802 = !DITemplateTypeParameter(name: "T", type: !64)
!803 = !DILocation(line: 490, column: 1, scope: !795)
!804 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17h7e01e26a82145150E", scope: !743, file: !742, line: 490, type: !805, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !818, retainedNodes: !816)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !807}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !808, size: 64, align: 64, dwarfAddressSpace: 0)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !199, file: !2, size: 128, align: 64, elements: !809, templateParams: !223, identifier: "c5456dbf11f2920431d11b69193766b8")
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !808, file: !2, baseType: !811, size: 128, align: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !203, file: !2, size: 128, align: 64, elements: !812, templateParams: !223, identifier: "6bc3fc24f38dc4e5b9c2e454106b93ec")
!812 = !{!813, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !811, file: !2, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !811, file: !2, baseType: !14, size: 64, align: 64, offset: 64)
!816 = !{!817}
!817 = !DILocalVariable(arg: 1, scope: !804, file: !742, line: 490, type: !807)
!818 = !{!819}
!819 = !DITemplateTypeParameter(name: "T", type: !808)
!820 = !DILocation(line: 490, column: 1, scope: !804)
!821 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17hb64ca4cb1df5f253E", scope: !743, file: !742, line: 490, type: !822, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !827, retainedNodes: !825)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !811, size: 64, align: 64, dwarfAddressSpace: 0)
!825 = !{!826}
!826 = !DILocalVariable(arg: 1, scope: !821, file: !742, line: 490, type: !824)
!827 = !{!828}
!828 = !DITemplateTypeParameter(name: "T", type: !811)
!829 = !DILocation(line: 490, column: 1, scope: !821)
!830 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null12runtime_impl17h060b0f0d87b84521E", scope: !832, file: !831, line: 37, type: !835, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !838)
!831 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ae0dfef55d0b113ecf8d41d1efcd51f")
!832 = !DINamespace(name: "is_null", scope: !833)
!833 = !DINamespace(name: "{impl#0}", scope: !834)
!834 = !DINamespace(name: "mut_ptr", scope: !743)
!835 = !DISubroutineType(types: !836)
!836 = !{!484, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!838 = !{!839}
!839 = !DILocalVariable(name: "ptr", arg: 1, scope: !830, file: !831, line: 37, type: !837)
!840 = !DILocation(line: 37, column: 25, scope: !830)
!841 = !DILocalVariable(name: "self", arg: 1, scope: !842, file: !831, line: 211, type: !837)
!842 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4addr17hf113e3684a569f12E", scope: !833, file: !831, line: 211, type: !843, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !218, retainedNodes: !845)
!843 = !DISubroutineType(types: !844)
!844 = !{!9, !837}
!845 = !{!841}
!846 = !DILocation(line: 211, column: 17, scope: !842, inlinedAt: !847)
!847 = distinct !DILocation(line: 38, column: 13, scope: !830)
!848 = !DILocalVariable(name: "self", arg: 1, scope: !849, file: !831, line: 59, type: !837)
!849 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17h7b5a1504465114beE", scope: !833, file: !831, line: 59, type: !850, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !854, retainedNodes: !853)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !837}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!853 = !{!848}
!854 = !{!91, !855}
!855 = !DITemplateTypeParameter(name: "U", type: !7)
!856 = !DILocation(line: 59, column: 26, scope: !849, inlinedAt: !857)
!857 = distinct !DILocation(line: 215, column: 33, scope: !842, inlinedAt: !847)
!858 = !DILocation(line: 215, column: 18, scope: !842, inlinedAt: !847)
!859 = !DILocation(line: 38, column: 13, scope: !830)
!860 = !DILocation(line: 39, column: 10, scope: !830)
!861 = distinct !DISubprogram(name: "is_null<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17h149e11cc1d876d2eE", scope: !833, file: !831, line: 35, type: !862, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !871)
!862 = !DISubroutineType(types: !863)
!863 = !{!484, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &dyn theo::traits::Testable", baseType: !865, size: 64, align: 64, dwarfAddressSpace: 0)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn theo::traits::Testable", file: !2, size: 128, align: 64, elements: !866, templateParams: !27, identifier: "ceafd93149e30aa21403b0ca817f335")
!866 = !{!867, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !865, file: !2, baseType: !868, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64, dwarfAddressSpace: 0)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn theo::traits::Testable", file: !2, align: 8, elements: !27, identifier: "2adc6c4abb60b760b0f6452968dedee1")
!870 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !865, file: !2, baseType: !355, size: 64, align: 64, offset: 64)
!871 = !{!872}
!872 = !DILocalVariable(name: "self", arg: 1, scope: !861, file: !831, line: 35, type: !864)
!873 = !{!874}
!874 = !DITemplateTypeParameter(name: "T", type: !865)
!875 = !DILocation(line: 35, column: 26, scope: !861)
!876 = !DILocation(line: 52, column: 36, scope: !861)
!877 = !DILocation(line: 52, column: 18, scope: !861)
!878 = !DILocation(line: 53, column: 6, scope: !861)
!879 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<uart_16550::port::SerialPort>>", linkageName: "_ZN4core3ptr80drop_in_place$LT$spin..mutex..MutexGuard$LT$uart_16550..port..SerialPort$GT$$GT$17h8035f1d7fb3e31e8E", scope: !743, file: !742, line: 490, type: !880, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !892, retainedNodes: !890)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<uart_16550::port::SerialPort>", baseType: !883, size: 64, align: 64, dwarfAddressSpace: 0)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<uart_16550::port::SerialPort>", scope: !199, file: !2, size: 128, align: 64, elements: !884, templateParams: !275, identifier: "c4599e03bdf4de54cb76dbbaf353eba")
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !883, file: !2, baseType: !886, size: 128, align: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<uart_16550::port::SerialPort>", scope: !203, file: !2, size: 128, align: 64, elements: !887, templateParams: !275, identifier: "7fa84ecf1c6ff9f5ddec80afda06fdc")
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !886, file: !2, baseType: !814, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !2, baseType: !64, size: 64, align: 64, offset: 64)
!890 = !{!891}
!891 = !DILocalVariable(arg: 1, scope: !879, file: !742, line: 490, type: !882)
!892 = !{!893}
!893 = !DITemplateTypeParameter(name: "T", type: !883)
!894 = !DILocation(line: 490, column: 1, scope: !879)
!895 = distinct !DISubprogram(name: "from_raw_parts<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17hce99a88ace42c424E", scope: !897, file: !896, line: 111, type: !898, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !901)
!896 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "1e1a461bde75de7a93357ca7e628f393")
!897 = !DINamespace(name: "metadata", scope: !743)
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !6, !7}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &dyn theo::traits::Testable", baseType: !865, size: 64, align: 64, dwarfAddressSpace: 0)
!901 = !{!902, !903}
!902 = !DILocalVariable(name: "data_address", arg: 1, scope: !895, file: !896, line: 112, type: !6)
!903 = !DILocalVariable(name: "metadata", arg: 2, scope: !895, file: !896, line: 113, type: !7)
!904 = !DILocation(line: 112, column: 5, scope: !895)
!905 = !DILocation(line: 113, column: 5, scope: !895)
!906 = !DILocation(line: 118, column: 36, scope: !895)
!907 = !DILocation(line: 118, column: 14, scope: !895)
!908 = !DILocation(line: 119, column: 2, scope: !895)
!909 = distinct !DISubprogram(name: "metadata<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr8metadata8metadata17h9911b99ab3e11579E", scope: !897, file: !896, line: 94, type: !910, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !900}
!912 = !{!913}
!913 = !DILocalVariable(name: "ptr", arg: 1, scope: !909, file: !896, line: 94, type: !900)
!914 = !DILocation(line: 94, column: 34, scope: !909)
!915 = !DILocation(line: 98, column: 14, scope: !909)
!916 = !DILocation(line: 99, column: 2, scope: !909)
!917 = distinct !DISubprogram(name: "new_unchecked<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17hb26e6873c30edf72E", scope: !919, file: !918, line: 197, type: !923, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !925)
!918 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "489a545a71841a1f316d99c11467aaa5")
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&dyn theo::traits::Testable>", scope: !920, file: !2, size: 64, align: 64, elements: !921, templateParams: !873, identifier: "b0e93edc28dd9538922deaf3e3d3df53")
!920 = !DINamespace(name: "non_null", scope: !743)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !919, file: !2, baseType: !900, size: 64, align: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!919, !864}
!925 = !{!926}
!926 = !DILocalVariable(name: "ptr", arg: 1, scope: !917, file: !918, line: 197, type: !864)
!927 = !DILocation(line: 197, column: 39, scope: !917)
!928 = !DILocation(line: 200, column: 13, scope: !917)
!929 = !DILocalVariable(name: "ptr", arg: 1, scope: !930, file: !931, line: 2218, type: !864)
!930 = distinct !DISubprogram(name: "runtime<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked7runtime17h94fd1b7f664cc7d9E", scope: !932, file: !931, line: 2218, type: !934, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !936)
!931 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "9636877b7f12d537541e2836c747da25")
!932 = !DINamespace(name: "new_unchecked", scope: !933)
!933 = !DINamespace(name: "{impl#3}", scope: !920)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !864}
!936 = !{!929}
!937 = !DILocation(line: 2218, column: 39, scope: !930, inlinedAt: !938)
!938 = distinct !DILocation(line: 200, column: 13, scope: !917)
!939 = !DILocation(line: 200, column: 134, scope: !940, inlinedAt: !938)
!940 = !DILexicalBlockFile(scope: !930, file: !918, discriminator: 0)
!941 = !DILocation(line: 200, column: 133, scope: !940, inlinedAt: !938)
!942 = !DILocation(line: 2219, column: 20, scope: !930, inlinedAt: !938)
!943 = !DILocation(line: 2221, column: 21, scope: !930, inlinedAt: !938)
!944 = !DILocation(line: 201, column: 13, scope: !917)
!945 = !DILocation(line: 203, column: 6, scope: !917)
!946 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<uart_16550::port::SerialPort>>", linkageName: "_ZN4core3ptr90drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$uart_16550..port..SerialPort$GT$$GT$17hbb38a74749d91498E", scope: !743, file: !742, line: 490, type: !947, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !952, retainedNodes: !950)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<uart_16550::port::SerialPort>", baseType: !886, size: 64, align: 64, dwarfAddressSpace: 0)
!950 = !{!951}
!951 = !DILocalVariable(arg: 1, scope: !946, file: !742, line: 490, type: !949)
!952 = !{!953}
!953 = !DITemplateTypeParameter(name: "T", type: !886)
!954 = !DILocation(line: 490, column: 1, scope: !946)
!955 = distinct !DISubprogram(name: "with_metadata_of<u8, &dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$16with_metadata_of17h1f76e4185672db95E", scope: !957, file: !956, line: 96, type: !959, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !965, retainedNodes: !962)
!956 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6cb3aa868e58a15d57a0da081c28bf30")
!957 = !DINamespace(name: "{impl#0}", scope: !958)
!958 = !DINamespace(name: "const_ptr", scope: !743)
!959 = !DISubroutineType(types: !960)
!960 = !{!900, !961, !900}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!962 = !{!963, !964}
!963 = !DILocalVariable(name: "self", arg: 1, scope: !955, file: !956, line: 96, type: !961)
!964 = !DILocalVariable(name: "meta", arg: 2, scope: !955, file: !956, line: 96, type: !900)
!965 = !{!91, !966}
!966 = !DITemplateTypeParameter(name: "U", type: !865)
!967 = !DILocation(line: 96, column: 38, scope: !955)
!968 = !DILocation(line: 96, column: 44, scope: !955)
!969 = !DILocation(line: 100, column: 48, scope: !955)
!970 = !DILocation(line: 100, column: 9, scope: !955)
!971 = !DILocation(line: 101, column: 6, scope: !955)
!972 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null12runtime_impl17hf99417e0a0155e45E", scope: !973, file: !956, line: 38, type: !974, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !976)
!973 = !DINamespace(name: "is_null", scope: !957)
!974 = !DISubroutineType(types: !975)
!975 = !{!484, !961}
!976 = !{!977}
!977 = !DILocalVariable(name: "ptr", arg: 1, scope: !972, file: !956, line: 38, type: !961)
!978 = !DILocation(line: 38, column: 25, scope: !972)
!979 = !DILocalVariable(name: "self", arg: 1, scope: !980, file: !956, line: 205, type: !961)
!980 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h5899f3e6d78d5b11E", scope: !957, file: !956, line: 205, type: !981, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !218, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{!9, !961}
!983 = !{!979}
!984 = !DILocation(line: 205, column: 17, scope: !980, inlinedAt: !985)
!985 = distinct !DILocation(line: 39, column: 13, scope: !972)
!986 = !DILocalVariable(name: "self", arg: 1, scope: !987, file: !956, line: 60, type: !961)
!987 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h64d4ff1034840b71E", scope: !957, file: !956, line: 60, type: !988, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !854, retainedNodes: !990)
!988 = !DISubroutineType(types: !989)
!989 = !{!6, !961}
!990 = !{!986}
!991 = !DILocation(line: 60, column: 26, scope: !987, inlinedAt: !992)
!992 = distinct !DILocation(line: 209, column: 33, scope: !980, inlinedAt: !985)
!993 = !DILocation(line: 209, column: 18, scope: !980, inlinedAt: !985)
!994 = !DILocation(line: 39, column: 13, scope: !972)
!995 = !DILocation(line: 40, column: 10, scope: !972)
!996 = distinct !DISubprogram(name: "is_null<&dyn theo::traits::Testable>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h2457a81cc80e521aE", scope: !957, file: !956, line: 36, type: !997, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !873, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!484, !900}
!999 = !{!1000}
!1000 = !DILocalVariable(name: "self", arg: 1, scope: !996, file: !956, line: 36, type: !900)
!1001 = !DILocation(line: 36, column: 26, scope: !996)
!1002 = !DILocation(line: 53, column: 36, scope: !996)
!1003 = !DILocation(line: 53, column: 18, scope: !996)
!1004 = !DILocation(line: 54, column: 6, scope: !996)
!1005 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17hb7e4b7a09d36452fE", scope: !1007, file: !1006, line: 197, type: !1009, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !289, templateParams: !27, retainedNodes: !1019)
