; ModuleID = 'crgf2ni748g49az'
source_filename = "crgf2ni748g49az"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !29, identifier: "a00285579fbbc59b5b979a7976db07b3")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::fmt::Arguments", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !15, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !17, templateParams: !29, identifier: "5c0bf663e13aed18b42e27881fea807c")
!15 = !DINamespace(name: "fmt", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18, !31, !84}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !14, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !20, templateParams: !29, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!20 = !{!21, !30}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !24, templateParams: !29, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !23, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !14, file: !2, baseType: !32, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "256519899e0672ceeaebd48b858206cf")
!33 = !DINamespace(name: "option", scope: !16)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !32, file: !2, size: 128, align: 64, elements: !36, templateParams: !29, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !83)
!36 = !{!37, !79}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !35, file: !2, baseType: !38, size: 128, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !39, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "T", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !42, templateParams: !29, identifier: "24318146e6c8bdc87822ff535a36a389")
!42 = !{!43, !78}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !41, file: !2, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !46, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !29, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!46 = !DINamespace(name: "rt", scope: !15)
!47 = !{!48, !49, !51, !58, !60, !77}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !45, file: !2, baseType: !50, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !45, file: !2, baseType: !52, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !46, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !2, baseType: !59, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !45, file: !2, baseType: !61, size: 128, align: 64, flags: DIFlagPublic)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !62, templateParams: !29, identifier: "96b697dd48c62362a4fdd24d145e624f")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_variant_part, scope: !61, file: !2, size: 128, align: 64, elements: !64, templateParams: !29, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !75)
!64 = !{!65, !69, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !63, file: !2, baseType: !66, size: 128, align: 64, extraData: i128 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !29, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !63, file: !2, baseType: !70, size: 128, align: 64, extraData: i128 1)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !29, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !63, file: !2, baseType: !74, size: 128, align: 64, extraData: i128 2)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "a1add839f51aefefecdce3df6110b61f")
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!76 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !45, file: !2, baseType: !61, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !35, file: !2, baseType: !80, size: 128, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !39, identifier: "f965b304662f282235bb5dc25f3fae0f")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !2, baseType: !41, size: 128, align: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !32, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !2, baseType: !85, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !86, templateParams: !29, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!86 = !{!87, !149}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !2, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !90, templateParams: !29, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !89, file: !2, baseType: !92, size: 64, align: 64, flags: DIFlagPrivate)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !94, file: !2, align: 8, elements: !29, identifier: "fffd88202d364d3dc6423c86977eda88")
!94 = !DINamespace(name: "{extern#0}", scope: !46)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !89, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !92, !117}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !100, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !101, templateParams: !29, identifier: "27f960845886d02861ac4e7842c7e3a5")
!100 = !DINamespace(name: "result", scope: !16)
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_variant_part, scope: !99, file: !2, size: 8, align: 8, elements: !103, templateParams: !29, identifier: "66d489f599415104a0443264f219183e", discriminator: !116)
!103 = !{!104, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !102, file: !2, baseType: !105, size: 8, align: 8, extraData: i128 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !106, templateParams: !108, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "T", type: !7)
!110 = !DITemplateTypeParameter(name: "E", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !15, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !102, file: !2, baseType: !113, size: 8, align: 8, extraData: i128 1)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !114, templateParams: !108, identifier: "c5badd8093158a69d1e378abd358f888")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !2, baseType: !111, align: 8, offset: 8, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagArtificial)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !15, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !119, templateParams: !29, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!119 = !{!120, !121, !122, !123, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !2, baseType: !59, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !2, baseType: !50, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !52, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !118, file: !2, baseType: !124, size: 128, align: 64, flags: DIFlagPrivate)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !125, templateParams: !29, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !124, file: !2, size: 128, align: 64, elements: !127, templateParams: !29, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !136)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i128 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !130, identifier: "ae81ebe2a9866af8df117bed47adaee")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !9)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !133, size: 128, align: 64, extraData: i128 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !134, templateParams: !130, identifier: "a581ef88bb755022340fa98600955727")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !118, file: !2, baseType: !124, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !2, baseType: !139, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !140, templateParams: !29, identifier: "6607f9b055c62ce71a6a286c8014df9")
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !2, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !29, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !139, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3, lowerBound: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !153, vtableHolder: !23, templateParams: !29, identifier: "ed154bdd413ffeab42f0e27636dee894")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !152, file: !2, baseType: !6, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !152, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !161, vtableHolder: !59, templateParams: !29, identifier: "f85b3e45771706a9e9b43b40364b7716")
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !160, file: !2, baseType: !6, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !160, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !169, vtableHolder: !174, templateParams: !29, identifier: "3ce38d829cd8edca542b8021bf4ac8d1")
!169 = !{!170, !171, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !168, file: !2, baseType: !6, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !168, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !178, vtableHolder: !183, templateParams: !29, identifier: "553928fbc6925353ab616833209efccb")
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !177, file: !2, baseType: !6, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !177, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !184, templateParams: !29, identifier: "26d43a9b6d12b117751598b186fa5617")
!184 = !{!185, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !183, file: !2, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "e5b3057f7b10b8c52014a7991b8218cd")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !183, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !192, vtableHolder: !197, templateParams: !29, identifier: "bf0dbdf65223d98060cccd1045680e1c")
!192 = !{!193, !194, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !191, file: !2, baseType: !6, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !191, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !198, templateParams: !29, identifier: "b69fcac78aacc390de3151c1212a43c9")
!198 = !{!199}
!199 = !DICompositeType(tag: DW_TAG_variant_part, scope: !197, file: !2, size: 64, align: 64, elements: !200, templateParams: !29, identifier: "eb1fcac313ca09c387d2b4b3f7cfa24f", discriminator: !209)
!200 = !{!201, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !199, file: !2, baseType: !202, size: 64, align: 64, extraData: i128 0)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !203, identifier: "c814ef4e231fea575b667cbe44c9b49")
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !13)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !199, file: !2, baseType: !206, size: 64, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !207, templateParams: !203, identifier: "5a2547bb3159b3da1b809eabd7ff0377")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !13, size: 64, align: 64, flags: DIFlagPublic)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !213, vtableHolder: !218, templateParams: !29, identifier: "14704c63251a2906dbd0b528a495269")
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !212, file: !2, baseType: !6, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !212, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !222, templateParams: !29, identifier: "a313c32de3a8c9bc539767ad1b1d23fa")
!220 = !DINamespace(name: "location", scope: !221)
!221 = !DINamespace(name: "panic", scope: !16)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !219, file: !2, baseType: !23, size: 128, align: 64, flags: DIFlagPrivate)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !229, vtableHolder: !234, templateParams: !29, identifier: "ad33a4b560891dcb9ee705ba28e17c27")
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !228, file: !2, baseType: !6, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !228, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!234 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !238, vtableHolder: !243, templateParams: !29, identifier: "eb383e1e2cdd0e7e41dfd1a0d381e57d")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !237, file: !2, baseType: !6, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !237, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "<vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "<vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !247, vtableHolder: !254, templateParams: !29, identifier: "761b2d764ccd3b5b9044a6b6c7ac6329")
!247 = !{!248, !249, !250, !251, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !246, file: !2, baseType: !6, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !255, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !256, templateParams: !29, identifier: "b0f29b4e731de200748a96c419b2014b")
!255 = !DINamespace(name: "vga", scope: null)
!256 = !{!257, !258, !266, !267, !285, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !254, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !254, file: !2, baseType: !259, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !260, templateParams: !29, identifier: "55c28ff37ad9e165233727d34ead0b72")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !259, file: !2, baseType: !262, size: 128, align: 64, flags: DIFlagPrivate)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !263, templateParams: !29, identifier: "d3caead7bce18958151699ca4bdc5246")
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !262, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !254, file: !2, baseType: !262, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !2, baseType: !268, size: 64, align: 64, flags: DIFlagPrivate)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !269, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !255, file: !2, size: 32000, align: 8, flags: DIFlagPrivate, elements: !270, templateParams: !29, identifier: "e6b677ce8937020c51adb0c996194102")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !269, file: !2, baseType: !272, size: 32000, align: 8, flags: DIFlagPrivate)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 32000, align: 8, elements: !283)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1280, align: 8, elements: !281)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !255, file: !2, size: 16, align: 8, flags: DIFlagPrivate, elements: !275, templateParams: !29, identifier: "222e81c2b39a79fb6c2702a5fabe9a27")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !274, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !274, file: !2, baseType: !278, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !255, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !279, templateParams: !29, identifier: "63816b86c1e17f936d69e131ef35e859")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !278, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!281 = !{!282}
!282 = !DISubrange(count: 80, lowerBound: 0)
!283 = !{!284}
!284 = !DISubrange(count: 25, lowerBound: 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !254, file: !2, baseType: !286, size: 8, align: 8, offset: 1664, flags: DIFlagPrivate)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !255, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !254, file: !2, baseType: !273, size: 1280, align: 8, offset: 384, flags: DIFlagPrivate)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "BOOTLOADER_CONFIG", linkageName: "_ZN4theo17BOOTLOADER_CONFIG17h0f14ec80208461abE", scope: !293, file: !294, line: 23, type: !295, isLocal: true, isDefinition: true, align: 64)
!293 = !DINamespace(name: "theo", scope: null)
!294 = !DIFile(filename: "src/main.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "157f7b92bafef89c9df2d38654d60c97")
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "BootloaderConfig", scope: !296, file: !2, size: 1472, align: 64, flags: DIFlagPublic, elements: !298, templateParams: !29, identifier: "e1d2124ffd2a9da3f2803cdb3e913a8")
!296 = !DINamespace(name: "config", scope: !297)
!297 = !DINamespace(name: "bootloader_api", scope: null)
!298 = !{!299, !307, !356, !357}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !295, file: !2, baseType: !300, size: 64, align: 16, offset: 1344, flags: DIFlagProtected)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "ApiVersion", scope: !296, file: !2, size: 64, align: 16, flags: DIFlagPublic, elements: !301, templateParams: !29, identifier: "d1071f3d17a12b8b4cf428493c082ddb")
!301 = !{!302, !304, !305, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !300, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!303 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !300, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "version_patch", scope: !300, file: !2, baseType: !303, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pre_release", scope: !300, file: !2, baseType: !234, size: 8, align: 8, offset: 48, flags: DIFlagPrivate)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !295, file: !2, baseType: !308, size: 1088, align: 64, flags: DIFlagPublic)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mappings", scope: !296, file: !2, size: 1088, align: 64, flags: DIFlagPublic, elements: !309, templateParams: !29, identifier: "c1be888176bdea36159ead97449117da")
!309 = !{!310, !322, !323, !324, !338, !339, !340, !354, !355}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack", scope: !308, file: !2, baseType: !311, size: 128, align: 64, flags: DIFlagPublic)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mapping", scope: !296, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !312, templateParams: !29, identifier: "603df5d4b92f8b6d7d7332540b323ad6")
!312 = !{!313}
!313 = !DICompositeType(tag: DW_TAG_variant_part, scope: !311, file: !2, size: 128, align: 64, elements: !314, templateParams: !29, identifier: "952b06d52f6656e963f6eb1cbd4538b", discriminator: !321)
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Dynamic", scope: !313, file: !2, baseType: !316, size: 128, align: 64, extraData: i128 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dynamic", scope: !311, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "d0c3e9ecb589265736d80456957eceab")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "FixedAddress", scope: !313, file: !2, baseType: !318, size: 128, align: 64, extraData: i128 1)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedAddress", scope: !311, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !319, templateParams: !29, identifier: "5680c18a49d07ababe811e258f74c10c")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !318, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!321 = !DIDerivedType(tag: DW_TAG_member, scope: !311, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !308, file: !2, baseType: !311, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "framebuffer", scope: !308, file: !2, baseType: !311, size: 128, align: 64, offset: 256, flags: DIFlagPublic)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "physical_memory", scope: !308, file: !2, baseType: !325, size: 128, align: 64, offset: 768, flags: DIFlagPublic)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bootloader_api::config::Mapping>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !326, templateParams: !29, identifier: "e866f088af3379dcaa381ba8ebcf4bd")
!326 = !{!327}
!327 = !DICompositeType(tag: DW_TAG_variant_part, scope: !325, file: !2, size: 128, align: 64, elements: !328, templateParams: !29, identifier: "5f44b9be3a73a97c1caac64f22406e7", discriminator: !337)
!328 = !{!329, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !327, file: !2, baseType: !330, size: 128, align: 64, extraData: i128 2)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !325, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !331, identifier: "4c05c4cab9fdc18aa271121a3cfbe73a")
!331 = !{!332}
!332 = !DITemplateTypeParameter(name: "T", type: !311)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !327, file: !2, baseType: !334, size: 128, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !325, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !335, templateParams: !331, identifier: "ae5e612e98bb3c93441530a7a76a6a7a")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !2, baseType: !311, size: 128, align: 64, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_recursive", scope: !308, file: !2, baseType: !325, size: 128, align: 64, offset: 896, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "aslr", scope: !308, file: !2, baseType: !234, size: 8, align: 8, offset: 1024, flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_start", scope: !308, file: !2, baseType: !341, size: 128, align: 64, offset: 384, flags: DIFlagPublic)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !342, templateParams: !29, identifier: "6f1696d18d23d47c69b222f2f35e16b5")
!342 = !{!343}
!343 = !DICompositeType(tag: DW_TAG_variant_part, scope: !341, file: !2, size: 128, align: 64, elements: !344, templateParams: !29, identifier: "73e7139f007f4e6023be7ef6d253e356", discriminator: !353)
!344 = !{!345, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !343, file: !2, baseType: !346, size: 128, align: 64, extraData: i128 0)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !347, identifier: "e506bb47389de31fa5a35e49f43ba94d")
!347 = !{!348}
!348 = !DITemplateTypeParameter(name: "T", type: !76)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !343, file: !2, baseType: !350, size: 128, align: 64, extraData: i128 1)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !351, templateParams: !347, identifier: "7e2f1f2d455f3cb646237311fb922a41")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !350, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!353 = !DIDerivedType(tag: DW_TAG_member, scope: !341, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_end", scope: !308, file: !2, baseType: !341, size: 128, align: 64, offset: 512, flags: DIFlagPublic)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ramdisk_memory", scope: !308, file: !2, baseType: !311, size: 128, align: 64, offset: 640, flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack_size", scope: !295, file: !2, baseType: !76, size: 64, align: 64, offset: 1408, flags: DIFlagPublic)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "frame_buffer", scope: !295, file: !2, baseType: !358, size: 256, align: 64, offset: 1088, flags: DIFlagPublic)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", scope: !296, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !359, templateParams: !29, identifier: "9c286d074499f3609ad655be57422f52")
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_height", scope: !358, file: !2, baseType: !341, size: 128, align: 64, flags: DIFlagPublic)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_width", scope: !358, file: !2, baseType: !341, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17h887e6378c73b0630E", scope: !364, file: !365, line: 161, type: !366, isLocal: true, isDefinition: true, align: 8)
!364 = !DINamespace(name: "interrupts", scope: !293)
!365 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !364, file: !2, align: 8, flags: DIFlagPrivate, elements: !367, templateParams: !29, identifier: "780f1d35228b7e6a7406cbeb522f7e48")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !366, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17he25d62281299a8b9E", scope: !371, file: !374, line: 29, type: !375, isLocal: true, isDefinition: true, align: 128)
!371 = !DINamespace(name: "__stability", scope: !372)
!372 = !DINamespace(name: "deref", scope: !373)
!373 = !DINamespace(name: "{impl#0}", scope: !364)
!374 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !376, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !378, templateParams: !404, identifier: "75b2a153b241725a5a0bf908eb81153a")
!376 = !DINamespace(name: "lazy", scope: !377)
!377 = !DINamespace(name: "lazy_static", scope: null)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !375, file: !2, baseType: !380, size: 33024, align: 128, flags: DIFlagPrivate)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !381, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !383, templateParams: !404, identifier: "a691d7dff4b3ff8f9b48680a471e73a1")
!381 = !DINamespace(name: "once", scope: !382)
!382 = !DINamespace(name: "spin", scope: null)
!383 = !{!384, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !2, baseType: !385, size: 64, align: 64, offset: 32896, flags: DIFlagPrivate)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !386, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !388, templateParams: !29, identifier: "8af730207cd32b025ecf7ee7343d73a2")
!386 = !DINamespace(name: "atomic", scope: !387)
!387 = !DINamespace(name: "sync", scope: !16)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !385, file: !2, baseType: !390, size: 64, align: 64, flags: DIFlagPrivate)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !391, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !392, templateParams: !130, identifier: "84d58981b30d111f1b59e7c4c4da7d09")
!391 = !DINamespace(name: "cell", scope: !16)
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !390, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !2, baseType: !395, size: 32896, align: 128, flags: DIFlagPrivate)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !391, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !396, templateParams: !563, identifier: "ca6f1122c7650659e71b9c2f032eb243")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !395, file: !2, baseType: !398, size: 32896, align: 128, flags: DIFlagPrivate)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !33, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !399, templateParams: !29, identifier: "354b0645d27ff40dff8fc02c230a9b1")
!399 = !{!400}
!400 = !DICompositeType(tag: DW_TAG_variant_part, scope: !398, file: !2, size: 32896, align: 128, elements: !401, templateParams: !29, identifier: "a467e06d4da6e5f3fc886aea70cef603", discriminator: !562)
!401 = !{!402, !558}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !400, file: !2, baseType: !403, size: 32896, align: 128, extraData: i128 2)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !398, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !29, templateParams: !404, identifier: "3b2296ebc9aa7fac6a09d557b9dc7028")
!404 = !{!405}
!405 = !DITemplateTypeParameter(name: "T", type: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !407, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !409, templateParams: !29, identifier: "91d5636955a289641f4c1204d1806efa")
!407 = !DINamespace(name: "interrupt_descriptor_table", scope: !408)
!408 = !DINamespace(name: "cpu_interrupts", scope: null)
!409 = !{!410, !555, !556, !557}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !406, file: !2, baseType: !411, size: 32768, align: 128, flags: DIFlagPrivate)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !412, file: !2, size: 32768, align: 128, flags: DIFlagPublic, elements: !415, templateParams: !29, identifier: "b390c7729da8230dab9ef897adf3b7ab")
!412 = !DINamespace(name: "idt", scope: !413)
!413 = !DINamespace(name: "structures", scope: !414)
!414 = !DINamespace(name: "x86_64", scope: null)
!415 = !{!416, !452, !453, !454, !455, !456, !457, !458, !459, !478, !479, !497, !498, !499, !500, !521, !522, !523, !524, !542, !543, !544, !548, !549, !550, !551}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !411, file: !2, baseType: !417, size: 128, align: 32, flags: DIFlagPublic)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !412, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !418, templateParams: !450, identifier: "7d69ff47a6aee51238b84f1843d814d0")
!418 = !{!419, !420, !421, !425, !426, !427, !428}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !417, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !417, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !417, file: !2, baseType: !422, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !412, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !423, templateParams: !29, identifier: "8f45d1028d32c5aa451bf13b17c6a918")
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !422, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !417, file: !2, baseType: !303, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !417, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !417, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !417, file: !2, baseType: !429, align: 8, offset: 128, flags: DIFlagPrivate)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !431, identifier: "cec9c03a86d186c45f8c8371eadd9b69")
!430 = !DINamespace(name: "marker", scope: !16)
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "T", type: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !434, size: 64, align: 64, dwarfAddressSpace: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !436}
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !412, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !437, templateParams: !29, identifier: "8b23b7905e012bfb81ef897593cb8bb")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !436, file: !2, baseType: !439, size: 320, align: 64, flags: DIFlagPrivate)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !412, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !440, templateParams: !29, identifier: "fb943ac64aa7be6a1cf16aaaf2128de7")
!440 = !{!441, !446, !447, !448, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !439, file: !2, baseType: !442, size: 64, align: 64, flags: DIFlagPublic)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !443, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !444, templateParams: !29, identifier: "e2f5a87bae0862b07d53d947247abc30")
!443 = !DINamespace(name: "addr", scope: !414)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !442, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !439, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !439, file: !2, baseType: !76, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !439, file: !2, baseType: !442, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !439, file: !2, baseType: !76, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!450 = !{!451}
!451 = !DITemplateTypeParameter(name: "F", type: !433)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 128, flags: DIFlagPublic)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 256, flags: DIFlagPublic)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 384, flags: DIFlagPublic)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 512, flags: DIFlagPublic)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 640, flags: DIFlagPublic)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 768, flags: DIFlagPublic)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 896, flags: DIFlagPublic)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !411, file: !2, baseType: !460, size: 128, align: 32, offset: 1024, flags: DIFlagPublic)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !412, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !461, templateParams: !476, identifier: "4136fad39c91162061ac0c1719de1991")
!461 = !{!462, !463, !464, !465, !466, !467, !468}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !460, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !460, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !460, file: !2, baseType: !422, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !460, file: !2, baseType: !303, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !460, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !460, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !460, file: !2, baseType: !469, align: 8, offset: 128, flags: DIFlagPrivate)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !470, identifier: "68c857415b547acb5d8ceb44842319b7")
!470 = !{!471}
!471 = !DITemplateTypeParameter(name: "T", type: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !473, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!475, !436, !76}
!475 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!476 = !{!477}
!477 = !DITemplateTypeParameter(name: "F", type: !472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 1152, flags: DIFlagPrivate)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 1280, flags: DIFlagPublic)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !412, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !481, templateParams: !495, identifier: "9957fff5581b78b12838df0b921b0d62")
!481 = !{!482, !483, !484, !485, !486, !487, !488}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !480, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !480, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !480, file: !2, baseType: !422, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !480, file: !2, baseType: !303, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !480, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !480, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !480, file: !2, baseType: !489, align: 8, offset: 128, flags: DIFlagPrivate)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !490, identifier: "4517952076a9a090a9c576f35ab9ff4")
!490 = !{!491}
!491 = !DITemplateTypeParameter(name: "T", type: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !493, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !436, !76}
!495 = !{!496}
!496 = !DITemplateTypeParameter(name: "F", type: !492)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 1408, flags: DIFlagPublic)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 1536, flags: DIFlagPublic)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 1664, flags: DIFlagPublic)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !411, file: !2, baseType: !501, size: 128, align: 32, offset: 1792, flags: DIFlagPublic)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !412, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !502, templateParams: !519, identifier: "a5e3fde7dfb99bbf978c4079136181f5")
!502 = !{!503, !504, !505, !506, !507, !508, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !501, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !501, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !501, file: !2, baseType: !422, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !501, file: !2, baseType: !303, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !501, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !501, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !501, file: !2, baseType: !510, align: 8, offset: 128, flags: DIFlagPrivate)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !511, identifier: "fa04cee00e5f5d152dcdca0dc5cbbc7d")
!511 = !{!512}
!512 = !DITemplateTypeParameter(name: "T", type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !514, size: 64, align: 64, dwarfAddressSpace: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !436, !516}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !412, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !517, templateParams: !29, identifier: "f2efc38f5359375da910df8fb1c92566")
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !516, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!519 = !{!520}
!520 = !DITemplateTypeParameter(name: "F", type: !513)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 1920, flags: DIFlagPrivate)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 2048, flags: DIFlagPublic)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 2176, flags: DIFlagPublic)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !411, file: !2, baseType: !525, size: 128, align: 32, offset: 2304, flags: DIFlagPublic)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !412, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !526, templateParams: !540, identifier: "fae063fcf5d63148a1fb7bd90167e67f")
!526 = !{!527, !528, !529, !530, !531, !532, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !525, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !525, file: !2, baseType: !303, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !525, file: !2, baseType: !422, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !525, file: !2, baseType: !303, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !525, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !525, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !525, file: !2, baseType: !534, align: 8, offset: 128, flags: DIFlagPrivate)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !535, identifier: "bc7371bbb6c4c3aa0fc13b06a57bc7")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !538, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!475, !436}
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "F", type: !537)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 2432, flags: DIFlagPublic)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 2560, flags: DIFlagPublic)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !411, file: !2, baseType: !545, size: 1024, align: 32, offset: 2688, flags: DIFlagPrivate)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 1024, align: 32, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 8, lowerBound: 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 3712, flags: DIFlagPublic)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !411, file: !2, baseType: !480, size: 128, align: 32, offset: 3840, flags: DIFlagPublic)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !411, file: !2, baseType: !417, size: 128, align: 32, offset: 3968, flags: DIFlagPrivate)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !411, file: !2, baseType: !552, size: 28672, align: 32, offset: 4096, flags: DIFlagPrivate)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 28672, align: 32, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 224, lowerBound: 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !406, file: !2, baseType: !234, size: 8, align: 8, offset: 32768, flags: DIFlagPrivate)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !406, file: !2, baseType: !234, size: 8, align: 8, offset: 32776, flags: DIFlagPrivate)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !406, file: !2, baseType: !234, size: 8, align: 8, offset: 32784, flags: DIFlagPrivate)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !400, file: !2, baseType: !559, size: 32896, align: 128)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !398, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !560, templateParams: !404, identifier: "d9101b717d93cde3fbd4631744fc6204")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !559, file: !2, baseType: !406, size: 32896, align: 128, flags: DIFlagPublic)
!562 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !2, baseType: !27, size: 8, align: 8, offset: 32784, flags: DIFlagArtificial)
!563 = !{!564}
!564 = !DITemplateTypeParameter(name: "T", type: !398)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17h64859bee50444d1eE", scope: !567, file: !365, line: 161, type: !568, isLocal: true, isDefinition: true, align: 8)
!567 = !DINamespace(name: "peripherals", scope: !293)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !567, file: !2, align: 8, flags: DIFlagPublic, elements: !569, templateParams: !29, identifier: "cd1a9f231d3062b996a1fd2456d0bcc7")
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !568, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h9ecc2e2e165e09d7E", scope: !573, file: !374, line: 29, type: !576, isLocal: true, isDefinition: true, align: 64)
!573 = !DINamespace(name: "__stability", scope: !574)
!574 = !DINamespace(name: "deref", scope: !575)
!575 = !DINamespace(name: "{impl#0}", scope: !567)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !376, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !577, templateParams: !592, identifier: "68990e07b879a12092edb114ab5b22ba")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !576, file: !2, baseType: !579, size: 1920, align: 64, flags: DIFlagPrivate)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !381, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !580, templateParams: !592, identifier: "5327ae29e64ec51d9ad08d941303c453")
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !579, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagPrivate)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !579, file: !2, baseType: !583, size: 1856, align: 64, offset: 64, flags: DIFlagPrivate)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !391, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !584, templateParams: !629, identifier: "f0a5b886bd1dc2a08b0c506a82f8f614")
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !583, file: !2, baseType: !586, size: 1856, align: 64, flags: DIFlagPrivate)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !33, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !587, templateParams: !29, identifier: "2eee223f61ac0dc870e6b26317f59c72")
!587 = !{!588}
!588 = !DICompositeType(tag: DW_TAG_variant_part, scope: !586, file: !2, size: 1856, align: 64, elements: !589, templateParams: !29, identifier: "6059d918d8074f8eaaad2d9931a9b608", discriminator: !628)
!589 = !{!590, !624}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !588, file: !2, baseType: !591, size: 1856, align: 64, extraData: i128 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !586, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !592, identifier: "ed7087efdd62ac4ace15329883aae2c0")
!592 = !{!593}
!593 = !DITemplateTypeParameter(name: "T", type: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !595, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !596, templateParams: !622, identifier: "6131ad82e168e59be6a79233f536752")
!595 = !DINamespace(name: "mutex", scope: !382)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !594, file: !2, baseType: !598, size: 1792, align: 64, flags: DIFlagPrivate)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !599, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !600, templateParams: !622, identifier: "8ff1cf9282c461f05e1d64de4d147bbb")
!599 = !DINamespace(name: "spin", scope: !595)
!600 = !{!601, !607, !616}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !598, file: !2, baseType: !602, align: 8, flags: DIFlagPrivate)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !603, identifier: "53842080da807efe2f66a57cfa1dc2b2")
!603 = !{!604}
!604 = !DITemplateTypeParameter(name: "T", type: !605)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !606, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "5c2b14cd1865fd0d8746459878c1381f")
!606 = !DINamespace(name: "relax", scope: !382)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !598, file: !2, baseType: !608, size: 8, align: 8, flags: DIFlagProtected)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !386, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !609, templateParams: !29, identifier: "e51bf8fd8b9e62c7945e950556c29af3")
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !608, file: !2, baseType: !611, size: 8, align: 8, flags: DIFlagPrivate)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !391, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !612, templateParams: !614, identifier: "8c2d30510cc7853b3fcfadd821ad3c4")
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !611, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!614 = !{!615}
!615 = !DITemplateTypeParameter(name: "T", type: !27)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !2, baseType: !617, size: 1728, align: 64, offset: 64, flags: DIFlagPrivate)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !391, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !618, templateParams: !620, identifier: "21d30a8a16882960dfd5e0a673e1ad37")
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !617, file: !2, baseType: !254, size: 1728, align: 64, flags: DIFlagPrivate)
!620 = !{!621}
!621 = !DITemplateTypeParameter(name: "T", type: !254)
!622 = !{!621, !623}
!623 = !DITemplateTypeParameter(name: "R", type: !605)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !588, file: !2, baseType: !625, size: 1856, align: 64, extraData: i128 1)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !586, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !626, templateParams: !592, identifier: "369bf12582a11a538cc7474b4654e14d")
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !625, file: !2, baseType: !594, size: 1792, align: 64, offset: 64, flags: DIFlagPublic)
!628 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!629 = !{!630}
!630 = !DITemplateTypeParameter(name: "T", type: !586)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "KEYBOARD", linkageName: "_ZN4theo11peripherals8KEYBOARD17h46e9a5597707b9f5E", scope: !567, file: !365, line: 161, type: !633, isLocal: true, isDefinition: true, align: 8)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "KEYBOARD", scope: !567, file: !2, align: 8, flags: DIFlagPublic, elements: !634, templateParams: !29, identifier: "870436d7f8bb4891331d868440a806")
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !633, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN71_$LT$theo..peripherals..KEYBOARD$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17haeec45cf8709e56fE", scope: !638, file: !374, line: 29, type: !641, isLocal: true, isDefinition: true, align: 64)
!638 = !DINamespace(name: "__stability", scope: !639)
!639 = !DINamespace(name: "deref", scope: !640)
!640 = !DINamespace(name: "{impl#2}", scope: !567)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !376, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !642, templateParams: !657, identifier: "d399d471aab8a1c592f76e80b12d5a02")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !641, file: !2, baseType: !644, size: 256, align: 64, flags: DIFlagPrivate)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !381, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !645, templateParams: !657, identifier: "8d89d3c41f4a14986f8b54e0297a1fc3")
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !644, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagPrivate)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !2, baseType: !648, size: 160, align: 16, offset: 64, flags: DIFlagPrivate)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>>", scope: !391, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !649, templateParams: !750, identifier: "94494947220a25c39e402e5f3b1388d")
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !648, file: !2, baseType: !651, size: 160, align: 16, flags: DIFlagPrivate)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !33, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !652, templateParams: !29, identifier: "b562e4a3f6e66cf9d596512209a82aef")
!652 = !{!653}
!653 = !DICompositeType(tag: DW_TAG_variant_part, scope: !651, file: !2, size: 160, align: 16, elements: !654, templateParams: !29, identifier: "3c7a2ac68042ec94e63570d603060cc2", discriminator: !749)
!654 = !{!655, !745}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !653, file: !2, baseType: !656, size: 160, align: 16, extraData: i128 0)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !651, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !657, identifier: "51e6c61441289d4561b0bbf04a3770f")
!657 = !{!658}
!658 = !DITemplateTypeParameter(name: "T", type: !659)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !595, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !660, templateParams: !744, identifier: "7b1354053001aeb6df57f48dd0d09f9e")
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !659, file: !2, baseType: !662, size: 144, align: 16, flags: DIFlagPrivate)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !599, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !663, templateParams: !744, identifier: "156301b46d662d36da3d92da3909cfb0")
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !662, file: !2, baseType: !602, align: 8, flags: DIFlagPrivate)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !662, file: !2, baseType: !608, size: 8, align: 8, flags: DIFlagProtected)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !662, file: !2, baseType: !667, size: 128, align: 16, offset: 16, flags: DIFlagPrivate)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>>", scope: !391, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !668, templateParams: !742, identifier: "eb0faad7a939d8bc8f140e2fb4557371")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !2, baseType: !670, size: 128, align: 16, flags: DIFlagPrivate)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !671, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !672, templateParams: !721, identifier: "11e732a97794238dd013a7ef2d8bd681")
!671 = !DINamespace(name: "keyboard", scope: null)
!672 = !{!673, !723}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !670, file: !2, baseType: !674, size: 112, align: 16, flags: DIFlagPrivate)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !675, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !676, templateParams: !721, identifier: "abf251e657e54cf5e8b002c9ff21b1e")
!675 = !DINamespace(name: "pc_keyboard", scope: null)
!676 = !{!677, !682, !696}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ps2_decoder", scope: !674, file: !2, baseType: !678, size: 32, align: 16, flags: DIFlagPrivate)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ps2Decoder", scope: !675, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !679, templateParams: !29, identifier: "d85924e431171d18eba68bbe61c0d")
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !678, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !678, file: !2, baseType: !27, size: 8, align: 8, offset: 16, flags: DIFlagPrivate)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "scancode_set", scope: !674, file: !2, baseType: !683, size: 8, align: 8, offset: 104, flags: DIFlagPrivate)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScancodeSet1", scope: !684, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !686, templateParams: !29, identifier: "e3fd471ede10693cde7430641b890c7e")
!684 = !DINamespace(name: "set1", scope: !685)
!685 = !DINamespace(name: "scancodes", scope: !675)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !683, file: !2, baseType: !688, size: 8, align: 8, flags: DIFlagPrivate)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !675, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695}
!690 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!691 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!692 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!693 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!694 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!695 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "event_decoder", scope: !674, file: !2, baseType: !697, size: 72, align: 8, offset: 32, flags: DIFlagPrivate)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventDecoder<pc_keyboard::layouts::us104::Us104Key>", scope: !675, file: !2, size: 72, align: 8, flags: DIFlagPublic, elements: !698, templateParams: !719, identifier: "b80c6890a7cf541d26a657e8c458e255")
!698 = !{!699, !704, !715}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handle_ctrl", scope: !697, file: !2, baseType: !700, size: 8, align: 8, flags: DIFlagPrivate)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !675, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !701)
!701 = !{!702, !703}
!702 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!703 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !697, file: !2, baseType: !705, size: 64, align: 8, offset: 8, flags: DIFlagPrivate)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !675, file: !2, size: 64, align: 8, flags: DIFlagPublic, elements: !706, templateParams: !29, identifier: "77eac88685bbad97631348bca770dfae")
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !705, file: !2, baseType: !234, size: 8, align: 8, flags: DIFlagPublic)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 16, flags: DIFlagPublic)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 24, flags: DIFlagPublic)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 48, flags: DIFlagPublic)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !705, file: !2, baseType: !234, size: 8, align: 8, offset: 56, flags: DIFlagPublic)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !697, file: !2, baseType: !716, align: 8, offset: 72, flags: DIFlagPrivate)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !717, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "95bafa42dce54244279674cd130c65fd")
!717 = !DINamespace(name: "us104", scope: !718)
!718 = !DINamespace(name: "layouts", scope: !675)
!719 = !{!720}
!720 = !DITemplateTypeParameter(name: "L", type: !716)
!721 = !{!720, !722}
!722 = !DITemplateTypeParameter(name: "S", type: !683)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !670, file: !2, baseType: !724, size: 16, align: 16, offset: 112, flags: DIFlagPrivate)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !725, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !727, templateParams: !740, identifier: "582de59b7758960a4fc1f2fde452c5f5")
!725 = !DINamespace(name: "port", scope: !726)
!726 = !DINamespace(name: "instructions", scope: !414)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !724, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !724, file: !2, baseType: !730, align: 8, offset: 16, flags: DIFlagPrivate)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !731, identifier: "e01e6f45252ac9ed118fe1f3a7ae33e1")
!731 = !{!732}
!732 = !DITemplateTypeParameter(name: "T", type: !733)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !734, templateParams: !29, identifier: "f1936dd1b81bd591b65cfc62296d865d")
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !733, file: !2, baseType: !27, size: 8, align: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !733, file: !2, baseType: !737, align: 8, offset: 8)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !725, file: !2, align: 8, flags: DIFlagPublic, elements: !738, templateParams: !29, identifier: "b89315aa149aed7bb45d1f2b7ae4eb33")
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !737, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!740 = !{!615, !741}
!741 = !DITemplateTypeParameter(name: "A", type: !737)
!742 = !{!743}
!743 = !DITemplateTypeParameter(name: "T", type: !670)
!744 = !{!743, !623}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !653, file: !2, baseType: !746, size: 160, align: 16, extraData: i128 1)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !651, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !747, templateParams: !657, identifier: "13eec173c6ca5a6d5076ed95a9392b")
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !746, file: !2, baseType: !659, size: 144, align: 16, offset: 16, flags: DIFlagPublic)
!749 = !DIDerivedType(tag: DW_TAG_member, scope: !651, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagArtificial)
!750 = !{!751}
!751 = !DITemplateTypeParameter(name: "T", type: !651)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h66752a81b8d49ed3E", scope: !754, file: !365, line: 161, type: !755, isLocal: true, isDefinition: true, align: 8)
!754 = !DINamespace(name: "serial", scope: !293)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !754, file: !2, align: 8, flags: DIFlagPublic, elements: !756, templateParams: !29, identifier: "d3d022f2a57cba894195942feb23b045")
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !755, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h0d6e7e6558af0970E", scope: !760, file: !374, line: 29, type: !763, isLocal: true, isDefinition: true, align: 64)
!760 = !DINamespace(name: "__stability", scope: !761)
!761 = !DINamespace(name: "deref", scope: !762)
!762 = !DINamespace(name: "{impl#0}", scope: !754)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !376, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !764, templateParams: !779, identifier: "a3f33b286c5033a248271f5298f41808")
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !763, file: !2, baseType: !766, size: 192, align: 64, flags: DIFlagPrivate)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !381, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !767, templateParams: !779, identifier: "e5b5c5c8b7ef109635371eca79b9edc7")
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !766, file: !2, baseType: !385, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !2, baseType: !770, size: 128, align: 16, flags: DIFlagPrivate)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !391, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !771, templateParams: !842, identifier: "82421cd1400d8ed43af897111a110f9b")
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !770, file: !2, baseType: !773, size: 128, align: 16, flags: DIFlagPrivate)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !33, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !774, templateParams: !29, identifier: "8195f31aa47fc3277ba8fc876ea44529")
!774 = !{!775}
!775 = !DICompositeType(tag: DW_TAG_variant_part, scope: !773, file: !2, size: 128, align: 16, elements: !776, templateParams: !29, identifier: "af000b5fcd6cf00f26405c5a9b3715f0", discriminator: !841)
!776 = !{!777, !837}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !775, file: !2, baseType: !778, size: 128, align: 16, extraData: i128 0)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !773, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !779, identifier: "5bc991f256099f91d190cac045d6ceeb")
!779 = !{!780}
!780 = !DITemplateTypeParameter(name: "T", type: !781)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !595, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !782, templateParams: !836, identifier: "a0c016871505c701ef7f7d2c992250be")
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !781, file: !2, baseType: !784, size: 112, align: 16, flags: DIFlagPrivate)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !599, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !785, templateParams: !836, identifier: "b76ae6ccc6681e76e8be84fb1591e0a8")
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !784, file: !2, baseType: !602, align: 8, flags: DIFlagPrivate)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !784, file: !2, baseType: !608, size: 8, align: 8, flags: DIFlagProtected)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !784, file: !2, baseType: !789, size: 96, align: 16, offset: 16, flags: DIFlagPrivate)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !391, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !790, templateParams: !834, identifier: "11ffbb18b189ec15a554e186f90c9c50")
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !789, file: !2, baseType: !792, size: 96, align: 16, flags: DIFlagPrivate)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !793, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !795, templateParams: !29, identifier: "cd2cfab81fd30006b3224a86e091d4be")
!793 = !DINamespace(name: "port", scope: !794)
!794 = !DINamespace(name: "uart_16550", scope: null)
!795 = !{!796, !797, !814, !815, !816, !817}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !792, file: !2, baseType: !724, size: 16, align: 16, flags: DIFlagPrivate)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !792, file: !2, baseType: !798, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !725, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !799, templateParams: !812, identifier: "88c92a8e9019782092fca4c78aa0b528")
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !798, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !798, file: !2, baseType: !802, align: 8, offset: 16, flags: DIFlagPrivate)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !430, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !803, identifier: "f972d392d77f37eafcc38aac8d2e8318")
!803 = !{!804}
!804 = !DITemplateTypeParameter(name: "T", type: !805)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !806, templateParams: !29, identifier: "a24d581725eb8ad9f2ac5ba2c0a69f75")
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !805, file: !2, baseType: !27, size: 8, align: 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !805, file: !2, baseType: !809, align: 8, offset: 8)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !725, file: !2, align: 8, flags: DIFlagPublic, elements: !810, templateParams: !29, identifier: "93060aa4846019eb67e0293fa512085a")
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !809, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!812 = !{!615, !813}
!813 = !DITemplateTypeParameter(name: "A", type: !809)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !792, file: !2, baseType: !798, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !792, file: !2, baseType: !798, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !792, file: !2, baseType: !798, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !792, file: !2, baseType: !818, size: 16, align: 16, offset: 80, flags: DIFlagPrivate)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !725, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !819, templateParams: !832, identifier: "d2fbebe20fdc1c5c321af2880a42e10")
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !818, file: !2, baseType: !303, size: 16, align: 16, flags: DIFlagPrivate)
