; ModuleID = '3mytfyo678bdv4ve'
source_filename = "3mytfyo678bdv4ve"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::iter::adapters::map::Map<core::ops::range::Range<usize>, {closure@x86_64::structures::paging::page_table::PageTable::iter::{closure#0}}>" = type { ptr, %"core::ops::range::Range<usize>" }
%"core::ops::range::Range<usize>" = type { i64, i64 }
%"core::fmt::rt::Argument<'_>" = type { ptr, ptr }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !29, identifier: "a0483a57acbdf4fa5326a02cd48043fe")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::fmt::Arguments", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !15, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !17, templateParams: !29, identifier: "86d983b481df04f01f2caf98ecdb573e")
!15 = !DINamespace(name: "fmt", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18, !31, !84}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !14, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !20, templateParams: !29, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!20 = !{!21, !30}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !24, templateParams: !29, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !23, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !14, file: !2, baseType: !32, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "e48718f86166d54d77f059ca0b0a6c98")
!33 = !DINamespace(name: "option", scope: !16)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !32, file: !2, size: 128, align: 64, elements: !36, templateParams: !29, identifier: "afffb15192482d728253b8f8d2472e72", discriminator: !83)
!36 = !{!37, !79}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !35, file: !2, baseType: !38, size: 128, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !39, identifier: "1d9e634e4d5498a7ee96fb2809d07bf0")
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "T", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !42, templateParams: !29, identifier: "10cafd0b6708f7074105ffbf9866f638")
!42 = !{!43, !78}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !41, file: !2, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !46, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !29, identifier: "28b92f1394f76687eb8e9c560ca51a4c")
!46 = !DINamespace(name: "rt", scope: !15)
!47 = !{!48, !49, !51, !58, !60, !77}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !45, file: !2, baseType: !50, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !45, file: !2, baseType: !52, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !46, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !2, baseType: !59, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !45, file: !2, baseType: !61, size: 128, align: 64, flags: DIFlagPublic)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !62, templateParams: !29, identifier: "481d968305f18fdf8ffdc763003c88c2")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_variant_part, scope: !61, file: !2, size: 128, align: 64, elements: !64, templateParams: !29, identifier: "24e90591fade26729409e3a20be2092f", discriminator: !75)
!64 = !{!65, !69, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !63, file: !2, baseType: !66, size: 128, align: 64, extraData: i128 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !29, identifier: "4f0d326e575be30f2fd639a109ec9636")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !63, file: !2, baseType: !70, size: 128, align: 64, extraData: i128 1)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !29, identifier: "3ef2efa2febef674f3c7a1d1edeb2d4")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !63, file: !2, baseType: !74, size: 128, align: 64, extraData: i128 2)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "9632846e4fadf93ac045eb7d766a59de")
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!76 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !45, file: !2, baseType: !61, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !35, file: !2, baseType: !80, size: 128, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !39, identifier: "bc059b01ff1bb2971a2574564a359fd")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !2, baseType: !41, size: 128, align: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !32, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !2, baseType: !85, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !86, templateParams: !29, identifier: "721bb03f9dbcb87965e2bb40d9a20f3b")
!86 = !{!87, !149}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !2, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !90, templateParams: !29, identifier: "c21ebc23867bf4144aa11e8b76b9019b")
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !89, file: !2, baseType: !92, size: 64, align: 64, flags: DIFlagPrivate)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !94, file: !2, align: 8, elements: !29, identifier: "7fd454df0a480bb0c65b40675d1838be")
!94 = !DINamespace(name: "{extern#0}", scope: !46)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !89, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !92, !117}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !100, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !101, templateParams: !29, identifier: "22edf1bd3971db6bd2ad32a9daa6f6ca")
!100 = !DINamespace(name: "result", scope: !16)
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_variant_part, scope: !99, file: !2, size: 8, align: 8, elements: !103, templateParams: !29, identifier: "adcad2b9c0ff448fdc0c8b7762234780", discriminator: !116)
!103 = !{!104, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !102, file: !2, baseType: !105, size: 8, align: 8, extraData: i128 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !106, templateParams: !108, identifier: "929502afbf827051526e72098b2bdef3")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "T", type: !7)
!110 = !DITemplateTypeParameter(name: "E", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !15, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "3069877aff233c82ff5ca4b40585f280")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !102, file: !2, baseType: !113, size: 8, align: 8, extraData: i128 1)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !114, templateParams: !108, identifier: "d8692c9ed1a95c26749ce8856cf20e6b")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !2, baseType: !111, align: 8, offset: 8, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagArtificial)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !15, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !119, templateParams: !29, identifier: "69fb35bbf13c50dad131588c55e1a73e")
!119 = !{!120, !121, !122, !123, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !2, baseType: !59, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !2, baseType: !50, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !52, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !118, file: !2, baseType: !124, size: 128, align: 64, flags: DIFlagPrivate)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !125, templateParams: !29, identifier: "e35d24df7864ff75c56a1be902455ff")
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !124, file: !2, size: 128, align: 64, elements: !127, templateParams: !29, identifier: "e387b39c7264d58d894a5d68f142d3c6", discriminator: !136)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i128 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !130, identifier: "c5e7f26fad88e7e95a61499e645aaa4c")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !9)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !133, size: 128, align: 64, extraData: i128 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !134, templateParams: !130, identifier: "d7d153280913c68b726880f10c7f2f12")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !118, file: !2, baseType: !124, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !2, baseType: !139, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !140, templateParams: !29, identifier: "8f6e1dba3018d5fd2b6a6d5825b494f5")
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !2, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !29, identifier: "b8b42c4b4ac43cfb69c8ca498cfba042")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !139, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3, lowerBound: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !153, vtableHolder: !23, templateParams: !29, identifier: "caf514d613d2e16747eae206c73951c7")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !152, file: !2, baseType: !6, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !152, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !161, vtableHolder: !59, templateParams: !29, identifier: "8b5924d8611b5ad522052ceb67a7cfb")
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !160, file: !2, baseType: !6, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !160, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !169, vtableHolder: !174, templateParams: !29, identifier: "f945807b72cc644fdfae91a8652e9bc5")
!169 = !{!170, !171, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !168, file: !2, baseType: !6, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !168, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !178, vtableHolder: !183, templateParams: !29, identifier: "2da19ac5296e9aeab076412a6102b0c9")
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !177, file: !2, baseType: !6, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !177, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !184, templateParams: !29, identifier: "a4b2bc7a55a2139888b43b81c7d8fe9a")
!184 = !{!185, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !183, file: !2, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "5385a15aafe22363c46f45ae5c8dad6b")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !183, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !192, vtableHolder: !197, templateParams: !29, identifier: "52fcb8ebc359e71df0dff7c202c2d2a0")
!192 = !{!193, !194, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !191, file: !2, baseType: !6, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !191, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !198, templateParams: !29, identifier: "e06c434358f56e57a46aa3d376545910")
!198 = !{!199}
!199 = !DICompositeType(tag: DW_TAG_variant_part, scope: !197, file: !2, size: 64, align: 64, elements: !200, templateParams: !29, identifier: "80ead23560329ab7e67827505c36ac7e", discriminator: !209)
!200 = !{!201, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !199, file: !2, baseType: !202, size: 64, align: 64, extraData: i128 0)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !203, identifier: "11c037c57dd6f17ae385a357b5fe84b9")
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !13)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !199, file: !2, baseType: !206, size: 64, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !207, templateParams: !203, identifier: "4090f5aa0a7fb540f9d6ff22f13dfa44")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !13, size: 64, align: 64, flags: DIFlagPublic)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !213, vtableHolder: !218, templateParams: !29, identifier: "35f673b1b759bb079d8146e1e480082")
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !212, file: !2, baseType: !6, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !212, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !222, templateParams: !29, identifier: "92103511feaa8dffda54e61810523e53")
!220 = !DINamespace(name: "location", scope: !221)
!221 = !DINamespace(name: "panic", scope: !16)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !219, file: !2, baseType: !23, size: 128, align: 64, flags: DIFlagPrivate)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !229, vtableHolder: !234, templateParams: !29, identifier: "be309d503cffaea3e7e317e1272fd73c")
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !228, file: !2, baseType: !6, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !228, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!234 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !238, vtableHolder: !243, templateParams: !29, identifier: "5b186ed135dca98a6fe4bfa9720e6c77")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !237, file: !2, baseType: !6, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !237, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "<vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "<vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !247, vtableHolder: !254, templateParams: !29, identifier: "53cc32d5dd13f31827b1f7a5295e71bb")
!247 = !{!248, !249, !250, !251, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !246, file: !2, baseType: !6, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !255, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !256, templateParams: !29, identifier: "330ec2815b83b95497a63dbcdc750fab")
!255 = !DINamespace(name: "vga", scope: null)
!256 = !{!257, !258, !266, !267, !285, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !254, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !254, file: !2, baseType: !259, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !260, templateParams: !29, identifier: "18eacc65824e14da86ca2a34a5649356")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !259, file: !2, baseType: !262, size: 128, align: 64, flags: DIFlagPrivate)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !263, templateParams: !29, identifier: "e81da3a37b79cea016d78bd7ddf43685")
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !262, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !254, file: !2, baseType: !262, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !2, baseType: !268, size: 64, align: 64, flags: DIFlagPrivate)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !269, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !255, file: !2, size: 32000, align: 8, flags: DIFlagPrivate, elements: !270, templateParams: !29, identifier: "492ac36a0b62d893dc31955386def3a")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !269, file: !2, baseType: !272, size: 32000, align: 8, flags: DIFlagPrivate)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 32000, align: 8, elements: !283)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1280, align: 8, elements: !281)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !255, file: !2, size: 16, align: 8, flags: DIFlagPrivate, elements: !275, templateParams: !29, identifier: "4819fcbb07635b3a72d791e93fe3b251")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !274, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !274, file: !2, baseType: !278, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !255, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !279, templateParams: !29, identifier: "404cd755b5b765a152c63e00ffea1eff")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !278, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!281 = !{!282}
!282 = !DISubrange(count: 80, lowerBound: 0)
!283 = !{!284}
!284 = !DISubrange(count: 25, lowerBound: 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !254, file: !2, baseType: !286, size: 8, align: 8, offset: 1664, flags: DIFlagPrivate)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !255, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !254, file: !2, baseType: !273, size: 1280, align: 8, offset: 384, flags: DIFlagPrivate)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::_::InternalBitFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::_::InternalBitFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !294, vtableHolder: !299, templateParams: !29, identifier: "f7154d90c404e00eb9fe9f70c38b879f")
!294 = !{!295, !296, !297, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !293, file: !2, baseType: !6, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !293, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !293, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::_::InternalBitFlags", baseType: !300, size: 64, align: 64, dwarfAddressSpace: 0)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalBitFlags", scope: !301, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !305, templateParams: !29, identifier: "63bd9e572f3af09a6da53f169fcb54be")
!301 = !DINamespace(name: "_", scope: !302)
!302 = !DINamespace(name: "idt", scope: !303)
!303 = !DINamespace(name: "structures", scope: !304)
!304 = !DINamespace(name: "x86_64", scope: null)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !300, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagProtected)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "BOOTLOADER_CONFIG", linkageName: "_ZN4theo17BOOTLOADER_CONFIG17h19b6408aebd9b887E", scope: !309, file: !310, line: 24, type: !311, isLocal: true, isDefinition: true, align: 64)
!309 = !DINamespace(name: "theo", scope: null)
!310 = !DIFile(filename: "src/main.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "64af06127703e06749c09bcf2fbe6d9e")
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "BootloaderConfig", scope: !312, file: !2, size: 1472, align: 64, flags: DIFlagPublic, elements: !314, templateParams: !29, identifier: "82cb6ff45c98afeab76746590d7e882a")
!312 = !DINamespace(name: "config", scope: !313)
!313 = !DINamespace(name: "bootloader_api", scope: null)
!314 = !{!315, !323, !372, !373}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !311, file: !2, baseType: !316, size: 64, align: 16, offset: 1344, flags: DIFlagProtected)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "ApiVersion", scope: !312, file: !2, size: 64, align: 16, flags: DIFlagPublic, elements: !317, templateParams: !29, identifier: "8e36327daecf202396cecdb4997ee01f")
!317 = !{!318, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !316, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!319 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !316, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "version_patch", scope: !316, file: !2, baseType: !319, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pre_release", scope: !316, file: !2, baseType: !234, size: 8, align: 8, offset: 48, flags: DIFlagPrivate)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !311, file: !2, baseType: !324, size: 1088, align: 64, flags: DIFlagPublic)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mappings", scope: !312, file: !2, size: 1088, align: 64, flags: DIFlagPublic, elements: !325, templateParams: !29, identifier: "fe89f9553afce15bd9a4351cdee118c4")
!325 = !{!326, !338, !339, !340, !354, !355, !356, !370, !371}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack", scope: !324, file: !2, baseType: !327, size: 128, align: 64, flags: DIFlagPublic)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mapping", scope: !312, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !328, templateParams: !29, identifier: "5f438d431198949192f643165f3bc7da")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_variant_part, scope: !327, file: !2, size: 128, align: 64, elements: !330, templateParams: !29, identifier: "b62d4cd6a437a77427b60487e310c369", discriminator: !337)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Dynamic", scope: !329, file: !2, baseType: !332, size: 128, align: 64, extraData: i128 0)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dynamic", scope: !327, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "982150e4340cdafa22d324c67c0e5a03")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "FixedAddress", scope: !329, file: !2, baseType: !334, size: 128, align: 64, extraData: i128 1)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedAddress", scope: !327, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !335, templateParams: !29, identifier: "360290eeca3bb310784d3f59db228ea4")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !324, file: !2, baseType: !327, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "framebuffer", scope: !324, file: !2, baseType: !327, size: 128, align: 64, offset: 256, flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "physical_memory", scope: !324, file: !2, baseType: !341, size: 128, align: 64, offset: 768, flags: DIFlagPublic)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bootloader_api::config::Mapping>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !342, templateParams: !29, identifier: "e6e8385503de0c39cc0eb4183407a2ef")
!342 = !{!343}
!343 = !DICompositeType(tag: DW_TAG_variant_part, scope: !341, file: !2, size: 128, align: 64, elements: !344, templateParams: !29, identifier: "1acceb2d0ed4f47b76c7c16d5b927958", discriminator: !353)
!344 = !{!345, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !343, file: !2, baseType: !346, size: 128, align: 64, extraData: i128 2)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !347, identifier: "d791028d98bb3021f68c7efe5f42016c")
!347 = !{!348}
!348 = !DITemplateTypeParameter(name: "T", type: !327)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !343, file: !2, baseType: !350, size: 128, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !351, templateParams: !347, identifier: "87a3f84282dee6a1c18ebc75ac6988d2")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !350, file: !2, baseType: !327, size: 128, align: 64, flags: DIFlagPublic)
!353 = !DIDerivedType(tag: DW_TAG_member, scope: !341, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_recursive", scope: !324, file: !2, baseType: !341, size: 128, align: 64, offset: 896, flags: DIFlagPublic)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "aslr", scope: !324, file: !2, baseType: !234, size: 8, align: 8, offset: 1024, flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_start", scope: !324, file: !2, baseType: !357, size: 128, align: 64, offset: 384, flags: DIFlagPublic)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !358, templateParams: !29, identifier: "150657176b358bed2bc2756fd835f8ab")
!358 = !{!359}
!359 = !DICompositeType(tag: DW_TAG_variant_part, scope: !357, file: !2, size: 128, align: 64, elements: !360, templateParams: !29, identifier: "f4c3dd5011c3d1fa95347ae92e37be61", discriminator: !369)
!360 = !{!361, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !359, file: !2, baseType: !362, size: 128, align: 64, extraData: i128 0)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !357, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !363, identifier: "277fa62b465a9764ee72f2a15dad28ef")
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "T", type: !76)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !359, file: !2, baseType: !366, size: 128, align: 64, extraData: i128 1)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !357, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !367, templateParams: !363, identifier: "509fa3e78464db0f5d668d7adc919b23")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !366, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !357, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_end", scope: !324, file: !2, baseType: !357, size: 128, align: 64, offset: 512, flags: DIFlagPublic)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ramdisk_memory", scope: !324, file: !2, baseType: !327, size: 128, align: 64, offset: 640, flags: DIFlagPublic)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack_size", scope: !311, file: !2, baseType: !76, size: 64, align: 64, offset: 1408, flags: DIFlagPublic)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "frame_buffer", scope: !311, file: !2, baseType: !374, size: 256, align: 64, offset: 1088, flags: DIFlagPublic)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", scope: !312, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !375, templateParams: !29, identifier: "4f2c2b15346f9986bd862241b4b59b88")
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_height", scope: !374, file: !2, baseType: !357, size: 128, align: 64, flags: DIFlagPublic)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_width", scope: !374, file: !2, baseType: !357, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17hcd027a0dc1b4df7aE", scope: !380, file: !381, line: 161, type: !382, isLocal: true, isDefinition: true, align: 8)
!380 = !DINamespace(name: "interrupts", scope: !309)
!381 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !380, file: !2, align: 8, flags: DIFlagPrivate, elements: !383, templateParams: !29, identifier: "8ac4171699c264d31a625a97a29c10c4")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !382, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h9cd6bf497b66c077E", scope: !387, file: !390, line: 29, type: !391, isLocal: true, isDefinition: true, align: 128)
!387 = !DINamespace(name: "__stability", scope: !388)
!388 = !DINamespace(name: "deref", scope: !389)
!389 = !DINamespace(name: "{impl#0}", scope: !380)
!390 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !392, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !394, templateParams: !420, identifier: "30b61abea6988d057615a23d42131166")
!392 = !DINamespace(name: "lazy", scope: !393)
!393 = !DINamespace(name: "lazy_static", scope: null)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !391, file: !2, baseType: !396, size: 33024, align: 128, flags: DIFlagPrivate)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !397, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !399, templateParams: !420, identifier: "dabc88b103550faba2ac374086af0a6f")
!397 = !DINamespace(name: "once", scope: !398)
!398 = !DINamespace(name: "spin", scope: null)
!399 = !{!400, !410}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !396, file: !2, baseType: !401, size: 64, align: 64, offset: 32896, flags: DIFlagPrivate)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !402, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !404, templateParams: !29, identifier: "563bdf7cef80ab0432ae98a6e3a035cc")
!402 = !DINamespace(name: "atomic", scope: !403)
!403 = !DINamespace(name: "sync", scope: !16)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !401, file: !2, baseType: !406, size: 64, align: 64, flags: DIFlagPrivate)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !407, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !408, templateParams: !130, identifier: "be585da722968b1199c79a1fc426f81b")
!407 = !DINamespace(name: "cell", scope: !16)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !406, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !2, baseType: !411, size: 32896, align: 128, flags: DIFlagPrivate)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !407, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !412, templateParams: !578, identifier: "888e1e7e54d4f4b35131992ad836722f")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !411, file: !2, baseType: !414, size: 32896, align: 128, flags: DIFlagPrivate)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !33, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !415, templateParams: !29, identifier: "a48487b13abe8b25b373da09a7767ee")
!415 = !{!416}
!416 = !DICompositeType(tag: DW_TAG_variant_part, scope: !414, file: !2, size: 32896, align: 128, elements: !417, templateParams: !29, identifier: "65105d9408834bf46bfe4aa97271d776", discriminator: !577)
!417 = !{!418, !573}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !416, file: !2, baseType: !419, size: 32896, align: 128, extraData: i128 2)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !414, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !29, templateParams: !420, identifier: "be4cfa2e4b4b04203b6158843ca61925")
!420 = !{!421}
!421 = !DITemplateTypeParameter(name: "T", type: !422)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !423, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !425, templateParams: !29, identifier: "bae027216cf2191e526d368cd114da5e")
!423 = !DINamespace(name: "interrupt_descriptor_table", scope: !424)
!424 = !DINamespace(name: "cpu_interrupts", scope: null)
!425 = !{!426, !570, !571, !572}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !422, file: !2, baseType: !427, size: 32768, align: 128, flags: DIFlagPrivate)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !302, file: !2, size: 32768, align: 128, flags: DIFlagPublic, elements: !428, templateParams: !29, identifier: "865021f9bba83a396af06f4f51ae1b6c")
!428 = !{!429, !465, !466, !467, !468, !469, !470, !471, !472, !491, !492, !510, !511, !512, !513, !534, !535, !536, !537, !555, !556, !557, !558, !562, !563, !564, !565, !566}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !427, file: !2, baseType: !430, size: 128, align: 32, flags: DIFlagPublic)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !302, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !431, templateParams: !463, identifier: "bff7e7cf97429cdfebff556929f44eb5")
!431 = !{!432, !433, !434, !438, !439, !440, !441}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !430, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !430, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !430, file: !2, baseType: !435, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !302, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !436, templateParams: !29, identifier: "a203088d74f58d64640436047b7cfb45")
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !435, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !430, file: !2, baseType: !319, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !430, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !430, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !430, file: !2, baseType: !442, align: 8, offset: 128, flags: DIFlagPrivate)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !444, identifier: "fc4b873c635cff7b971c1cdc3d36a5ed")
!443 = !DINamespace(name: "marker", scope: !16)
!444 = !{!445}
!445 = !DITemplateTypeParameter(name: "T", type: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !447, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449}
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !302, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !450, templateParams: !29, identifier: "2e1daac055551c50b04605807eb331f1")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !449, file: !2, baseType: !452, size: 320, align: 64, flags: DIFlagPrivate)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !302, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !453, templateParams: !29, identifier: "8d7ad4980b4fab7d471ed72cee256847")
!453 = !{!454, !459, !460, !461, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !452, file: !2, baseType: !455, size: 64, align: 64, flags: DIFlagPublic)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !456, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !457, templateParams: !29, identifier: "57b20c948fbc92d1afac39b6c2f39f93")
!456 = !DINamespace(name: "addr", scope: !304)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !455, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !452, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !452, file: !2, baseType: !76, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !452, file: !2, baseType: !455, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !452, file: !2, baseType: !76, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!463 = !{!464}
!464 = !DITemplateTypeParameter(name: "F", type: !446)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 128, flags: DIFlagPublic)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 256, flags: DIFlagPublic)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 384, flags: DIFlagPublic)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 512, flags: DIFlagPublic)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 640, flags: DIFlagPublic)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 768, flags: DIFlagPublic)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 896, flags: DIFlagPublic)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !427, file: !2, baseType: !473, size: 128, align: 32, offset: 1024, flags: DIFlagPublic)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !302, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !474, templateParams: !489, identifier: "c6b10923af5f8413a6b70807dcf28568")
!474 = !{!475, !476, !477, !478, !479, !480, !481}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !473, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !473, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !473, file: !2, baseType: !435, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !473, file: !2, baseType: !319, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !473, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !473, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !473, file: !2, baseType: !482, align: 8, offset: 128, flags: DIFlagPrivate)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !483, identifier: "147e3a5f666ef6ed97320fd46f8cf873")
!483 = !{!484}
!484 = !DITemplateTypeParameter(name: "T", type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !486, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !449, !76}
!488 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!489 = !{!490}
!490 = !DITemplateTypeParameter(name: "F", type: !485)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 1152, flags: DIFlagPrivate)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 1280, flags: DIFlagPublic)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !302, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !494, templateParams: !508, identifier: "920652b1723b9f5426a44f4fc98709a2")
!494 = !{!495, !496, !497, !498, !499, !500, !501}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !493, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !493, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !493, file: !2, baseType: !435, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !493, file: !2, baseType: !319, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !493, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !493, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !493, file: !2, baseType: !502, align: 8, offset: 128, flags: DIFlagPrivate)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !503, identifier: "bfe1146976bbc49bd80b67dbce32c33")
!503 = !{!504}
!504 = !DITemplateTypeParameter(name: "T", type: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !449, !76}
!508 = !{!509}
!509 = !DITemplateTypeParameter(name: "F", type: !505)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 1408, flags: DIFlagPublic)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 1536, flags: DIFlagPublic)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 1664, flags: DIFlagPublic)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !427, file: !2, baseType: !514, size: 128, align: 32, offset: 1792, flags: DIFlagPublic)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !302, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !515, templateParams: !532, identifier: "dcd3e0641511dd9ce8b5791958874a42")
!515 = !{!516, !517, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !514, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !514, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !514, file: !2, baseType: !435, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !514, file: !2, baseType: !319, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !514, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !514, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !514, file: !2, baseType: !523, align: 8, offset: 128, flags: DIFlagPrivate)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !524, identifier: "75baae00511e87137743ede4cd5d611f")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !527, size: 64, align: 64, dwarfAddressSpace: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !449, !529}
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !302, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !530, templateParams: !29, identifier: "a9dfbb4fd57b912c358080f724dbd2ec")
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !529, file: !2, baseType: !300, size: 64, align: 64, flags: DIFlagPrivate)
!532 = !{!533}
!533 = !DITemplateTypeParameter(name: "F", type: !526)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 1920, flags: DIFlagPrivate)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 2048, flags: DIFlagPublic)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 2176, flags: DIFlagPublic)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !427, file: !2, baseType: !538, size: 128, align: 32, offset: 2304, flags: DIFlagPublic)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !302, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !539, templateParams: !553, identifier: "8e50be64817b96df40dbf2ac851fd754")
!539 = !{!540, !541, !542, !543, !544, !545, !546}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !538, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !538, file: !2, baseType: !319, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !538, file: !2, baseType: !435, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !538, file: !2, baseType: !319, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !538, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !538, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !538, file: !2, baseType: !547, align: 8, offset: 128, flags: DIFlagPrivate)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !548, identifier: "2b8492b3068858e7a6d1714c3f74d46d")
!548 = !{!549}
!549 = !DITemplateTypeParameter(name: "T", type: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !551, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!488, !449}
!553 = !{!554}
!554 = !DITemplateTypeParameter(name: "F", type: !550)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 2432, flags: DIFlagPublic)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 2560, flags: DIFlagPublic)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cp_protection_exception", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 2688, flags: DIFlagPublic)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !427, file: !2, baseType: !559, size: 768, align: 32, offset: 2816, flags: DIFlagPrivate)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 768, align: 32, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 6, lowerBound: 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hv_injection_exception", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 3584, flags: DIFlagPublic)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 3712, flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !427, file: !2, baseType: !493, size: 128, align: 32, offset: 3840, flags: DIFlagPublic)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !427, file: !2, baseType: !430, size: 128, align: 32, offset: 3968, flags: DIFlagPrivate)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !427, file: !2, baseType: !567, size: 28672, align: 32, offset: 4096, flags: DIFlagPrivate)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 28672, align: 32, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 224, lowerBound: 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !422, file: !2, baseType: !234, size: 8, align: 8, offset: 32768, flags: DIFlagPrivate)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !422, file: !2, baseType: !234, size: 8, align: 8, offset: 32776, flags: DIFlagPrivate)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !422, file: !2, baseType: !234, size: 8, align: 8, offset: 32784, flags: DIFlagPrivate)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !416, file: !2, baseType: !574, size: 32896, align: 128)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !414, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !575, templateParams: !420, identifier: "2c4dbc4cd1d0e7fd43dd55813d85e360")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !422, size: 32896, align: 128, flags: DIFlagPublic)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !2, baseType: !27, size: 8, align: 8, offset: 32784, flags: DIFlagArtificial)
!578 = !{!579}
!579 = !DITemplateTypeParameter(name: "T", type: !414)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17h1126cb4cf797ea1cE", scope: !582, file: !381, line: 173, type: !583, isLocal: true, isDefinition: true, align: 8)
!582 = !DINamespace(name: "peripherals", scope: !309)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !582, file: !2, align: 8, flags: DIFlagPublic, elements: !584, templateParams: !29, identifier: "e38d1492fa17b48bd278de45eb9db29f")
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !583, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h990dd612b592a6a8E", scope: !588, file: !390, line: 29, type: !591, isLocal: true, isDefinition: true, align: 64)
!588 = !DINamespace(name: "__stability", scope: !589)
!589 = !DINamespace(name: "deref", scope: !590)
!590 = !DINamespace(name: "{impl#0}", scope: !582)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !392, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !592, templateParams: !607, identifier: "30e94c9ad82cb56ed527b1f6e5c1b0ca")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !591, file: !2, baseType: !594, size: 1920, align: 64, flags: DIFlagPrivate)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !397, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !595, templateParams: !607, identifier: "ca1b9458706e0661714e394fa74543ef")
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !594, file: !2, baseType: !401, size: 64, align: 64, flags: DIFlagPrivate)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !2, baseType: !598, size: 1856, align: 64, offset: 64, flags: DIFlagPrivate)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !407, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !599, templateParams: !644, identifier: "6879e02463c168354599663a65cb878a")
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !598, file: !2, baseType: !601, size: 1856, align: 64, flags: DIFlagPrivate)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !33, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !602, templateParams: !29, identifier: "2fe9d1b183230395c7c126cab923dbf1")
!602 = !{!603}
!603 = !DICompositeType(tag: DW_TAG_variant_part, scope: !601, file: !2, size: 1856, align: 64, elements: !604, templateParams: !29, identifier: "c58f3c0dffb700c05466b15816da7ff4", discriminator: !643)
!604 = !{!605, !639}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !603, file: !2, baseType: !606, size: 1856, align: 64, extraData: i128 0)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !601, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !607, identifier: "240fb1736008d31e8d0bec1db39969e6")
!607 = !{!608}
!608 = !DITemplateTypeParameter(name: "T", type: !609)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !610, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !611, templateParams: !637, identifier: "7918480eab89f5a73f3a36b06c723d20")
!610 = !DINamespace(name: "mutex", scope: !398)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !609, file: !2, baseType: !613, size: 1792, align: 64, flags: DIFlagPrivate)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !614, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !615, templateParams: !637, identifier: "e90cbdad52e838ad8e02173c262a042a")
!614 = !DINamespace(name: "spin", scope: !610)
!615 = !{!616, !622, !631}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !613, file: !2, baseType: !617, align: 8, flags: DIFlagPrivate)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !618, identifier: "2129426a237e1bfd9e2d6afae4bcdc3f")
!618 = !{!619}
!619 = !DITemplateTypeParameter(name: "T", type: !620)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !621, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "ef27873c3e69385681a5882603277967")
!621 = !DINamespace(name: "relax", scope: !398)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !2, baseType: !623, size: 8, align: 8, flags: DIFlagProtected)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !402, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !624, templateParams: !29, identifier: "c6bcd2f08768851eca905f4a36661ead")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !623, file: !2, baseType: !626, size: 8, align: 8, flags: DIFlagPrivate)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !407, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !627, templateParams: !629, identifier: "6e62764dda0e49d5d7ca1aa91f6abd61")
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !626, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!629 = !{!630}
!630 = !DITemplateTypeParameter(name: "T", type: !27)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !2, baseType: !632, size: 1728, align: 64, offset: 64, flags: DIFlagPrivate)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !407, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !633, templateParams: !635, identifier: "167c1076a73a6453b258dd9bed016200")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !632, file: !2, baseType: !254, size: 1728, align: 64, flags: DIFlagPrivate)
!635 = !{!636}
!636 = !DITemplateTypeParameter(name: "T", type: !254)
!637 = !{!636, !638}
!638 = !DITemplateTypeParameter(name: "R", type: !620)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !603, file: !2, baseType: !640, size: 1856, align: 64, extraData: i128 1)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !601, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !641, templateParams: !607, identifier: "dd8508984a1fbef89fb7580c2a748033")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !640, file: !2, baseType: !609, size: 1792, align: 64, offset: 64, flags: DIFlagPublic)
!643 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!644 = !{!645}
!645 = !DITemplateTypeParameter(name: "T", type: !601)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "KEYBOARD", linkageName: "_ZN4theo11peripherals8KEYBOARD17h8de25e2078b9955aE", scope: !582, file: !381, line: 173, type: !648, isLocal: true, isDefinition: true, align: 8)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "KEYBOARD", scope: !582, file: !2, align: 8, flags: DIFlagPublic, elements: !649, templateParams: !29, identifier: "1075006943a98ffee405011439d140ab")
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !648, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN71_$LT$theo..peripherals..KEYBOARD$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h289de5092f7fa060E", scope: !653, file: !390, line: 29, type: !656, isLocal: true, isDefinition: true, align: 64)
!653 = !DINamespace(name: "__stability", scope: !654)
!654 = !DINamespace(name: "deref", scope: !655)
!655 = !DINamespace(name: "{impl#2}", scope: !582)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !392, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !657, templateParams: !672, identifier: "26e4b386836ee6482998300e35182cfb")
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !656, file: !2, baseType: !659, size: 256, align: 64, flags: DIFlagPrivate)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !397, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !660, templateParams: !672, identifier: "e2478bc54a3b32f36dd6ad7403588ae6")
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !659, file: !2, baseType: !401, size: 64, align: 64, flags: DIFlagPrivate)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !2, baseType: !663, size: 160, align: 16, offset: 64, flags: DIFlagPrivate)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>>", scope: !407, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !664, templateParams: !765, identifier: "3b70ede5798286aea7ee6f5305ca2730")
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !663, file: !2, baseType: !666, size: 160, align: 16, flags: DIFlagPrivate)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !33, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !667, templateParams: !29, identifier: "cae4118a722e8d9c34e60353b57eba9")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_variant_part, scope: !666, file: !2, size: 160, align: 16, elements: !669, templateParams: !29, identifier: "d32489d726d21eec54498922570c9e84", discriminator: !764)
!669 = !{!670, !760}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !668, file: !2, baseType: !671, size: 160, align: 16, extraData: i128 0)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !666, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !672, identifier: "eeca21a3e8c0ed8cdca58522ce6b8a4f")
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "T", type: !674)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !610, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !675, templateParams: !759, identifier: "d10c4afeeb91b9011aa466e0612ea3fe")
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !674, file: !2, baseType: !677, size: 144, align: 16, flags: DIFlagPrivate)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !614, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !678, templateParams: !759, identifier: "c25edfa6aeacd1828bf985665e2d2669")
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !677, file: !2, baseType: !617, align: 8, flags: DIFlagPrivate)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !677, file: !2, baseType: !623, size: 8, align: 8, flags: DIFlagProtected)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !2, baseType: !682, size: 128, align: 16, offset: 16, flags: DIFlagPrivate)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>>", scope: !407, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !683, templateParams: !757, identifier: "8fd9a83e847507b9edb926d7f5767af6")
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !682, file: !2, baseType: !685, size: 128, align: 16, flags: DIFlagPrivate)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !686, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !687, templateParams: !736, identifier: "3aff063eb72ae80e430be364538757bd")
!686 = !DINamespace(name: "keyboard", scope: null)
!687 = !{!688, !738}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !685, file: !2, baseType: !689, size: 112, align: 16, flags: DIFlagPrivate)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !690, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !691, templateParams: !736, identifier: "4b7ec5db813c9fd5e8492f8c81e910f")
!690 = !DINamespace(name: "pc_keyboard", scope: null)
!691 = !{!692, !697, !711}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ps2_decoder", scope: !689, file: !2, baseType: !693, size: 32, align: 16, flags: DIFlagPrivate)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ps2Decoder", scope: !690, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !694, templateParams: !29, identifier: "30c6a4225823a82e9784896d6238d34e")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !693, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !693, file: !2, baseType: !27, size: 8, align: 8, offset: 16, flags: DIFlagPrivate)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "scancode_set", scope: !689, file: !2, baseType: !698, size: 8, align: 8, offset: 104, flags: DIFlagPrivate)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScancodeSet1", scope: !699, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !701, templateParams: !29, identifier: "363ccae5acfd31bf8a5be5857078c65a")
!699 = !DINamespace(name: "set1", scope: !700)
!700 = !DINamespace(name: "scancodes", scope: !690)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !698, file: !2, baseType: !703, size: 8, align: 8, flags: DIFlagPrivate)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !690, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710}
!705 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "event_decoder", scope: !689, file: !2, baseType: !712, size: 72, align: 8, offset: 32, flags: DIFlagPrivate)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventDecoder<pc_keyboard::layouts::us104::Us104Key>", scope: !690, file: !2, size: 72, align: 8, flags: DIFlagPublic, elements: !713, templateParams: !734, identifier: "7f55bff6682b37e875333f11cfa363d9")
!713 = !{!714, !719, !730}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handle_ctrl", scope: !712, file: !2, baseType: !715, size: 8, align: 8, flags: DIFlagPrivate)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !690, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !716)
!716 = !{!717, !718}
!717 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!718 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !712, file: !2, baseType: !720, size: 64, align: 8, offset: 8, flags: DIFlagPrivate)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !690, file: !2, size: 64, align: 8, flags: DIFlagPublic, elements: !721, templateParams: !29, identifier: "95382bb7ad88f6c79eb5ccd72d3cda98")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !720, file: !2, baseType: !234, size: 8, align: 8, flags: DIFlagPublic)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 16, flags: DIFlagPublic)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 24, flags: DIFlagPublic)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 48, flags: DIFlagPublic)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !720, file: !2, baseType: !234, size: 8, align: 8, offset: 56, flags: DIFlagPublic)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !712, file: !2, baseType: !731, align: 8, offset: 72, flags: DIFlagPrivate)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !732, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "442834776260e3a0172ba56d18661ac3")
!732 = !DINamespace(name: "us104", scope: !733)
!733 = !DINamespace(name: "layouts", scope: !690)
!734 = !{!735}
!735 = !DITemplateTypeParameter(name: "L", type: !731)
!736 = !{!735, !737}
!737 = !DITemplateTypeParameter(name: "S", type: !698)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !685, file: !2, baseType: !739, size: 16, align: 16, offset: 112, flags: DIFlagPrivate)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !740, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !742, templateParams: !755, identifier: "df995e664beb44b94e9ca5b3b89edf81")
!740 = !DINamespace(name: "port", scope: !741)
!741 = !DINamespace(name: "instructions", scope: !304)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !739, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagPrivate)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !739, file: !2, baseType: !745, align: 8, offset: 16, flags: DIFlagPrivate)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !443, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !746, identifier: "c91d80b15d02217d59f1e35940264dea")
!746 = !{!747}
!747 = !DITemplateTypeParameter(name: "T", type: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !749, templateParams: !29, identifier: "14b11c8c29b36b2ef7b60d8c620e065b")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !748, file: !2, baseType: !27, size: 8, align: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !748, file: !2, baseType: !752, align: 8, offset: 8)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !740, file: !2, align: 8, flags: DIFlagPublic, elements: !753, templateParams: !29, identifier: "52a0f3382c83137e6e80dae86e0aeab0")
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !752, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!755 = !{!630, !756}
!756 = !DITemplateTypeParameter(name: "A", type: !752)
!757 = !{!758}
!758 = !DITemplateTypeParameter(name: "T", type: !685)
!759 = !{!758, !638}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !668, file: !2, baseType: !761, size: 160, align: 16, extraData: i128 1)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !666, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !762, templateParams: !672, identifier: "2a7169fb00709b1b79db50a1892b3b2b")
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !761, file: !2, baseType: !674, size: 144, align: 16, offset: 16, flags: DIFlagPublic)
!764 = !DIDerivedType(tag: DW_TAG_member, scope: !666, file: !2, baseType: !319, size: 16, align: 16, flags: DIFlagArtificial)
!765 = !{!766}
!766 = !DITemplateTypeParameter(name: "T", type: !666)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h965f48109ccf4522E", scope: !769, file: !381, line: 173, type: !770, isLocal: true, isDefinition: true, align: 8)
!769 = !DINamespace(name: "serial", scope: !309)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !769, file: !2, align: 8, flags: DIFlagPublic, elements: !771, templateParams: !29, identifier: "66092bf219af77effc29e39b52164e36")
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !770, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hf7ac88771eb75508E", scope: !775, file: !390, line: 29, type: !778, isLocal: true, isDefinition: true, align: 64)
!775 = !DINamespace(name: "__stability", scope: !776)
!776 = !DINamespace(name: "deref", scope: !777)
!777 = !DINamespace(name: "{impl#0}", scope: !769)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !392, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !779, templateParams: !794, identifier: "4de49f4ab2b877ca16f11be40979427f")
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !778, file: !2, baseType: !781, size: 192, align: 64, flags: DIFlagPrivate)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !397, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !782, templateParams: !794, identifier: "e5ab9a11fbeb03f2a8d306bc0f55f7e3")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !781, file: !2, baseType: !401, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !781, file: !2, baseType: !785, size: 128, align: 16, flags: DIFlagPrivate)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !407, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !786, templateParams: !857, identifier: "85ccec5911171c79513e7fc75c895834")
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !785, file: !2, baseType: !788, size: 128, align: 16, flags: DIFlagPrivate)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !33, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !789, templateParams: !29, identifier: "b3984434949280e28f18730207b9fc49")
!789 = !{!790}
!790 = !DICompositeType(tag: DW_TAG_variant_part, scope: !788, file: !2, size: 128, align: 16, elements: !791, templateParams: !29, identifier: "3c41e8d6d4dddcffea01e00737279294", discriminator: !856)
!791 = !{!792, !852}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !790, file: !2, baseType: !793, size: 128, align: 16, extraData: i128 0)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !788, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !794, identifier: "8cdc41d0ee9ab2999b60ae757a49fb6b")
!794 = !{!795}
!795 = !DITemplateTypeParameter(name: "T", type: !796)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !610, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !797, templateParams: !851, identifier: "e72b5685595c8a1a473d7482a2026607")
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !796, file: !2, baseType: !799, size: 112, align: 16, flags: DIFlagPrivate)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !614, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !800, templateParams: !851, identifier: "c28c026aa0925933dec7125daeeb42c7")
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !799, file: !2, baseType: !617, align: 8, flags: DIFlagPrivate)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !2, baseType: !623, size: 8, align: 8, flags: DIFlagProtected)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !799, file: !2, baseType: !804, size: 96, align: 16, offset: 16, flags: DIFlagPrivate)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !407, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !805, templateParams: !849, identifier: "cd0ebe43099d34da55bef997b058c90f")
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !804, file: !2, baseType: !807, size: 96, align: 16, flags: DIFlagPrivate)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !808, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !810, templateParams: !29, identifier: "d28290aa3a3511ae4d54081ea525bec1")
!808 = !DINamespace(name: "port", scope: !809)
!809 = !DINamespace(name: "uart_16550", scope: null)
!810 = !{!811, !812, !829, !830, !831, !832}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !807, file: !2, baseType: !739, size: 16, align: 16, flags: DIFlagPrivate)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !807, file: !2, baseType: !813, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !740, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !814, templateParams: !827, identifier: "1045cae47254aca4880ba4d5b7c695c3")
!814 = !{!815, !816}
