; ModuleID = '4kud9y0wn5f3c6sq'
source_filename = "4kud9y0wn5f3c6sq"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"spin::mutex::Mutex<vga::Screen>" = type { %"spin::mutex::spin::SpinMutex<vga::Screen>" }
%"spin::mutex::spin::SpinMutex<vga::Screen>" = type { %"core::marker::PhantomData<spin::relax::Spin>", %"core::sync::atomic::AtomicBool", [7 x i8], %"core::cell::UnsafeCell<vga::Screen>" }
%"core::marker::PhantomData<spin::relax::Spin>" = type {}
%"core::sync::atomic::AtomicBool" = type { i8 }
%"core::cell::UnsafeCell<vga::Screen>" = type { %"vga::Screen" }
%"vga::Screen" = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>::Some" = type { [1 x i64], %"spin::mutex::Mutex<vga::Screen>" }
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>" = type { i64, [28 x i64] }
%"spin::once::Once<spin::mutex::Mutex<vga::Screen>>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" = type { %"core::option::Option<spin::mutex::Mutex<vga::Screen>>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "7bca096cedfc11aa1851e54e1f58d629")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "6d51daca1a3c5a5765414427c2bd520a")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "e8ead1d3471f8a9315af3c820c1eeca2")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "6e4a853d3e2be99c863c9e3c381c20c0")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "995a82863742a0009f461bd26852bb27")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "9fa2b9d052ac23659a89c6ddd9f38")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "5f32aefbe5ebba7b2f4babfba9c9aa1c")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN__TEXT_MODE", linkageName: "_ZN4theo11peripherals25VGA_DISPLAY_IN__TEXT_MODE17hbe1f5fdd82af7f3fE", scope: !56, file: !58, line: 161, type: !59, isLocal: true, isDefinition: true, align: 8)
!56 = !DINamespace(name: "peripherals", scope: !57)
!57 = !DINamespace(name: "theo", scope: null)
!58 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN__TEXT_MODE", scope: !56, file: !2, align: 8, elements: !60, templateParams: !27, identifier: "684ef8ad3c0f6fd9154cbbacf4ad8012")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !59, file: !2, baseType: !7, align: 8)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hf4f977c774bb751cE", scope: !64, file: !67, line: 29, type: !68, isLocal: true, isDefinition: true, align: 64)
!64 = !DINamespace(name: "__stability", scope: !65)
!65 = !DINamespace(name: "deref", scope: !66)
!66 = !DINamespace(name: "{impl#0}", scope: !56)
!67 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !69, file: !2, size: 1920, align: 64, elements: !71, templateParams: !101, identifier: "a5d8972dc13f8be77176901fbc08551c")
!69 = !DINamespace(name: "lazy", scope: !70)
!70 = !DINamespace(name: "lazy_static", scope: null)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !73, size: 1920, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !74, file: !2, size: 1920, align: 64, elements: !76, templateParams: !101, identifier: "9331c560283c252b8fc9ec4c4b50dbd2")
!74 = !DINamespace(name: "once", scope: !75)
!75 = !DINamespace(name: "spin", scope: null)
!76 = !{!77, !90}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !2, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !79, file: !2, size: 64, align: 64, elements: !82, templateParams: !27, identifier: "e00fd022714aa819cef83a74a4523c4")
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !81)
!81 = !DINamespace(name: "core", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !78, file: !2, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !85, file: !2, size: 64, align: 64, elements: !86, templateParams: !88, identifier: "8f2b43c3fe89fd793c6f616cb378bdef")
!85 = !DINamespace(name: "cell", scope: !81)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !2, baseType: !9, size: 64, align: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !2, baseType: !91, size: 1856, align: 64, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !85, file: !2, size: 1856, align: 64, elements: !92, templateParams: !140, identifier: "70424b8d619f6f5777b5c03f062ee1d")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !94, size: 1856, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !95, file: !2, size: 1856, align: 64, elements: !96, templateParams: !27, identifier: "4e6ad8c2ab6c8a64d4de497e7613271c")
!95 = !DINamespace(name: "option", scope: !81)
!96 = !{!97}
!97 = !DICompositeType(tag: DW_TAG_variant_part, scope: !94, file: !2, size: 1856, align: 64, elements: !98, templateParams: !27, identifier: "8003e5c6a4dd930a87a3da132f6d1799", discriminator: !138)
!98 = !{!99, !134}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !97, file: !2, baseType: !100, size: 1856, align: 64, extraData: i64 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !94, file: !2, size: 1856, align: 64, elements: !27, templateParams: !101, identifier: "35a0d2b5cc97545e91f1b99c6596e222")
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !104, file: !2, size: 1792, align: 64, elements: !105, templateParams: !132, identifier: "611611f7d8f259a75c4739045eb92376")
!104 = !DINamespace(name: "mutex", scope: !75)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !103, file: !2, baseType: !107, size: 1792, align: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !108, file: !2, size: 1792, align: 64, elements: !109, templateParams: !132, identifier: "b3dfe561449a6eeff18410bb469c1f42")
!108 = !DINamespace(name: "spin", scope: !104)
!109 = !{!110, !117, !126}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !107, file: !2, baseType: !111, align: 8)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !112, file: !2, align: 8, elements: !27, templateParams: !113, identifier: "1feaf6ce1c4a12cea2f4514b29b4c864")
!112 = !DINamespace(name: "marker", scope: !81)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "T", type: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !116, file: !2, align: 8, elements: !27, identifier: "cb1681359f2dc154bb8862341a96ce33")
!116 = !DINamespace(name: "relax", scope: !75)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !107, file: !2, baseType: !118, size: 8, align: 8)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !79, file: !2, size: 8, align: 8, elements: !119, templateParams: !27, identifier: "e3a8f6aca1ae589a686903e9b7facdec")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !118, file: !2, baseType: !121, size: 8, align: 8)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !85, file: !2, size: 8, align: 8, elements: !122, templateParams: !124, identifier: "600c9f501150572d601fb37034a1a639")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !121, file: !2, baseType: !39, size: 8, align: 8)
!124 = !{!125}
!125 = !DITemplateTypeParameter(name: "T", type: !39)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !2, baseType: !127, size: 1728, align: 64, offset: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !85, file: !2, size: 1728, align: 64, elements: !128, templateParams: !130, identifier: "61fc10a41702fb20684248e2866e6816")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !127, file: !2, baseType: !15, size: 1728, align: 64)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !15)
!132 = !{!131, !133}
!133 = !DITemplateTypeParameter(name: "R", type: !115)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !97, file: !2, baseType: !135, size: 1856, align: 64, extraData: i64 1)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !94, file: !2, size: 1856, align: 64, elements: !136, templateParams: !101, identifier: "1052d5d58e93e3e7d43ac2244bf4593e")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !135, file: !2, baseType: !103, size: 1792, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!139 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!140 = !{!141}
!141 = !DITemplateTypeParameter(name: "T", type: !94)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h0297b817d903c012E", scope: !144, file: !58, line: 161, type: !145, isLocal: true, isDefinition: true, align: 8)
!144 = !DINamespace(name: "serial", scope: !57)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !144, file: !2, align: 8, elements: !146, templateParams: !27, identifier: "d519e0b4a26045b838efe6ac97f11cb7")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !145, file: !2, baseType: !7, align: 8)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h7142e2e3fd054f95E", scope: !150, file: !67, line: 29, type: !153, isLocal: true, isDefinition: true, align: 64)
!150 = !DINamespace(name: "__stability", scope: !151)
!151 = !DINamespace(name: "deref", scope: !152)
!152 = !DINamespace(name: "{impl#0}", scope: !144)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !69, file: !2, size: 192, align: 64, elements: !154, templateParams: !169, identifier: "26b26f494da8fcd63f9aa92979cd8e6c")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !153, file: !2, baseType: !156, size: 192, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !74, file: !2, size: 192, align: 64, elements: !157, templateParams: !169, identifier: "a1bb927dfb7c71086fa0e7b77ab75557")
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !2, baseType: !78, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !2, baseType: !160, size: 128, align: 16)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !85, file: !2, size: 128, align: 16, elements: !161, templateParams: !252, identifier: "4401a97cb8814934aea371126e6f3fa8")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !160, file: !2, baseType: !163, size: 128, align: 16)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !95, file: !2, size: 128, align: 16, elements: !164, templateParams: !27, identifier: "292f5d7ee3aa0314fc67b1cbcfa3a85")
!164 = !{!165}
!165 = !DICompositeType(tag: DW_TAG_variant_part, scope: !163, file: !2, size: 128, align: 16, elements: !166, templateParams: !27, identifier: "dbd1581234cdbfac1ca90a119af1ed7a", discriminator: !251)
!166 = !{!167, !247}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !165, file: !2, baseType: !168, size: 128, align: 16, extraData: i64 0)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !163, file: !2, size: 128, align: 16, elements: !27, templateParams: !169, identifier: "16a9c01677858e2dc042224426b6a980")
!169 = !{!170}
!170 = !DITemplateTypeParameter(name: "T", type: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !104, file: !2, size: 112, align: 16, elements: !172, templateParams: !246, identifier: "6ba686b67b8ad0012b9f7333bff57fcc")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !171, file: !2, baseType: !174, size: 112, align: 16)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !108, file: !2, size: 112, align: 16, elements: !175, templateParams: !246, identifier: "3698ede834143f1bd4e0176f449ed692")
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !174, file: !2, baseType: !111, align: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !174, file: !2, baseType: !118, size: 8, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !2, baseType: !179, size: 96, align: 16, offset: 16)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !85, file: !2, size: 96, align: 16, elements: !180, templateParams: !244, identifier: "7a9bcae904aed9b39d6360c65543d3f0")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !2, baseType: !182, size: 96, align: 16)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !183, file: !2, size: 96, align: 16, elements: !185, templateParams: !27, identifier: "ff529824826a5c83dc8253bd394b51")
!183 = !DINamespace(name: "port", scope: !184)
!184 = !DINamespace(name: "uart_16550", scope: null)
!185 = !{!186, !207, !224, !225, !226, !227}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !2, baseType: !187, size: 16, align: 16)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !188, file: !2, size: 16, align: 16, elements: !191, templateParams: !205, identifier: "9dbee6da713b474ad4fd363bf0c16663")
!188 = !DINamespace(name: "port", scope: !189)
!189 = !DINamespace(name: "instructions", scope: !190)
!190 = !DINamespace(name: "x86_64", scope: null)
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !187, file: !2, baseType: !193, size: 16, align: 16)
!193 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !187, file: !2, baseType: !195, align: 8)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !112, file: !2, align: 8, elements: !27, templateParams: !196, identifier: "fc0e64cf58bb3b7551a4d353d2157188")
!196 = !{!197}
!197 = !DITemplateTypeParameter(name: "T", type: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !199, templateParams: !27, identifier: "683385a8b1322cbe9480f70f16674175")
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !2, baseType: !39, size: 8, align: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !198, file: !2, baseType: !202, align: 8, offset: 8)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !188, file: !2, align: 8, elements: !203, templateParams: !27, identifier: "728edd502a2e53f8559d30e8d4ed9df3")
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !202, file: !2, baseType: !7, align: 8)
!205 = !{!125, !206}
!206 = !DITemplateTypeParameter(name: "A", type: !202)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !182, file: !2, baseType: !208, size: 16, align: 16, offset: 16)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !188, file: !2, size: 16, align: 16, elements: !209, templateParams: !222, identifier: "8b8400a5e9159f4ec06d7a9d38cbed6")
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !208, file: !2, baseType: !193, size: 16, align: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !208, file: !2, baseType: !212, align: 8)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !112, file: !2, align: 8, elements: !27, templateParams: !213, identifier: "562dbd7d07afc8df5ccd5b8923460714")
!213 = !{!214}
!214 = !DITemplateTypeParameter(name: "T", type: !215)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !216, templateParams: !27, identifier: "a5b3e358e550b308477cf3f6886b7d22")
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !215, file: !2, baseType: !39, size: 8, align: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !215, file: !2, baseType: !219, align: 8, offset: 8)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !188, file: !2, align: 8, elements: !220, templateParams: !27, identifier: "b9f05cac3e8158583609b5006348800e")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !219, file: !2, baseType: !7, align: 8)
!222 = !{!125, !223}
!223 = !DITemplateTypeParameter(name: "A", type: !219)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !182, file: !2, baseType: !208, size: 16, align: 16, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !182, file: !2, baseType: !208, size: 16, align: 16, offset: 48)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !182, file: !2, baseType: !208, size: 16, align: 16, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !182, file: !2, baseType: !228, size: 16, align: 16, offset: 80)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !188, file: !2, size: 16, align: 16, elements: !229, templateParams: !242, identifier: "2b1d0688442157e568bef8cbb83945c")
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !228, file: !2, baseType: !193, size: 16, align: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !228, file: !2, baseType: !232, align: 8)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !112, file: !2, align: 8, elements: !27, templateParams: !233, identifier: "26817db0be5bebf7224579bba202d9df")
!233 = !{!234}
!234 = !DITemplateTypeParameter(name: "T", type: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !236, templateParams: !27, identifier: "18d525d760fb866110c1cd89e68d7524")
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !235, file: !2, baseType: !39, size: 8, align: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !235, file: !2, baseType: !239, align: 8, offset: 8)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !188, file: !2, align: 8, elements: !240, templateParams: !27, identifier: "ae4515a8f1712ea8d5f3f6d9b5956241")
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !239, file: !2, baseType: !7, align: 8)
!242 = !{!125, !243}
!243 = !DITemplateTypeParameter(name: "A", type: !239)
!244 = !{!245}
!245 = !DITemplateTypeParameter(name: "T", type: !182)
!246 = !{!245, !133}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !165, file: !2, baseType: !248, size: 128, align: 16, extraData: i64 1)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !163, file: !2, size: 128, align: 16, elements: !249, templateParams: !169, identifier: "f5847b5c5ae8a6f191f48f96d853dddb")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !248, file: !2, baseType: !171, size: 112, align: 16, offset: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !2, baseType: !193, size: 16, align: 16, flags: DIFlagArtificial)
!252 = !{!253}
!253 = !DITemplateTypeParameter(name: "T", type: !163)
!254 = !{i32 7, !"PIC Level", i32 2}
!255 = !{i32 7, !"PIE Level", i32 2}
!256 = !{i32 2, !"Dwarf Version", i32 4}
!257 = !{i32 2, !"Debug Info Version", i32 3}
!258 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !259, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, globals: !277, splitDebugInlining: false)
!259 = !DIFile(filename: "src/main.rs/@/4kud9y0wn5f3c6sq", directory: "/Users/yaw/self/theo")
!260 = !{!49, !261, !270}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !262, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !265)
!262 = !DINamespace(name: "v1", scope: !263)
!263 = !DINamespace(name: "rt", scope: !264)
!264 = !DINamespace(name: "fmt", scope: !81)
!265 = !{!266, !267, !268, !269}
!266 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !271)
!271 = !{!272, !273, !274, !275, !276}
!272 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!273 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!274 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!275 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!276 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!277 = !{!0, !54, !62, !142, !148}
!278 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h58508f04a15f2b46E", scope: !280, file: !279, line: 2396, type: !281, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !448, retainedNodes: !445)
!279 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!280 = !DINamespace(name: "{impl#59}", scope: !264)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !301, !403}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !284, file: !2, size: 8, align: 8, elements: !285, templateParams: !27, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!284 = !DINamespace(name: "result", scope: !81)
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_variant_part, scope: !283, file: !2, size: 8, align: 8, elements: !287, templateParams: !27, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !300)
!287 = !{!288, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !286, file: !2, baseType: !289, size: 8, align: 8, extraData: i64 0)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !283, file: !2, size: 8, align: 8, elements: !290, templateParams: !292, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !2, baseType: !7, align: 8, offset: 8)
!292 = !{!293, !294}
!293 = !DITemplateTypeParameter(name: "T", type: !7)
!294 = !DITemplateTypeParameter(name: "E", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !264, file: !2, align: 8, elements: !27, identifier: "c2c8f2f945c37359aa57422093183824")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !286, file: !2, baseType: !297, size: 8, align: 8, extraData: i64 1)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !283, file: !2, size: 8, align: 8, elements: !298, templateParams: !292, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !295, align: 8, offset: 8)
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !302, size: 64, align: 64, dwarfAddressSpace: 0)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !304, file: !2, size: 320, align: 64, elements: !306, templateParams: !27, identifier: "90bca62bb39f22eaf4aba345b6dfdcd8")
!304 = !DINamespace(name: "panic_info", scope: !305)
!305 = !DINamespace(name: "panic", scope: !81)
!306 = !{!307, !318, !435, !443}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !303, file: !2, baseType: !308, size: 128, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !309, templateParams: !27, identifier: "91bebff1f503b976bbd2a3ceea1f17b9")
!309 = !{!310, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !308, file: !2, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "2f2bd5b97c7e57f6f57794baac36921")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !308, file: !2, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 3, lowerBound: 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !303, file: !2, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !95, file: !2, size: 64, align: 64, elements: !320, templateParams: !27, identifier: "81a15a8dd92c26f32f6fe547cc342046")
!320 = !{!321}
!321 = !DICompositeType(tag: DW_TAG_variant_part, scope: !319, file: !2, size: 64, align: 64, elements: !322, templateParams: !27, identifier: "103445c12dbb3354a30129d6938e7e21", discriminator: !434)
!322 = !{!323, !430}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !321, file: !2, baseType: !324, size: 64, align: 64, extraData: i64 0)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !319, file: !2, size: 64, align: 64, elements: !27, templateParams: !325, identifier: "754f5afe71d0c8b616d03a5994e18d13")
!325 = !{!326}
!326 = !DITemplateTypeParameter(name: "T", type: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !264, file: !2, size: 384, align: 64, elements: !329, templateParams: !27, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!329 = !{!330, !341, !388}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !328, file: !2, baseType: !331, size: 128, align: 64, offset: 128)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !332, templateParams: !27, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!332 = !{!333, !340}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !331, file: !2, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64, dwarfAddressSpace: 0)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !336, templateParams: !27, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !335, file: !2, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !335, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !331, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !328, file: !2, baseType: !342, size: 128, align: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !95, file: !2, size: 128, align: 64, elements: !343, templateParams: !27, identifier: "37e4e944ba32344d635147f54bf9f4df")
!343 = !{!344}
!344 = !DICompositeType(tag: DW_TAG_variant_part, scope: !342, file: !2, size: 128, align: 64, elements: !345, templateParams: !27, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !387)
!345 = !{!346, !383}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !344, file: !2, baseType: !347, size: 128, align: 64, extraData: i64 0)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !342, file: !2, size: 128, align: 64, elements: !27, templateParams: !348, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!348 = !{!349}
!349 = !DITemplateTypeParameter(name: "T", type: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !351, templateParams: !27, identifier: "2225a8a3217ca2e4230086a86939d931")
!351 = !{!352, !382}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !350, file: !2, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !262, file: !2, size: 448, align: 64, elements: !355, templateParams: !27, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !354, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !354, file: !2, baseType: !358, size: 384, align: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !262, file: !2, size: 384, align: 64, elements: !359, templateParams: !27, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!359 = !{!360, !362, !363, !365, !381}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !358, file: !2, baseType: !361, size: 32, align: 32, offset: 288)
!361 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !358, file: !2, baseType: !261, size: 8, align: 8, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !358, file: !2, baseType: !364, size: 32, align: 32, offset: 256)
!364 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !358, file: !2, baseType: !366, size: 128, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !262, file: !2, size: 128, align: 64, elements: !367, templateParams: !27, identifier: "32660758978696a09244873a5d6fbb61")
!367 = !{!368}
!368 = !DICompositeType(tag: DW_TAG_variant_part, scope: !366, file: !2, size: 128, align: 64, elements: !369, templateParams: !27, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !380)
!369 = !{!370, !374, !378}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !368, file: !2, baseType: !371, size: 128, align: 64, extraData: i64 0)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !366, file: !2, size: 128, align: 64, elements: !372, templateParams: !27, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !368, file: !2, baseType: !375, size: 128, align: 64, extraData: i64 1)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !366, file: !2, size: 128, align: 64, elements: !376, templateParams: !27, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !375, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !368, file: !2, baseType: !379, size: 128, align: 64, extraData: i64 2)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !366, file: !2, size: 128, align: 64, elements: !27, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!380 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !358, file: !2, baseType: !366, size: 128, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !350, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !344, file: !2, baseType: !384, size: 128, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !342, file: !2, size: 128, align: 64, elements: !385, templateParams: !348, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !384, file: !2, baseType: !350, size: 128, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, scope: !342, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !328, file: !2, baseType: !389, size: 128, align: 64, offset: 256)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !390, templateParams: !27, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!390 = !{!391, !429}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !389, file: !2, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64, dwarfAddressSpace: 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !264, file: !2, size: 128, align: 64, elements: !394, templateParams: !27, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!394 = !{!395, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !393, file: !2, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !398, file: !2, align: 8, elements: !27, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!398 = !DINamespace(name: "{extern#0}", scope: !264)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !393, file: !2, baseType: !400, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !401, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!283, !396, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !404, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !264, file: !2, size: 512, align: 64, elements: !405, templateParams: !27, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!405 = !{!406, !407, !408, !409, !421, !422}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !404, file: !2, baseType: !364, size: 32, align: 32, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !404, file: !2, baseType: !361, size: 32, align: 32, offset: 416)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !404, file: !2, baseType: !261, size: 8, align: 8, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !404, file: !2, baseType: !410, size: 128, align: 64, offset: 128)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !95, file: !2, size: 128, align: 64, elements: !411, templateParams: !27, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!411 = !{!412}
!412 = !DICompositeType(tag: DW_TAG_variant_part, scope: !410, file: !2, size: 128, align: 64, elements: !413, templateParams: !27, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !420)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !412, file: !2, baseType: !415, size: 128, align: 64, extraData: i64 0)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !410, file: !2, size: 128, align: 64, elements: !27, templateParams: !88, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !412, file: !2, baseType: !417, size: 128, align: 64, extraData: i64 1)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !410, file: !2, size: 128, align: 64, elements: !418, templateParams: !88, identifier: "eec942390a307d7c8c2162b2092f63f3")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !404, file: !2, baseType: !410, size: 128, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !404, file: !2, baseType: !423, size: 128, align: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !424, templateParams: !27, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!424 = !{!425, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !423, file: !2, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "bb744bac75d5d19249a16512e8e296c")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !423, file: !2, baseType: !314, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !389, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !321, file: !2, baseType: !431, size: 64, align: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !319, file: !2, size: 64, align: 64, elements: !432, templateParams: !325, identifier: "3bc485037230e1476210237f20bbbcb8")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !431, file: !2, baseType: !327, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !319, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !303, file: !2, baseType: !436, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !438, file: !2, size: 192, align: 64, elements: !439, templateParams: !27, identifier: "ce713e8941e9786f7cd6b9ed5cdf02a8")
!438 = !DINamespace(name: "location", scope: !305)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !437, file: !2, baseType: !335, size: 128, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !437, file: !2, baseType: !364, size: 32, align: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !437, file: !2, baseType: !364, size: 32, align: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !303, file: !2, baseType: !444, size: 8, align: 8, offset: 256)
!444 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!445 = !{!446, !447}
!446 = !DILocalVariable(name: "self", arg: 1, scope: !278, file: !279, line: 2396, type: !301)
!447 = !DILocalVariable(name: "f", arg: 2, scope: !278, file: !279, line: 2396, type: !403)
!448 = !{!449}
!449 = !DITemplateTypeParameter(name: "T", type: !303)
!450 = !DILocation(line: 2396, column: 20, scope: !278)
!451 = !DILocation(line: 2396, column: 27, scope: !278)
!452 = !DILocation(line: 2396, column: 71, scope: !278)
!453 = !{i64 8}
!454 = !DILocation(line: 2396, column: 62, scope: !278)
!455 = !DILocation(line: 2396, column: 84, scope: !278)
!456 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17h3d82916d8de344dbE", scope: !393, file: !279, line: 340, type: !457, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !463, retainedNodes: !460)
!457 = !DISubroutineType(types: !458)
!458 = !{!393, !301, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!460 = !{!461, !462}
!461 = !DILocalVariable(name: "x", arg: 1, scope: !456, file: !279, line: 340, type: !301)
!462 = !DILocalVariable(name: "f", arg: 2, scope: !456, file: !279, line: 340, type: !459)
!463 = !{!464}
!464 = !DITemplateTypeParameter(name: "T", type: !302)
!465 = !DILocation(line: 340, column: 23, scope: !456)
!466 = !DILocation(line: 340, column: 33, scope: !456)
!467 = !DILocation(line: 349, column: 42, scope: !456)
!468 = !DILocation(line: 349, column: 68, scope: !456)
!469 = !{i64 1}
!470 = !DILocation(line: 349, column: 18, scope: !456)
!471 = !DILocation(line: 350, column: 6, scope: !456)
!472 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h5c864c7b7d651e90E", scope: !393, file: !279, line: 329, type: !473, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !463, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!393, !301}
!475 = !{!476}
!476 = !DILocalVariable(name: "x", arg: 1, scope: !472, file: !279, line: 329, type: !301)
!477 = !DILocation(line: 329, column: 30, scope: !472)
!478 = !DILocation(line: 330, column: 13, scope: !472)
!479 = !DILocation(line: 331, column: 10, scope: !472)
!480 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17h95d93ccaafccac81E", scope: !481, file: !279, line: 168, type: !482, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !487, retainedNodes: !484)
!481 = !DINamespace(name: "Write", scope: !264)
!482 = !DISubroutineType(types: !483)
!483 = !{!283, !14, !361}
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !480, file: !279, line: 168, type: !14)
!486 = !DILocalVariable(name: "c", arg: 2, scope: !480, file: !279, line: 168, type: !361)
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "Self", type: !15)
!489 = !DILocation(line: 168, column: 19, scope: !480)
!490 = !DILocation(line: 168, column: 30, scope: !480)
!491 = !DILocation(line: 169, column: 43, scope: !480)
!492 = !DILocation(line: 169, column: 24, scope: !480)
!493 = !DILocation(line: 169, column: 9, scope: !480)
!494 = !DILocation(line: 170, column: 6, scope: !480)
!495 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17hc533ace97ee556faE", scope: !481, file: !279, line: 196, type: !496, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !487, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!283, !14, !328}
!498 = !{!499, !500}
!499 = !DILocalVariable(name: "self", arg: 1, scope: !495, file: !279, line: 196, type: !14)
!500 = !DILocalVariable(name: "args", arg: 2, scope: !495, file: !279, line: 196, type: !328)
!501 = !DILocation(line: 196, column: 18, scope: !495)
!502 = !DILocation(line: 196, column: 39, scope: !495)
!503 = !DILocation(line: 197, column: 9, scope: !495)
!504 = !DILocation(line: 198, column: 6, scope: !495)
!505 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h076aed60ab470decE", scope: !328, file: !279, line: 421, type: !506, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !511)
!506 = !DISubroutineType(types: !507)
!507 = !{!328, !331, !389, !350, !508}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !264, file: !2, align: 8, elements: !509, templateParams: !27, identifier: "9da388efda58098f3ebab1da42679df")
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !508, file: !2, baseType: !7, align: 8)
!511 = !{!512, !513, !514, !515}
!512 = !DILocalVariable(name: "pieces", arg: 1, scope: !505, file: !279, line: 422, type: !331)
!513 = !DILocalVariable(name: "args", arg: 2, scope: !505, file: !279, line: 423, type: !389)
!514 = !DILocalVariable(name: "fmt", arg: 3, scope: !505, file: !279, line: 424, type: !350)
!515 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !505, file: !279, line: 425, type: !508)
!516 = !DILocation(line: 422, column: 9, scope: !505)
!517 = !DILocation(line: 423, column: 9, scope: !505)
!518 = !DILocation(line: 424, column: 9, scope: !505)
!519 = !DILocation(line: 425, column: 9, scope: !505)
!520 = !DILocation(line: 427, column: 34, scope: !505)
!521 = !DILocation(line: 427, column: 9, scope: !505)
!522 = !DILocation(line: 428, column: 6, scope: !505)
!523 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h66823de7ac8fe00eE", scope: !328, file: !279, line: 401, type: !524, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!328, !331, !389}
!526 = !{!527, !528}
!527 = !DILocalVariable(name: "pieces", arg: 1, scope: !523, file: !279, line: 401, type: !331)
!528 = !DILocalVariable(name: "args", arg: 2, scope: !523, file: !279, line: 401, type: !389)
!529 = !DILocation(line: 401, column: 25, scope: !523)
!530 = !DILocation(line: 401, column: 53, scope: !523)
!531 = !DILocation(line: 402, column: 12, scope: !523)
!532 = !DILocation(line: 402, column: 56, scope: !523)
!533 = !{i8 0, i8 2}
!534 = !DILocation(line: 402, column: 41, scope: !523)
!535 = !DILocation(line: 405, column: 34, scope: !523)
!536 = !DILocation(line: 405, column: 9, scope: !523)
!537 = !DILocation(line: 406, column: 6, scope: !523)
!538 = !DILocation(line: 403, column: 13, scope: !523)
!539 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h9f68c34f562c7b19E", scope: !541, file: !540, line: 250, type: !544, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !552, retainedNodes: !549)
!540 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!541 = !DINamespace(name: "FnOnce", scope: !542)
!542 = !DINamespace(name: "function", scope: !543)
!543 = !DINamespace(name: "ops", scope: !81)
!544 = !DISubroutineType(types: !545)
!545 = !{!103, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !547, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!103}
!549 = !{!550, !551}
!550 = !DILocalVariable(arg: 1, scope: !539, file: !540, line: 250, type: !546)
!551 = !DILocalVariable(arg: 2, scope: !539, file: !540, line: 250, type: !7)
!552 = !{!553, !554}
!553 = !DITemplateTypeParameter(name: "Self", type: !546)
!554 = !DITemplateTypeParameter(name: "Args", type: !7)
!555 = !DILocation(line: 250, column: 5, scope: !539)
!556 = !DILocation(line: 8, column: 20, scope: !557, inlinedAt: !560)
!557 = !DILexicalBlockFile(scope: !559, file: !558, discriminator: 0)
!558 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a9f733008b5882d285bb953998165fcd")
!559 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h002e44da60140c16E", scope: !65, file: !58, line: 137, type: !547, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !27)
!560 = distinct !DILocation(line: 250, column: 5, scope: !539)
!561 = !DILocalVariable(name: "value", arg: 1, scope: !562, file: !563, line: 134, type: !15)
!562 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17hb4941e4db9c01f19E", scope: !103, file: !563, line: 134, type: !564, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !132, retainedNodes: !566)
!563 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.4/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c58534ad96d8dc14eb87ebe3c1afa1b")
!564 = !DISubroutineType(types: !565)
!565 = !{!103, !15}
!566 = !{!561}
!567 = !DILocation(line: 134, column: 22, scope: !562, inlinedAt: !568)
!568 = distinct !DILocation(line: 8, column: 9, scope: !557, inlinedAt: !560)
!569 = !DILocalVariable(name: "data", arg: 1, scope: !570, file: !571, line: 99, type: !15)
!570 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17h266d03f366ed91b2E", scope: !107, file: !571, line: 99, type: !572, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !132, retainedNodes: !574)
!571 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.4/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c66351a136ee4537f9723cd15dd8f9b")
!572 = !DISubroutineType(types: !573)
!573 = !{!107, !15}
!574 = !{!569}
!575 = !DILocation(line: 99, column: 22, scope: !570, inlinedAt: !576)
!576 = distinct !DILocation(line: 135, column: 23, scope: !562, inlinedAt: !568)
!577 = !DILocation(line: 101, column: 19, scope: !570, inlinedAt: !576)
!578 = !DILocalVariable(name: "value", arg: 1, scope: !579, file: !580, line: 1962, type: !15)
!579 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h29dce688bd1c33a3E", scope: !127, file: !580, line: 1962, type: !581, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !130, retainedNodes: !583)
!580 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "533ae9b9d5d15fd7608d43889fd78bf4")
!581 = !DISubroutineType(types: !582)
!582 = !{!127, !15}
!583 = !{!578}
!584 = !DILocation(line: 1962, column: 22, scope: !579, inlinedAt: !585)
!585 = distinct !DILocation(line: 102, column: 19, scope: !570, inlinedAt: !576)
!586 = !DILocation(line: 1963, column: 9, scope: !579, inlinedAt: !585)
!587 = !DILocation(line: 100, column: 9, scope: !570, inlinedAt: !576)
!588 = !DILocation(line: 135, column: 9, scope: !562, inlinedAt: !568)
!589 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17hc46b87f40f8a2808E", scope: !591, file: !590, line: 490, type: !592, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !597, retainedNodes: !595)
!590 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!591 = !DINamespace(name: "ptr", scope: !81)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !{!596}
!596 = !DILocalVariable(arg: 1, scope: !589, file: !590, line: 490, type: !594)
!597 = !{!598}
!598 = !DITemplateTypeParameter(name: "T", type: !14)
!599 = !DILocation(line: 490, column: 1, scope: !589)
!600 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17h75a095827ebdf10dE", scope: !591, file: !590, line: 490, type: !601, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !614, retainedNodes: !612)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !604, size: 64, align: 64, dwarfAddressSpace: 0)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !104, file: !2, size: 128, align: 64, elements: !605, templateParams: !130, identifier: "208c008a801288677a0d7d89a602a149")
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !604, file: !2, baseType: !607, size: 128, align: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !108, file: !2, size: 128, align: 64, elements: !608, templateParams: !130, identifier: "56d87455e4a10f18e751cfe3ef7d4566")
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !607, file: !2, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !2, baseType: !14, size: 64, align: 64, offset: 64)
!612 = !{!613}
!613 = !DILocalVariable(arg: 1, scope: !600, file: !590, line: 490, type: !603)
!614 = !{!615}
!615 = !DITemplateTypeParameter(name: "T", type: !604)
!616 = !DILocation(line: 490, column: 1, scope: !600)
!617 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17h626787c311b1e406E", scope: !591, file: !590, line: 490, type: !618, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !623, retainedNodes: !621)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !607, size: 64, align: 64, dwarfAddressSpace: 0)
!621 = !{!622}
!622 = !DILocalVariable(arg: 1, scope: !617, file: !590, line: 490, type: !620)
!623 = !{!624}
!624 = !DITemplateTypeParameter(name: "T", type: !607)
!625 = !DILocation(line: 490, column: 1, scope: !617)
!626 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17h532ac1dc90b71c3cE", scope: !628, file: !627, line: 197, type: !630, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !640)
!627 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "197638d8a57725d685b49f7f7ce80004")
!628 = !DINamespace(name: "converts", scope: !629)
!629 = !DINamespace(name: "str", scope: !81)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !636}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut str", file: !2, size: 128, align: 64, elements: !633, templateParams: !27, identifier: "5a9563f597f3707a3b1d983c8a782f1")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !632, file: !2, baseType: !338, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !632, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !637, templateParams: !27, identifier: "76f368a1641a25f5ea1dd03aa07d17c8")
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !636, file: !2, baseType: !338, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !636, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!640 = !{!641}
!641 = !DILocalVariable(name: "v", arg: 1, scope: !626, file: !627, line: 197, type: !636)
!642 = !DILocation(line: 197, column: 45, scope: !626)
!643 = !DILocation(line: 203, column: 2, scope: !626)
!644 = distinct !DISubprogram(name: "encode_utf8_raw", linkageName: "_ZN4core4char7methods15encode_utf8_raw17h256d1e659b17a16fE", scope: !646, file: !645, line: 1713, type: !648, scopeLine: 1713, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !650)
!645 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/methods.rs", directory: "", checksumkind: CSK_MD5, checksum: "6639fd939de0cc71e2551f3e27d008ab")
!646 = !DINamespace(name: "methods", scope: !647)
!647 = !DINamespace(name: "char", scope: !81)
!648 = !DISubroutineType(types: !649)
!649 = !{!636, !364, !636}
!650 = !{!651, !652, !653, !655, !658, !660, !661, !663, !664, !665, !667, !668, !669}
!651 = !DILocalVariable(name: "code", arg: 1, scope: !644, file: !645, line: 1713, type: !364)
!652 = !DILocalVariable(name: "dst", arg: 2, scope: !644, file: !645, line: 1713, type: !636)
!653 = !DILocalVariable(name: "len", scope: !654, file: !645, line: 1714, type: !9, align: 8)
!654 = distinct !DILexicalBlock(scope: !644, file: !645, line: 1714, column: 5)
!655 = !DILocalVariable(name: "a", scope: !656, file: !645, line: 1716, type: !657, align: 8)
!656 = distinct !DILexicalBlock(scope: !654, file: !645, line: 1716, column: 9)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!658 = !DILocalVariable(name: "a", scope: !659, file: !645, line: 1719, type: !657, align: 8)
!659 = distinct !DILexicalBlock(scope: !654, file: !645, line: 1719, column: 9)
!660 = !DILocalVariable(name: "b", scope: !659, file: !645, line: 1719, type: !657, align: 8)
!661 = !DILocalVariable(name: "a", scope: !662, file: !645, line: 1723, type: !657, align: 8)
!662 = distinct !DILexicalBlock(scope: !654, file: !645, line: 1723, column: 9)
!663 = !DILocalVariable(name: "b", scope: !662, file: !645, line: 1723, type: !657, align: 8)
!664 = !DILocalVariable(name: "c", scope: !662, file: !645, line: 1723, type: !657, align: 8)
!665 = !DILocalVariable(name: "a", scope: !666, file: !645, line: 1728, type: !657, align: 8)
!666 = distinct !DILexicalBlock(scope: !654, file: !645, line: 1728, column: 9)
!667 = !DILocalVariable(name: "b", scope: !666, file: !645, line: 1728, type: !657, align: 8)
!668 = !DILocalVariable(name: "c", scope: !666, file: !645, line: 1728, type: !657, align: 8)
!669 = !DILocalVariable(name: "d", scope: !666, file: !645, line: 1728, type: !657, align: 8)
!670 = !DILocation(line: 1713, column: 24, scope: !644)
!671 = !DILocation(line: 1713, column: 35, scope: !644)
!672 = !DILocation(line: 1714, column: 9, scope: !654)
!673 = !DILocation(line: 1714, column: 15, scope: !644)
!674 = !DILocation(line: 1715, column: 12, scope: !654)
!675 = !DILocation(line: 1715, column: 22, scope: !654)
!676 = !DILocation(line: 1715, column: 11, scope: !654)
!677 = !DILocation(line: 1715, column: 5, scope: !654)
!678 = !DILocation(line: 1734, column: 14, scope: !654)
!679 = !DILocation(line: 1738, column: 13, scope: !654)
!680 = !DILocation(line: 1716, column: 13, scope: !654)
!681 = !DILocation(line: 1719, column: 13, scope: !654)
!682 = !DILocation(line: 1723, column: 13, scope: !654)
!683 = !DILocation(line: 1728, column: 13, scope: !654)
!684 = !DILocation(line: 1728, column: 14, scope: !654)
!685 = !DILocation(line: 1728, column: 14, scope: !666)
!686 = !DILocation(line: 1728, column: 17, scope: !654)
!687 = !DILocation(line: 1728, column: 17, scope: !666)
!688 = !DILocation(line: 1728, column: 20, scope: !654)
!689 = !DILocation(line: 1728, column: 20, scope: !666)
!690 = !DILocation(line: 1728, column: 23, scope: !654)
!691 = !DILocation(line: 1728, column: 23, scope: !666)
!692 = !DILocation(line: 1729, column: 19, scope: !666)
!693 = !DILocation(line: 1729, column: 18, scope: !666)
!694 = !DILocation(line: 1729, column: 13, scope: !666)
!695 = !DILocation(line: 1730, column: 19, scope: !666)
!696 = !DILocation(line: 1730, column: 18, scope: !666)
!697 = !DILocation(line: 1730, column: 13, scope: !666)
!698 = !DILocation(line: 1731, column: 19, scope: !666)
!699 = !DILocation(line: 1731, column: 18, scope: !666)
!700 = !DILocation(line: 1731, column: 13, scope: !666)
!701 = !DILocation(line: 1732, column: 18, scope: !666)
!702 = !DILocation(line: 1732, column: 13, scope: !666)
!703 = !DILocation(line: 1733, column: 9, scope: !654)
!704 = !DILocation(line: 1741, column: 16, scope: !654)
!705 = !DILocation(line: 1741, column: 14, scope: !654)
!706 = !DILocation(line: 1741, column: 10, scope: !654)
!707 = !DILocation(line: 1742, column: 2, scope: !644)
!708 = !DILocation(line: 1723, column: 14, scope: !654)
!709 = !DILocation(line: 1723, column: 14, scope: !662)
!710 = !DILocation(line: 1723, column: 17, scope: !654)
!711 = !DILocation(line: 1723, column: 17, scope: !662)
!712 = !DILocation(line: 1723, column: 20, scope: !654)
!713 = !DILocation(line: 1723, column: 20, scope: !662)
!714 = !DILocation(line: 1724, column: 19, scope: !662)
!715 = !DILocation(line: 1724, column: 18, scope: !662)
!716 = !DILocation(line: 1724, column: 13, scope: !662)
!717 = !DILocation(line: 1725, column: 19, scope: !662)
!718 = !DILocation(line: 1725, column: 18, scope: !662)
!719 = !DILocation(line: 1725, column: 13, scope: !662)
!720 = !DILocation(line: 1726, column: 18, scope: !662)
!721 = !DILocation(line: 1726, column: 13, scope: !662)
!722 = !DILocation(line: 1727, column: 9, scope: !654)
!723 = !DILocation(line: 1719, column: 14, scope: !654)
!724 = !DILocation(line: 1719, column: 14, scope: !659)
!725 = !DILocation(line: 1719, column: 17, scope: !654)
!726 = !DILocation(line: 1719, column: 17, scope: !659)
!727 = !DILocation(line: 1720, column: 19, scope: !659)
!728 = !DILocation(line: 1720, column: 18, scope: !659)
!729 = !DILocation(line: 1720, column: 13, scope: !659)
!730 = !DILocation(line: 1721, column: 18, scope: !659)
!731 = !DILocation(line: 1721, column: 13, scope: !659)
!732 = !DILocation(line: 1722, column: 9, scope: !654)
!733 = !DILocation(line: 1716, column: 14, scope: !654)
!734 = !DILocation(line: 1716, column: 14, scope: !656)
!735 = !DILocation(line: 1717, column: 13, scope: !656)
!736 = !DILocation(line: 1718, column: 9, scope: !654)
!737 = distinct !DISubprogram(name: "encode_utf8", linkageName: "_ZN4core4char7methods22_$LT$impl$u20$char$GT$11encode_utf817hbda3e756159fc5dbE", scope: !738, file: !645, line: 645, type: !739, scopeLine: 645, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !741)
!738 = !DINamespace(name: "{impl#0}", scope: !646)
!739 = !DISubroutineType(types: !740)
!740 = !{!632, !361, !636}
!741 = !{!742, !743}
!742 = !DILocalVariable(name: "self", arg: 1, scope: !737, file: !645, line: 645, type: !361)
!743 = !DILocalVariable(name: "dst", arg: 2, scope: !737, file: !645, line: 645, type: !636)
!744 = !DILocation(line: 645, column: 24, scope: !737)
!745 = !DILocation(line: 645, column: 30, scope: !737)
!746 = !DILocation(line: 647, column: 42, scope: !737)
!747 = !DILocation(line: 647, column: 18, scope: !737)
!748 = !DILocation(line: 648, column: 6, scope: !737)
!749 = distinct !DISubprogram(name: "len_utf8", linkageName: "_ZN4core4char7methods8len_utf817hd3975514358cc95eE", scope: !646, file: !645, line: 1685, type: !750, scopeLine: 1685, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!9, !364}
!752 = !{!753}
!753 = !DILocalVariable(name: "code", arg: 1, scope: !749, file: !645, line: 1685, type: !364)
!754 = !DILocation(line: 1685, column: 19, scope: !749)
!755 = !DILocation(line: 1686, column: 8, scope: !749)
!756 = !DILocation(line: 1688, column: 15, scope: !749)
!757 = !DILocation(line: 1687, column: 9, scope: !749)
!758 = !DILocation(line: 1686, column: 5, scope: !749)
!759 = !DILocation(line: 1695, column: 2, scope: !749)
!760 = !DILocation(line: 1690, column: 15, scope: !749)
!761 = !DILocation(line: 1689, column: 9, scope: !749)
!762 = !DILocation(line: 1688, column: 12, scope: !749)
!763 = !DILocation(line: 1693, column: 9, scope: !749)
!764 = !DILocation(line: 1690, column: 12, scope: !749)
!765 = !DILocation(line: 1691, column: 9, scope: !749)
!766 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17ha7c5d11573cfe8bdE", scope: !768, file: !767, line: 100, type: !769, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !27)
!767 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c5ec66aac3b7b220f0974f6b880e36c")
!768 = !DINamespace(name: "hint", scope: !81)
!769 = !DISubroutineType(types: !770)
!770 = !{null}
!771 = !DILocation(line: 2244, column: 21, scope: !772, inlinedAt: !775)
!772 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h305e73259a5d2adcE", scope: !774, file: !773, line: 2241, type: !769, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !27)
!773 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!774 = !DINamespace(name: "unreachable_unchecked", scope: !768)
!775 = distinct !DILocation(line: 104, column: 9, scope: !766)
!776 = !DILocation(line: 105, column: 9, scope: !766)
!777 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17h3b4e515c6df84f8fE", scope: !118, file: !778, line: 717, type: !779, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !797)
!778 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece39eca309c3b2a21b91ed3770bad24")
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !610, !444, !444, !270, !270}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !284, file: !2, size: 16, align: 8, elements: !782, templateParams: !27, identifier: "7b9495714949212c9fcd4ccc7691e7be")
!782 = !{!783}
!783 = !DICompositeType(tag: DW_TAG_variant_part, scope: !781, file: !2, size: 16, align: 8, elements: !784, templateParams: !27, identifier: "a9798088dc063caa5368a587679c5167", discriminator: !796)
!784 = !{!785, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !783, file: !2, baseType: !786, size: 16, align: 8, extraData: i64 0)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !781, file: !2, size: 16, align: 8, elements: !787, templateParams: !789, identifier: "d8ebcd5d7bb65782a5973b25068bbb17")
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !786, file: !2, baseType: !444, size: 8, align: 8, offset: 8)
!789 = !{!790, !791}
!790 = !DITemplateTypeParameter(name: "T", type: !444)
!791 = !DITemplateTypeParameter(name: "E", type: !444)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !783, file: !2, baseType: !793, size: 16, align: 8, extraData: i64 1)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !781, file: !2, size: 16, align: 8, elements: !794, templateParams: !789, identifier: "7ed78d51c656cad6ba2e6e6dc43c73f")
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !793, file: !2, baseType: !444, size: 8, align: 8, offset: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, scope: !781, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!797 = !{!798, !799, !800, !801, !802, !803, !805}
!798 = !DILocalVariable(name: "self", arg: 1, scope: !777, file: !778, line: 718, type: !610)
!799 = !DILocalVariable(name: "current", arg: 2, scope: !777, file: !778, line: 719, type: !444)
!800 = !DILocalVariable(name: "new", arg: 3, scope: !777, file: !778, line: 720, type: !444)
!801 = !DILocalVariable(name: "success", arg: 4, scope: !777, file: !778, line: 721, type: !270)
!802 = !DILocalVariable(name: "failure", arg: 5, scope: !777, file: !778, line: 722, type: !270)
!803 = !DILocalVariable(name: "x", scope: !804, file: !778, line: 728, type: !39, align: 1)
!804 = distinct !DILexicalBlock(scope: !777, file: !778, line: 728, column: 13)
!805 = !DILocalVariable(name: "x", scope: !806, file: !778, line: 729, type: !39, align: 1)
!806 = distinct !DILexicalBlock(scope: !777, file: !778, line: 729, column: 13)
!807 = !DILocation(line: 718, column: 9, scope: !777)
!808 = !DILocation(line: 719, column: 9, scope: !777)
!809 = !DILocation(line: 720, column: 9, scope: !777)
!810 = !DILocation(line: 721, column: 9, scope: !777)
!811 = !DILocation(line: 722, column: 9, scope: !777)
!812 = !DILocalVariable(name: "self", arg: 1, scope: !813, file: !580, line: 2005, type: !817)
!813 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h36fb2b190badd0f5E", scope: !121, file: !580, line: 2005, type: !814, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !124, retainedNodes: !818)
!814 = !DISubroutineType(types: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !121, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !{!812}
!819 = !DILocation(line: 2005, column: 22, scope: !813, inlinedAt: !820)
!820 = distinct !DILocation(line: 726, column: 42, scope: !777)
!821 = !DILocation(line: 726, column: 56, scope: !777)
!822 = !DILocation(line: 726, column: 71, scope: !777)
!823 = !DILocation(line: 726, column: 13, scope: !777)
!824 = !DILocation(line: 725, column: 15, scope: !777)
!825 = !DILocation(line: 725, column: 9, scope: !777)
!826 = !DILocation(line: 728, column: 16, scope: !777)
!827 = !DILocation(line: 728, column: 16, scope: !804)
!828 = !DILocation(line: 728, column: 25, scope: !804)
!829 = !DILocation(line: 728, column: 22, scope: !804)
!830 = !DILocation(line: 728, column: 31, scope: !777)
!831 = !DILocation(line: 729, column: 17, scope: !777)
!832 = !DILocation(line: 729, column: 17, scope: !806)
!833 = !DILocation(line: 729, column: 27, scope: !806)
!834 = !DILocation(line: 729, column: 23, scope: !806)
!835 = !DILocation(line: 729, column: 33, scope: !777)
!836 = !DILocation(line: 731, column: 6, scope: !777)
!837 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core4sync6atomic10AtomicBool3new17h476dcb71314211eeE", scope: !118, file: !778, line: 304, type: !838, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!118, !444}
!840 = !{!841}
!841 = !DILocalVariable(name: "v", arg: 1, scope: !837, file: !778, line: 304, type: !444)
!842 = !DILocation(line: 304, column: 22, scope: !837)
!843 = !DILocation(line: 305, column: 41, scope: !837)
!844 = !DILocalVariable(name: "value", arg: 1, scope: !845, file: !580, line: 1962, type: !39)
!845 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h61c812b23b3e130aE", scope: !121, file: !580, line: 1962, type: !846, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !124, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!121, !39}
!848 = !{!844}
!849 = !DILocation(line: 1962, column: 22, scope: !845, inlinedAt: !850)
!850 = distinct !DILocation(line: 305, column: 25, scope: !837)
!851 = !DILocation(line: 1963, column: 9, scope: !845, inlinedAt: !850)
!852 = !DILocation(line: 1964, column: 6, scope: !845, inlinedAt: !850)
!853 = !DILocation(line: 305, column: 9, scope: !837)
!854 = !DILocation(line: 306, column: 6, scope: !837)
!855 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17h46d2c3eac41e181cE", scope: !118, file: !778, line: 497, type: !856, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!444, !610, !270}
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "self", arg: 1, scope: !855, file: !778, line: 497, type: !610)
!860 = !DILocalVariable(name: "order", arg: 2, scope: !855, file: !778, line: 497, type: !270)
!861 = !DILocation(line: 497, column: 17, scope: !855)
!862 = !DILocation(line: 497, column: 24, scope: !855)
!863 = !DILocation(line: 2005, column: 22, scope: !813, inlinedAt: !864)
!864 = distinct !DILocation(line: 500, column: 30, scope: !855)
!865 = !DILocation(line: 500, column: 18, scope: !855)
!866 = !DILocation(line: 501, column: 6, scope: !855)
!867 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h872cfc68e38562deE", scope: !118, file: !778, line: 525, type: !868, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !610, !444, !270}
!870 = !{!871, !872, !873}
!871 = !DILocalVariable(name: "self", arg: 1, scope: !867, file: !778, line: 525, type: !610)
!872 = !DILocalVariable(name: "val", arg: 2, scope: !867, file: !778, line: 525, type: !444)
!873 = !DILocalVariable(name: "order", arg: 3, scope: !867, file: !778, line: 525, type: !270)
!874 = !DILocation(line: 525, column: 18, scope: !867)
!875 = !DILocation(line: 525, column: 25, scope: !867)
!876 = !DILocation(line: 525, column: 36, scope: !867)
!877 = !DILocation(line: 2005, column: 22, scope: !813, inlinedAt: !878)
!878 = distinct !DILocation(line: 529, column: 26, scope: !867)
!879 = !DILocation(line: 529, column: 40, scope: !867)
!880 = !DILocation(line: 529, column: 13, scope: !867)
!881 = !DILocation(line: 531, column: 6, scope: !867)
!882 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h267bf75ad55a800bE", scope: !78, file: !778, line: 2374, type: !883, scopeLine: 2374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !886)
!883 = !DISubroutineType(types: !884)
!884 = !{!9, !885, !9, !9, !270}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!886 = !{!887, !888, !889, !890, !891, !893}
!887 = !DILocalVariable(name: "self", arg: 1, scope: !882, file: !778, line: 2374, type: !885)
!888 = !DILocalVariable(name: "current", arg: 2, scope: !882, file: !778, line: 2375, type: !9)
!889 = !DILocalVariable(name: "new", arg: 3, scope: !882, file: !778, line: 2376, type: !9)
!890 = !DILocalVariable(name: "order", arg: 4, scope: !882, file: !778, line: 2377, type: !270)
!891 = !DILocalVariable(name: "x", scope: !892, file: !778, line: 2382, type: !9, align: 8)
!892 = distinct !DILexicalBlock(scope: !882, file: !778, line: 2382, column: 21)
!893 = !DILocalVariable(name: "x", scope: !894, file: !778, line: 2383, type: !9, align: 8)
!894 = distinct !DILexicalBlock(scope: !882, file: !778, line: 2383, column: 21)
!895 = !DILocation(line: 2374, column: 37, scope: !882)
!896 = !DILocation(line: 2375, column: 37, scope: !882)
!897 = !DILocation(line: 2376, column: 37, scope: !882)
!898 = !DILocation(line: 2377, column: 37, scope: !882)
!899 = !DILocation(line: 2381, column: 45, scope: !882)
!900 = !{i8 0, i8 5}
!901 = !DILocation(line: 2378, column: 23, scope: !882)
!902 = !{i64 0, i64 2}
!903 = !DILocation(line: 2378, column: 17, scope: !882)
!904 = !DILocation(line: 2382, column: 24, scope: !882)
!905 = !DILocation(line: 2382, column: 24, scope: !892)
!906 = !DILocation(line: 2382, column: 30, scope: !892)
!907 = !DILocation(line: 2382, column: 30, scope: !882)
!908 = !DILocation(line: 2383, column: 25, scope: !882)
!909 = !DILocation(line: 2383, column: 25, scope: !894)
!910 = !DILocation(line: 2383, column: 31, scope: !894)
!911 = !DILocation(line: 2383, column: 31, scope: !882)
!912 = !DILocation(line: 2385, column: 14, scope: !882)
!913 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17hcc4a552db537b063E", scope: !78, file: !778, line: 2428, type: !914, scopeLine: 2428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !931)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !885, !9, !9, !270, !270}
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !284, file: !2, size: 128, align: 64, elements: !917, templateParams: !27, identifier: "5579df6104a82f0c746794ad7f2aed62")
!917 = !{!918}
!918 = !DICompositeType(tag: DW_TAG_variant_part, scope: !916, file: !2, size: 128, align: 64, elements: !919, templateParams: !27, identifier: "7e508de376a90f54f3fcef7824c806a6", discriminator: !930)
!919 = !{!920, !926}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !918, file: !2, baseType: !921, size: 128, align: 64, extraData: i64 0)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !916, file: !2, size: 128, align: 64, elements: !922, templateParams: !924, identifier: "aca05aa4b9341eadc3e13899788bdf69")
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !921, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!924 = !{!89, !925}
!925 = !DITemplateTypeParameter(name: "E", type: !9)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !918, file: !2, baseType: !927, size: 128, align: 64, extraData: i64 1)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !916, file: !2, size: 128, align: 64, elements: !928, templateParams: !924, identifier: "70e806ef3110231932692cff225e8728")
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !927, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, scope: !916, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagArtificial)
!931 = !{!932, !933, !934, !935, !936}
!932 = !DILocalVariable(name: "self", arg: 1, scope: !913, file: !778, line: 2428, type: !885)
!933 = !DILocalVariable(name: "current", arg: 2, scope: !913, file: !778, line: 2429, type: !9)
!934 = !DILocalVariable(name: "new", arg: 3, scope: !913, file: !778, line: 2430, type: !9)
!935 = !DILocalVariable(name: "success", arg: 4, scope: !913, file: !778, line: 2431, type: !270)
!936 = !DILocalVariable(name: "failure", arg: 5, scope: !913, file: !778, line: 2432, type: !270)
!937 = !DILocation(line: 2428, column: 37, scope: !913)
!938 = !DILocation(line: 2429, column: 37, scope: !913)
!939 = !DILocation(line: 2430, column: 37, scope: !913)
!940 = !DILocation(line: 2431, column: 37, scope: !913)
!941 = !DILocation(line: 2432, column: 37, scope: !913)
!942 = !DILocalVariable(name: "self", arg: 1, scope: !943, file: !580, line: 2005, type: !947)
!943 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h8060627046c5f67cE", scope: !84, file: !580, line: 2005, type: !944, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !88, retainedNodes: !948)
!944 = !DISubroutineType(types: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !84, size: 64, align: 64, dwarfAddressSpace: 0)
!948 = !{!942}
!949 = !DILocation(line: 2005, column: 22, scope: !943, inlinedAt: !950)
!950 = distinct !DILocation(line: 2434, column: 50, scope: !913)
!951 = !DILocation(line: 2434, column: 26, scope: !913)
!952 = !DILocation(line: 2435, column: 14, scope: !913)
!953 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h39c658438044a703E", scope: !78, file: !778, line: 2261, type: !954, scopeLine: 2261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !956)
!954 = !DISubroutineType(types: !955)
!955 = !{!9, !885, !270}
!956 = !{!957, !958}
!957 = !DILocalVariable(name: "self", arg: 1, scope: !953, file: !778, line: 2261, type: !885)
!958 = !DILocalVariable(name: "order", arg: 2, scope: !953, file: !778, line: 2261, type: !270)
!959 = !DILocation(line: 2261, column: 25, scope: !953)
!960 = !DILocation(line: 2261, column: 32, scope: !953)
!961 = !DILocation(line: 2005, column: 22, scope: !943, inlinedAt: !962)
!962 = distinct !DILocation(line: 2263, column: 38, scope: !953)
!963 = !DILocation(line: 2263, column: 26, scope: !953)
!964 = !DILocation(line: 2264, column: 14, scope: !953)
!965 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h35184ac3957db2a1E", scope: !78, file: !778, line: 2288, type: !966, scopeLine: 2288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !885, !9, !270}
!968 = !{!969, !970, !971}
!969 = !DILocalVariable(name: "self", arg: 1, scope: !965, file: !778, line: 2288, type: !885)
!970 = !DILocalVariable(name: "val", arg: 2, scope: !965, file: !778, line: 2288, type: !9)
!971 = !DILocalVariable(name: "order", arg: 3, scope: !965, file: !778, line: 2288, type: !270)
!972 = !DILocation(line: 2288, column: 26, scope: !965)
!973 = !DILocation(line: 2288, column: 33, scope: !965)
!974 = !DILocation(line: 2288, column: 49, scope: !965)
!975 = !DILocation(line: 2005, column: 22, scope: !943, inlinedAt: !976)
!976 = distinct !DILocation(line: 2290, column: 39, scope: !965)
!977 = !DILocation(line: 2290, column: 26, scope: !965)
!978 = !DILocation(line: 2291, column: 14, scope: !965)
!979 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h8a99aebfe102f870E", scope: !79, file: !778, line: 3640, type: !769, scopeLine: 3640, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !27)
!980 = !DILocation(line: 175, column: 18, scope: !981, inlinedAt: !982)
!981 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17he5fd86094f85d608E", scope: !768, file: !767, line: 165, type: !769, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !27)
!982 = distinct !DILocation(line: 3641, column: 5, scope: !979)
!983 = !DILocation(line: 3642, column: 2, scope: !979)
!984 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h213803411c088841E", scope: !79, file: !778, line: 3129, type: !985, scopeLine: 3129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !27, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!270, !270}
!987 = !{!988}
!988 = !DILocalVariable(name: "order", arg: 1, scope: !984, file: !778, line: 3129, type: !270)
!989 = !DILocation(line: 3129, column: 31, scope: !984)
!990 = !DILocation(line: 3130, column: 11, scope: !984)
!991 = !DILocation(line: 3130, column: 5, scope: !984)
!992 = !DILocation(line: 3132, column: 20, scope: !984)
!993 = !DILocation(line: 3131, column: 20, scope: !984)
!994 = !DILocation(line: 3134, column: 20, scope: !984)
!995 = !DILocation(line: 3135, column: 19, scope: !984)
!996 = !DILocation(line: 3133, column: 19, scope: !984)
!997 = !DILocation(line: 3137, column: 2, scope: !984)
!998 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17h5f0550192a107b6cE", scope: !79, file: !778, line: 3262, type: !999, scopeLine: 3262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !124, retainedNodes: !1016)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !816, !39, !39, !270, !270}
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !284, file: !2, size: 16, align: 8, elements: !1002, templateParams: !27, identifier: "fc12dffd3b0d02484ca81ae1bda35649")
!1002 = !{!1003}
!1003 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1001, file: !2, size: 16, align: 8, elements: !1004, templateParams: !27, identifier: "36295286399fff6b9d4ed75a3f282e4f", discriminator: !1015)
!1004 = !{!1005, !1011}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !1003, file: !2, baseType: !1006, size: 16, align: 8, extraData: i64 0)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !1001, file: !2, size: 16, align: 8, elements: !1007, templateParams: !1009, identifier: "ef9e2cf66cb57a4fdcce5fe95af498ae")
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1006, file: !2, baseType: !39, size: 8, align: 8, offset: 8)
!1009 = !{!125, !1010}
!1010 = !DITemplateTypeParameter(name: "E", type: !39)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !1003, file: !2, baseType: !1012, size: 16, align: 8, extraData: i64 1)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !1001, file: !2, size: 16, align: 8, elements: !1013, templateParams: !1009, identifier: "5ed90018bb58fae96f0b033f2d9d7338")
!1013 = !{!1014}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1012, file: !2, baseType: !39, size: 8, align: 8, offset: 8)
!1015 = !DIDerivedType(tag: DW_TAG_member, scope: !1001, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1024}
!1017 = !DILocalVariable(name: "dst", arg: 1, scope: !998, file: !778, line: 3263, type: !816)
!1018 = !DILocalVariable(name: "old", arg: 2, scope: !998, file: !778, line: 3264, type: !39)
!1019 = !DILocalVariable(name: "new", arg: 3, scope: !998, file: !778, line: 3265, type: !39)
!1020 = !DILocalVariable(name: "success", arg: 4, scope: !998, file: !778, line: 3266, type: !270)
!1021 = !DILocalVariable(name: "failure", arg: 5, scope: !998, file: !778, line: 3267, type: !270)
!1022 = !DILocalVariable(name: "val", scope: !1023, file: !778, line: 3270, type: !39, align: 1)
!1023 = distinct !DILexicalBlock(scope: !998, file: !778, line: 3270, column: 5)
!1024 = !DILocalVariable(name: "ok", scope: !1023, file: !778, line: 3270, type: !444, align: 1)
!1025 = !DILocation(line: 3263, column: 5, scope: !998)
!1026 = !DILocation(line: 3264, column: 5, scope: !998)
!1027 = !DILocation(line: 3265, column: 5, scope: !998)
!1028 = !DILocation(line: 3266, column: 5, scope: !998)
!1029 = !DILocation(line: 3267, column: 5, scope: !998)
!1030 = !DILocation(line: 3271, column: 15, scope: !998)
!1031 = !DILocation(line: 3271, column: 9, scope: !998)
!1032 = !DILocation(line: 3284, column: 34, scope: !998)
!1033 = !DILocation(line: 3285, column: 34, scope: !998)
!1034 = !DILocation(line: 3286, column: 33, scope: !998)
!1035 = !DILocation(line: 3270, column: 10, scope: !998)
!1036 = !DILocation(line: 3270, column: 10, scope: !1023)
!1037 = !DILocation(line: 3270, column: 15, scope: !998)
!1038 = !DILocation(line: 3270, column: 15, scope: !1023)
!1039 = !DILocation(line: 3291, column: 8, scope: !1023)
!1040 = !DILocation(line: 3281, column: 34, scope: !998)
!1041 = !DILocation(line: 3282, column: 34, scope: !998)
!1042 = !DILocation(line: 3283, column: 33, scope: !998)
!1043 = !DILocation(line: 3275, column: 35, scope: !998)
!1044 = !DILocation(line: 3276, column: 35, scope: !998)
!1045 = !DILocation(line: 3277, column: 34, scope: !998)
!1046 = !DILocation(line: 3278, column: 35, scope: !998)
!1047 = !DILocation(line: 3279, column: 35, scope: !998)
!1048 = !DILocation(line: 3280, column: 34, scope: !998)
!1049 = !DILocation(line: 3272, column: 35, scope: !998)
!1050 = !DILocation(line: 3273, column: 35, scope: !998)
!1051 = !DILocation(line: 3274, column: 34, scope: !998)
!1052 = !DILocation(line: 3288, column: 29, scope: !998)
!1053 = !DILocation(line: 3287, column: 28, scope: !998)
!1054 = !DILocation(line: 3291, column: 30, scope: !1023)
!1055 = !DILocation(line: 3291, column: 5, scope: !1023)
!1056 = !DILocation(line: 3291, column: 13, scope: !1023)
!1057 = !DILocation(line: 3292, column: 2, scope: !998)
!1058 = distinct !DISubprogram(name: "as_ref<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17h88c5f84035046cceE", scope: !94, file: !1059, line: 675, type: !1060, scopeLine: 675, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !258, templateParams: !101, retainedNodes: !1077)
!1059 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "d6f90b4fba5d6fbabc4ac99b183a8294")
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1062, !1076}
