; ModuleID = '4q8zpo9akaypu2k4'
source_filename = "4q8zpo9akaypu2k4"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !29, identifier: "a00285579fbbc59b5b979a7976db07b3")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::fmt::Arguments", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !15, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !17, templateParams: !29, identifier: "5c0bf663e13aed18b42e27881fea807c")
!15 = !DINamespace(name: "fmt", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18, !31, !84}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !14, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !20, templateParams: !29, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!20 = !{!21, !30}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !24, templateParams: !29, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !23, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !14, file: !2, baseType: !32, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "256519899e0672ceeaebd48b858206cf")
!33 = !DINamespace(name: "option", scope: !16)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !32, file: !2, size: 128, align: 64, elements: !36, templateParams: !29, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !83)
!36 = !{!37, !79}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !35, file: !2, baseType: !38, size: 128, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !39, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "T", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !42, templateParams: !29, identifier: "24318146e6c8bdc87822ff535a36a389")
!42 = !{!43, !78}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !41, file: !2, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !46, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !29, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!46 = !DINamespace(name: "rt", scope: !15)
!47 = !{!48, !49, !51, !58, !60, !77}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !45, file: !2, baseType: !50, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !45, file: !2, baseType: !52, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !46, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !2, baseType: !59, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !45, file: !2, baseType: !61, size: 128, align: 64, flags: DIFlagPublic)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !62, templateParams: !29, identifier: "96b697dd48c62362a4fdd24d145e624f")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_variant_part, scope: !61, file: !2, size: 128, align: 64, elements: !64, templateParams: !29, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !75)
!64 = !{!65, !69, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !63, file: !2, baseType: !66, size: 128, align: 64, extraData: i128 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !29, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !63, file: !2, baseType: !70, size: 128, align: 64, extraData: i128 1)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !29, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !63, file: !2, baseType: !74, size: 128, align: 64, extraData: i128 2)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "a1add839f51aefefecdce3df6110b61f")
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!76 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !45, file: !2, baseType: !61, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !35, file: !2, baseType: !80, size: 128, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !39, identifier: "f965b304662f282235bb5dc25f3fae0f")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !2, baseType: !41, size: 128, align: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !32, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !2, baseType: !85, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !86, templateParams: !29, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!86 = !{!87, !149}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !2, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !90, templateParams: !29, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !89, file: !2, baseType: !92, size: 64, align: 64, flags: DIFlagPrivate)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !94, file: !2, align: 8, elements: !29, identifier: "fffd88202d364d3dc6423c86977eda88")
!94 = !DINamespace(name: "{extern#0}", scope: !46)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !89, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !92, !117}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !100, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !101, templateParams: !29, identifier: "27f960845886d02861ac4e7842c7e3a5")
!100 = !DINamespace(name: "result", scope: !16)
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_variant_part, scope: !99, file: !2, size: 8, align: 8, elements: !103, templateParams: !29, identifier: "66d489f599415104a0443264f219183e", discriminator: !116)
!103 = !{!104, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !102, file: !2, baseType: !105, size: 8, align: 8, extraData: i128 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !106, templateParams: !108, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "T", type: !7)
!110 = !DITemplateTypeParameter(name: "E", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !15, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !102, file: !2, baseType: !113, size: 8, align: 8, extraData: i128 1)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !114, templateParams: !108, identifier: "c5badd8093158a69d1e378abd358f888")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !2, baseType: !111, align: 8, offset: 8, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagArtificial)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !15, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !119, templateParams: !29, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!119 = !{!120, !121, !122, !123, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !2, baseType: !59, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !2, baseType: !50, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !52, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !118, file: !2, baseType: !124, size: 128, align: 64, flags: DIFlagPrivate)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !125, templateParams: !29, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !124, file: !2, size: 128, align: 64, elements: !127, templateParams: !29, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !136)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i128 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !130, identifier: "ae81ebe2a9866af8df117bed47adaee")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !9)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !133, size: 128, align: 64, extraData: i128 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !134, templateParams: !130, identifier: "a581ef88bb755022340fa98600955727")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !118, file: !2, baseType: !124, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !2, baseType: !139, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !140, templateParams: !29, identifier: "6607f9b055c62ce71a6a286c8014df9")
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !2, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !29, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !139, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3, lowerBound: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !153, vtableHolder: !23, templateParams: !29, identifier: "ed154bdd413ffeab42f0e27636dee894")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !152, file: !2, baseType: !6, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !152, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !161, vtableHolder: !59, templateParams: !29, identifier: "f85b3e45771706a9e9b43b40364b7716")
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !160, file: !2, baseType: !6, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !160, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !169, vtableHolder: !174, templateParams: !29, identifier: "3ce38d829cd8edca542b8021bf4ac8d1")
!169 = !{!170, !171, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !168, file: !2, baseType: !6, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !168, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !168, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !178, vtableHolder: !183, templateParams: !29, identifier: "553928fbc6925353ab616833209efccb")
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !177, file: !2, baseType: !6, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !177, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !177, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !184, templateParams: !29, identifier: "26d43a9b6d12b117751598b186fa5617")
!184 = !{!185, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !183, file: !2, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "e5b3057f7b10b8c52014a7991b8218cd")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !183, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !192, vtableHolder: !197, templateParams: !29, identifier: "bf0dbdf65223d98060cccd1045680e1c")
!192 = !{!193, !194, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !191, file: !2, baseType: !6, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !191, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !191, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !198, templateParams: !29, identifier: "b69fcac78aacc390de3151c1212a43c9")
!198 = !{!199}
!199 = !DICompositeType(tag: DW_TAG_variant_part, scope: !197, file: !2, size: 64, align: 64, elements: !200, templateParams: !29, identifier: "eb1fcac313ca09c387d2b4b3f7cfa24f", discriminator: !209)
!200 = !{!201, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !199, file: !2, baseType: !202, size: 64, align: 64, extraData: i128 0)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !203, identifier: "c814ef4e231fea575b667cbe44c9b49")
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !13)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !199, file: !2, baseType: !206, size: 64, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !197, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !207, templateParams: !203, identifier: "5a2547bb3159b3da1b809eabd7ff0377")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !13, size: 64, align: 64, flags: DIFlagPublic)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !213, vtableHolder: !218, templateParams: !29, identifier: "14704c63251a2906dbd0b528a495269")
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !212, file: !2, baseType: !6, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !212, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !222, templateParams: !29, identifier: "a313c32de3a8c9bc539767ad1b1d23fa")
!220 = !DINamespace(name: "location", scope: !221)
!221 = !DINamespace(name: "panic", scope: !16)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !219, file: !2, baseType: !23, size: 128, align: 64, flags: DIFlagPrivate)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !2, baseType: !59, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !229, vtableHolder: !234, templateParams: !29, identifier: "ad33a4b560891dcb9ee705ba28e17c27")
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !228, file: !2, baseType: !6, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !228, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!234 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !238, vtableHolder: !243, templateParams: !29, identifier: "eb383e1e2cdd0e7e41dfd1a0d381e57d")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !237, file: !2, baseType: !6, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !237, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "<vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "<vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !247, vtableHolder: !254, templateParams: !29, identifier: "761b2d764ccd3b5b9044a6b6c7ac6329")
!247 = !{!248, !249, !250, !251, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !246, file: !2, baseType: !6, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !255, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !256, templateParams: !29, identifier: "b0f29b4e731de200748a96c419b2014b")
!255 = !DINamespace(name: "vga", scope: null)
!256 = !{!257, !258, !266, !267, !285, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !254, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !254, file: !2, baseType: !259, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !260, templateParams: !29, identifier: "55c28ff37ad9e165233727d34ead0b72")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !259, file: !2, baseType: !262, size: 128, align: 64, flags: DIFlagPrivate)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !255, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !263, templateParams: !29, identifier: "d3caead7bce18958151699ca4bdc5246")
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !262, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !254, file: !2, baseType: !262, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !2, baseType: !268, size: 64, align: 64, flags: DIFlagPrivate)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !269, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !255, file: !2, size: 32000, align: 8, flags: DIFlagPrivate, elements: !270, templateParams: !29, identifier: "e6b677ce8937020c51adb0c996194102")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !269, file: !2, baseType: !272, size: 32000, align: 8, flags: DIFlagPrivate)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 32000, align: 8, elements: !283)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1280, align: 8, elements: !281)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !255, file: !2, size: 16, align: 8, flags: DIFlagPrivate, elements: !275, templateParams: !29, identifier: "222e81c2b39a79fb6c2702a5fabe9a27")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !274, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !274, file: !2, baseType: !278, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !255, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !279, templateParams: !29, identifier: "63816b86c1e17f936d69e131ef35e859")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !278, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!281 = !{!282}
!282 = !DISubrange(count: 80, lowerBound: 0)
!283 = !{!284}
!284 = !DISubrange(count: 25, lowerBound: 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !254, file: !2, baseType: !286, size: 8, align: 8, offset: 1664, flags: DIFlagPrivate)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !255, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !254, file: !2, baseType: !273, size: 1280, align: 8, offset: 384, flags: DIFlagPrivate)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17h1ac1acc185659e9bE", scope: !293, file: !295, line: 161, type: !296, isLocal: true, isDefinition: true, align: 8)
!293 = !DINamespace(name: "interrupts", scope: !294)
!294 = !DINamespace(name: "theo", scope: null)
!295 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !293, file: !2, align: 8, flags: DIFlagPrivate, elements: !297, templateParams: !29, identifier: "d6fdea390c9d33cb6a441f4c3efb69c4")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !296, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hc26398ed2d936919E", scope: !301, file: !304, line: 29, type: !305, isLocal: true, isDefinition: true, align: 128)
!301 = !DINamespace(name: "__stability", scope: !302)
!302 = !DINamespace(name: "deref", scope: !303)
!303 = !DINamespace(name: "{impl#0}", scope: !293)
!304 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !306, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !308, templateParams: !334, identifier: "75b2a153b241725a5a0bf908eb81153a")
!306 = !DINamespace(name: "lazy", scope: !307)
!307 = !DINamespace(name: "lazy_static", scope: null)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !310, size: 33024, align: 128, flags: DIFlagPrivate)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !311, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !313, templateParams: !334, identifier: "a691d7dff4b3ff8f9b48680a471e73a1")
!311 = !DINamespace(name: "once", scope: !312)
!312 = !DINamespace(name: "spin", scope: null)
!313 = !{!314, !324}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !2, baseType: !315, size: 64, align: 64, offset: 32896, flags: DIFlagPrivate)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !316, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !318, templateParams: !29, identifier: "8af730207cd32b025ecf7ee7343d73a2")
!316 = !DINamespace(name: "atomic", scope: !317)
!317 = !DINamespace(name: "sync", scope: !16)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !315, file: !2, baseType: !320, size: 64, align: 64, flags: DIFlagPrivate)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !321, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !322, templateParams: !130, identifier: "84d58981b30d111f1b59e7c4c4da7d09")
!321 = !DINamespace(name: "cell", scope: !16)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !320, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !2, baseType: !325, size: 32896, align: 128, flags: DIFlagPrivate)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !321, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !326, templateParams: !494, identifier: "ca6f1122c7650659e71b9c2f032eb243")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !2, baseType: !328, size: 32896, align: 128, flags: DIFlagPrivate)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !33, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !329, templateParams: !29, identifier: "354b0645d27ff40dff8fc02c230a9b1")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !2, size: 32896, align: 128, elements: !331, templateParams: !29, identifier: "a467e06d4da6e5f3fc886aea70cef603", discriminator: !493)
!331 = !{!332, !489}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !330, file: !2, baseType: !333, size: 32896, align: 128, extraData: i128 2)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !328, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !29, templateParams: !334, identifier: "3b2296ebc9aa7fac6a09d557b9dc7028")
!334 = !{!335}
!335 = !DITemplateTypeParameter(name: "T", type: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !337, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !339, templateParams: !29, identifier: "91d5636955a289641f4c1204d1806efa")
!337 = !DINamespace(name: "interrupt_descriptor_table", scope: !338)
!338 = !DINamespace(name: "cpu_interrupts", scope: null)
!339 = !{!340, !486, !487, !488}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !336, file: !2, baseType: !341, size: 32768, align: 128, flags: DIFlagPrivate)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !342, file: !2, size: 32768, align: 128, flags: DIFlagPublic, elements: !345, templateParams: !29, identifier: "b390c7729da8230dab9ef897adf3b7ab")
!342 = !DINamespace(name: "idt", scope: !343)
!343 = !DINamespace(name: "structures", scope: !344)
!344 = !DINamespace(name: "x86_64", scope: null)
!345 = !{!346, !383, !384, !385, !386, !387, !388, !389, !390, !409, !410, !428, !429, !430, !431, !452, !453, !454, !455, !473, !474, !475, !479, !480, !481, !482}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !341, file: !2, baseType: !347, size: 128, align: 32, flags: DIFlagPublic)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !342, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !348, templateParams: !381, identifier: "7d69ff47a6aee51238b84f1843d814d0")
!348 = !{!349, !351, !352, !356, !357, !358, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !347, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!350 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !347, file: !2, baseType: !350, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !347, file: !2, baseType: !353, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !342, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !354, templateParams: !29, identifier: "8f45d1028d32c5aa451bf13b17c6a918")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !353, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !347, file: !2, baseType: !350, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !347, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !347, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !347, file: !2, baseType: !360, align: 8, offset: 128, flags: DIFlagPrivate)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !362, identifier: "cec9c03a86d186c45f8c8371eadd9b69")
!361 = !DINamespace(name: "marker", scope: !16)
!362 = !{!363}
!363 = !DITemplateTypeParameter(name: "T", type: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367}
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !342, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !368, templateParams: !29, identifier: "8b23b7905e012bfb81ef897593cb8bb")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !2, baseType: !370, size: 320, align: 64, flags: DIFlagPrivate)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !342, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !371, templateParams: !29, identifier: "fb943ac64aa7be6a1cf16aaaf2128de7")
!371 = !{!372, !377, !378, !379, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !370, file: !2, baseType: !373, size: 64, align: 64, flags: DIFlagPublic)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !374, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !375, templateParams: !29, identifier: "e2f5a87bae0862b07d53d947247abc30")
!374 = !DINamespace(name: "addr", scope: !344)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !373, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !370, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !370, file: !2, baseType: !76, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !370, file: !2, baseType: !373, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !370, file: !2, baseType: !76, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!381 = !{!382}
!382 = !DITemplateTypeParameter(name: "F", type: !364)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 128, flags: DIFlagPublic)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 256, flags: DIFlagPublic)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 384, flags: DIFlagPublic)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 512, flags: DIFlagPublic)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 640, flags: DIFlagPublic)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 768, flags: DIFlagPublic)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 896, flags: DIFlagPublic)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !341, file: !2, baseType: !391, size: 128, align: 32, offset: 1024, flags: DIFlagPublic)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !342, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !392, templateParams: !407, identifier: "4136fad39c91162061ac0c1719de1991")
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !391, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !391, file: !2, baseType: !350, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !391, file: !2, baseType: !353, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !391, file: !2, baseType: !350, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !391, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !391, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !391, file: !2, baseType: !400, align: 8, offset: 128, flags: DIFlagPrivate)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !401, identifier: "68c857415b547acb5d8ceb44842319b7")
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !404, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !367, !76}
!406 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "F", type: !403)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 1152, flags: DIFlagPrivate)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 1280, flags: DIFlagPublic)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !342, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !412, templateParams: !426, identifier: "9957fff5581b78b12838df0b921b0d62")
!412 = !{!413, !414, !415, !416, !417, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !411, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !411, file: !2, baseType: !350, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !411, file: !2, baseType: !353, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !411, file: !2, baseType: !350, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !411, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !411, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !411, file: !2, baseType: !420, align: 8, offset: 128, flags: DIFlagPrivate)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !421, identifier: "4517952076a9a090a9c576f35ab9ff4")
!421 = !{!422}
!422 = !DITemplateTypeParameter(name: "T", type: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !367, !76}
!426 = !{!427}
!427 = !DITemplateTypeParameter(name: "F", type: !423)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 1408, flags: DIFlagPublic)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 1536, flags: DIFlagPublic)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 1664, flags: DIFlagPublic)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !341, file: !2, baseType: !432, size: 128, align: 32, offset: 1792, flags: DIFlagPublic)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !342, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !433, templateParams: !450, identifier: "a5e3fde7dfb99bbf978c4079136181f5")
!433 = !{!434, !435, !436, !437, !438, !439, !440}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !432, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !432, file: !2, baseType: !350, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !432, file: !2, baseType: !353, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !432, file: !2, baseType: !350, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !432, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !432, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !432, file: !2, baseType: !441, align: 8, offset: 128, flags: DIFlagPrivate)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !442, identifier: "fa04cee00e5f5d152dcdca0dc5cbbc7d")
!442 = !{!443}
!443 = !DITemplateTypeParameter(name: "T", type: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !445, size: 64, align: 64, dwarfAddressSpace: 0)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !367, !447}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !342, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !448, templateParams: !29, identifier: "f2efc38f5359375da910df8fb1c92566")
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !447, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!450 = !{!451}
!451 = !DITemplateTypeParameter(name: "F", type: !444)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 1920, flags: DIFlagPrivate)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 2048, flags: DIFlagPublic)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 2176, flags: DIFlagPublic)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !341, file: !2, baseType: !456, size: 128, align: 32, offset: 2304, flags: DIFlagPublic)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !342, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !457, templateParams: !471, identifier: "fae063fcf5d63148a1fb7bd90167e67f")
!457 = !{!458, !459, !460, !461, !462, !463, !464}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !456, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !456, file: !2, baseType: !350, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !456, file: !2, baseType: !353, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !456, file: !2, baseType: !350, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !456, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !456, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !456, file: !2, baseType: !465, align: 8, offset: 128, flags: DIFlagPrivate)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !466, identifier: "bc7371bbb6c4c3aa0fc13b06a57bc7")
!466 = !{!467}
!467 = !DITemplateTypeParameter(name: "T", type: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !469, size: 64, align: 64, dwarfAddressSpace: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!406, !367}
!471 = !{!472}
!472 = !DITemplateTypeParameter(name: "F", type: !468)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 2432, flags: DIFlagPublic)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 2560, flags: DIFlagPublic)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !341, file: !2, baseType: !476, size: 1024, align: 32, offset: 2688, flags: DIFlagPrivate)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 1024, align: 32, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 8, lowerBound: 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 3712, flags: DIFlagPublic)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !341, file: !2, baseType: !411, size: 128, align: 32, offset: 3840, flags: DIFlagPublic)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !341, file: !2, baseType: !347, size: 128, align: 32, offset: 3968, flags: DIFlagPrivate)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !341, file: !2, baseType: !483, size: 28672, align: 32, offset: 4096, flags: DIFlagPrivate)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 28672, align: 32, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 224, lowerBound: 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !336, file: !2, baseType: !234, size: 8, align: 8, offset: 32768, flags: DIFlagPrivate)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !336, file: !2, baseType: !234, size: 8, align: 8, offset: 32776, flags: DIFlagPrivate)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !336, file: !2, baseType: !234, size: 8, align: 8, offset: 32784, flags: DIFlagPrivate)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !330, file: !2, baseType: !490, size: 32896, align: 128)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !328, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !491, templateParams: !334, identifier: "d9101b717d93cde3fbd4631744fc6204")
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !490, file: !2, baseType: !336, size: 32896, align: 128, flags: DIFlagPublic)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !2, baseType: !27, size: 8, align: 8, offset: 32784, flags: DIFlagArtificial)
!494 = !{!495}
!495 = !DITemplateTypeParameter(name: "T", type: !328)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17hc1810a588d887de4E", scope: !498, file: !295, line: 161, type: !499, isLocal: true, isDefinition: true, align: 8)
!498 = !DINamespace(name: "peripherals", scope: !294)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !498, file: !2, align: 8, flags: DIFlagPublic, elements: !500, templateParams: !29, identifier: "af37734e1c0a3e5d7074420b9bb0d7b0")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !499, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h77568ecfdc405642E", scope: !504, file: !304, line: 29, type: !507, isLocal: true, isDefinition: true, align: 64)
!504 = !DINamespace(name: "__stability", scope: !505)
!505 = !DINamespace(name: "deref", scope: !506)
!506 = !DINamespace(name: "{impl#0}", scope: !498)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !306, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !508, templateParams: !523, identifier: "68990e07b879a12092edb114ab5b22ba")
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !507, file: !2, baseType: !510, size: 1920, align: 64, flags: DIFlagPrivate)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !311, file: !2, size: 1920, align: 64, flags: DIFlagPublic, elements: !511, templateParams: !523, identifier: "5327ae29e64ec51d9ad08d941303c453")
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !510, file: !2, baseType: !315, size: 64, align: 64, flags: DIFlagPrivate)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !510, file: !2, baseType: !514, size: 1856, align: 64, offset: 64, flags: DIFlagPrivate)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !321, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !515, templateParams: !560, identifier: "f0a5b886bd1dc2a08b0c506a82f8f614")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !514, file: !2, baseType: !517, size: 1856, align: 64, flags: DIFlagPrivate)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !33, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !518, templateParams: !29, identifier: "2eee223f61ac0dc870e6b26317f59c72")
!518 = !{!519}
!519 = !DICompositeType(tag: DW_TAG_variant_part, scope: !517, file: !2, size: 1856, align: 64, elements: !520, templateParams: !29, identifier: "6059d918d8074f8eaaad2d9931a9b608", discriminator: !559)
!520 = !{!521, !555}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !519, file: !2, baseType: !522, size: 1856, align: 64, extraData: i128 0)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !517, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !523, identifier: "ed7087efdd62ac4ace15329883aae2c0")
!523 = !{!524}
!524 = !DITemplateTypeParameter(name: "T", type: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !526, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !527, templateParams: !553, identifier: "6131ad82e168e59be6a79233f536752")
!526 = !DINamespace(name: "mutex", scope: !312)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !525, file: !2, baseType: !529, size: 1792, align: 64, flags: DIFlagPrivate)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !530, file: !2, size: 1792, align: 64, flags: DIFlagPublic, elements: !531, templateParams: !553, identifier: "8ff1cf9282c461f05e1d64de4d147bbb")
!530 = !DINamespace(name: "spin", scope: !526)
!531 = !{!532, !538, !547}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !529, file: !2, baseType: !533, align: 8, flags: DIFlagPrivate)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !534, identifier: "53842080da807efe2f66a57cfa1dc2b2")
!534 = !{!535}
!535 = !DITemplateTypeParameter(name: "T", type: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !537, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "5c2b14cd1865fd0d8746459878c1381f")
!537 = !DINamespace(name: "relax", scope: !312)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !529, file: !2, baseType: !539, size: 8, align: 8, flags: DIFlagProtected)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !316, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !540, templateParams: !29, identifier: "e51bf8fd8b9e62c7945e950556c29af3")
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !539, file: !2, baseType: !542, size: 8, align: 8, flags: DIFlagPrivate)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !321, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !543, templateParams: !545, identifier: "8c2d30510cc7853b3fcfadd821ad3c4")
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !542, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!545 = !{!546}
!546 = !DITemplateTypeParameter(name: "T", type: !27)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !2, baseType: !548, size: 1728, align: 64, offset: 64, flags: DIFlagPrivate)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !321, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !549, templateParams: !551, identifier: "21d30a8a16882960dfd5e0a673e1ad37")
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !548, file: !2, baseType: !254, size: 1728, align: 64, flags: DIFlagPrivate)
!551 = !{!552}
!552 = !DITemplateTypeParameter(name: "T", type: !254)
!553 = !{!552, !554}
!554 = !DITemplateTypeParameter(name: "R", type: !536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !519, file: !2, baseType: !556, size: 1856, align: 64, extraData: i128 1)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !517, file: !2, size: 1856, align: 64, flags: DIFlagPublic, elements: !557, templateParams: !523, identifier: "369bf12582a11a538cc7474b4654e14d")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !556, file: !2, baseType: !525, size: 1792, align: 64, offset: 64, flags: DIFlagPublic)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!560 = !{!561}
!561 = !DITemplateTypeParameter(name: "T", type: !517)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "KEYBOARD", linkageName: "_ZN4theo11peripherals8KEYBOARD17hdd5aaea41ee0f11fE", scope: !498, file: !295, line: 161, type: !564, isLocal: true, isDefinition: true, align: 8)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "KEYBOARD", scope: !498, file: !2, align: 8, flags: DIFlagPublic, elements: !565, templateParams: !29, identifier: "706330793473d9c18db2c346f68049b9")
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !564, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN71_$LT$theo..peripherals..KEYBOARD$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hcac565c7769aff03E", scope: !569, file: !304, line: 29, type: !572, isLocal: true, isDefinition: true, align: 64)
!569 = !DINamespace(name: "__stability", scope: !570)
!570 = !DINamespace(name: "deref", scope: !571)
!571 = !DINamespace(name: "{impl#2}", scope: !498)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !306, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !573, templateParams: !588, identifier: "d399d471aab8a1c592f76e80b12d5a02")
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !572, file: !2, baseType: !575, size: 256, align: 64, flags: DIFlagPrivate)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !311, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !576, templateParams: !588, identifier: "8d89d3c41f4a14986f8b54e0297a1fc3")
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !575, file: !2, baseType: !315, size: 64, align: 64, flags: DIFlagPrivate)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !575, file: !2, baseType: !579, size: 160, align: 16, offset: 64, flags: DIFlagPrivate)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>>", scope: !321, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !580, templateParams: !681, identifier: "94494947220a25c39e402e5f3b1388d")
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !579, file: !2, baseType: !582, size: 160, align: 16, flags: DIFlagPrivate)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !33, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !583, templateParams: !29, identifier: "b562e4a3f6e66cf9d596512209a82aef")
!583 = !{!584}
!584 = !DICompositeType(tag: DW_TAG_variant_part, scope: !582, file: !2, size: 160, align: 16, elements: !585, templateParams: !29, identifier: "3c7a2ac68042ec94e63570d603060cc2", discriminator: !680)
!585 = !{!586, !676}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !584, file: !2, baseType: !587, size: 160, align: 16, extraData: i128 0)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !582, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !588, identifier: "51e6c61441289d4561b0bbf04a3770f")
!588 = !{!589}
!589 = !DITemplateTypeParameter(name: "T", type: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !526, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !591, templateParams: !675, identifier: "7b1354053001aeb6df57f48dd0d09f9e")
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !590, file: !2, baseType: !593, size: 144, align: 16, flags: DIFlagPrivate)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !530, file: !2, size: 144, align: 16, flags: DIFlagPublic, elements: !594, templateParams: !675, identifier: "156301b46d662d36da3d92da3909cfb0")
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !593, file: !2, baseType: !533, align: 8, flags: DIFlagPrivate)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !593, file: !2, baseType: !539, size: 8, align: 8, flags: DIFlagProtected)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !2, baseType: !598, size: 128, align: 16, offset: 16, flags: DIFlagPrivate)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>>", scope: !321, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !599, templateParams: !673, identifier: "eb0faad7a939d8bc8f140e2fb4557371")
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !598, file: !2, baseType: !601, size: 128, align: 16, flags: DIFlagPrivate)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !602, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !603, templateParams: !652, identifier: "11e732a97794238dd013a7ef2d8bd681")
!602 = !DINamespace(name: "keyboard", scope: null)
!603 = !{!604, !654}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !601, file: !2, baseType: !605, size: 112, align: 16, flags: DIFlagPrivate)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !606, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !607, templateParams: !652, identifier: "abf251e657e54cf5e8b002c9ff21b1e")
!606 = !DINamespace(name: "pc_keyboard", scope: null)
!607 = !{!608, !613, !627}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ps2_decoder", scope: !605, file: !2, baseType: !609, size: 32, align: 16, flags: DIFlagPrivate)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ps2Decoder", scope: !606, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !610, templateParams: !29, identifier: "d85924e431171d18eba68bbe61c0d")
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !609, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !609, file: !2, baseType: !27, size: 8, align: 8, offset: 16, flags: DIFlagPrivate)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "scancode_set", scope: !605, file: !2, baseType: !614, size: 8, align: 8, offset: 104, flags: DIFlagPrivate)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScancodeSet1", scope: !615, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !617, templateParams: !29, identifier: "e3fd471ede10693cde7430641b890c7e")
!615 = !DINamespace(name: "set1", scope: !616)
!616 = !DINamespace(name: "scancodes", scope: !606)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !614, file: !2, baseType: !619, size: 8, align: 8, flags: DIFlagPrivate)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !606, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626}
!621 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!622 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!623 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!624 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!625 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "event_decoder", scope: !605, file: !2, baseType: !628, size: 72, align: 8, offset: 32, flags: DIFlagPrivate)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventDecoder<pc_keyboard::layouts::us104::Us104Key>", scope: !606, file: !2, size: 72, align: 8, flags: DIFlagPublic, elements: !629, templateParams: !650, identifier: "b80c6890a7cf541d26a657e8c458e255")
!629 = !{!630, !635, !646}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "handle_ctrl", scope: !628, file: !2, baseType: !631, size: 8, align: 8, flags: DIFlagPrivate)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !606, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !632)
!632 = !{!633, !634}
!633 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!634 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !628, file: !2, baseType: !636, size: 64, align: 8, offset: 8, flags: DIFlagPrivate)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !606, file: !2, size: 64, align: 8, flags: DIFlagPublic, elements: !637, templateParams: !29, identifier: "77eac88685bbad97631348bca770dfae")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !636, file: !2, baseType: !234, size: 8, align: 8, flags: DIFlagPublic)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 16, flags: DIFlagPublic)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 24, flags: DIFlagPublic)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 48, flags: DIFlagPublic)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !636, file: !2, baseType: !234, size: 8, align: 8, offset: 56, flags: DIFlagPublic)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !628, file: !2, baseType: !647, align: 8, offset: 72, flags: DIFlagPrivate)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !648, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "95bafa42dce54244279674cd130c65fd")
!648 = !DINamespace(name: "us104", scope: !649)
!649 = !DINamespace(name: "layouts", scope: !606)
!650 = !{!651}
!651 = !DITemplateTypeParameter(name: "L", type: !647)
!652 = !{!651, !653}
!653 = !DITemplateTypeParameter(name: "S", type: !614)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !601, file: !2, baseType: !655, size: 16, align: 16, offset: 112, flags: DIFlagPrivate)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !656, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !658, templateParams: !671, identifier: "582de59b7758960a4fc1f2fde452c5f5")
!656 = !DINamespace(name: "port", scope: !657)
!657 = !DINamespace(name: "instructions", scope: !344)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !655, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !655, file: !2, baseType: !661, align: 8, offset: 16, flags: DIFlagPrivate)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !662, identifier: "e01e6f45252ac9ed118fe1f3a7ae33e1")
!662 = !{!663}
!663 = !DITemplateTypeParameter(name: "T", type: !664)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !665, templateParams: !29, identifier: "f1936dd1b81bd591b65cfc62296d865d")
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !664, file: !2, baseType: !27, size: 8, align: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !664, file: !2, baseType: !668, align: 8, offset: 8)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !656, file: !2, align: 8, flags: DIFlagPublic, elements: !669, templateParams: !29, identifier: "b89315aa149aed7bb45d1f2b7ae4eb33")
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !668, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!671 = !{!546, !672}
!672 = !DITemplateTypeParameter(name: "A", type: !668)
!673 = !{!674}
!674 = !DITemplateTypeParameter(name: "T", type: !601)
!675 = !{!674, !554}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !584, file: !2, baseType: !677, size: 160, align: 16, extraData: i128 1)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !582, file: !2, size: 160, align: 16, flags: DIFlagPublic, elements: !678, templateParams: !588, identifier: "13eec173c6ca5a6d5076ed95a9392b")
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !677, file: !2, baseType: !590, size: 144, align: 16, offset: 16, flags: DIFlagPublic)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !582, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagArtificial)
!681 = !{!682}
!682 = !DITemplateTypeParameter(name: "T", type: !582)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h5aac5f6013f74e18E", scope: !685, file: !295, line: 161, type: !686, isLocal: true, isDefinition: true, align: 8)
!685 = !DINamespace(name: "serial", scope: !294)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !685, file: !2, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !29, identifier: "be88bbb7079779a359320092db122c70")
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !686, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h58ab21f7479712ddE", scope: !691, file: !304, line: 29, type: !694, isLocal: true, isDefinition: true, align: 64)
!691 = !DINamespace(name: "__stability", scope: !692)
!692 = !DINamespace(name: "deref", scope: !693)
!693 = !DINamespace(name: "{impl#0}", scope: !685)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !306, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !695, templateParams: !710, identifier: "a3f33b286c5033a248271f5298f41808")
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !694, file: !2, baseType: !697, size: 192, align: 64, flags: DIFlagPrivate)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !311, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !698, templateParams: !710, identifier: "e5b5c5c8b7ef109635371eca79b9edc7")
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !697, file: !2, baseType: !315, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !2, baseType: !701, size: 128, align: 16, flags: DIFlagPrivate)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !321, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !702, templateParams: !773, identifier: "82421cd1400d8ed43af897111a110f9b")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !701, file: !2, baseType: !704, size: 128, align: 16, flags: DIFlagPrivate)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !33, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !705, templateParams: !29, identifier: "8195f31aa47fc3277ba8fc876ea44529")
!705 = !{!706}
!706 = !DICompositeType(tag: DW_TAG_variant_part, scope: !704, file: !2, size: 128, align: 16, elements: !707, templateParams: !29, identifier: "af000b5fcd6cf00f26405c5a9b3715f0", discriminator: !772)
!707 = !{!708, !768}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !706, file: !2, baseType: !709, size: 128, align: 16, extraData: i128 0)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !704, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !29, templateParams: !710, identifier: "5bc991f256099f91d190cac045d6ceeb")
!710 = !{!711}
!711 = !DITemplateTypeParameter(name: "T", type: !712)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !526, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !713, templateParams: !767, identifier: "a0c016871505c701ef7f7d2c992250be")
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !712, file: !2, baseType: !715, size: 112, align: 16, flags: DIFlagPrivate)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !530, file: !2, size: 112, align: 16, flags: DIFlagPublic, elements: !716, templateParams: !767, identifier: "b76ae6ccc6681e76e8be84fb1591e0a8")
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !715, file: !2, baseType: !533, align: 8, flags: DIFlagPrivate)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !715, file: !2, baseType: !539, size: 8, align: 8, flags: DIFlagProtected)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !715, file: !2, baseType: !720, size: 96, align: 16, offset: 16, flags: DIFlagPrivate)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !321, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !721, templateParams: !765, identifier: "11ffbb18b189ec15a554e186f90c9c50")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !720, file: !2, baseType: !723, size: 96, align: 16, flags: DIFlagPrivate)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !724, file: !2, size: 96, align: 16, flags: DIFlagPublic, elements: !726, templateParams: !29, identifier: "cd2cfab81fd30006b3224a86e091d4be")
!724 = !DINamespace(name: "port", scope: !725)
!725 = !DINamespace(name: "uart_16550", scope: null)
!726 = !{!727, !728, !745, !746, !747, !748}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !2, baseType: !655, size: 16, align: 16, flags: DIFlagPrivate)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !723, file: !2, baseType: !729, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !656, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !730, templateParams: !743, identifier: "88c92a8e9019782092fca4c78aa0b528")
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !729, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !729, file: !2, baseType: !733, align: 8, offset: 16, flags: DIFlagPrivate)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !734, identifier: "f972d392d77f37eafcc38aac8d2e8318")
!734 = !{!735}
!735 = !DITemplateTypeParameter(name: "T", type: !736)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !737, templateParams: !29, identifier: "a24d581725eb8ad9f2ac5ba2c0a69f75")
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !27, size: 8, align: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !736, file: !2, baseType: !740, align: 8, offset: 8)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !656, file: !2, align: 8, flags: DIFlagPublic, elements: !741, templateParams: !29, identifier: "93060aa4846019eb67e0293fa512085a")
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !740, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!743 = !{!546, !744}
!744 = !DITemplateTypeParameter(name: "A", type: !740)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !723, file: !2, baseType: !729, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !723, file: !2, baseType: !729, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !723, file: !2, baseType: !729, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !723, file: !2, baseType: !749, size: 16, align: 16, offset: 80, flags: DIFlagPrivate)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !656, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !750, templateParams: !763, identifier: "d2fbebe20fdc1c5c321af2880a42e10")
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !749, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagPrivate)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !749, file: !2, baseType: !753, align: 8, offset: 16, flags: DIFlagPrivate)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !361, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !754, identifier: "b51d4980c6e0f9b69552145a2b7358")
!754 = !{!755}
!755 = !DITemplateTypeParameter(name: "T", type: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !757, templateParams: !29, identifier: "b921d515426e36c7aa3e78a67219675c")
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !756, file: !2, baseType: !27, size: 8, align: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !756, file: !2, baseType: !760, align: 8, offset: 8)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !656, file: !2, align: 8, flags: DIFlagPublic, elements: !761, templateParams: !29, identifier: "a3de672240f2b26328cdf7ee4626ba68")
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !760, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!763 = !{!546, !764}
!764 = !DITemplateTypeParameter(name: "A", type: !760)
!765 = !{!766}
!766 = !DITemplateTypeParameter(name: "T", type: !723)
!767 = !{!766, !554}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !706, file: !2, baseType: !769, size: 128, align: 16, extraData: i128 1)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !704, file: !2, size: 128, align: 16, flags: DIFlagPublic, elements: !770, templateParams: !710, identifier: "c8d56c7b3b1e524ef630b0345d7def3c")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !769, file: !2, baseType: !712, size: 112, align: 16, offset: 16, flags: DIFlagPublic)
!772 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !2, baseType: !350, size: 16, align: 16, flags: DIFlagArtificial)
!773 = !{!774}
!774 = !DITemplateTypeParameter(name: "T", type: !704)
!775 = !{i32 8, !"PIC Level", i32 2}
!776 = !{i32 7, !"PIE Level", i32 2}
!777 = !{i32 2, !"Dwarf Version", i32 4}
!778 = !{i32 2, !"Debug Info Version", i32 3}
!779 = !{!"rustc version 1.77.0-nightly (bf8716f1c 2023-12-24)"}
!780 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !781, producer: "clang LLVM (rustc version 1.77.0-nightly (bf8716f1c 2023-12-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, globals: !928, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "src/main.rs/@/4q8zpo9akaypu2k4", directory: "/Users/yaw/self/theo")
!782 = !{!286, !619, !631, !783, !909, !914, !52, !921}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyCode", scope: !606, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!785 = !DIEnumerator(name: "Escape", value: 0, isUnsigned: true)
!786 = !DIEnumerator(name: "F1", value: 1, isUnsigned: true)
!787 = !DIEnumerator(name: "F2", value: 2, isUnsigned: true)
!788 = !DIEnumerator(name: "F3", value: 3, isUnsigned: true)
!789 = !DIEnumerator(name: "F4", value: 4, isUnsigned: true)
!790 = !DIEnumerator(name: "F5", value: 5, isUnsigned: true)
!791 = !DIEnumerator(name: "F6", value: 6, isUnsigned: true)
!792 = !DIEnumerator(name: "F7", value: 7, isUnsigned: true)
!793 = !DIEnumerator(name: "F8", value: 8, isUnsigned: true)
!794 = !DIEnumerator(name: "F9", value: 9, isUnsigned: true)
!795 = !DIEnumerator(name: "F10", value: 10, isUnsigned: true)
!796 = !DIEnumerator(name: "F11", value: 11, isUnsigned: true)
!797 = !DIEnumerator(name: "F12", value: 12, isUnsigned: true)
!798 = !DIEnumerator(name: "PrintScreen", value: 13, isUnsigned: true)
!799 = !DIEnumerator(name: "SysRq", value: 14, isUnsigned: true)
!800 = !DIEnumerator(name: "ScrollLock", value: 15, isUnsigned: true)
!801 = !DIEnumerator(name: "PauseBreak", value: 16, isUnsigned: true)
!802 = !DIEnumerator(name: "Oem8", value: 17, isUnsigned: true)
!803 = !DIEnumerator(name: "Key1", value: 18, isUnsigned: true)
!804 = !DIEnumerator(name: "Key2", value: 19, isUnsigned: true)
!805 = !DIEnumerator(name: "Key3", value: 20, isUnsigned: true)
!806 = !DIEnumerator(name: "Key4", value: 21, isUnsigned: true)
!807 = !DIEnumerator(name: "Key5", value: 22, isUnsigned: true)
!808 = !DIEnumerator(name: "Key6", value: 23, isUnsigned: true)
!809 = !DIEnumerator(name: "Key7", value: 24, isUnsigned: true)
!810 = !DIEnumerator(name: "Key8", value: 25, isUnsigned: true)
!811 = !DIEnumerator(name: "Key9", value: 26, isUnsigned: true)
!812 = !DIEnumerator(name: "Key0", value: 27, isUnsigned: true)
!813 = !DIEnumerator(name: "OemMinus", value: 28, isUnsigned: true)
!814 = !DIEnumerator(name: "OemPlus", value: 29, isUnsigned: true)
!815 = !DIEnumerator(name: "Backspace", value: 30, isUnsigned: true)
!816 = !DIEnumerator(name: "Insert", value: 31, isUnsigned: true)
!817 = !DIEnumerator(name: "Home", value: 32, isUnsigned: true)
!818 = !DIEnumerator(name: "PageUp", value: 33, isUnsigned: true)
!819 = !DIEnumerator(name: "NumpadLock", value: 34, isUnsigned: true)
!820 = !DIEnumerator(name: "NumpadDivide", value: 35, isUnsigned: true)
!821 = !DIEnumerator(name: "NumpadMultiply", value: 36, isUnsigned: true)
!822 = !DIEnumerator(name: "NumpadSubtract", value: 37, isUnsigned: true)
!823 = !DIEnumerator(name: "Tab", value: 38, isUnsigned: true)
!824 = !DIEnumerator(name: "Q", value: 39, isUnsigned: true)
!825 = !DIEnumerator(name: "W", value: 40, isUnsigned: true)
!826 = !DIEnumerator(name: "E", value: 41, isUnsigned: true)
!827 = !DIEnumerator(name: "R", value: 42, isUnsigned: true)
!828 = !DIEnumerator(name: "T", value: 43, isUnsigned: true)
!829 = !DIEnumerator(name: "Y", value: 44, isUnsigned: true)
!830 = !DIEnumerator(name: "U", value: 45, isUnsigned: true)
!831 = !DIEnumerator(name: "I", value: 46, isUnsigned: true)
!832 = !DIEnumerator(name: "O", value: 47, isUnsigned: true)
!833 = !DIEnumerator(name: "P", value: 48, isUnsigned: true)
!834 = !DIEnumerator(name: "Oem4", value: 49, isUnsigned: true)
!835 = !DIEnumerator(name: "Oem6", value: 50, isUnsigned: true)
!836 = !DIEnumerator(name: "Oem5", value: 51, isUnsigned: true)
!837 = !DIEnumerator(name: "Oem7", value: 52, isUnsigned: true)
!838 = !DIEnumerator(name: "Delete", value: 53, isUnsigned: true)
!839 = !DIEnumerator(name: "End", value: 54, isUnsigned: true)
!840 = !DIEnumerator(name: "PageDown", value: 55, isUnsigned: true)
!841 = !DIEnumerator(name: "Numpad7", value: 56, isUnsigned: true)
!842 = !DIEnumerator(name: "Numpad8", value: 57, isUnsigned: true)
!843 = !DIEnumerator(name: "Numpad9", value: 58, isUnsigned: true)
!844 = !DIEnumerator(name: "NumpadAdd", value: 59, isUnsigned: true)
!845 = !DIEnumerator(name: "CapsLock", value: 60, isUnsigned: true)
!846 = !DIEnumerator(name: "A", value: 61, isUnsigned: true)
!847 = !DIEnumerator(name: "S", value: 62, isUnsigned: true)
!848 = !DIEnumerator(name: "D", value: 63, isUnsigned: true)
!849 = !DIEnumerator(name: "F", value: 64, isUnsigned: true)
!850 = !DIEnumerator(name: "G", value: 65, isUnsigned: true)
!851 = !DIEnumerator(name: "H", value: 66, isUnsigned: true)
!852 = !DIEnumerator(name: "J", value: 67, isUnsigned: true)
!853 = !DIEnumerator(name: "K", value: 68, isUnsigned: true)
!854 = !DIEnumerator(name: "L", value: 69, isUnsigned: true)
!855 = !DIEnumerator(name: "Oem1", value: 70, isUnsigned: true)
!856 = !DIEnumerator(name: "Oem3", value: 71, isUnsigned: true)
!857 = !DIEnumerator(name: "Return", value: 72, isUnsigned: true)
!858 = !DIEnumerator(name: "Numpad4", value: 73, isUnsigned: true)
!859 = !DIEnumerator(name: "Numpad5", value: 74, isUnsigned: true)
!860 = !DIEnumerator(name: "Numpad6", value: 75, isUnsigned: true)
!861 = !DIEnumerator(name: "LShift", value: 76, isUnsigned: true)
!862 = !DIEnumerator(name: "Z", value: 77, isUnsigned: true)
!863 = !DIEnumerator(name: "X", value: 78, isUnsigned: true)
!864 = !DIEnumerator(name: "C", value: 79, isUnsigned: true)
!865 = !DIEnumerator(name: "V", value: 80, isUnsigned: true)
!866 = !DIEnumerator(name: "B", value: 81, isUnsigned: true)
!867 = !DIEnumerator(name: "N", value: 82, isUnsigned: true)
