; ModuleID = 'hzprub9ggwmrmly'
source_filename = "hzprub9ggwmrmly"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"spin::mutex::Mutex<vga::Screen>" = type { %"spin::mutex::spin::SpinMutex<vga::Screen>" }
%"spin::mutex::spin::SpinMutex<vga::Screen>" = type { %"core::marker::PhantomData<spin::relax::Spin>", %"core::sync::atomic::AtomicBool", [7 x i8], %"core::cell::UnsafeCell<vga::Screen>" }
%"core::marker::PhantomData<spin::relax::Spin>" = type {}
%"core::sync::atomic::AtomicBool" = type { i8 }
%"core::cell::UnsafeCell<vga::Screen>" = type { %"vga::Screen" }
%"vga::Screen" = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>::Some" = type { [1 x i64], %"spin::mutex::Mutex<vga::Screen>" }
%"core::fmt::Error" = type {}
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>" = type { i64, [28 x i64] }
%"spin::once::Once<spin::mutex::Mutex<vga::Screen>>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" = type { %"core::option::Option<spin::mutex::Mutex<vga::Screen>>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "cf72e0dadb6494b7ad68c53b3d6eadff")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "9ca10c15524becb51750e1912bdfb31f")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "1cf10498cbfe63619133d419dd9dc80b")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "6edea29cd4f6f73dd157d33a0ba5413b")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "4207958c39dd173f170efd37ae33c8f")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "146334839738b787f82c55bc17e43799")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "be8c2a0334c3989c587969be818e8ff9")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !57, vtableHolder: !62, templateParams: !27, identifier: "43199e6b6ce3a55941a5857031c37d9b")
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !56, file: !2, baseType: !6, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !56, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !63, file: !2, align: 8, elements: !27, identifier: "377b02c51e9ee2c532c4ee74749d6d")
!63 = !DINamespace(name: "fmt", scope: !64)
!64 = !DINamespace(name: "core", scope: null)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN__TEXT_MODE", linkageName: "_ZN4theo11peripherals25VGA_DISPLAY_IN__TEXT_MODE17h67fcc88dc4446ffbE", scope: !67, file: !69, line: 161, type: !70, isLocal: true, isDefinition: true, align: 8)
!67 = !DINamespace(name: "peripherals", scope: !68)
!68 = !DINamespace(name: "theo", scope: null)
!69 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN__TEXT_MODE", scope: !67, file: !2, align: 8, elements: !71, templateParams: !27, identifier: "3cb85d4d5bb0fee8c56a6280bfa72b91")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !70, file: !2, baseType: !7, align: 8)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h97baca53b0c09103E", scope: !75, file: !78, line: 29, type: !79, isLocal: true, isDefinition: true, align: 64)
!75 = !DINamespace(name: "__stability", scope: !76)
!76 = !DINamespace(name: "deref", scope: !77)
!77 = !DINamespace(name: "{impl#0}", scope: !67)
!78 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !80, file: !2, size: 1920, align: 64, elements: !82, templateParams: !111, identifier: "1deecd7b3076626c67dcfccc5efedbc4")
!80 = !DINamespace(name: "lazy", scope: !81)
!81 = !DINamespace(name: "lazy_static", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !79, file: !2, baseType: !84, size: 1920, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !85, file: !2, size: 1920, align: 64, elements: !87, templateParams: !111, identifier: "cb0e3c3e8f51729e1709d09dd45462db")
!85 = !DINamespace(name: "once", scope: !86)
!86 = !DINamespace(name: "spin", scope: null)
!87 = !{!88, !100}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !2, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !90, file: !2, size: 64, align: 64, elements: !92, templateParams: !27, identifier: "c4b604690a8aaf0544d93ce725b10acb")
!90 = !DINamespace(name: "atomic", scope: !91)
!91 = !DINamespace(name: "sync", scope: !64)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !89, file: !2, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !95, file: !2, size: 64, align: 64, elements: !96, templateParams: !98, identifier: "12e8e4660f60ed2d877d193b37db548f")
!95 = !DINamespace(name: "cell", scope: !64)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !94, file: !2, baseType: !9, size: 64, align: 64)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "T", type: !9)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !2, baseType: !101, size: 1856, align: 64, offset: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !95, file: !2, size: 1856, align: 64, elements: !102, templateParams: !150, identifier: "b8d6b15196417ce3e37ae3027cb62d9")
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !2, baseType: !104, size: 1856, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !105, file: !2, size: 1856, align: 64, elements: !106, templateParams: !27, identifier: "5a38d6366e67a5feb0dbe7b22c62d57d")
!105 = !DINamespace(name: "option", scope: !64)
!106 = !{!107}
!107 = !DICompositeType(tag: DW_TAG_variant_part, scope: !104, file: !2, size: 1856, align: 64, elements: !108, templateParams: !27, identifier: "db40eb48c30cb80d1bdc5386dd8163c9", discriminator: !148)
!108 = !{!109, !144}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !107, file: !2, baseType: !110, size: 1856, align: 64, extraData: i64 0)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !104, file: !2, size: 1856, align: 64, elements: !27, templateParams: !111, identifier: "2786cf05fb630f0c367ca4f862fbc7fa")
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "T", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !114, file: !2, size: 1792, align: 64, elements: !115, templateParams: !142, identifier: "4923237598bb92eeb52e98b1a38e4b6e")
!114 = !DINamespace(name: "mutex", scope: !86)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !113, file: !2, baseType: !117, size: 1792, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !118, file: !2, size: 1792, align: 64, elements: !119, templateParams: !142, identifier: "6354b5058e2e4d68f6910933caf0e193")
!118 = !DINamespace(name: "spin", scope: !114)
!119 = !{!120, !127, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !117, file: !2, baseType: !121, align: 8)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !122, file: !2, align: 8, elements: !27, templateParams: !123, identifier: "5784ed3d14b0259f5d45bd5c24cf98a9")
!122 = !DINamespace(name: "marker", scope: !64)
!123 = !{!124}
!124 = !DITemplateTypeParameter(name: "T", type: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !126, file: !2, align: 8, elements: !27, identifier: "f9dc8894a8f7328a59a94806cff50033")
!126 = !DINamespace(name: "relax", scope: !86)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !117, file: !2, baseType: !128, size: 8, align: 8)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !90, file: !2, size: 8, align: 8, elements: !129, templateParams: !27, identifier: "8de9d800707bcbaf95d2de7d28a62f0f")
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !128, file: !2, baseType: !131, size: 8, align: 8)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !95, file: !2, size: 8, align: 8, elements: !132, templateParams: !134, identifier: "4d6fa4ec5436b369855b6949d262eb7c")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !2, baseType: !39, size: 8, align: 8)
!134 = !{!135}
!135 = !DITemplateTypeParameter(name: "T", type: !39)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !2, baseType: !137, size: 1728, align: 64, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !95, file: !2, size: 1728, align: 64, elements: !138, templateParams: !140, identifier: "de347fe9f6ffb45b19cb9be36b14892e")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !137, file: !2, baseType: !15, size: 1728, align: 64)
!140 = !{!141}
!141 = !DITemplateTypeParameter(name: "T", type: !15)
!142 = !{!141, !143}
!143 = !DITemplateTypeParameter(name: "R", type: !125)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !107, file: !2, baseType: !145, size: 1856, align: 64, extraData: i64 1)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !104, file: !2, size: 1856, align: 64, elements: !146, templateParams: !111, identifier: "cebd91b2fcba219b74cea7488eedb507")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !145, file: !2, baseType: !113, size: 1792, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, scope: !104, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!149 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "T", type: !104)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h1107ace1971c38a2E", scope: !154, file: !69, line: 161, type: !155, isLocal: true, isDefinition: true, align: 8)
!154 = !DINamespace(name: "serial", scope: !68)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !154, file: !2, align: 8, elements: !156, templateParams: !27, identifier: "99c79f1eb30d2852afda85771939b49c")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !155, file: !2, baseType: !7, align: 8)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hd2442e3535cd9e2dE", scope: !160, file: !78, line: 29, type: !163, isLocal: true, isDefinition: true, align: 64)
!160 = !DINamespace(name: "__stability", scope: !161)
!161 = !DINamespace(name: "deref", scope: !162)
!162 = !DINamespace(name: "{impl#0}", scope: !154)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !80, file: !2, size: 192, align: 64, elements: !164, templateParams: !179, identifier: "d1edadcc89c9b534ea63c028a1be5d97")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !163, file: !2, baseType: !166, size: 192, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !85, file: !2, size: 192, align: 64, elements: !167, templateParams: !179, identifier: "d50303226bcbdb29fc45d24bf2c8f97f")
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !2, baseType: !89, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !2, baseType: !170, size: 128, align: 16)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !95, file: !2, size: 128, align: 16, elements: !171, templateParams: !262, identifier: "bb3c3b86e4f447ea5f740a875545997a")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !170, file: !2, baseType: !173, size: 128, align: 16)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !105, file: !2, size: 128, align: 16, elements: !174, templateParams: !27, identifier: "96042ed03969cb483205bcbe9f9d752")
!174 = !{!175}
!175 = !DICompositeType(tag: DW_TAG_variant_part, scope: !173, file: !2, size: 128, align: 16, elements: !176, templateParams: !27, identifier: "7faeedcf8022b305e338061896eafc0a", discriminator: !261)
!176 = !{!177, !257}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !175, file: !2, baseType: !178, size: 128, align: 16, extraData: i64 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !173, file: !2, size: 128, align: 16, elements: !27, templateParams: !179, identifier: "9b22495314afd513a042fb23a045de8a")
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !114, file: !2, size: 112, align: 16, elements: !182, templateParams: !256, identifier: "aafbce1a38b5ed79a9e63e1bdc7b7074")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !181, file: !2, baseType: !184, size: 112, align: 16)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !118, file: !2, size: 112, align: 16, elements: !185, templateParams: !256, identifier: "32b663c8e4c109fc8b28fd17d3fefcd3")
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !184, file: !2, baseType: !121, align: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !184, file: !2, baseType: !128, size: 8, align: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !2, baseType: !189, size: 96, align: 16, offset: 16)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !95, file: !2, size: 96, align: 16, elements: !190, templateParams: !254, identifier: "5d309d1dd6a2be068ba34514f0b96934")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !189, file: !2, baseType: !192, size: 96, align: 16)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !193, file: !2, size: 96, align: 16, elements: !195, templateParams: !27, identifier: "739bbe796242555bdafa8bcd79bd082")
!193 = !DINamespace(name: "port", scope: !194)
!194 = !DINamespace(name: "uart_16550", scope: null)
!195 = !{!196, !217, !234, !235, !236, !237}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !2, baseType: !197, size: 16, align: 16)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !198, file: !2, size: 16, align: 16, elements: !201, templateParams: !215, identifier: "b76a079a44290dfc3ae7e3f37f6d2568")
!198 = !DINamespace(name: "port", scope: !199)
!199 = !DINamespace(name: "instructions", scope: !200)
!200 = !DINamespace(name: "x86_64", scope: null)
!201 = !{!202, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !197, file: !2, baseType: !203, size: 16, align: 16)
!203 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !197, file: !2, baseType: !205, align: 8)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !122, file: !2, align: 8, elements: !27, templateParams: !206, identifier: "9cd1ce89cce1268d19c42bb28130306a")
!206 = !{!207}
!207 = !DITemplateTypeParameter(name: "T", type: !208)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !209, templateParams: !27, identifier: "59432c87f7b7af599b835a06197bcdfd")
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !208, file: !2, baseType: !39, size: 8, align: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !208, file: !2, baseType: !212, align: 8, offset: 8)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !198, file: !2, align: 8, elements: !213, templateParams: !27, identifier: "24c040ba760aedb59a1a3f0b27d114a6")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !2, baseType: !7, align: 8)
!215 = !{!135, !216}
!216 = !DITemplateTypeParameter(name: "A", type: !212)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !192, file: !2, baseType: !218, size: 16, align: 16, offset: 16)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !198, file: !2, size: 16, align: 16, elements: !219, templateParams: !232, identifier: "c5fd7072abaeb2c4e9e6daab6c442590")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !218, file: !2, baseType: !203, size: 16, align: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !218, file: !2, baseType: !222, align: 8)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !122, file: !2, align: 8, elements: !27, templateParams: !223, identifier: "6fedb701b74e877903a3c6b3dc54a3")
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !226, templateParams: !27, identifier: "b2059ef57f7326115a0927bd569bbaf7")
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !225, file: !2, baseType: !39, size: 8, align: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !225, file: !2, baseType: !229, align: 8, offset: 8)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !198, file: !2, align: 8, elements: !230, templateParams: !27, identifier: "2297098ea03ff1555768c8e4fced7c9")
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !229, file: !2, baseType: !7, align: 8)
!232 = !{!135, !233}
!233 = !DITemplateTypeParameter(name: "A", type: !229)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !192, file: !2, baseType: !218, size: 16, align: 16, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !192, file: !2, baseType: !218, size: 16, align: 16, offset: 48)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !192, file: !2, baseType: !218, size: 16, align: 16, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !192, file: !2, baseType: !238, size: 16, align: 16, offset: 80)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !198, file: !2, size: 16, align: 16, elements: !239, templateParams: !252, identifier: "922f03718f6fd94c696e86a9e0e2d38")
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !238, file: !2, baseType: !203, size: 16, align: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !238, file: !2, baseType: !242, align: 8)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !122, file: !2, align: 8, elements: !27, templateParams: !243, identifier: "e03f211626118c9343864fc410523a76")
!243 = !{!244}
!244 = !DITemplateTypeParameter(name: "T", type: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !246, templateParams: !27, identifier: "ace980b06c83f3df19c5b03b5702f0e9")
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !2, baseType: !39, size: 8, align: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !245, file: !2, baseType: !249, align: 8, offset: 8)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !198, file: !2, align: 8, elements: !250, templateParams: !27, identifier: "5d5f712d2b7331e32c872efb4808ac03")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !249, file: !2, baseType: !7, align: 8)
!252 = !{!135, !253}
!253 = !DITemplateTypeParameter(name: "A", type: !249)
!254 = !{!255}
!255 = !DITemplateTypeParameter(name: "T", type: !192)
!256 = !{!255, !143}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !175, file: !2, baseType: !258, size: 128, align: 16, extraData: i64 1)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !173, file: !2, size: 128, align: 16, elements: !259, templateParams: !179, identifier: "7e8f4a47c0a52d7ce99f80faf762150a")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !258, file: !2, baseType: !181, size: 112, align: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !2, baseType: !203, size: 16, align: 16, flags: DIFlagArtificial)
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !173)
!264 = !{i32 7, !"PIC Level", i32 2}
!265 = !{i32 7, !"PIE Level", i32 2}
!266 = !{i32 2, !"Dwarf Version", i32 4}
!267 = !{i32 2, !"Debug Info Version", i32 3}
!268 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !269, producer: "clang LLVM (rustc version 1.69.0-nightly (c5c7d2b37 2023-02-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !270, globals: !286, splitDebugInlining: false)
!269 = !DIFile(filename: "src/main.rs/@/hzprub9ggwmrmly", directory: "/Users/yaw/self/theo")
!270 = !{!49, !271, !279}
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !272, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !274)
!272 = !DINamespace(name: "v1", scope: !273)
!273 = !DINamespace(name: "rt", scope: !63)
!274 = !{!275, !276, !277, !278}
!275 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!278 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !90, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !280)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!285 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!286 = !{!0, !54, !65, !73, !152, !158}
!287 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hd720fa992bf00d9eE", scope: !289, file: !288, line: 2396, type: !290, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !456, retainedNodes: !453)
!288 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!289 = !DINamespace(name: "{impl#59}", scope: !63)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !309, !411}
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !293, file: !2, size: 8, align: 8, elements: !294, templateParams: !27, identifier: "26bbe38b51f2cf836c2841caf1cef163")
!293 = !DINamespace(name: "result", scope: !64)
!294 = !{!295}
!295 = !DICompositeType(tag: DW_TAG_variant_part, scope: !292, file: !2, size: 8, align: 8, elements: !296, templateParams: !27, identifier: "7b55b4b0cb45eebeb665bcd48885acf0", discriminator: !308)
!296 = !{!297, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !295, file: !2, baseType: !298, size: 8, align: 8, extraData: i64 0)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !292, file: !2, size: 8, align: 8, elements: !299, templateParams: !301, identifier: "1c7ce0ea1dfb63fc55126b0f823a594d")
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !298, file: !2, baseType: !7, align: 8, offset: 8)
!301 = !{!302, !303}
!302 = !DITemplateTypeParameter(name: "T", type: !7)
!303 = !DITemplateTypeParameter(name: "E", type: !62)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !295, file: !2, baseType: !305, size: 8, align: 8, extraData: i64 1)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !292, file: !2, size: 8, align: 8, elements: !306, templateParams: !301, identifier: "9c184bfedb5841cfb892e9481e551d89")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !62, align: 8, offset: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !292, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !312, file: !2, size: 320, align: 64, elements: !314, templateParams: !27, identifier: "6d283c3f8239b331c661daa2f375aa75")
!312 = !DINamespace(name: "panic_info", scope: !313)
!313 = !DINamespace(name: "panic", scope: !64)
!314 = !{!315, !326, !443, !451}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !311, file: !2, baseType: !316, size: 128, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !317, templateParams: !27, identifier: "be14702aca4085c2efb757154ac06e5c")
!317 = !{!318, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !316, file: !2, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64, dwarfAddressSpace: 0)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "b9a28a42d32f274a326be2a91dd6b117")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !316, file: !2, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 3, lowerBound: 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !311, file: !2, baseType: !327, size: 64, align: 64, offset: 128)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !105, file: !2, size: 64, align: 64, elements: !328, templateParams: !27, identifier: "773ec16d15a16a6823db31368abe2be3")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_variant_part, scope: !327, file: !2, size: 64, align: 64, elements: !330, templateParams: !27, identifier: "27fc0284ef6f943f6b46e9fef374d521", discriminator: !442)
!330 = !{!331, !438}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !329, file: !2, baseType: !332, size: 64, align: 64, extraData: i64 0)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !327, file: !2, size: 64, align: 64, elements: !27, templateParams: !333, identifier: "7178df3bc221d19f5cd03fe474512ebe")
!333 = !{!334}
!334 = !DITemplateTypeParameter(name: "T", type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !336, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !63, file: !2, size: 384, align: 64, elements: !337, templateParams: !27, identifier: "8ca1c8bb57c26330aaa9c7bcb3afcea3")
!337 = !{!338, !349, !396}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !336, file: !2, baseType: !339, size: 128, align: 64, offset: 128)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !340, templateParams: !27, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!340 = !{!341, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !339, file: !2, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !344, templateParams: !27, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!344 = !{!345, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !343, file: !2, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !343, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !339, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !336, file: !2, baseType: !350, size: 128, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !105, file: !2, size: 128, align: 64, elements: !351, templateParams: !27, identifier: "dc2c4fbf840c440a5bc74b230864c62c")
!351 = !{!352}
!352 = !DICompositeType(tag: DW_TAG_variant_part, scope: !350, file: !2, size: 128, align: 64, elements: !353, templateParams: !27, identifier: "1eed79dab0622e2c42a08b0a3935e037", discriminator: !395)
!353 = !{!354, !391}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !352, file: !2, baseType: !355, size: 128, align: 64, extraData: i64 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !350, file: !2, size: 128, align: 64, elements: !27, templateParams: !356, identifier: "f082b5fa705ac4c889d6681e27706985")
!356 = !{!357}
!357 = !DITemplateTypeParameter(name: "T", type: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !359, templateParams: !27, identifier: "b4ac42342b8303edfcba4c1d1fe4f702")
!359 = !{!360, !390}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !358, file: !2, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !272, file: !2, size: 448, align: 64, elements: !363, templateParams: !27, identifier: "1c585b9e1982cb0f56f2bde16d89254b")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !362, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !362, file: !2, baseType: !366, size: 384, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !272, file: !2, size: 384, align: 64, elements: !367, templateParams: !27, identifier: "d73dca86b4fa507d5490cfae9f2e69b2")
!367 = !{!368, !370, !371, !373, !389}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !366, file: !2, baseType: !369, size: 32, align: 32, offset: 288)
!369 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !366, file: !2, baseType: !271, size: 8, align: 8, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !2, baseType: !372, size: 32, align: 32, offset: 256)
!372 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !366, file: !2, baseType: !374, size: 128, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !272, file: !2, size: 128, align: 64, elements: !375, templateParams: !27, identifier: "f1c92ed85d6bc94ca1ba8b6165e7021")
!375 = !{!376}
!376 = !DICompositeType(tag: DW_TAG_variant_part, scope: !374, file: !2, size: 128, align: 64, elements: !377, templateParams: !27, identifier: "d8cac28a6923e355281ecb8308e78762", discriminator: !388)
!377 = !{!378, !382, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !376, file: !2, baseType: !379, size: 128, align: 64, extraData: i64 0)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !374, file: !2, size: 128, align: 64, elements: !380, templateParams: !27, identifier: "218d32ee898f6c51c26e76a63740d375")
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !379, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !376, file: !2, baseType: !383, size: 128, align: 64, extraData: i64 1)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !374, file: !2, size: 128, align: 64, elements: !384, templateParams: !27, identifier: "e750f291dd4d9e3dc572eb76f08e32bd")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !376, file: !2, baseType: !387, size: 128, align: 64, extraData: i64 2)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !374, file: !2, size: 128, align: 64, elements: !27, identifier: "45d92226e2750a0656a00baa92f37a00")
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !366, file: !2, baseType: !374, size: 128, align: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !358, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !352, file: !2, baseType: !392, size: 128, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !350, file: !2, size: 128, align: 64, elements: !393, templateParams: !356, identifier: "594c3a1251b26193b48ba9c1ada76dd0")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !392, file: !2, baseType: !358, size: 128, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, scope: !350, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !336, file: !2, baseType: !397, size: 128, align: 64, offset: 256)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !398, templateParams: !27, identifier: "57d6094f30cde1051168ff3f2ad6a74c")
!398 = !{!399, !437}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !397, file: !2, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !63, file: !2, size: 128, align: 64, elements: !402, templateParams: !27, identifier: "b05c5d728067bfb8d9643825d53dce0f")
!402 = !{!403, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !401, file: !2, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !406, file: !2, align: 8, elements: !27, identifier: "ccae6e9d596dbcdb15b715c1fc4a175b")
!406 = !DINamespace(name: "{extern#0}", scope: !63)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !401, file: !2, baseType: !408, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !409, size: 64, align: 64, dwarfAddressSpace: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!292, !404, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !412, size: 64, align: 64, dwarfAddressSpace: 0)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !63, file: !2, size: 512, align: 64, elements: !413, templateParams: !27, identifier: "4965709144e9f8582bc4af54f7e0350a")
!413 = !{!414, !415, !416, !417, !429, !430}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !2, baseType: !372, size: 32, align: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !412, file: !2, baseType: !369, size: 32, align: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !412, file: !2, baseType: !271, size: 8, align: 8, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !412, file: !2, baseType: !418, size: 128, align: 64, offset: 128)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !105, file: !2, size: 128, align: 64, elements: !419, templateParams: !27, identifier: "659085d76f9c3f75b5f8c40976074da")
!419 = !{!420}
!420 = !DICompositeType(tag: DW_TAG_variant_part, scope: !418, file: !2, size: 128, align: 64, elements: !421, templateParams: !27, identifier: "e738c443d6d2476fcd78612f00f4f22e", discriminator: !428)
!421 = !{!422, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !420, file: !2, baseType: !423, size: 128, align: 64, extraData: i64 0)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !418, file: !2, size: 128, align: 64, elements: !27, templateParams: !98, identifier: "17fea1ebd4d2ff882ba731180256ce25")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !420, file: !2, baseType: !425, size: 128, align: 64, extraData: i64 1)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !418, file: !2, size: 128, align: 64, elements: !426, templateParams: !98, identifier: "fdf08f4319c2feb269842fd50a84a3de")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !418, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !412, file: !2, baseType: !418, size: 128, align: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !412, file: !2, baseType: !431, size: 128, align: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !432, templateParams: !27, identifier: "5b186481c2fe29994e7fc0160ea825b8")
!432 = !{!433, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !431, file: !2, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "2c9da7f07ed8b4c96822d6d90a924ef5")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !431, file: !2, baseType: !322, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !397, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !329, file: !2, baseType: !439, size: 64, align: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !327, file: !2, size: 64, align: 64, elements: !440, templateParams: !333, identifier: "eda54f13fb761fa0646111a4e85503c1")
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !439, file: !2, baseType: !335, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !311, file: !2, baseType: !444, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !445, size: 64, align: 64, dwarfAddressSpace: 0)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !446, file: !2, size: 192, align: 64, elements: !447, templateParams: !27, identifier: "612296f4ec2f99e036dec011ef3ac47e")
!446 = !DINamespace(name: "location", scope: !313)
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !445, file: !2, baseType: !343, size: 128, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !445, file: !2, baseType: !372, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !445, file: !2, baseType: !372, size: 32, align: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !311, file: !2, baseType: !452, size: 8, align: 8, offset: 256)
!452 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!453 = !{!454, !455}
!454 = !DILocalVariable(name: "self", arg: 1, scope: !287, file: !288, line: 2396, type: !309)
!455 = !DILocalVariable(name: "f", arg: 2, scope: !287, file: !288, line: 2396, type: !411)
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !311)
!458 = !DILocation(line: 2396, column: 20, scope: !287)
!459 = !DILocation(line: 2396, column: 27, scope: !287)
!460 = !DILocation(line: 2396, column: 71, scope: !287)
!461 = !{i64 8}
!462 = !DILocation(line: 2396, column: 62, scope: !287)
!463 = !DILocation(line: 2396, column: 84, scope: !287)
!464 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17hda187f7a33ac5fa1E", scope: !401, file: !288, line: 340, type: !465, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !471, retainedNodes: !468)
!465 = !DISubroutineType(types: !466)
!466 = !{!401, !309, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !290, size: 64, align: 64, dwarfAddressSpace: 0)
!468 = !{!469, !470}
!469 = !DILocalVariable(name: "x", arg: 1, scope: !464, file: !288, line: 340, type: !309)
!470 = !DILocalVariable(name: "f", arg: 2, scope: !464, file: !288, line: 340, type: !467)
!471 = !{!472}
!472 = !DITemplateTypeParameter(name: "T", type: !310)
!473 = !DILocation(line: 340, column: 23, scope: !464)
!474 = !DILocation(line: 340, column: 33, scope: !464)
!475 = !DILocation(line: 349, column: 42, scope: !464)
!476 = !DILocation(line: 349, column: 68, scope: !464)
!477 = !{i64 1}
!478 = !DILocation(line: 349, column: 18, scope: !464)
!479 = !DILocation(line: 350, column: 6, scope: !464)
!480 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h384b3d5add577c17E", scope: !401, file: !288, line: 329, type: !481, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !471, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!401, !309}
!483 = !{!484}
!484 = !DILocalVariable(name: "x", arg: 1, scope: !480, file: !288, line: 329, type: !309)
!485 = !DILocation(line: 329, column: 30, scope: !480)
!486 = !DILocation(line: 330, column: 13, scope: !480)
!487 = !DILocation(line: 331, column: 10, scope: !480)
!488 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17h23b4873325c2835fE", scope: !489, file: !288, line: 168, type: !490, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !495, retainedNodes: !492)
!489 = !DINamespace(name: "Write", scope: !63)
!490 = !DISubroutineType(types: !491)
!491 = !{!292, !14, !369}
!492 = !{!493, !494}
!493 = !DILocalVariable(name: "self", arg: 1, scope: !488, file: !288, line: 168, type: !14)
!494 = !DILocalVariable(name: "c", arg: 2, scope: !488, file: !288, line: 168, type: !369)
!495 = !{!496}
!496 = !DITemplateTypeParameter(name: "Self", type: !15)
!497 = !DILocation(line: 168, column: 19, scope: !488)
!498 = !DILocation(line: 168, column: 30, scope: !488)
!499 = !DILocation(line: 169, column: 43, scope: !488)
!500 = !DILocation(line: 169, column: 24, scope: !488)
!501 = !DILocation(line: 169, column: 9, scope: !488)
!502 = !DILocation(line: 170, column: 6, scope: !488)
!503 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17h1693794640fc8cc7E", scope: !489, file: !288, line: 196, type: !504, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !495, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!292, !14, !336}
!506 = !{!507, !508}
!507 = !DILocalVariable(name: "self", arg: 1, scope: !503, file: !288, line: 196, type: !14)
!508 = !DILocalVariable(name: "args", arg: 2, scope: !503, file: !288, line: 196, type: !336)
!509 = !DILocation(line: 196, column: 18, scope: !503)
!510 = !DILocation(line: 196, column: 39, scope: !503)
!511 = !DILocation(line: 197, column: 9, scope: !503)
!512 = !DILocation(line: 198, column: 6, scope: !503)
!513 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h68f8fadb8bb894f0E", scope: !336, file: !288, line: 421, type: !514, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !519)
!514 = !DISubroutineType(types: !515)
!515 = !{!336, !339, !397, !358, !516}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !63, file: !2, align: 8, elements: !517, templateParams: !27, identifier: "68f3f6666779eaf34433ac9b1f21476e")
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !516, file: !2, baseType: !7, align: 8)
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(name: "pieces", arg: 1, scope: !513, file: !288, line: 422, type: !339)
!521 = !DILocalVariable(name: "args", arg: 2, scope: !513, file: !288, line: 423, type: !397)
!522 = !DILocalVariable(name: "fmt", arg: 3, scope: !513, file: !288, line: 424, type: !358)
!523 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !513, file: !288, line: 425, type: !516)
!524 = !DILocation(line: 422, column: 9, scope: !513)
!525 = !DILocation(line: 423, column: 9, scope: !513)
!526 = !DILocation(line: 424, column: 9, scope: !513)
!527 = !DILocation(line: 425, column: 9, scope: !513)
!528 = !DILocation(line: 427, column: 34, scope: !513)
!529 = !DILocation(line: 427, column: 9, scope: !513)
!530 = !DILocation(line: 428, column: 6, scope: !513)
!531 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h6efcde47be91e57cE", scope: !336, file: !288, line: 401, type: !532, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!336, !339, !397}
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "pieces", arg: 1, scope: !531, file: !288, line: 401, type: !339)
!536 = !DILocalVariable(name: "args", arg: 2, scope: !531, file: !288, line: 401, type: !397)
!537 = !DILocation(line: 401, column: 25, scope: !531)
!538 = !DILocation(line: 401, column: 53, scope: !531)
!539 = !DILocation(line: 402, column: 12, scope: !531)
!540 = !DILocation(line: 402, column: 56, scope: !531)
!541 = !{i8 0, i8 2}
!542 = !DILocation(line: 402, column: 41, scope: !531)
!543 = !DILocation(line: 405, column: 34, scope: !531)
!544 = !DILocation(line: 405, column: 9, scope: !531)
!545 = !DILocation(line: 406, column: 6, scope: !531)
!546 = !DILocation(line: 403, column: 13, scope: !531)
!547 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hc0166bca439f8a3eE", scope: !549, file: !548, line: 250, type: !552, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !560, retainedNodes: !557)
!548 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!549 = !DINamespace(name: "FnOnce", scope: !550)
!550 = !DINamespace(name: "function", scope: !551)
!551 = !DINamespace(name: "ops", scope: !64)
!552 = !DISubroutineType(types: !553)
!553 = !{!113, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !555, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!113}
!557 = !{!558, !559}
!558 = !DILocalVariable(arg: 1, scope: !547, file: !548, line: 250, type: !554)
!559 = !DILocalVariable(arg: 2, scope: !547, file: !548, line: 250, type: !7)
!560 = !{!561, !562}
!561 = !DITemplateTypeParameter(name: "Self", type: !554)
!562 = !DITemplateTypeParameter(name: "Args", type: !7)
!563 = !DILocation(line: 250, column: 5, scope: !547)
!564 = !DILocation(line: 8, column: 20, scope: !565, inlinedAt: !568)
!565 = !DILexicalBlockFile(scope: !567, file: !566, discriminator: 0)
!566 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a9f733008b5882d285bb953998165fcd")
!567 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hba3475329cec53beE", scope: !76, file: !69, line: 137, type: !555, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !27)
!568 = distinct !DILocation(line: 250, column: 5, scope: !547)
!569 = !DILocalVariable(name: "value", arg: 1, scope: !570, file: !571, line: 134, type: !15)
!570 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17hffc1c6b29fbbe1bdE", scope: !113, file: !571, line: 134, type: !572, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !142, retainedNodes: !574)
!571 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c58534ad96d8dc14eb87ebe3c1afa1b")
!572 = !DISubroutineType(types: !573)
!573 = !{!113, !15}
!574 = !{!569}
!575 = !DILocation(line: 134, column: 22, scope: !570, inlinedAt: !576)
!576 = distinct !DILocation(line: 8, column: 9, scope: !565, inlinedAt: !568)
!577 = !DILocalVariable(name: "data", arg: 1, scope: !578, file: !579, line: 99, type: !15)
!578 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17h79bc11d55e16b839E", scope: !117, file: !579, line: 99, type: !580, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !142, retainedNodes: !582)
!579 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c66351a136ee4537f9723cd15dd8f9b")
!580 = !DISubroutineType(types: !581)
!581 = !{!117, !15}
!582 = !{!577}
!583 = !DILocation(line: 99, column: 22, scope: !578, inlinedAt: !584)
!584 = distinct !DILocation(line: 135, column: 23, scope: !570, inlinedAt: !576)
!585 = !DILocation(line: 101, column: 19, scope: !578, inlinedAt: !584)
!586 = !DILocalVariable(name: "value", arg: 1, scope: !587, file: !588, line: 1962, type: !15)
!587 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h35febeef1f730567E", scope: !137, file: !588, line: 1962, type: !589, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !140, retainedNodes: !591)
!588 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "0a931b3cf4e155135af9f41e879646f7")
!589 = !DISubroutineType(types: !590)
!590 = !{!137, !15}
!591 = !{!586}
!592 = !DILocation(line: 1962, column: 22, scope: !587, inlinedAt: !593)
!593 = distinct !DILocation(line: 102, column: 19, scope: !578, inlinedAt: !584)
!594 = !DILocation(line: 1963, column: 9, scope: !587, inlinedAt: !593)
!595 = !DILocation(line: 100, column: 9, scope: !578, inlinedAt: !584)
!596 = !DILocation(line: 135, column: 9, scope: !570, inlinedAt: !576)
!597 = distinct !DISubprogram(name: "drop_in_place<core::fmt::Error>", linkageName: "_ZN4core3ptr37drop_in_place$LT$core..fmt..Error$GT$17hc12a839527ebf6a7E", scope: !599, file: !598, line: 490, type: !600, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !605, retainedNodes: !603)
!598 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!599 = !DINamespace(name: "ptr", scope: !64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::fmt::Error", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !{!604}
!604 = !DILocalVariable(arg: 1, scope: !597, file: !598, line: 490, type: !602)
!605 = !{!606}
!606 = !DITemplateTypeParameter(name: "T", type: !62)
!607 = !DILocation(line: 490, column: 1, scope: !597)
!608 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h1ccd928c310b770eE", scope: !599, file: !598, line: 490, type: !609, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !619, retainedNodes: !617)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !612, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !85, file: !2, size: 128, align: 64, elements: !613, templateParams: !27, identifier: "8181506e9d163fe7468edc6418d10d3c")
!613 = !{!614, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !612, file: !2, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !612, file: !2, baseType: !452, size: 8, align: 8, offset: 64)
!617 = !{!618}
!618 = !DILocalVariable(arg: 1, scope: !608, file: !598, line: 490, type: !611)
!619 = !{!620}
!620 = !DITemplateTypeParameter(name: "T", type: !612)
!621 = !DILocation(line: 490, column: 1, scope: !608)
!622 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17h70a9ef217539e879E", scope: !599, file: !598, line: 490, type: !623, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !628, retainedNodes: !626)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!626 = !{!627}
!627 = !DILocalVariable(arg: 1, scope: !622, file: !598, line: 490, type: !625)
!628 = !{!629}
!629 = !DITemplateTypeParameter(name: "T", type: !14)
!630 = !DILocation(line: 490, column: 1, scope: !622)
!631 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17ha34fa542c41bd33bE", scope: !599, file: !598, line: 490, type: !632, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !645, retainedNodes: !643)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !635, size: 64, align: 64, dwarfAddressSpace: 0)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !114, file: !2, size: 128, align: 64, elements: !636, templateParams: !140, identifier: "c3a2a830b0bbafd6534cee5f9e8b1cc3")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !635, file: !2, baseType: !638, size: 128, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !118, file: !2, size: 128, align: 64, elements: !639, templateParams: !140, identifier: "900f052eedd43fc44f797cb71c69e38")
!639 = !{!640, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !638, file: !2, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !638, file: !2, baseType: !14, size: 64, align: 64, offset: 64)
!643 = !{!644}
!644 = !DILocalVariable(arg: 1, scope: !631, file: !598, line: 490, type: !634)
!645 = !{!646}
!646 = !DITemplateTypeParameter(name: "T", type: !635)
!647 = !DILocation(line: 490, column: 1, scope: !631)
!648 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17ha6e61f99558c5ee0E", scope: !599, file: !598, line: 490, type: !649, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !654, retainedNodes: !652)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !638, size: 64, align: 64, dwarfAddressSpace: 0)
!652 = !{!653}
!653 = !DILocalVariable(arg: 1, scope: !648, file: !598, line: 490, type: !651)
!654 = !{!655}
!655 = !DITemplateTypeParameter(name: "T", type: !638)
!656 = !DILocation(line: 490, column: 1, scope: !648)
!657 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17hac78960a25b152d4E", scope: !659, file: !658, line: 197, type: !661, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !671)
!658 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "197638d8a57725d685b49f7f7ce80004")
!659 = !DINamespace(name: "converts", scope: !660)
!660 = !DINamespace(name: "str", scope: !64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !667}
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut str", file: !2, size: 128, align: 64, elements: !664, templateParams: !27, identifier: "5a9563f597f3707a3b1d983c8a782f1")
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !663, file: !2, baseType: !346, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !663, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !668, templateParams: !27, identifier: "76f368a1641a25f5ea1dd03aa07d17c8")
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !667, file: !2, baseType: !346, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !667, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!671 = !{!672}
!672 = !DILocalVariable(name: "v", arg: 1, scope: !657, file: !658, line: 197, type: !667)
!673 = !DILocation(line: 197, column: 45, scope: !657)
!674 = !DILocation(line: 203, column: 2, scope: !657)
!675 = distinct !DISubprogram(name: "encode_utf8_raw", linkageName: "_ZN4core4char7methods15encode_utf8_raw17h27550c6a7d537fb0E", scope: !677, file: !676, line: 1713, type: !679, scopeLine: 1713, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !681)
!676 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/methods.rs", directory: "", checksumkind: CSK_MD5, checksum: "6639fd939de0cc71e2551f3e27d008ab")
!677 = !DINamespace(name: "methods", scope: !678)
!678 = !DINamespace(name: "char", scope: !64)
!679 = !DISubroutineType(types: !680)
!680 = !{!667, !372, !667}
!681 = !{!682, !683, !684, !686, !689, !691, !692, !694, !695, !696, !698, !699, !700}
!682 = !DILocalVariable(name: "code", arg: 1, scope: !675, file: !676, line: 1713, type: !372)
!683 = !DILocalVariable(name: "dst", arg: 2, scope: !675, file: !676, line: 1713, type: !667)
!684 = !DILocalVariable(name: "len", scope: !685, file: !676, line: 1714, type: !9, align: 8)
!685 = distinct !DILexicalBlock(scope: !675, file: !676, line: 1714, column: 5)
!686 = !DILocalVariable(name: "a", scope: !687, file: !676, line: 1716, type: !688, align: 8)
!687 = distinct !DILexicalBlock(scope: !685, file: !676, line: 1716, column: 9)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!689 = !DILocalVariable(name: "a", scope: !690, file: !676, line: 1719, type: !688, align: 8)
!690 = distinct !DILexicalBlock(scope: !685, file: !676, line: 1719, column: 9)
!691 = !DILocalVariable(name: "b", scope: !690, file: !676, line: 1719, type: !688, align: 8)
!692 = !DILocalVariable(name: "a", scope: !693, file: !676, line: 1723, type: !688, align: 8)
!693 = distinct !DILexicalBlock(scope: !685, file: !676, line: 1723, column: 9)
!694 = !DILocalVariable(name: "b", scope: !693, file: !676, line: 1723, type: !688, align: 8)
!695 = !DILocalVariable(name: "c", scope: !693, file: !676, line: 1723, type: !688, align: 8)
!696 = !DILocalVariable(name: "a", scope: !697, file: !676, line: 1728, type: !688, align: 8)
!697 = distinct !DILexicalBlock(scope: !685, file: !676, line: 1728, column: 9)
!698 = !DILocalVariable(name: "b", scope: !697, file: !676, line: 1728, type: !688, align: 8)
!699 = !DILocalVariable(name: "c", scope: !697, file: !676, line: 1728, type: !688, align: 8)
!700 = !DILocalVariable(name: "d", scope: !697, file: !676, line: 1728, type: !688, align: 8)
!701 = !DILocation(line: 1713, column: 24, scope: !675)
!702 = !DILocation(line: 1713, column: 35, scope: !675)
!703 = !DILocation(line: 1714, column: 9, scope: !685)
!704 = !DILocation(line: 1714, column: 15, scope: !675)
!705 = !DILocation(line: 1715, column: 12, scope: !685)
!706 = !DILocation(line: 1715, column: 22, scope: !685)
!707 = !DILocation(line: 1715, column: 11, scope: !685)
!708 = !DILocation(line: 1715, column: 5, scope: !685)
!709 = !DILocation(line: 1734, column: 14, scope: !685)
!710 = !DILocation(line: 1738, column: 13, scope: !685)
!711 = !DILocation(line: 1716, column: 13, scope: !685)
!712 = !DILocation(line: 1719, column: 13, scope: !685)
!713 = !DILocation(line: 1723, column: 13, scope: !685)
!714 = !DILocation(line: 1728, column: 13, scope: !685)
!715 = !DILocation(line: 1728, column: 14, scope: !685)
!716 = !DILocation(line: 1728, column: 14, scope: !697)
!717 = !DILocation(line: 1728, column: 17, scope: !685)
!718 = !DILocation(line: 1728, column: 17, scope: !697)
!719 = !DILocation(line: 1728, column: 20, scope: !685)
!720 = !DILocation(line: 1728, column: 20, scope: !697)
!721 = !DILocation(line: 1728, column: 23, scope: !685)
!722 = !DILocation(line: 1728, column: 23, scope: !697)
!723 = !DILocation(line: 1729, column: 19, scope: !697)
!724 = !DILocation(line: 1729, column: 18, scope: !697)
!725 = !DILocation(line: 1729, column: 13, scope: !697)
!726 = !DILocation(line: 1730, column: 19, scope: !697)
!727 = !DILocation(line: 1730, column: 18, scope: !697)
!728 = !DILocation(line: 1730, column: 13, scope: !697)
!729 = !DILocation(line: 1731, column: 19, scope: !697)
!730 = !DILocation(line: 1731, column: 18, scope: !697)
!731 = !DILocation(line: 1731, column: 13, scope: !697)
!732 = !DILocation(line: 1732, column: 18, scope: !697)
!733 = !DILocation(line: 1732, column: 13, scope: !697)
!734 = !DILocation(line: 1733, column: 9, scope: !685)
!735 = !DILocation(line: 1741, column: 16, scope: !685)
!736 = !DILocation(line: 1741, column: 14, scope: !685)
!737 = !DILocation(line: 1741, column: 10, scope: !685)
!738 = !DILocation(line: 1742, column: 2, scope: !675)
!739 = !DILocation(line: 1723, column: 14, scope: !685)
!740 = !DILocation(line: 1723, column: 14, scope: !693)
!741 = !DILocation(line: 1723, column: 17, scope: !685)
!742 = !DILocation(line: 1723, column: 17, scope: !693)
!743 = !DILocation(line: 1723, column: 20, scope: !685)
!744 = !DILocation(line: 1723, column: 20, scope: !693)
!745 = !DILocation(line: 1724, column: 19, scope: !693)
!746 = !DILocation(line: 1724, column: 18, scope: !693)
!747 = !DILocation(line: 1724, column: 13, scope: !693)
!748 = !DILocation(line: 1725, column: 19, scope: !693)
!749 = !DILocation(line: 1725, column: 18, scope: !693)
!750 = !DILocation(line: 1725, column: 13, scope: !693)
!751 = !DILocation(line: 1726, column: 18, scope: !693)
!752 = !DILocation(line: 1726, column: 13, scope: !693)
!753 = !DILocation(line: 1727, column: 9, scope: !685)
!754 = !DILocation(line: 1719, column: 14, scope: !685)
!755 = !DILocation(line: 1719, column: 14, scope: !690)
!756 = !DILocation(line: 1719, column: 17, scope: !685)
!757 = !DILocation(line: 1719, column: 17, scope: !690)
!758 = !DILocation(line: 1720, column: 19, scope: !690)
!759 = !DILocation(line: 1720, column: 18, scope: !690)
!760 = !DILocation(line: 1720, column: 13, scope: !690)
!761 = !DILocation(line: 1721, column: 18, scope: !690)
!762 = !DILocation(line: 1721, column: 13, scope: !690)
!763 = !DILocation(line: 1722, column: 9, scope: !685)
!764 = !DILocation(line: 1716, column: 14, scope: !685)
!765 = !DILocation(line: 1716, column: 14, scope: !687)
!766 = !DILocation(line: 1717, column: 13, scope: !687)
!767 = !DILocation(line: 1718, column: 9, scope: !685)
!768 = distinct !DISubprogram(name: "encode_utf8", linkageName: "_ZN4core4char7methods22_$LT$impl$u20$char$GT$11encode_utf817ha29c5fd6baf0a41fE", scope: !769, file: !676, line: 645, type: !770, scopeLine: 645, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !772)
!769 = !DINamespace(name: "{impl#0}", scope: !677)
!770 = !DISubroutineType(types: !771)
!771 = !{!663, !369, !667}
!772 = !{!773, !774}
!773 = !DILocalVariable(name: "self", arg: 1, scope: !768, file: !676, line: 645, type: !369)
!774 = !DILocalVariable(name: "dst", arg: 2, scope: !768, file: !676, line: 645, type: !667)
!775 = !DILocation(line: 645, column: 24, scope: !768)
!776 = !DILocation(line: 645, column: 30, scope: !768)
!777 = !DILocation(line: 647, column: 42, scope: !768)
!778 = !DILocation(line: 647, column: 18, scope: !768)
!779 = !DILocation(line: 648, column: 6, scope: !768)
!780 = distinct !DISubprogram(name: "len_utf8", linkageName: "_ZN4core4char7methods8len_utf817h173cacda17075bdbE", scope: !677, file: !676, line: 1685, type: !781, scopeLine: 1685, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{!9, !372}
!783 = !{!784}
!784 = !DILocalVariable(name: "code", arg: 1, scope: !780, file: !676, line: 1685, type: !372)
!785 = !DILocation(line: 1685, column: 19, scope: !780)
!786 = !DILocation(line: 1686, column: 8, scope: !780)
!787 = !DILocation(line: 1688, column: 15, scope: !780)
!788 = !DILocation(line: 1687, column: 9, scope: !780)
!789 = !DILocation(line: 1686, column: 5, scope: !780)
!790 = !DILocation(line: 1695, column: 2, scope: !780)
!791 = !DILocation(line: 1690, column: 15, scope: !780)
!792 = !DILocation(line: 1689, column: 9, scope: !780)
!793 = !DILocation(line: 1688, column: 12, scope: !780)
!794 = !DILocation(line: 1693, column: 9, scope: !780)
!795 = !DILocation(line: 1690, column: 12, scope: !780)
!796 = !DILocation(line: 1691, column: 9, scope: !780)
!797 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h3a56682ae8e38a78E", scope: !799, file: !798, line: 100, type: !800, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !27)
!798 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c5ec66aac3b7b220f0974f6b880e36c")
!799 = !DINamespace(name: "hint", scope: !64)
!800 = !DISubroutineType(types: !801)
!801 = !{null}
!802 = !DILocation(line: 2221, column: 21, scope: !803, inlinedAt: !806)
!803 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h23c2b209fb38fbb2E", scope: !805, file: !804, line: 2218, type: !800, scopeLine: 2218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !27)
!804 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "9636877b7f12d537541e2836c747da25")
!805 = !DINamespace(name: "unreachable_unchecked", scope: !799)
!806 = distinct !DILocation(line: 104, column: 9, scope: !797)
!807 = !DILocation(line: 105, column: 9, scope: !797)
!808 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17h553d4b577ec6da37E", scope: !128, file: !809, line: 673, type: !810, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !828)
!809 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "f644e187741d1cdbb316b1c25cd888e4")
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !641, !452, !452, !279, !279}
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !293, file: !2, size: 16, align: 8, elements: !813, templateParams: !27, identifier: "6710c8953afcc697203096182308687f")
!813 = !{!814}
!814 = !DICompositeType(tag: DW_TAG_variant_part, scope: !812, file: !2, size: 16, align: 8, elements: !815, templateParams: !27, identifier: "724f94d890085747533209f17abbfeb2", discriminator: !827)
!815 = !{!816, !823}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !814, file: !2, baseType: !817, size: 16, align: 8, extraData: i64 0)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !812, file: !2, size: 16, align: 8, elements: !818, templateParams: !820, identifier: "1822b5a2656957c62c50a7b4a41949b6")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !817, file: !2, baseType: !452, size: 8, align: 8, offset: 8)
!820 = !{!821, !822}
!821 = !DITemplateTypeParameter(name: "T", type: !452)
!822 = !DITemplateTypeParameter(name: "E", type: !452)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !814, file: !2, baseType: !824, size: 16, align: 8, extraData: i64 1)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !812, file: !2, size: 16, align: 8, elements: !825, templateParams: !820, identifier: "497fb1093c3b2140fa56658d15bbd2fe")
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !824, file: !2, baseType: !452, size: 8, align: 8, offset: 8)
!827 = !DIDerivedType(tag: DW_TAG_member, scope: !812, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!828 = !{!829, !830, !831, !832, !833, !834, !836}
!829 = !DILocalVariable(name: "self", arg: 1, scope: !808, file: !809, line: 674, type: !641)
!830 = !DILocalVariable(name: "current", arg: 2, scope: !808, file: !809, line: 675, type: !452)
!831 = !DILocalVariable(name: "new", arg: 3, scope: !808, file: !809, line: 676, type: !452)
!832 = !DILocalVariable(name: "success", arg: 4, scope: !808, file: !809, line: 677, type: !279)
!833 = !DILocalVariable(name: "failure", arg: 5, scope: !808, file: !809, line: 678, type: !279)
!834 = !DILocalVariable(name: "x", scope: !835, file: !809, line: 684, type: !39, align: 1)
!835 = distinct !DILexicalBlock(scope: !808, file: !809, line: 684, column: 13)
!836 = !DILocalVariable(name: "x", scope: !837, file: !809, line: 685, type: !39, align: 1)
!837 = distinct !DILexicalBlock(scope: !808, file: !809, line: 685, column: 13)
!838 = !DILocation(line: 674, column: 9, scope: !808)
!839 = !DILocation(line: 675, column: 9, scope: !808)
!840 = !DILocation(line: 676, column: 9, scope: !808)
!841 = !DILocation(line: 677, column: 9, scope: !808)
!842 = !DILocation(line: 678, column: 9, scope: !808)
!843 = !DILocalVariable(name: "self", arg: 1, scope: !844, file: !588, line: 2005, type: !848)
!844 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h6719abc267f6d924E", scope: !131, file: !588, line: 2005, type: !845, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !134, retainedNodes: !849)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!849 = !{!843}
!850 = !DILocation(line: 2005, column: 22, scope: !844, inlinedAt: !851)
!851 = distinct !DILocation(line: 682, column: 42, scope: !808)
!852 = !DILocation(line: 682, column: 56, scope: !808)
!853 = !DILocation(line: 682, column: 71, scope: !808)
!854 = !DILocation(line: 682, column: 13, scope: !808)
!855 = !DILocation(line: 681, column: 15, scope: !808)
!856 = !DILocation(line: 681, column: 9, scope: !808)
!857 = !DILocation(line: 684, column: 16, scope: !808)
!858 = !DILocation(line: 684, column: 16, scope: !835)
!859 = !DILocation(line: 684, column: 25, scope: !835)
!860 = !DILocation(line: 684, column: 22, scope: !835)
!861 = !DILocation(line: 684, column: 31, scope: !808)
!862 = !DILocation(line: 685, column: 17, scope: !808)
!863 = !DILocation(line: 685, column: 17, scope: !837)
!864 = !DILocation(line: 685, column: 27, scope: !837)
!865 = !DILocation(line: 685, column: 23, scope: !837)
!866 = !DILocation(line: 685, column: 33, scope: !808)
!867 = !DILocation(line: 687, column: 6, scope: !808)
!868 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core4sync6atomic10AtomicBool3new17h2a355f0f69698b92E", scope: !128, file: !809, line: 304, type: !869, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{!128, !452}
!871 = !{!872}
!872 = !DILocalVariable(name: "v", arg: 1, scope: !868, file: !809, line: 304, type: !452)
!873 = !DILocation(line: 304, column: 22, scope: !868)
!874 = !DILocation(line: 305, column: 41, scope: !868)
!875 = !DILocalVariable(name: "value", arg: 1, scope: !876, file: !588, line: 1962, type: !39)
!876 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17hab73e74efc3dfed4E", scope: !131, file: !588, line: 1962, type: !877, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !134, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{!131, !39}
!879 = !{!875}
!880 = !DILocation(line: 1962, column: 22, scope: !876, inlinedAt: !881)
!881 = distinct !DILocation(line: 305, column: 25, scope: !868)
!882 = !DILocation(line: 1963, column: 9, scope: !876, inlinedAt: !881)
!883 = !DILocation(line: 1964, column: 6, scope: !876, inlinedAt: !881)
!884 = !DILocation(line: 305, column: 9, scope: !868)
!885 = !DILocation(line: 306, column: 6, scope: !868)
!886 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17hcac003299d0504acE", scope: !128, file: !809, line: 453, type: !887, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!452, !641, !279}
!889 = !{!890, !891}
!890 = !DILocalVariable(name: "self", arg: 1, scope: !886, file: !809, line: 453, type: !641)
!891 = !DILocalVariable(name: "order", arg: 2, scope: !886, file: !809, line: 453, type: !279)
!892 = !DILocation(line: 453, column: 17, scope: !886)
!893 = !DILocation(line: 453, column: 24, scope: !886)
!894 = !DILocation(line: 2005, column: 22, scope: !844, inlinedAt: !895)
!895 = distinct !DILocation(line: 456, column: 30, scope: !886)
!896 = !DILocation(line: 456, column: 18, scope: !886)
!897 = !DILocation(line: 457, column: 6, scope: !886)
!898 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h4db5b78814bc7967E", scope: !128, file: !809, line: 481, type: !899, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !901)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !641, !452, !279}
!901 = !{!902, !903, !904}
!902 = !DILocalVariable(name: "self", arg: 1, scope: !898, file: !809, line: 481, type: !641)
!903 = !DILocalVariable(name: "val", arg: 2, scope: !898, file: !809, line: 481, type: !452)
!904 = !DILocalVariable(name: "order", arg: 3, scope: !898, file: !809, line: 481, type: !279)
!905 = !DILocation(line: 481, column: 18, scope: !898)
!906 = !DILocation(line: 481, column: 25, scope: !898)
!907 = !DILocation(line: 481, column: 36, scope: !898)
!908 = !DILocation(line: 2005, column: 22, scope: !844, inlinedAt: !909)
!909 = distinct !DILocation(line: 485, column: 26, scope: !898)
!910 = !DILocation(line: 485, column: 40, scope: !898)
!911 = !DILocation(line: 485, column: 13, scope: !898)
!912 = !DILocation(line: 487, column: 6, scope: !898)
!913 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h4980cb2ebcce7f32E", scope: !89, file: !809, line: 2239, type: !914, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{!9, !615, !9, !9, !279}
!916 = !{!917, !918, !919, !920, !921, !923}
!917 = !DILocalVariable(name: "self", arg: 1, scope: !913, file: !809, line: 2239, type: !615)
!918 = !DILocalVariable(name: "current", arg: 2, scope: !913, file: !809, line: 2240, type: !9)
!919 = !DILocalVariable(name: "new", arg: 3, scope: !913, file: !809, line: 2241, type: !9)
!920 = !DILocalVariable(name: "order", arg: 4, scope: !913, file: !809, line: 2242, type: !279)
!921 = !DILocalVariable(name: "x", scope: !922, file: !809, line: 2247, type: !9, align: 8)
!922 = distinct !DILexicalBlock(scope: !913, file: !809, line: 2247, column: 21)
!923 = !DILocalVariable(name: "x", scope: !924, file: !809, line: 2248, type: !9, align: 8)
!924 = distinct !DILexicalBlock(scope: !913, file: !809, line: 2248, column: 21)
!925 = !DILocation(line: 2239, column: 37, scope: !913)
!926 = !DILocation(line: 2240, column: 37, scope: !913)
!927 = !DILocation(line: 2241, column: 37, scope: !913)
!928 = !DILocation(line: 2242, column: 37, scope: !913)
!929 = !DILocation(line: 2246, column: 45, scope: !913)
!930 = !{i8 0, i8 5}
!931 = !DILocation(line: 2243, column: 23, scope: !913)
!932 = !{i64 0, i64 2}
!933 = !DILocation(line: 2243, column: 17, scope: !913)
!934 = !DILocation(line: 2247, column: 24, scope: !913)
!935 = !DILocation(line: 2247, column: 24, scope: !922)
!936 = !DILocation(line: 2247, column: 30, scope: !922)
!937 = !DILocation(line: 2247, column: 30, scope: !913)
!938 = !DILocation(line: 2248, column: 25, scope: !913)
!939 = !DILocation(line: 2248, column: 25, scope: !924)
!940 = !DILocation(line: 2248, column: 31, scope: !924)
!941 = !DILocation(line: 2248, column: 31, scope: !913)
!942 = !DILocation(line: 2250, column: 14, scope: !913)
!943 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17h31eeefa8e995e110E", scope: !89, file: !809, line: 2293, type: !944, scopeLine: 2293, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !961)
!944 = !DISubroutineType(types: !945)
!945 = !{!946, !615, !9, !9, !279, !279}
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !293, file: !2, size: 128, align: 64, elements: !947, templateParams: !27, identifier: "7c3ab0baaecebbe6776a2066b95611a5")
!947 = !{!948}
!948 = !DICompositeType(tag: DW_TAG_variant_part, scope: !946, file: !2, size: 128, align: 64, elements: !949, templateParams: !27, identifier: "6c3998eba236d46930b15303e1b1b742", discriminator: !960)
!949 = !{!950, !956}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !948, file: !2, baseType: !951, size: 128, align: 64, extraData: i64 0)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !946, file: !2, size: 128, align: 64, elements: !952, templateParams: !954, identifier: "e34ed496662312bae73b1872f0fb9204")
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !951, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!954 = !{!99, !955}
!955 = !DITemplateTypeParameter(name: "E", type: !9)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !948, file: !2, baseType: !957, size: 128, align: 64, extraData: i64 1)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !946, file: !2, size: 128, align: 64, elements: !958, templateParams: !954, identifier: "fd967c3035576a17e261f54e6b61c52")
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !957, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !946, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!961 = !{!962, !963, !964, !965, !966}
!962 = !DILocalVariable(name: "self", arg: 1, scope: !943, file: !809, line: 2293, type: !615)
!963 = !DILocalVariable(name: "current", arg: 2, scope: !943, file: !809, line: 2294, type: !9)
!964 = !DILocalVariable(name: "new", arg: 3, scope: !943, file: !809, line: 2295, type: !9)
!965 = !DILocalVariable(name: "success", arg: 4, scope: !943, file: !809, line: 2296, type: !279)
!966 = !DILocalVariable(name: "failure", arg: 5, scope: !943, file: !809, line: 2297, type: !279)
!967 = !DILocation(line: 2293, column: 37, scope: !943)
!968 = !DILocation(line: 2294, column: 37, scope: !943)
!969 = !DILocation(line: 2295, column: 37, scope: !943)
!970 = !DILocation(line: 2296, column: 37, scope: !943)
!971 = !DILocation(line: 2297, column: 37, scope: !943)
!972 = !DILocalVariable(name: "self", arg: 1, scope: !973, file: !588, line: 2005, type: !977)
!973 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha2183fb617f84e4dE", scope: !94, file: !588, line: 2005, type: !974, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !98, retainedNodes: !978)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!978 = !{!972}
!979 = !DILocation(line: 2005, column: 22, scope: !973, inlinedAt: !980)
!980 = distinct !DILocation(line: 2299, column: 50, scope: !943)
!981 = !DILocation(line: 2299, column: 26, scope: !943)
!982 = !DILocation(line: 2300, column: 14, scope: !943)
!983 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17haff237dfbd7e7590E", scope: !89, file: !809, line: 2126, type: !984, scopeLine: 2126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !986)
!984 = !DISubroutineType(types: !985)
!985 = !{!9, !615, !279}
!986 = !{!987, !988}
!987 = !DILocalVariable(name: "self", arg: 1, scope: !983, file: !809, line: 2126, type: !615)
!988 = !DILocalVariable(name: "order", arg: 2, scope: !983, file: !809, line: 2126, type: !279)
!989 = !DILocation(line: 2126, column: 25, scope: !983)
!990 = !DILocation(line: 2126, column: 32, scope: !983)
!991 = !DILocation(line: 2005, column: 22, scope: !973, inlinedAt: !992)
!992 = distinct !DILocation(line: 2128, column: 38, scope: !983)
!993 = !DILocation(line: 2128, column: 26, scope: !983)
!994 = !DILocation(line: 2129, column: 14, scope: !983)
!995 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17hb8a1bea2d01d2b63E", scope: !89, file: !809, line: 2153, type: !996, scopeLine: 2153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !615, !9, !279}
!998 = !{!999, !1000, !1001}
!999 = !DILocalVariable(name: "self", arg: 1, scope: !995, file: !809, line: 2153, type: !615)
!1000 = !DILocalVariable(name: "val", arg: 2, scope: !995, file: !809, line: 2153, type: !9)
!1001 = !DILocalVariable(name: "order", arg: 3, scope: !995, file: !809, line: 2153, type: !279)
!1002 = !DILocation(line: 2153, column: 26, scope: !995)
!1003 = !DILocation(line: 2153, column: 33, scope: !995)
!1004 = !DILocation(line: 2153, column: 49, scope: !995)
!1005 = !DILocation(line: 2005, column: 22, scope: !973, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 2155, column: 39, scope: !995)
!1007 = !DILocation(line: 2155, column: 26, scope: !995)
!1008 = !DILocation(line: 2156, column: 14, scope: !995)
!1009 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h71dad7f5df981851E", scope: !90, file: !809, line: 3505, type: !800, scopeLine: 3505, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !27)
!1010 = !DILocation(line: 175, column: 18, scope: !1011, inlinedAt: !1012)
!1011 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17hf863d1e5fb8648b8E", scope: !799, file: !798, line: 165, type: !800, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !27)
!1012 = distinct !DILocation(line: 3506, column: 5, scope: !1009)
!1013 = !DILocation(line: 3507, column: 2, scope: !1009)
!1014 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h34ae987cec43635aE", scope: !90, file: !809, line: 3091, type: !1015, scopeLine: 3091, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !98, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!946, !976, !9, !9, !279, !279}
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1025}
!1018 = !DILocalVariable(name: "dst", arg: 1, scope: !1014, file: !809, line: 3092, type: !976)
!1019 = !DILocalVariable(name: "old", arg: 2, scope: !1014, file: !809, line: 3093, type: !9)
!1020 = !DILocalVariable(name: "new", arg: 3, scope: !1014, file: !809, line: 3094, type: !9)
!1021 = !DILocalVariable(name: "success", arg: 4, scope: !1014, file: !809, line: 3095, type: !279)
!1022 = !DILocalVariable(name: "failure", arg: 5, scope: !1014, file: !809, line: 3096, type: !279)
!1023 = !DILocalVariable(name: "val", scope: !1024, file: !809, line: 3099, type: !9, align: 8)
!1024 = distinct !DILexicalBlock(scope: !1014, file: !809, line: 3099, column: 5)
!1025 = !DILocalVariable(name: "ok", scope: !1024, file: !809, line: 3099, type: !452, align: 1)
!1026 = !DILocation(line: 3092, column: 5, scope: !1014)
!1027 = !DILocation(line: 3093, column: 5, scope: !1014)
!1028 = !DILocation(line: 3094, column: 5, scope: !1014)
!1029 = !DILocation(line: 3095, column: 5, scope: !1014)
!1030 = !DILocation(line: 3096, column: 5, scope: !1014)
!1031 = !DILocation(line: 3100, column: 15, scope: !1014)
!1032 = !DILocation(line: 3100, column: 9, scope: !1014)
!1033 = !DILocation(line: 3113, column: 34, scope: !1014)
!1034 = !DILocation(line: 3114, column: 34, scope: !1014)
!1035 = !DILocation(line: 3115, column: 33, scope: !1014)
!1036 = !DILocation(line: 3099, column: 10, scope: !1014)
!1037 = !DILocation(line: 3099, column: 10, scope: !1024)
!1038 = !DILocation(line: 3099, column: 15, scope: !1014)
!1039 = !DILocation(line: 3099, column: 15, scope: !1024)
!1040 = !DILocation(line: 3120, column: 8, scope: !1024)
!1041 = !DILocation(line: 3110, column: 34, scope: !1014)
!1042 = !DILocation(line: 3111, column: 34, scope: !1014)
!1043 = !DILocation(line: 3112, column: 33, scope: !1014)
!1044 = !DILocation(line: 3104, column: 35, scope: !1014)
!1045 = !DILocation(line: 3105, column: 35, scope: !1014)
!1046 = !DILocation(line: 3106, column: 34, scope: !1014)
!1047 = !DILocation(line: 3107, column: 35, scope: !1014)
!1048 = !DILocation(line: 3108, column: 35, scope: !1014)
!1049 = !DILocation(line: 3109, column: 34, scope: !1014)
!1050 = !DILocation(line: 3101, column: 35, scope: !1014)
!1051 = !DILocation(line: 3102, column: 35, scope: !1014)
!1052 = !DILocation(line: 3103, column: 34, scope: !1014)
!1053 = !DILocation(line: 3117, column: 29, scope: !1014)
!1054 = !DILocation(line: 3116, column: 28, scope: !1014)
!1055 = !DILocation(line: 3120, column: 30, scope: !1024)
!1056 = !DILocation(line: 3120, column: 5, scope: !1024)
!1057 = !DILocation(line: 3120, column: 13, scope: !1024)
!1058 = !DILocation(line: 3121, column: 2, scope: !1014)
!1059 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h11151407cd0ec589E", scope: !90, file: !809, line: 2994, type: !1060, scopeLine: 2994, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !268, templateParams: !27, retainedNodes: !1062)
!1060 = !DISubroutineType(types: !1061)
