; ModuleID = '4zpp01r331gj1a5o'
source_filename = "4zpp01r331gj1a5o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !29, identifier: "a00285579fbbc59b5b979a7976db07b3")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::fmt::Arguments", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !15, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !17, templateParams: !29, identifier: "5c0bf663e13aed18b42e27881fea807c")
!15 = !DINamespace(name: "fmt", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18, !31, !84}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !14, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !20, templateParams: !29, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!20 = !{!21, !30}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !24, templateParams: !29, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !23, file: !2, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !14, file: !2, baseType: !32, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "256519899e0672ceeaebd48b858206cf")
!33 = !DINamespace(name: "option", scope: !16)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !32, file: !2, size: 128, align: 64, elements: !36, templateParams: !29, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !83)
!36 = !{!37, !79}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !35, file: !2, baseType: !38, size: 128, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !39, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "T", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !42, templateParams: !29, identifier: "24318146e6c8bdc87822ff535a36a389")
!42 = !{!43, !78}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !41, file: !2, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !46, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !29, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!46 = !DINamespace(name: "rt", scope: !15)
!47 = !{!48, !49, !51, !58, !60, !77}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !45, file: !2, baseType: !50, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !45, file: !2, baseType: !52, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !46, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !2, baseType: !59, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !45, file: !2, baseType: !61, size: 128, align: 64, flags: DIFlagPublic)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !62, templateParams: !29, identifier: "96b697dd48c62362a4fdd24d145e624f")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_variant_part, scope: !61, file: !2, size: 128, align: 64, elements: !64, templateParams: !29, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !75)
!64 = !{!65, !69, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !63, file: !2, baseType: !66, size: 128, align: 64, extraData: i128 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !29, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !63, file: !2, baseType: !70, size: 128, align: 64, extraData: i128 1)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !29, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !63, file: !2, baseType: !74, size: 128, align: 64, extraData: i128 2)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !61, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "a1add839f51aefefecdce3df6110b61f")
!75 = !DIDerivedType(tag: DW_TAG_member, scope: !61, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!76 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !45, file: !2, baseType: !61, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !35, file: !2, baseType: !80, size: 128, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !39, identifier: "f965b304662f282235bb5dc25f3fae0f")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !2, baseType: !41, size: 128, align: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, scope: !32, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !2, baseType: !85, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !86, templateParams: !29, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!86 = !{!87, !149}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !2, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !90, templateParams: !29, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !89, file: !2, baseType: !92, size: 64, align: 64, flags: DIFlagPrivate)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !94, file: !2, align: 8, elements: !29, identifier: "fffd88202d364d3dc6423c86977eda88")
!94 = !DINamespace(name: "{extern#0}", scope: !46)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !89, file: !2, baseType: !96, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !92, !117}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !100, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !101, templateParams: !29, identifier: "27f960845886d02861ac4e7842c7e3a5")
!100 = !DINamespace(name: "result", scope: !16)
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_variant_part, scope: !99, file: !2, size: 8, align: 8, elements: !103, templateParams: !29, identifier: "66d489f599415104a0443264f219183e", discriminator: !116)
!103 = !{!104, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !102, file: !2, baseType: !105, size: 8, align: 8, extraData: i128 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !106, templateParams: !108, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "T", type: !7)
!110 = !DITemplateTypeParameter(name: "E", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !15, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !102, file: !2, baseType: !113, size: 8, align: 8, extraData: i128 1)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !99, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !114, templateParams: !108, identifier: "c5badd8093158a69d1e378abd358f888")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !113, file: !2, baseType: !111, align: 8, offset: 8, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !99, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagArtificial)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !15, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !119, templateParams: !29, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!119 = !{!120, !121, !122, !123, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !2, baseType: !59, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !2, baseType: !50, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !52, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !118, file: !2, baseType: !124, size: 128, align: 64, flags: DIFlagPrivate)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !125, templateParams: !29, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !124, file: !2, size: 128, align: 64, elements: !127, templateParams: !29, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !136)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i128 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !130, identifier: "ae81ebe2a9866af8df117bed47adaee")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !9)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !133, size: 128, align: 64, extraData: i128 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !134, templateParams: !130, identifier: "a581ef88bb755022340fa98600955727")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !118, file: !2, baseType: !124, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !2, baseType: !139, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !140, templateParams: !29, identifier: "6607f9b055c62ce71a6a286c8014df9")
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !2, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !29, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !139, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3, lowerBound: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "<bootloader_api::config::ApiVersion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::config::ApiVersion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !153, vtableHolder: !158, templateParams: !29, identifier: "ebf2824d2d3006621df95ec1ce994663")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !152, file: !2, baseType: !6, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !152, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ApiVersion", scope: !159, file: !2, size: 64, align: 16, flags: DIFlagPublic, elements: !161, templateParams: !29, identifier: "d1071f3d17a12b8b4cf428493c082ddb")
!159 = !DINamespace(name: "config", scope: !160)
!160 = !DINamespace(name: "bootloader_api", scope: null)
!161 = !{!162, !164, !165, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !158, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!163 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !158, file: !2, baseType: !163, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "version_patch", scope: !158, file: !2, baseType: !163, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pre_release", scope: !158, file: !2, baseType: !167, size: 8, align: 8, offset: 48, flags: DIFlagPrivate)
!167 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "<bootloader_api::info::MemoryRegions as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::MemoryRegions as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !171, vtableHolder: !176, templateParams: !29, identifier: "21275bb4a011fbda76b9a36b5455c06a")
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !170, file: !2, baseType: !6, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !170, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegions", scope: !177, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !178, templateParams: !29, identifier: "3530008cf87cc125fca3b74cf62a6d0c")
!177 = !DINamespace(name: "info", scope: !160)
!178 = !{!179, !203}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !176, file: !2, baseType: !180, size: 64, align: 64, flags: DIFlagProtected)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader_api::info::MemoryRegion", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !177, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !182, templateParams: !29, identifier: "5903c0d441ca3d7e8261a8dee18bad7f")
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !181, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPublic)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !181, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !181, file: !2, baseType: !186, size: 64, align: 32, offset: 128, flags: DIFlagPublic)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegionKind", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !187, templateParams: !29, identifier: "3fc6ee2ca55cc583d84e9d108eb840dd")
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_variant_part, scope: !186, file: !2, size: 64, align: 32, elements: !189, templateParams: !29, identifier: "ad2ac08c2717e9e99566a943e6d0df51", discriminator: !202)
!189 = !{!190, !192, !194, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Usable", scope: !188, file: !2, baseType: !191, size: 64, align: 32, extraData: i128 0)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Usable", scope: !186, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, identifier: "dca5745781ddddef2670459aed804e27")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Bootloader", scope: !188, file: !2, baseType: !193, size: 64, align: 32, extraData: i128 1)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bootloader", scope: !186, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, identifier: "9f5360bc8d5463b245d5320fe99c7d1")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownUefi", scope: !188, file: !2, baseType: !195, size: 64, align: 32, extraData: i128 2)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnknownUefi", scope: !186, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !196, templateParams: !29, identifier: "26c2ec7cd2eba01f7fc0356ffd4d26d5")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownBios", scope: !188, file: !2, baseType: !199, size: 64, align: 32, extraData: i128 3)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnknownBios", scope: !186, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !200, templateParams: !29, identifier: "87d8c1e755e15bc3ff72eb607aabc85c")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !2, baseType: !59, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !186, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !176, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "<bootloader_api::info::Optional<bootloader_api::info::FrameBuffer> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::Optional<bootloader_api::info::FrameBuffer> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !207, vtableHolder: !212, templateParams: !29, identifier: "64b4d69102b03e3d3cf10ca175c87f2c")
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !206, file: !2, baseType: !6, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !206, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !206, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional<bootloader_api::info::FrameBuffer>", scope: !177, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !213, templateParams: !29, identifier: "430cb57c2ef32d287c56e68e36e75fd")
!213 = !{!214}
!214 = !DICompositeType(tag: DW_TAG_variant_part, scope: !212, file: !2, size: 512, align: 64, elements: !215, templateParams: !29, identifier: "8386d485117cfb31f83fe548d4feb7ec", discriminator: !253)
!215 = !{!216, !251}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !214, file: !2, baseType: !217, size: 512, align: 64, extraData: i128 0)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !212, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !218, templateParams: !249, identifier: "9e4e6c8fb2a5feae8062837961d97eef")
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !217, file: !2, baseType: !220, size: 448, align: 64, offset: 64, flags: DIFlagPublic)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", scope: !177, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !221, templateParams: !29, identifier: "e27d969d6c0186c9c7c4d86a7dfc9d2")
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !220, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagProtected)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !220, file: !2, baseType: !224, size: 384, align: 64, offset: 64, flags: DIFlagProtected)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBufferInfo", scope: !177, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !225, templateParams: !29, identifier: "8323e07bfb7a69c418e6a683cc746c2")
!225 = !{!226, !227, !228, !229, !247, !248}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "byte_len", scope: !224, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !224, file: !2, baseType: !230, size: 64, align: 32, offset: 192, flags: DIFlagPublic)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelFormat", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !231, templateParams: !29, identifier: "a26c715ab0de29c27bbdf2c87d305d19")
!231 = !{!232}
!232 = !DICompositeType(tag: DW_TAG_variant_part, scope: !230, file: !2, size: 64, align: 32, elements: !233, templateParams: !29, identifier: "347d59b7154c2ff4e1b220b282780354", discriminator: !246)
!233 = !{!234, !236, !238, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Rgb", scope: !232, file: !2, baseType: !235, size: 64, align: 32, extraData: i128 0)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rgb", scope: !230, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, identifier: "2e1c5e894827ab6755346ceef919b6f")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Bgr", scope: !232, file: !2, baseType: !237, size: 64, align: 32, extraData: i128 1)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bgr", scope: !230, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, identifier: "50a7113546fcf06b3b36f9fb7fbbf682")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "U8", scope: !232, file: !2, baseType: !239, size: 64, align: 32, extraData: i128 2)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "U8", scope: !230, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, identifier: "9c214ef271cf586e69c7865ba3fb8278")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Unknown", scope: !232, file: !2, baseType: !241, size: 64, align: 32, extraData: i128 3)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unknown", scope: !230, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !242, templateParams: !29, identifier: "32c0388f187e03fa47fab74f681cddfa")
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "red_position", scope: !241, file: !2, baseType: !27, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "green_position", scope: !241, file: !2, baseType: !27, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "blue_position", scope: !241, file: !2, baseType: !27, size: 8, align: 8, offset: 48, flags: DIFlagPublic)
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !230, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_pixel", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!249 = !{!250}
!250 = !DITemplateTypeParameter(name: "T", type: !220)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !214, file: !2, baseType: !252, size: 512, align: 64, extraData: i128 1)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !212, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !249, identifier: "ff1a09150b89056db46bd8d18ecfd90")
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !212, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "<bootloader_api::info::Optional<u64> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !256, isLocal: true, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::Optional<u64> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !257, vtableHolder: !262, templateParams: !29, identifier: "3022228859ebf048141d6199ac7c5472")
!257 = !{!258, !259, !260, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !256, file: !2, baseType: !6, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !256, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !256, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !256, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional<u64>", scope: !177, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !263, templateParams: !29, identifier: "ca44835def0f07369a7a29fdf2bee2b")
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_variant_part, scope: !262, file: !2, size: 128, align: 64, elements: !265, templateParams: !29, identifier: "a6ea4db5acf27f6d128263224c88d7bb", discriminator: !274)
!265 = !{!266, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !264, file: !2, baseType: !267, size: 128, align: 64, extraData: i128 0)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !262, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !268, templateParams: !270, identifier: "fa22449526702762a6d03e2690cd144f")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!270 = !{!271}
!271 = !DITemplateTypeParameter(name: "T", type: !76)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !264, file: !2, baseType: !273, size: 128, align: 64, extraData: i128 1)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !262, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !270, identifier: "88d45f28b0fdc3552f867d36592d4124")
!274 = !DIDerivedType(tag: DW_TAG_member, scope: !262, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "<bootloader_api::info::Optional<u16> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::Optional<u16> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !278, vtableHolder: !283, templateParams: !29, identifier: "a95e756f2075b6ab3e6ba1150482e4eb")
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !277, file: !2, baseType: !6, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !277, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !277, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !277, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional<u16>", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !284, templateParams: !29, identifier: "b90463743f8e5fe0a05f26eabae66d37")
!284 = !{!285}
!285 = !DICompositeType(tag: DW_TAG_variant_part, scope: !283, file: !2, size: 64, align: 32, elements: !286, templateParams: !29, identifier: "f36d940a8cb56e34b0321c1964845f56", discriminator: !295)
!286 = !{!287, !293}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !285, file: !2, baseType: !288, size: 64, align: 32, extraData: i128 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !283, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !289, templateParams: !291, identifier: "7f0cbef8b7cbdd321eb4c9377f74624d")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !288, file: !2, baseType: !163, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "T", type: !163)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !285, file: !2, baseType: !294, size: 64, align: 32, extraData: i128 1)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !283, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !29, templateParams: !291, identifier: "cb2b1f4a010104d55c55f9345406e73f")
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !283, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "<bootloader_api::info::Optional<bootloader_api::info::TlsTemplate> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::Optional<bootloader_api::info::TlsTemplate> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !299, vtableHolder: !304, templateParams: !29, identifier: "84111973c21f1474c5dffef692d9906c")
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !298, file: !2, baseType: !6, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !298, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !298, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !298, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional<bootloader_api::info::TlsTemplate>", scope: !177, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !305, templateParams: !29, identifier: "4724613b49c0468ebbad0ab2e0d1de83")
!305 = !{!306}
!306 = !DICompositeType(tag: DW_TAG_variant_part, scope: !304, file: !2, size: 256, align: 64, elements: !307, templateParams: !29, identifier: "92467f0bea343016cb3327192d794a80", discriminator: !321)
!307 = !{!308, !319}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !306, file: !2, baseType: !309, size: 256, align: 64, extraData: i128 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !304, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !310, templateParams: !317, identifier: "99854862a499748b6c205b1c349a2344")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !309, file: !2, baseType: !312, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !177, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !313, templateParams: !29, identifier: "b90b980acf524366332302020f47a658")
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !312, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPublic)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !312, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !312, file: !2, baseType: !76, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!317 = !{!318}
!318 = !DITemplateTypeParameter(name: "T", type: !312)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !306, file: !2, baseType: !320, size: 256, align: 64, extraData: i128 1)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !304, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !317, identifier: "f792fc62283197a7e8ad782aff62247")
!321 = !DIDerivedType(tag: DW_TAG_member, scope: !304, file: !2, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !325, vtableHolder: !76, templateParams: !29, identifier: "b9b0cb319a7d463144fc74516180638a")
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !324, file: !2, baseType: !6, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !324, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !324, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !324, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !333, vtableHolder: !338, templateParams: !29, identifier: "6ceed83188e32c7f9652d06d9d8d627c")
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !332, file: !2, baseType: !6, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !332, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !332, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !332, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !342, vtableHolder: !23, templateParams: !29, identifier: "ed154bdd413ffeab42f0e27636dee894")
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !341, file: !2, baseType: !6, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !341, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !341, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !341, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !350, vtableHolder: !59, templateParams: !29, identifier: "f85b3e45771706a9e9b43b40364b7716")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !349, file: !2, baseType: !6, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !349, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !358, vtableHolder: !363, templateParams: !29, identifier: "3ce38d829cd8edca542b8021bf4ac8d1")
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !357, file: !2, baseType: !6, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !357, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "<&bootloader_api::info::FrameBufferInfo as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader_api::info::FrameBufferInfo as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !367, vtableHolder: !372, templateParams: !29, identifier: "71361545c25fd3a637502fb094bf908d")
!367 = !{!368, !369, !370, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !366, file: !2, baseType: !6, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !366, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !366, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::info::FrameBufferInfo", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "<u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !376, vtableHolder: !27, templateParams: !29, identifier: "a1671c50a8e45baf482a3970f8176269")
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !375, file: !2, baseType: !6, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !375, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !375, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !375, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !384, vtableHolder: !389, templateParams: !29, identifier: "77c7f54f1071abb5fde1ca72bea12377")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !383, file: !2, baseType: !6, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !383, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !383, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !383, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !393, vtableHolder: !163, templateParams: !29, identifier: "cc4d06a836eb85b751048971eb6e8389")
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !392, file: !2, baseType: !6, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !392, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !392, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !392, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !401, vtableHolder: !406, templateParams: !29, identifier: "eb383e1e2cdd0e7e41dfd1a0d381e57d")
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !400, file: !2, baseType: !6, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !400, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&(dyn core::any::Any + core::marker::Send) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !410, vtableHolder: !415, templateParams: !29, identifier: "553928fbc6925353ab616833209efccb")
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !409, file: !2, baseType: !6, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !409, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !416, templateParams: !29, identifier: "26d43a9b6d12b117751598b186fa5617")
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !415, file: !2, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64, dwarfAddressSpace: 0)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "e5b3057f7b10b8c52014a7991b8218cd")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !415, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<&core::fmt::Arguments> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !424, vtableHolder: !429, templateParams: !29, identifier: "bf0dbdf65223d98060cccd1045680e1c")
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !423, file: !2, baseType: !6, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !423, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !430, templateParams: !29, identifier: "b69fcac78aacc390de3151c1212a43c9")
!430 = !{!431}
!431 = !DICompositeType(tag: DW_TAG_variant_part, scope: !429, file: !2, size: 64, align: 64, elements: !432, templateParams: !29, identifier: "eb1fcac313ca09c387d2b4b3f7cfa24f", discriminator: !441)
!432 = !{!433, !437}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !431, file: !2, baseType: !434, size: 64, align: 64, extraData: i128 0)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !429, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !435, identifier: "c814ef4e231fea575b667cbe44c9b49")
!435 = !{!436}
!436 = !DITemplateTypeParameter(name: "T", type: !13)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !431, file: !2, baseType: !438, size: 64, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !429, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !439, templateParams: !435, identifier: "5a2547bb3159b3da1b809eabd7ff0377")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !438, file: !2, baseType: !13, size: 64, align: 64, flags: DIFlagPublic)
!441 = !DIDerivedType(tag: DW_TAG_member, scope: !429, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::panic::location::Location as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !445, vtableHolder: !450, templateParams: !29, identifier: "14704c63251a2906dbd0b528a495269")
!445 = !{!446, !447, !448, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !444, file: !2, baseType: !6, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !444, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !444, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !452, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !454, templateParams: !29, identifier: "a313c32de3a8c9bc539767ad1b1d23fa")
!452 = !DINamespace(name: "location", scope: !453)
!453 = !DINamespace(name: "panic", scope: !16)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !451, file: !2, baseType: !23, size: 128, align: 64, flags: DIFlagPrivate)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !451, file: !2, baseType: !59, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !451, file: !2, baseType: !59, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !461, vtableHolder: !167, templateParams: !29, identifier: "ad33a4b560891dcb9ee705ba28e17c27")
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !460, file: !2, baseType: !6, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !460, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !460, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "<*mut bootloader_api::info::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "<*mut bootloader_api::info::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !469, vtableHolder: !180, templateParams: !29, identifier: "15b946d54db2dfa23d91c798293e17c3")
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !468, file: !2, baseType: !6, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !468, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !477, vtableHolder: !482, templateParams: !29, identifier: "e06ac59f8f3dec29c3501decb6bfda8c")
!477 = !{!478, !479, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !476, file: !2, baseType: !6, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !476, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !476, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !476, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !486, vtableHolder: !9, templateParams: !29, identifier: "661f317fed17ef9bebd3b152203aad26")
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !485, file: !2, baseType: !6, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !485, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !485, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "<bootloader_api::info::PixelFormat as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bootloader_api::info::PixelFormat as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !494, vtableHolder: !230, templateParams: !29, identifier: "6c76fb6c9949032adf5c797c29d9556b")
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !493, file: !2, baseType: !6, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !493, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !493, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !493, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "<vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "<vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !502, vtableHolder: !509, templateParams: !29, identifier: "761b2d764ccd3b5b9044a6b6c7ac6329")
!502 = !{!503, !504, !505, !506, !507, !508}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !501, file: !2, baseType: !6, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !501, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !501, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !501, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !501, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !501, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !510, file: !2, size: 1728, align: 64, flags: DIFlagPublic, elements: !511, templateParams: !29, identifier: "b0f29b4e731de200748a96c419b2014b")
!510 = !DINamespace(name: "vga", scope: null)
!511 = !{!512, !513, !521, !522, !540, !545}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !509, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !509, file: !2, baseType: !514, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !510, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !515, templateParams: !29, identifier: "55c28ff37ad9e165233727d34ead0b72")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !514, file: !2, baseType: !517, size: 128, align: 64, flags: DIFlagPrivate)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !510, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !518, templateParams: !29, identifier: "d3caead7bce18958151699ca4bdc5246")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !517, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !517, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !509, file: !2, baseType: !517, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !509, file: !2, baseType: !523, size: 64, align: 64, flags: DIFlagPrivate)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !524, size: 64, align: 64, dwarfAddressSpace: 0)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !510, file: !2, size: 32000, align: 8, flags: DIFlagPrivate, elements: !525, templateParams: !29, identifier: "e6b677ce8937020c51adb0c996194102")
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !524, file: !2, baseType: !527, size: 32000, align: 8, flags: DIFlagPrivate)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 32000, align: 8, elements: !538)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 1280, align: 8, elements: !536)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !510, file: !2, size: 16, align: 8, flags: DIFlagPrivate, elements: !530, templateParams: !29, identifier: "222e81c2b39a79fb6c2702a5fabe9a27")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !529, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !529, file: !2, baseType: !533, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !510, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !534, templateParams: !29, identifier: "63816b86c1e17f936d69e131ef35e859")
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !533, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagPrivate)
!536 = !{!537}
!537 = !DISubrange(count: 80, lowerBound: 0)
!538 = !{!539}
!539 = !DISubrange(count: 25, lowerBound: 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !509, file: !2, baseType: !541, size: 8, align: 8, offset: 1664, flags: DIFlagPrivate)
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !510, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !542)
!542 = !{!543, !544}
!543 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!544 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !509, file: !2, baseType: !528, size: 1280, align: 8, offset: 384, flags: DIFlagPrivate)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "<&bootloader_api::info::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader_api::info::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !549, vtableHolder: !554, templateParams: !29, identifier: "26c51764b6fd270fe8cde2861d757836")
!549 = !{!550, !551, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !548, file: !2, baseType: !6, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !548, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !548, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::info::TlsTemplate", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "<&u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !558, vtableHolder: !563, templateParams: !29, identifier: "55695ee4c7da45aa8f85077e95500fb5")
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !557, file: !2, baseType: !6, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !557, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !557, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !557, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "<&bootloader_api::info::FrameBuffer as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader_api::info::FrameBuffer as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !567, vtableHolder: !572, templateParams: !29, identifier: "1efb49d753332d0d1384144b1823066e")
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !566, file: !2, baseType: !6, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !566, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !566, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !566, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader_api::info::FrameBuffer", baseType: !220, size: 64, align: 64, dwarfAddressSpace: 0)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::_::InternalBitFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::_::InternalBitFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !576, vtableHolder: !581, templateParams: !29, identifier: "6f0cb4086a454e6bef8713d26fe2d77e")
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !575, file: !2, baseType: !6, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !575, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !575, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !575, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::_::InternalBitFlags", baseType: !582, size: 64, align: 64, dwarfAddressSpace: 0)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalBitFlags", scope: !583, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !587, templateParams: !29, identifier: "fd2a026fa4b7c3a7c1c348116a0ccf6c")
!583 = !DINamespace(name: "_", scope: !584)
!584 = !DINamespace(name: "idt", scope: !585)
!585 = !DINamespace(name: "structures", scope: !586)
!586 = !DINamespace(name: "x86_64", scope: null)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !582, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagProtected)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "BOOTLOADER_CONFIG", linkageName: "_ZN4theo17BOOTLOADER_CONFIG17h1eaf019cabb9262dE", scope: !591, file: !592, line: 23, type: !593, isLocal: true, isDefinition: true, align: 64)
!591 = !DINamespace(name: "theo", scope: null)
!592 = !DIFile(filename: "src/main.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "67931db171fb34075459f70e420d2a74")
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "BootloaderConfig", scope: !159, file: !2, size: 1472, align: 64, flags: DIFlagPublic, elements: !594, templateParams: !29, identifier: "e1d2124ffd2a9da3f2803cdb3e913a8")
!594 = !{!595, !596, !643, !644}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !593, file: !2, baseType: !158, size: 64, align: 16, offset: 1344, flags: DIFlagProtected)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !593, file: !2, baseType: !597, size: 1088, align: 64, flags: DIFlagPublic)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mappings", scope: !159, file: !2, size: 1088, align: 64, flags: DIFlagPublic, elements: !598, templateParams: !29, identifier: "c1be888176bdea36159ead97449117da")
!598 = !{!599, !611, !612, !613, !627, !628, !629, !641, !642}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack", scope: !597, file: !2, baseType: !600, size: 128, align: 64, flags: DIFlagPublic)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mapping", scope: !159, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !601, templateParams: !29, identifier: "603df5d4b92f8b6d7d7332540b323ad6")
!601 = !{!602}
!602 = !DICompositeType(tag: DW_TAG_variant_part, scope: !600, file: !2, size: 128, align: 64, elements: !603, templateParams: !29, identifier: "952b06d52f6656e963f6eb1cbd4538b", discriminator: !610)
!603 = !{!604, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Dynamic", scope: !602, file: !2, baseType: !605, size: 128, align: 64, extraData: i128 0)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dynamic", scope: !600, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "d0c3e9ecb589265736d80456957eceab")
!606 = !DIDerivedType(tag: DW_TAG_member, name: "FixedAddress", scope: !602, file: !2, baseType: !607, size: 128, align: 64, extraData: i128 1)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedAddress", scope: !600, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !608, templateParams: !29, identifier: "5680c18a49d07ababe811e258f74c10c")
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !607, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!610 = !DIDerivedType(tag: DW_TAG_member, scope: !600, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !597, file: !2, baseType: !600, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "framebuffer", scope: !597, file: !2, baseType: !600, size: 128, align: 64, offset: 256, flags: DIFlagPublic)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "physical_memory", scope: !597, file: !2, baseType: !614, size: 128, align: 64, offset: 768, flags: DIFlagPublic)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bootloader_api::config::Mapping>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !615, templateParams: !29, identifier: "e866f088af3379dcaa381ba8ebcf4bd")
!615 = !{!616}
!616 = !DICompositeType(tag: DW_TAG_variant_part, scope: !614, file: !2, size: 128, align: 64, elements: !617, templateParams: !29, identifier: "5f44b9be3a73a97c1caac64f22406e7", discriminator: !626)
!617 = !{!618, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !616, file: !2, baseType: !619, size: 128, align: 64, extraData: i128 2)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !614, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !620, identifier: "4c05c4cab9fdc18aa271121a3cfbe73a")
!620 = !{!621}
!621 = !DITemplateTypeParameter(name: "T", type: !600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !616, file: !2, baseType: !623, size: 128, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !614, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !624, templateParams: !620, identifier: "ae5e612e98bb3c93441530a7a76a6a7a")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !623, file: !2, baseType: !600, size: 128, align: 64, flags: DIFlagPublic)
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !614, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_recursive", scope: !597, file: !2, baseType: !614, size: 128, align: 64, offset: 896, flags: DIFlagPublic)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aslr", scope: !597, file: !2, baseType: !167, size: 8, align: 8, offset: 1024, flags: DIFlagPublic)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_start", scope: !597, file: !2, baseType: !630, size: 128, align: 64, offset: 384, flags: DIFlagPublic)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !631, templateParams: !29, identifier: "6f1696d18d23d47c69b222f2f35e16b5")
!631 = !{!632}
!632 = !DICompositeType(tag: DW_TAG_variant_part, scope: !630, file: !2, size: 128, align: 64, elements: !633, templateParams: !29, identifier: "73e7139f007f4e6023be7ef6d253e356", discriminator: !640)
!633 = !{!634, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !632, file: !2, baseType: !635, size: 128, align: 64, extraData: i128 0)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !630, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !270, identifier: "e506bb47389de31fa5a35e49f43ba94d")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !632, file: !2, baseType: !637, size: 128, align: 64, extraData: i128 1)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !630, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !638, templateParams: !270, identifier: "7e2f1f2d455f3cb646237311fb922a41")
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !637, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !630, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagArtificial)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_range_end", scope: !597, file: !2, baseType: !630, size: 128, align: 64, offset: 512, flags: DIFlagPublic)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ramdisk_memory", scope: !597, file: !2, baseType: !600, size: 128, align: 64, offset: 640, flags: DIFlagPublic)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_stack_size", scope: !593, file: !2, baseType: !76, size: 64, align: 64, offset: 1408, flags: DIFlagPublic)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_buffer", scope: !593, file: !2, baseType: !645, size: 256, align: 64, offset: 1088, flags: DIFlagPublic)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", scope: !159, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !646, templateParams: !29, identifier: "9c286d074499f3609ad655be57422f52")
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_height", scope: !645, file: !2, baseType: !630, size: 128, align: 64, flags: DIFlagPublic)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_framebuffer_width", scope: !645, file: !2, baseType: !630, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17h41147477e7839572E", scope: !651, file: !652, line: 161, type: !653, isLocal: true, isDefinition: true, align: 8)
!651 = !DINamespace(name: "interrupts", scope: !591)
!652 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !651, file: !2, align: 8, flags: DIFlagPrivate, elements: !654, templateParams: !29, identifier: "f44f63bfcec83577280b6755c2a4f7c4")
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !653, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hc000ba55d5e2c985E", scope: !658, file: !661, line: 29, type: !662, isLocal: true, isDefinition: true, align: 128)
!658 = !DINamespace(name: "__stability", scope: !659)
!659 = !DINamespace(name: "deref", scope: !660)
!660 = !DINamespace(name: "{impl#0}", scope: !651)
!661 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !663, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !665, templateParams: !691, identifier: "6c60271dc811125e83050821b5b2430e")
!663 = !DINamespace(name: "lazy", scope: !664)
!664 = !DINamespace(name: "lazy_static", scope: null)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !662, file: !2, baseType: !667, size: 33024, align: 128, flags: DIFlagPrivate)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !668, file: !2, size: 33024, align: 128, flags: DIFlagPublic, elements: !670, templateParams: !691, identifier: "e3b234f664cad95b77eb5dcb16e93993")
!668 = !DINamespace(name: "once", scope: !669)
!669 = !DINamespace(name: "spin", scope: null)
!670 = !{!671, !681}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !667, file: !2, baseType: !672, size: 64, align: 64, offset: 32896, flags: DIFlagPrivate)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !673, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !675, templateParams: !29, identifier: "8af730207cd32b025ecf7ee7343d73a2")
!673 = !DINamespace(name: "atomic", scope: !674)
!674 = !DINamespace(name: "sync", scope: !16)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !672, file: !2, baseType: !677, size: 64, align: 64, flags: DIFlagPrivate)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !678, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !679, templateParams: !130, identifier: "84d58981b30d111f1b59e7c4c4da7d09")
!678 = !DINamespace(name: "cell", scope: !16)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !677, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !667, file: !2, baseType: !682, size: 32896, align: 128, flags: DIFlagPrivate)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !678, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !683, templateParams: !849, identifier: "70cf3ec4201635fe94bb06d08e95a11b")
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !682, file: !2, baseType: !685, size: 32896, align: 128, flags: DIFlagPrivate)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !33, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !686, templateParams: !29, identifier: "1062b369bbf2d6f1d5232294da4d8e4b")
!686 = !{!687}
!687 = !DICompositeType(tag: DW_TAG_variant_part, scope: !685, file: !2, size: 32896, align: 128, elements: !688, templateParams: !29, identifier: "aaae62b7d1ff3b201cdc5a26d773eebf", discriminator: !848)
!688 = !{!689, !844}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !687, file: !2, baseType: !690, size: 32896, align: 128, extraData: i128 2)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !685, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !29, templateParams: !691, identifier: "5502297f7e239d01ce414ffcb39ae320")
!691 = !{!692}
!692 = !DITemplateTypeParameter(name: "T", type: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !694, file: !2, size: 32896, align: 128, flags: DIFlagPublic, elements: !696, templateParams: !29, identifier: "547c1bd1bc51c049b4a4ac32dcad6803")
!694 = !DINamespace(name: "interrupt_descriptor_table", scope: !695)
!695 = !DINamespace(name: "cpu_interrupts", scope: null)
!696 = !{!697, !841, !842, !843}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !693, file: !2, baseType: !698, size: 32768, align: 128, flags: DIFlagPrivate)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !584, file: !2, size: 32768, align: 128, flags: DIFlagPublic, elements: !699, templateParams: !29, identifier: "f4f2a7415609fa12feaac5392d682081")
!699 = !{!700, !736, !737, !738, !739, !740, !741, !742, !743, !762, !763, !781, !782, !783, !784, !805, !806, !807, !808, !826, !827, !828, !829, !833, !834, !835, !836, !837}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !698, file: !2, baseType: !701, size: 128, align: 32, flags: DIFlagPublic)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !584, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !702, templateParams: !734, identifier: "9d61477b3ed18c59b0b15b8121536df9")
!702 = !{!703, !704, !705, !709, !710, !711, !712}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !701, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !701, file: !2, baseType: !163, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !701, file: !2, baseType: !706, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !584, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !707, templateParams: !29, identifier: "2c7fccc0653319553248b1972dbfd9ed")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !701, file: !2, baseType: !163, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !701, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !701, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !701, file: !2, baseType: !713, align: 8, offset: 128, flags: DIFlagPrivate)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !714, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !715, identifier: "d46a21b9c74c46b3be295cd635316d67")
!714 = !DINamespace(name: "marker", scope: !16)
!715 = !{!716}
!716 = !DITemplateTypeParameter(name: "T", type: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !718, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !720}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !584, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !721, templateParams: !29, identifier: "c6bf854889a0bbbc10ac1ed106c12dfb")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !720, file: !2, baseType: !723, size: 320, align: 64, flags: DIFlagPrivate)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !584, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !724, templateParams: !29, identifier: "2b542cd69cbeed6bcdeb6739b798052f")
!724 = !{!725, !730, !731, !732, !733}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !723, file: !2, baseType: !726, size: 64, align: 64, flags: DIFlagPublic)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !727, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !728, templateParams: !29, identifier: "b2ed7d6e47382d3883c0cf78993b7ac5")
!727 = !DINamespace(name: "addr", scope: !586)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !726, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !723, file: !2, baseType: !76, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !723, file: !2, baseType: !76, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !723, file: !2, baseType: !726, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !723, file: !2, baseType: !76, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!734 = !{!735}
!735 = !DITemplateTypeParameter(name: "F", type: !717)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 128, flags: DIFlagPublic)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 256, flags: DIFlagPublic)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 384, flags: DIFlagPublic)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 512, flags: DIFlagPublic)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 640, flags: DIFlagPublic)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 768, flags: DIFlagPublic)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 896, flags: DIFlagPublic)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !698, file: !2, baseType: !744, size: 128, align: 32, offset: 1024, flags: DIFlagPublic)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !584, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !745, templateParams: !760, identifier: "cd6c4e2f63326692ee0e7c3e5ddecc0c")
!745 = !{!746, !747, !748, !749, !750, !751, !752}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !744, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !744, file: !2, baseType: !163, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !744, file: !2, baseType: !706, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !744, file: !2, baseType: !163, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !744, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !744, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !744, file: !2, baseType: !753, align: 8, offset: 128, flags: DIFlagPrivate)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !714, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !754, identifier: "6eb45d429788214e77348243d79f32ca")
!754 = !{!755}
!755 = !DITemplateTypeParameter(name: "T", type: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !757, size: 64, align: 64, dwarfAddressSpace: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !720, !76}
!759 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!760 = !{!761}
!761 = !DITemplateTypeParameter(name: "F", type: !756)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !698, file: !2, baseType: !701, size: 128, align: 32, offset: 1152, flags: DIFlagPrivate)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !698, file: !2, baseType: !764, size: 128, align: 32, offset: 1280, flags: DIFlagPublic)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !584, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !765, templateParams: !779, identifier: "b31ff7288018ab74cf425591bad81762")
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !764, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !764, file: !2, baseType: !163, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !764, file: !2, baseType: !706, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !764, file: !2, baseType: !163, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !764, file: !2, baseType: !59, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !764, file: !2, baseType: !59, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !764, file: !2, baseType: !773, align: 8, offset: 128, flags: DIFlagPrivate)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !714, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !774, identifier: "b60325c540a3bae2f9ca297e5dc10763")
!774 = !{!775}
!775 = !DITemplateTypeParameter(name: "T", type: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !777, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !720, !76}
!779 = !{!780}
!780 = !DITemplateTypeParameter(name: "F", type: !776)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !698, file: !2, baseType: !764, size: 128, align: 32, offset: 1408, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !698, file: !2, baseType: !764, size: 128, align: 32, offset: 1536, flags: DIFlagPublic)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !698, file: !2, baseType: !764, size: 128, align: 32, offset: 1664, flags: DIFlagPublic)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !698, file: !2, baseType: !785, size: 128, align: 32, offset: 1792, flags: DIFlagPublic)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !584, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !786, templateParams: !803, identifier: "43bc2438e7151acc2208638cd3d887c4")
!786 = !{!787, !788, !789, !790, !791, !792, !793}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !785, file: !2, baseType: !163, size: 16, align: 16, flags: DIFlagPrivate)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !785, file: !2, baseType: !163, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !785, file: !2, baseType: !706, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !785, file: !2, baseType: !163, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
