; ModuleID = '1cnee0pmndpoluo2'
source_filename = "1cnee0pmndpoluo2"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "9c422f64d203875c66ddb15893ad6e1c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "63a53f835d237cb8ebd6a5e966686d67")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 128)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "b9e1ac78c379d613a24da21c45684d50")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "7ff22148d0b16863c4aa60ae0d000eaf")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "ab546dd5a6a76b9ab28753c07b51723b")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "802c1f988044dbc1a9d73823e0bfe966")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "6eb125df015b80203cbc5acebadf697")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8, offset: 384)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17h52459c85cf25b7a7E", scope: !56, file: !58, line: 161, type: !59, isLocal: true, isDefinition: true, align: 8)
!56 = !DINamespace(name: "interrupts", scope: !57)
!57 = !DINamespace(name: "theo", scope: null)
!58 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !56, file: !2, align: 8, elements: !60, templateParams: !27, identifier: "1ee70e3c08b0939676127e82c24bd99c")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !59, file: !2, baseType: !7, align: 8)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hf7bb39a147a3fe7bE", scope: !64, file: !67, line: 29, type: !68, isLocal: true, isDefinition: true, align: 128)
!64 = !DINamespace(name: "__stability", scope: !65)
!65 = !DINamespace(name: "deref", scope: !66)
!66 = !DINamespace(name: "{impl#0}", scope: !56)
!67 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !69, file: !2, size: 33024, align: 128, elements: !71, templateParams: !101, identifier: "a76bc1a50d5f35eaecdfa4b2c2d88cc9")
!69 = !DINamespace(name: "lazy", scope: !70)
!70 = !DINamespace(name: "lazy_static", scope: null)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !73, size: 33024, align: 128)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !74, file: !2, size: 33024, align: 128, elements: !76, templateParams: !101, identifier: "d1d9c0f2f6e4e547142a540ac1298c69")
!74 = !DINamespace(name: "once", scope: !75)
!75 = !DINamespace(name: "spin", scope: null)
!76 = !{!77, !90}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !2, baseType: !78, size: 64, align: 64, offset: 32896)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !79, file: !2, size: 64, align: 64, elements: !82, templateParams: !27, identifier: "96aa113e1bfe90e7d61ad001f3b45ae5")
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !81)
!81 = !DINamespace(name: "core", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !78, file: !2, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !85, file: !2, size: 64, align: 64, elements: !86, templateParams: !88, identifier: "3448ea56aa98dd3220ed64c0302dee9d")
!85 = !DINamespace(name: "cell", scope: !81)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !2, baseType: !9, size: 64, align: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !2, baseType: !91, size: 32896, align: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !85, file: !2, size: 32896, align: 128, elements: !92, templateParams: !264, identifier: "83e9565465e484157934f8e14076c58e")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !94, size: 32896, align: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !95, file: !2, size: 32896, align: 128, elements: !96, templateParams: !27, identifier: "f54b11e80912808c6f7584cc48898587")
!95 = !DINamespace(name: "option", scope: !81)
!96 = !{!97}
!97 = !DICompositeType(tag: DW_TAG_variant_part, scope: !94, file: !2, size: 32896, align: 128, elements: !98, templateParams: !27, identifier: "b1f7ab282edffffa653b7b59c7cf9b41", discriminator: !263)
!98 = !{!99, !259}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !97, file: !2, baseType: !100, size: 32896, align: 128, extraData: i64 2)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !94, file: !2, size: 32896, align: 128, elements: !27, templateParams: !101, identifier: "9071903e1550b6bd193c3cb72da91c50")
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !104, file: !2, size: 32896, align: 128, elements: !106, templateParams: !27, identifier: "fb197530b774861440d3e89a840dff50")
!104 = !DINamespace(name: "interrupt_descriptor_table", scope: !105)
!105 = !DINamespace(name: "cpu_interrupts", scope: null)
!106 = !{!107, !255, !257, !258}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !103, file: !2, baseType: !108, size: 32768, align: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !109, file: !2, size: 32768, align: 128, elements: !112, templateParams: !27, identifier: "f1981593f3649cc9806f368ce043dc6b")
!109 = !DINamespace(name: "idt", scope: !110)
!110 = !DINamespace(name: "structures", scope: !111)
!111 = !DINamespace(name: "x86_64", scope: null)
!112 = !{!113, !152, !153, !154, !155, !156, !157, !158, !159, !178, !179, !197, !198, !199, !200, !221, !222, !223, !224, !242, !243, !244, !248, !249, !250, !251}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !108, file: !2, baseType: !114, size: 128, align: 32)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !109, file: !2, size: 128, align: 32, elements: !115, templateParams: !150, identifier: "f93ab5ab80f3da77dc4b58825a3bf3af")
!115 = !{!116, !118, !119, !123, !124, !126, !127}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !114, file: !2, baseType: !117, size: 16, align: 16)
!117 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !109, file: !2, size: 16, align: 16, elements: !121, templateParams: !27, identifier: "5e314cd9ca92f2d53b6623ba02729e38")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !117, size: 16, align: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !114, file: !2, baseType: !128, align: 8, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !130, identifier: "2e726565d06bd42ff56195cc7443eb1b")
!129 = !DINamespace(name: "marker", scope: !81)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !109, file: !2, size: 320, align: 64, elements: !136, templateParams: !27, identifier: "b841bc3232047a1bed0bd7573aa65170")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !2, baseType: !138, size: 320, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !109, file: !2, size: 320, align: 64, elements: !139, templateParams: !27, identifier: "62c93b0d675876c2e0096f81afda62d3")
!139 = !{!140, !146, !147, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !142, file: !2, size: 64, align: 64, elements: !143, templateParams: !27, identifier: "95618196717fb1b0f4f491666efe7e07")
!142 = !DINamespace(name: "addr", scope: !111)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !141, file: !2, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 256)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "F", type: !132)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !108, file: !2, baseType: !160, size: 128, align: 32, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !161, templateParams: !176, identifier: "e4e37cb7368fdd9ace95cd71e0402859")
!161 = !{!162, !163, !164, !165, !166, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !160, file: !2, baseType: !117, size: 16, align: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !160, file: !2, baseType: !169, align: 8, offset: 128)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !170, identifier: "8d73746c11c91f536e24915ab78b2021")
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !135, !145}
!175 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "F", type: !172)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1280)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !109, file: !2, size: 128, align: 32, elements: !181, templateParams: !195, identifier: "1e97e8908b9392717352ad86f77cb17")
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !180, file: !2, baseType: !117, size: 16, align: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !180, file: !2, baseType: !189, align: 8, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !190, identifier: "32c29aaededb082db20e570e14fbabae")
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !135, !145}
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "F", type: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1664)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !108, file: !2, baseType: !201, size: 128, align: 32, offset: 1792)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !109, file: !2, size: 128, align: 32, elements: !202, templateParams: !219, identifier: "6d876bf4fb79484f9779363eb3fe3aae")
!202 = !{!203, !204, !205, !206, !207, !208, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !201, file: !2, baseType: !117, size: 16, align: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !201, file: !2, baseType: !210, align: 8, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !211, identifier: "af705672b44f72b5adfff45c69dd055")
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "T", type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !135, !216}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !109, file: !2, size: 64, align: 64, elements: !217, templateParams: !27, identifier: "8b478815f97e1e9dbedb8aa3e094eae1")
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !216, file: !2, baseType: !145, size: 64, align: 64)
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "F", type: !213)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1920)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !108, file: !2, baseType: !225, size: 128, align: 32, offset: 2304)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !226, templateParams: !240, identifier: "ebdccb5ab011d709836e78d7125442e2")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !225, file: !2, baseType: !117, size: 16, align: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !225, file: !2, baseType: !234, align: 8, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !235, identifier: "d871f3cbb6b1cd4d61fd68148648d110")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubroutineType(types: !239)
!239 = !{!175, !135}
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "F", type: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !108, file: !2, baseType: !245, size: 1024, align: 32, offset: 2688)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, align: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8, lowerBound: 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3712)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3840)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 3968)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !108, file: !2, baseType: !252, size: 28672, align: 32, offset: 4096)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 28672, align: 32, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 224, lowerBound: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32768)
!256 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32776)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32784)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !97, file: !2, baseType: !260, size: 32896, align: 128)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !94, file: !2, size: 32896, align: 128, elements: !261, templateParams: !101, identifier: "5e42ff6062e7efc0603584e95e90093e")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !103, size: 32896, align: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !2, baseType: !39, size: 8, align: 8, offset: 32784, flags: DIFlagArtificial)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !94)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17h8715e970722ff4a1E", scope: !268, file: !58, line: 161, type: !269, isLocal: true, isDefinition: true, align: 8)
!268 = !DINamespace(name: "peripherals", scope: !57)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !268, file: !2, align: 8, elements: !270, templateParams: !27, identifier: "26557dd8d14cd8decc1ca4c7b876b5c5")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !269, file: !2, baseType: !7, align: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h5da30a1f90e1084aE", scope: !274, file: !67, line: 29, type: !277, isLocal: true, isDefinition: true, align: 64)
!274 = !DINamespace(name: "__stability", scope: !275)
!275 = !DINamespace(name: "deref", scope: !276)
!276 = !DINamespace(name: "{impl#0}", scope: !268)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !69, file: !2, size: 1920, align: 64, elements: !278, templateParams: !293, identifier: "34a960015f6569a443bd1c85692778cb")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !2, baseType: !280, size: 1920, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !74, file: !2, size: 1920, align: 64, elements: !281, templateParams: !293, identifier: "e21c0b08c67a0a03d0969f77ce54f9d9")
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !2, baseType: !78, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !2, baseType: !284, size: 1856, align: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !85, file: !2, size: 1856, align: 64, elements: !285, templateParams: !330, identifier: "2aedf11674afe39616372f2abaa622c")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 1856, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !95, file: !2, size: 1856, align: 64, elements: !288, templateParams: !27, identifier: "d3751be7eb93d9ef8388fa7f40c6df57")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 1856, align: 64, elements: !290, templateParams: !27, identifier: "dcb2f0a991d6f02f185c54e0f5e86041", discriminator: !329)
!290 = !{!291, !325}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 1856, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 1856, align: 64, elements: !27, templateParams: !293, identifier: "46d17642fafd8b65a28aea0e6079cd23")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !296, file: !2, size: 1792, align: 64, elements: !297, templateParams: !323, identifier: "2507cd6baca35278fe2e5052bb45f2e1")
!296 = !DINamespace(name: "mutex", scope: !75)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !295, file: !2, baseType: !299, size: 1792, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !300, file: !2, size: 1792, align: 64, elements: !301, templateParams: !323, identifier: "4abbf4047a738a5793a0f42b169b9a8c")
!300 = !DINamespace(name: "spin", scope: !296)
!301 = !{!302, !308, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !299, file: !2, baseType: !303, align: 8)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !304, identifier: "6b34c2b88aaaf10ce8ea193acb901879")
!304 = !{!305}
!305 = !DITemplateTypeParameter(name: "T", type: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !307, file: !2, align: 8, elements: !27, identifier: "e1b33317cb41dc25d0387654fb971f14")
!307 = !DINamespace(name: "relax", scope: !75)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !2, baseType: !309, size: 8, align: 8)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !79, file: !2, size: 8, align: 8, elements: !310, templateParams: !27, identifier: "9104ccfbfda95c7b820c7a9761849c1d")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !309, file: !2, baseType: !312, size: 8, align: 8)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !85, file: !2, size: 8, align: 8, elements: !313, templateParams: !315, identifier: "941eba023f5e0fd5b22a454bf3b2360d")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !2, baseType: !39, size: 8, align: 8)
!315 = !{!316}
!316 = !DITemplateTypeParameter(name: "T", type: !39)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !2, baseType: !318, size: 1728, align: 64, offset: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !85, file: !2, size: 1728, align: 64, elements: !319, templateParams: !321, identifier: "5c9ae7daa80d2448d28d9e31e32cfaf")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !2, baseType: !15, size: 1728, align: 64)
!321 = !{!322}
!322 = !DITemplateTypeParameter(name: "T", type: !15)
!323 = !{!322, !324}
!324 = !DITemplateTypeParameter(name: "R", type: !306)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !326, size: 1856, align: 64, extraData: i64 1)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 1856, align: 64, elements: !327, templateParams: !293, identifier: "7c0b16747daa473d56765a1e12ee071d")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !295, size: 1792, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !287)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "KEYBOARD", linkageName: "_ZN4theo11peripherals8KEYBOARD17hb5c519d92d20d068E", scope: !268, file: !58, line: 161, type: !334, isLocal: true, isDefinition: true, align: 8)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "KEYBOARD", scope: !268, file: !2, align: 8, elements: !335, templateParams: !27, identifier: "f4eabd2b269dcbb344034d88c9eb28f1")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !334, file: !2, baseType: !7, align: 8)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN71_$LT$theo..peripherals..KEYBOARD$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h04e3159a77f9ab3dE", scope: !339, file: !67, line: 29, type: !342, isLocal: true, isDefinition: true, align: 64)
!339 = !DINamespace(name: "__stability", scope: !340)
!340 = !DINamespace(name: "deref", scope: !341)
!341 = !DINamespace(name: "{impl#2}", scope: !268)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !69, file: !2, size: 256, align: 64, elements: !343, templateParams: !358, identifier: "49cb8f83c073aa96666a37759531476b")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !342, file: !2, baseType: !345, size: 256, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !74, file: !2, size: 256, align: 64, elements: !346, templateParams: !358, identifier: "fcf1a5fa476264e2e6d63c323709711")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !2, baseType: !78, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !2, baseType: !349, size: 144, align: 16, offset: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>>", scope: !85, file: !2, size: 144, align: 16, elements: !350, templateParams: !432, identifier: "a62c89518f5422f6e453b7f73ddf94d")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !349, file: !2, baseType: !352, size: 144, align: 16)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>>", scope: !95, file: !2, size: 144, align: 16, elements: !353, templateParams: !27, identifier: "c21a64df90e8178a81927022a89d36b4")
!353 = !{!354}
!354 = !DICompositeType(tag: DW_TAG_variant_part, scope: !352, file: !2, size: 144, align: 16, elements: !355, templateParams: !27, identifier: "91497b9c3bf028a8e82cd35c589cf6c4", discriminator: !431)
!355 = !{!356, !427}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !354, file: !2, baseType: !357, size: 144, align: 16, extraData: i64 0)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !352, file: !2, size: 144, align: 16, elements: !27, templateParams: !358, identifier: "7ccc37b06a2cf8631e4bc1f436a36a3a")
!358 = !{!359}
!359 = !DITemplateTypeParameter(name: "T", type: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !296, file: !2, size: 128, align: 16, elements: !361, templateParams: !426, identifier: "97275314a0598772993d4743abc9c90c")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !360, file: !2, baseType: !363, size: 128, align: 16)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>, spin::relax::Spin>", scope: !300, file: !2, size: 128, align: 16, elements: !364, templateParams: !426, identifier: "cade5b8ece1f3d1cae2498d00a532434")
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !363, file: !2, baseType: !303, align: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !363, file: !2, baseType: !309, size: 8, align: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !2, baseType: !368, size: 112, align: 16, offset: 16)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<keyboard::Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>>", scope: !85, file: !2, size: 112, align: 16, elements: !369, templateParams: !424, identifier: "f7b328b2555d7c1061122616ebce4ffa")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !2, baseType: !371, size: 112, align: 16)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !372, file: !2, size: 112, align: 16, elements: !373, templateParams: !422, identifier: "c00e366a84ab0560e7279aa4e5fb7dd0")
!372 = !DINamespace(name: "keyboard", scope: null)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !371, file: !2, baseType: !375, size: 112, align: 16)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Keyboard<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", scope: !376, file: !2, size: 112, align: 16, elements: !377, templateParams: !422, identifier: "a181d7620ae604a2a4e904682f0c1fd4")
!376 = !DINamespace(name: "pc_keyboard", scope: null)
!377 = !{!378, !383, !397}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ps2_decoder", scope: !375, file: !2, baseType: !379, size: 32, align: 16)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ps2Decoder", scope: !376, file: !2, size: 32, align: 16, elements: !380, templateParams: !27, identifier: "749e1e456edf9dcf6033badd77e783be")
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "register", scope: !379, file: !2, baseType: !117, size: 16, align: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !379, file: !2, baseType: !39, size: 8, align: 8, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scancode_set", scope: !375, file: !2, baseType: !384, size: 8, align: 8, offset: 104)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScancodeSet1", scope: !385, file: !2, size: 8, align: 8, elements: !387, templateParams: !27, identifier: "23c2450dd708d15a706a79866f0a95d9")
!385 = !DINamespace(name: "set1", scope: !386)
!386 = !DINamespace(name: "scancodes", scope: !376)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !384, file: !2, baseType: !389, size: 8, align: 8)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!396 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "event_decoder", scope: !375, file: !2, baseType: !398, size: 72, align: 8, offset: 32)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventDecoder<pc_keyboard::layouts::us104::Us104Key>", scope: !376, file: !2, size: 72, align: 8, elements: !399, templateParams: !420, identifier: "4581ae3cc1a398a748a013327c551c06")
!399 = !{!400, !405, !416}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "handle_ctrl", scope: !398, file: !2, baseType: !401, size: 8, align: 8)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !402)
!402 = !{!403, !404}
!403 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !398, file: !2, baseType: !406, size: 64, align: 8, offset: 8)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !376, file: !2, size: 64, align: 8, elements: !407, templateParams: !27, identifier: "557cd4f8f7e06d6ab0beb7942023fe1c")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !406, file: !2, baseType: !256, size: 8, align: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 24)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 40)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 48)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !406, file: !2, baseType: !256, size: 8, align: 8, offset: 56)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !398, file: !2, baseType: !417, align: 8)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !418, file: !2, align: 8, elements: !27, identifier: "fb1d740f4670a8424680d855011a8134")
!418 = !DINamespace(name: "us104", scope: !419)
!419 = !DINamespace(name: "layouts", scope: !376)
!420 = !{!421}
!421 = !DITemplateTypeParameter(name: "L", type: !417)
!422 = !{!421, !423}
!423 = !DITemplateTypeParameter(name: "S", type: !384)
!424 = !{!425}
!425 = !DITemplateTypeParameter(name: "T", type: !371)
!426 = !{!425, !324}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !354, file: !2, baseType: !428, size: 144, align: 16, extraData: i64 1)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !352, file: !2, size: 144, align: 16, elements: !429, templateParams: !358, identifier: "9f085f3e65c79b08aac2413117d855")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !428, file: !2, baseType: !360, size: 128, align: 16, offset: 16)
!431 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !352)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h4b048069e2da0f0cE", scope: !436, file: !58, line: 161, type: !437, isLocal: true, isDefinition: true, align: 8)
!436 = !DINamespace(name: "serial", scope: !57)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !436, file: !2, align: 8, elements: !438, templateParams: !27, identifier: "7234dd4fdef09babf9e345eee7ea9b2a")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !437, file: !2, baseType: !7, align: 8)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h592e41af2efb1654E", scope: !442, file: !67, line: 29, type: !445, isLocal: true, isDefinition: true, align: 64)
!442 = !DINamespace(name: "__stability", scope: !443)
!443 = !DINamespace(name: "deref", scope: !444)
!444 = !DINamespace(name: "{impl#0}", scope: !436)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !69, file: !2, size: 192, align: 64, elements: !446, templateParams: !461, identifier: "8624abeaa2fc39882647fe8c4da705eb")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !448, size: 192, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !74, file: !2, size: 192, align: 64, elements: !449, templateParams: !461, identifier: "c82158186c749b4cc0a91570ee31e04e")
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !448, file: !2, baseType: !78, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !448, file: !2, baseType: !452, size: 128, align: 16)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !85, file: !2, size: 128, align: 16, elements: !453, templateParams: !542, identifier: "3ee5e6f69b14ac4f21fdced2c5a635d")
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !452, file: !2, baseType: !455, size: 128, align: 16)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !95, file: !2, size: 128, align: 16, elements: !456, templateParams: !27, identifier: "dbc1e4a4e4c150d4e6f6c7a2de1cdbfa")
!456 = !{!457}
!457 = !DICompositeType(tag: DW_TAG_variant_part, scope: !455, file: !2, size: 128, align: 16, elements: !458, templateParams: !27, identifier: "78b1b5ecf9e1cb45f394cc688c4e4e83", discriminator: !541)
!458 = !{!459, !537}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !457, file: !2, baseType: !460, size: 128, align: 16, extraData: i64 0)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !455, file: !2, size: 128, align: 16, elements: !27, templateParams: !461, identifier: "280e5ed3885ab8cd29f4dd4ff7057a6f")
!461 = !{!462}
!462 = !DITemplateTypeParameter(name: "T", type: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !296, file: !2, size: 112, align: 16, elements: !464, templateParams: !536, identifier: "aa90b14e8ad8b786f41ef25308c97879")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !463, file: !2, baseType: !466, size: 112, align: 16)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !300, file: !2, size: 112, align: 16, elements: !467, templateParams: !536, identifier: "3c9cf3ec0fa32afaf67ae186b4bad1bf")
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !466, file: !2, baseType: !303, align: 8)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !466, file: !2, baseType: !309, size: 8, align: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !2, baseType: !471, size: 96, align: 16, offset: 16)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !85, file: !2, size: 96, align: 16, elements: !472, templateParams: !534, identifier: "cabfc2b7ddaae861142f24dc3edfc030")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !471, file: !2, baseType: !474, size: 96, align: 16)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !475, file: !2, size: 96, align: 16, elements: !477, templateParams: !27, identifier: "6d5291f15095d6a6cd607afe17776871")
!475 = !DINamespace(name: "port", scope: !476)
!476 = !DINamespace(name: "uart_16550", scope: null)
!477 = !{!478, !497, !514, !515, !516, !517}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !2, baseType: !479, size: 16, align: 16)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !480, file: !2, size: 16, align: 16, elements: !482, templateParams: !495, identifier: "c3a533e8b8615a76d657ef1acc22dc20")
!480 = !DINamespace(name: "port", scope: !481)
!481 = !DINamespace(name: "instructions", scope: !111)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !479, file: !2, baseType: !117, size: 16, align: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !479, file: !2, baseType: !485, align: 8)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !486, identifier: "57bead6024b7dfa9330620895d694ea6")
!486 = !{!487}
!487 = !DITemplateTypeParameter(name: "T", type: !488)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !489, templateParams: !27, identifier: "26ee74012beacbfc8ee2449d78cb9179")
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !39, size: 8, align: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !488, file: !2, baseType: !492, align: 8, offset: 8)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !480, file: !2, align: 8, elements: !493, templateParams: !27, identifier: "dc8d7a3e52183a47225eb87e6874bf7c")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !492, file: !2, baseType: !7, align: 8)
!495 = !{!316, !496}
!496 = !DITemplateTypeParameter(name: "A", type: !492)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !474, file: !2, baseType: !498, size: 16, align: 16, offset: 16)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !480, file: !2, size: 16, align: 16, elements: !499, templateParams: !512, identifier: "b4431bca1bcd3753c4002641e9e92305")
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !498, file: !2, baseType: !117, size: 16, align: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !498, file: !2, baseType: !502, align: 8)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !503, identifier: "c67dcc86fcd75eb8681fb238d3de2f81")
!503 = !{!504}
!504 = !DITemplateTypeParameter(name: "T", type: !505)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !506, templateParams: !27, identifier: "bbb1c7cd0bb21ede55d5448878931f3f")
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !2, baseType: !39, size: 8, align: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !505, file: !2, baseType: !509, align: 8, offset: 8)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !480, file: !2, align: 8, elements: !510, templateParams: !27, identifier: "f849551834bee6fbcb9b0372e9db7fea")
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !509, file: !2, baseType: !7, align: 8)
!512 = !{!316, !513}
!513 = !DITemplateTypeParameter(name: "A", type: !509)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !474, file: !2, baseType: !498, size: 16, align: 16, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !474, file: !2, baseType: !498, size: 16, align: 16, offset: 48)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !474, file: !2, baseType: !498, size: 16, align: 16, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !474, file: !2, baseType: !518, size: 16, align: 16, offset: 80)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !480, file: !2, size: 16, align: 16, elements: !519, templateParams: !532, identifier: "a4010d8eda104223c34b1d33ec1cbf54")
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !518, file: !2, baseType: !117, size: 16, align: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !518, file: !2, baseType: !522, align: 8)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !523, identifier: "758ae4749cee6f03dbcaecba4a8c4b75")
!523 = !{!524}
!524 = !DITemplateTypeParameter(name: "T", type: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !526, templateParams: !27, identifier: "c804277b3fbf99448ba5f0677a74dd6")
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !525, file: !2, baseType: !39, size: 8, align: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !525, file: !2, baseType: !529, align: 8, offset: 8)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !480, file: !2, align: 8, elements: !530, templateParams: !27, identifier: "eb63fa85de98ec4143e7405a4fad1d37")
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !529, file: !2, baseType: !7, align: 8)
!532 = !{!316, !533}
!533 = !DITemplateTypeParameter(name: "A", type: !529)
!534 = !{!535}
!535 = !DITemplateTypeParameter(name: "T", type: !474)
!536 = !{!535, !324}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !457, file: !2, baseType: !538, size: 128, align: 16, extraData: i64 1)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !455, file: !2, size: 128, align: 16, elements: !539, templateParams: !461, identifier: "1248c3f227a7d4772c909b5ef5733c5")
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !538, file: !2, baseType: !463, size: 112, align: 16, offset: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, scope: !455, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!542 = !{!543}
!543 = !DITemplateTypeParameter(name: "T", type: !455)
!544 = !{i32 8, !"PIC Level", i32 2}
!545 = !{i32 7, !"PIE Level", i32 2}
!546 = !{i32 2, !"Dwarf Version", i32 4}
!547 = !{i32 2, !"Debug Info Version", i32 3}
!548 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !549, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !550, globals: !697, splitDebugInlining: false)
!549 = !DIFile(filename: "src/main.rs/@/1cnee0pmndpoluo2", directory: "/Users/yaw/self/theo")
!550 = !{!49, !389, !401, !551, !559, !566, !692}
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !552, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !554)
!552 = !DINamespace(name: "rt", scope: !553)
!553 = !DINamespace(name: "fmt", scope: !81)
!554 = !{!555, !556, !557, !558}
!555 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!556 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!557 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!558 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !560)
!560 = !{!561, !562, !563, !564, !565}
!561 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!562 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!563 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!564 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!565 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyCode", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!568 = !DIEnumerator(name: "Escape", value: 0, isUnsigned: true)
!569 = !DIEnumerator(name: "F1", value: 1, isUnsigned: true)
!570 = !DIEnumerator(name: "F2", value: 2, isUnsigned: true)
!571 = !DIEnumerator(name: "F3", value: 3, isUnsigned: true)
!572 = !DIEnumerator(name: "F4", value: 4, isUnsigned: true)
!573 = !DIEnumerator(name: "F5", value: 5, isUnsigned: true)
!574 = !DIEnumerator(name: "F6", value: 6, isUnsigned: true)
!575 = !DIEnumerator(name: "F7", value: 7, isUnsigned: true)
!576 = !DIEnumerator(name: "F8", value: 8, isUnsigned: true)
!577 = !DIEnumerator(name: "F9", value: 9, isUnsigned: true)
!578 = !DIEnumerator(name: "F10", value: 10, isUnsigned: true)
!579 = !DIEnumerator(name: "F11", value: 11, isUnsigned: true)
!580 = !DIEnumerator(name: "F12", value: 12, isUnsigned: true)
!581 = !DIEnumerator(name: "PrintScreen", value: 13, isUnsigned: true)
!582 = !DIEnumerator(name: "SysRq", value: 14, isUnsigned: true)
!583 = !DIEnumerator(name: "ScrollLock", value: 15, isUnsigned: true)
!584 = !DIEnumerator(name: "PauseBreak", value: 16, isUnsigned: true)
!585 = !DIEnumerator(name: "Oem8", value: 17, isUnsigned: true)
!586 = !DIEnumerator(name: "Key1", value: 18, isUnsigned: true)
!587 = !DIEnumerator(name: "Key2", value: 19, isUnsigned: true)
!588 = !DIEnumerator(name: "Key3", value: 20, isUnsigned: true)
!589 = !DIEnumerator(name: "Key4", value: 21, isUnsigned: true)
!590 = !DIEnumerator(name: "Key5", value: 22, isUnsigned: true)
!591 = !DIEnumerator(name: "Key6", value: 23, isUnsigned: true)
!592 = !DIEnumerator(name: "Key7", value: 24, isUnsigned: true)
!593 = !DIEnumerator(name: "Key8", value: 25, isUnsigned: true)
!594 = !DIEnumerator(name: "Key9", value: 26, isUnsigned: true)
!595 = !DIEnumerator(name: "Key0", value: 27, isUnsigned: true)
!596 = !DIEnumerator(name: "OemMinus", value: 28, isUnsigned: true)
!597 = !DIEnumerator(name: "OemPlus", value: 29, isUnsigned: true)
!598 = !DIEnumerator(name: "Backspace", value: 30, isUnsigned: true)
!599 = !DIEnumerator(name: "Insert", value: 31, isUnsigned: true)
!600 = !DIEnumerator(name: "Home", value: 32, isUnsigned: true)
!601 = !DIEnumerator(name: "PageUp", value: 33, isUnsigned: true)
!602 = !DIEnumerator(name: "NumpadLock", value: 34, isUnsigned: true)
!603 = !DIEnumerator(name: "NumpadDivide", value: 35, isUnsigned: true)
!604 = !DIEnumerator(name: "NumpadMultiply", value: 36, isUnsigned: true)
!605 = !DIEnumerator(name: "NumpadSubtract", value: 37, isUnsigned: true)
!606 = !DIEnumerator(name: "Tab", value: 38, isUnsigned: true)
!607 = !DIEnumerator(name: "Q", value: 39, isUnsigned: true)
!608 = !DIEnumerator(name: "W", value: 40, isUnsigned: true)
!609 = !DIEnumerator(name: "E", value: 41, isUnsigned: true)
!610 = !DIEnumerator(name: "R", value: 42, isUnsigned: true)
!611 = !DIEnumerator(name: "T", value: 43, isUnsigned: true)
!612 = !DIEnumerator(name: "Y", value: 44, isUnsigned: true)
!613 = !DIEnumerator(name: "U", value: 45, isUnsigned: true)
!614 = !DIEnumerator(name: "I", value: 46, isUnsigned: true)
!615 = !DIEnumerator(name: "O", value: 47, isUnsigned: true)
!616 = !DIEnumerator(name: "P", value: 48, isUnsigned: true)
!617 = !DIEnumerator(name: "Oem4", value: 49, isUnsigned: true)
!618 = !DIEnumerator(name: "Oem6", value: 50, isUnsigned: true)
!619 = !DIEnumerator(name: "Oem5", value: 51, isUnsigned: true)
!620 = !DIEnumerator(name: "Oem7", value: 52, isUnsigned: true)
!621 = !DIEnumerator(name: "Delete", value: 53, isUnsigned: true)
!622 = !DIEnumerator(name: "End", value: 54, isUnsigned: true)
!623 = !DIEnumerator(name: "PageDown", value: 55, isUnsigned: true)
!624 = !DIEnumerator(name: "Numpad7", value: 56, isUnsigned: true)
!625 = !DIEnumerator(name: "Numpad8", value: 57, isUnsigned: true)
!626 = !DIEnumerator(name: "Numpad9", value: 58, isUnsigned: true)
!627 = !DIEnumerator(name: "NumpadAdd", value: 59, isUnsigned: true)
!628 = !DIEnumerator(name: "CapsLock", value: 60, isUnsigned: true)
!629 = !DIEnumerator(name: "A", value: 61, isUnsigned: true)
!630 = !DIEnumerator(name: "S", value: 62, isUnsigned: true)
!631 = !DIEnumerator(name: "D", value: 63, isUnsigned: true)
!632 = !DIEnumerator(name: "F", value: 64, isUnsigned: true)
!633 = !DIEnumerator(name: "G", value: 65, isUnsigned: true)
!634 = !DIEnumerator(name: "H", value: 66, isUnsigned: true)
!635 = !DIEnumerator(name: "J", value: 67, isUnsigned: true)
!636 = !DIEnumerator(name: "K", value: 68, isUnsigned: true)
!637 = !DIEnumerator(name: "L", value: 69, isUnsigned: true)
!638 = !DIEnumerator(name: "Oem1", value: 70, isUnsigned: true)
!639 = !DIEnumerator(name: "Oem3", value: 71, isUnsigned: true)
!640 = !DIEnumerator(name: "Return", value: 72, isUnsigned: true)
!641 = !DIEnumerator(name: "Numpad4", value: 73, isUnsigned: true)
!642 = !DIEnumerator(name: "Numpad5", value: 74, isUnsigned: true)
!643 = !DIEnumerator(name: "Numpad6", value: 75, isUnsigned: true)
!644 = !DIEnumerator(name: "LShift", value: 76, isUnsigned: true)
!645 = !DIEnumerator(name: "Z", value: 77, isUnsigned: true)
!646 = !DIEnumerator(name: "X", value: 78, isUnsigned: true)
!647 = !DIEnumerator(name: "C", value: 79, isUnsigned: true)
!648 = !DIEnumerator(name: "V", value: 80, isUnsigned: true)
!649 = !DIEnumerator(name: "B", value: 81, isUnsigned: true)
!650 = !DIEnumerator(name: "N", value: 82, isUnsigned: true)
!651 = !DIEnumerator(name: "M", value: 83, isUnsigned: true)
!652 = !DIEnumerator(name: "OemComma", value: 84, isUnsigned: true)
!653 = !DIEnumerator(name: "OemPeriod", value: 85, isUnsigned: true)
!654 = !DIEnumerator(name: "Oem2", value: 86, isUnsigned: true)
!655 = !DIEnumerator(name: "RShift", value: 87, isUnsigned: true)
!656 = !DIEnumerator(name: "ArrowUp", value: 88, isUnsigned: true)
!657 = !DIEnumerator(name: "Numpad1", value: 89, isUnsigned: true)
!658 = !DIEnumerator(name: "Numpad2", value: 90, isUnsigned: true)
!659 = !DIEnumerator(name: "Numpad3", value: 91, isUnsigned: true)
!660 = !DIEnumerator(name: "NumpadEnter", value: 92, isUnsigned: true)
!661 = !DIEnumerator(name: "LControl", value: 93, isUnsigned: true)
!662 = !DIEnumerator(name: "LWin", value: 94, isUnsigned: true)
!663 = !DIEnumerator(name: "LAlt", value: 95, isUnsigned: true)
!664 = !DIEnumerator(name: "Spacebar", value: 96, isUnsigned: true)
!665 = !DIEnumerator(name: "RAltGr", value: 97, isUnsigned: true)
!666 = !DIEnumerator(name: "RWin", value: 98, isUnsigned: true)
!667 = !DIEnumerator(name: "Apps", value: 99, isUnsigned: true)
!668 = !DIEnumerator(name: "RControl", value: 100, isUnsigned: true)
!669 = !DIEnumerator(name: "ArrowLeft", value: 101, isUnsigned: true)
!670 = !DIEnumerator(name: "ArrowDown", value: 102, isUnsigned: true)
!671 = !DIEnumerator(name: "ArrowRight", value: 103, isUnsigned: true)
!672 = !DIEnumerator(name: "Numpad0", value: 104, isUnsigned: true)
!673 = !DIEnumerator(name: "NumpadPeriod", value: 105, isUnsigned: true)
!674 = !DIEnumerator(name: "Oem9", value: 106, isUnsigned: true)
!675 = !DIEnumerator(name: "Oem10", value: 107, isUnsigned: true)
!676 = !DIEnumerator(name: "Oem11", value: 108, isUnsigned: true)
!677 = !DIEnumerator(name: "Oem12", value: 109, isUnsigned: true)
!678 = !DIEnumerator(name: "Oem13", value: 110, isUnsigned: true)
!679 = !DIEnumerator(name: "PrevTrack", value: 111, isUnsigned: true)
!680 = !DIEnumerator(name: "NextTrack", value: 112, isUnsigned: true)
!681 = !DIEnumerator(name: "Mute", value: 113, isUnsigned: true)
!682 = !DIEnumerator(name: "Calculator", value: 114, isUnsigned: true)
!683 = !DIEnumerator(name: "Play", value: 115, isUnsigned: true)
!684 = !DIEnumerator(name: "Stop", value: 116, isUnsigned: true)
!685 = !DIEnumerator(name: "VolumeDown", value: 117, isUnsigned: true)
!686 = !DIEnumerator(name: "VolumeUp", value: 118, isUnsigned: true)
!687 = !DIEnumerator(name: "WWWHome", value: 119, isUnsigned: true)
!688 = !DIEnumerator(name: "PowerOnTestOk", value: 120, isUnsigned: true)
!689 = !DIEnumerator(name: "TooManyKeys", value: 121, isUnsigned: true)
!690 = !DIEnumerator(name: "RControl2", value: 122, isUnsigned: true)
!691 = !DIEnumerator(name: "RAlt2", value: 123, isUnsigned: true)
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyState", scope: !376, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIEnumerator(name: "Up", value: 0, isUnsigned: true)
!695 = !DIEnumerator(name: "Down", value: 1, isUnsigned: true)
!696 = !DIEnumerator(name: "SingleShot", value: 2, isUnsigned: true)
!697 = !{!0, !54, !62, !266, !272, !332, !337, !434, !440}
!698 = distinct !DISubprogram(name: "index_mut", linkageName: "_ZN109_$LT$x86_64..structures..idt..InterruptDescriptorTable$u20$as$u20$core..ops..index..IndexMut$LT$usize$GT$$GT$9index_mut17hf70cb6bddd9533afE", scope: !700, file: !699, line: 575, type: !701, scopeLine: 575, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !27, retainedNodes: !718)
!699 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!700 = !DINamespace(name: "{impl#2}", scope: !109)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !704, !9, !705}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !706, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !707, file: !2, size: 192, align: 64, elements: !709, templateParams: !27, identifier: "58edb26be50e546f2f545926f1f4db80")
!707 = !DINamespace(name: "location", scope: !708)
!708 = !DINamespace(name: "panic", scope: !81)
!709 = !{!710, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !706, file: !2, baseType: !711, size: 128, align: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !712, templateParams: !27, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!712 = !{!713, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !711, file: !2, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !711, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !706, file: !2, baseType: !125, size: 32, align: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !706, file: !2, baseType: !125, size: 32, align: 32, offset: 160)
!718 = !{!719, !720, !721, !723, !725, !727, !729}
!719 = !DILocalVariable(name: "self", arg: 1, scope: !698, file: !699, line: 575, type: !704)
!720 = !DILocalVariable(name: "index", arg: 2, scope: !698, file: !699, line: 575, type: !9)
!721 = !DILocalVariable(name: "i", scope: !722, file: !699, line: 589, type: !9, align: 8)
!722 = distinct !DILexicalBlock(scope: !698, file: !699, line: 589, column: 13)
!723 = !DILocalVariable(name: "i", scope: !724, file: !699, line: 590, type: !9, align: 8)
!724 = distinct !DILexicalBlock(scope: !698, file: !699, line: 590, column: 13)
!725 = !DILocalVariable(name: "i", scope: !726, file: !699, line: 591, type: !9, align: 8)
!726 = distinct !DILexicalBlock(scope: !698, file: !699, line: 591, column: 13)
!727 = !DILocalVariable(name: "i", scope: !728, file: !699, line: 594, type: !9, align: 8)
!728 = distinct !DILexicalBlock(scope: !698, file: !699, line: 594, column: 13)
!729 = !DILocalVariable(name: "i", scope: !730, file: !699, line: 595, type: !9, align: 8)
!730 = distinct !DILexicalBlock(scope: !698, file: !699, line: 595, column: 13)
!731 = !DILocation(line: 575, column: 18, scope: !698)
!732 = !DILocation(line: 575, column: 29, scope: !698)
!733 = !DILocation(line: 589, column: 13, scope: !722)
!734 = !DILocation(line: 590, column: 13, scope: !724)
!735 = !DILocation(line: 591, column: 13, scope: !726)
!736 = !DILocation(line: 594, column: 13, scope: !728)
!737 = !DILocation(line: 595, column: 13, scope: !730)
!738 = !DILocation(line: 576, column: 9, scope: !698)
!739 = !DILocation(line: 589, column: 17, scope: !698)
!740 = !DILocation(line: 577, column: 18, scope: !698)
!741 = !DILocation(line: 577, column: 39, scope: !698)
!742 = !DILocation(line: 578, column: 18, scope: !698)
!743 = !DILocation(line: 578, column: 32, scope: !698)
!744 = !DILocation(line: 579, column: 18, scope: !698)
!745 = !DILocation(line: 579, column: 49, scope: !698)
!746 = !DILocation(line: 580, column: 18, scope: !698)
!747 = !DILocation(line: 580, column: 37, scope: !698)
!748 = !DILocation(line: 581, column: 18, scope: !698)
!749 = !DILocation(line: 581, column: 35, scope: !698)
!750 = !DILocation(line: 582, column: 18, scope: !698)
!751 = !DILocation(line: 582, column: 47, scope: !698)
!752 = !DILocation(line: 583, column: 18, scope: !698)
!753 = !DILocation(line: 583, column: 41, scope: !698)
!754 = !DILocation(line: 584, column: 18, scope: !698)
!755 = !DILocation(line: 584, column: 47, scope: !698)
!756 = !DILocation(line: 585, column: 18, scope: !698)
!757 = !DILocation(line: 585, column: 54, scope: !698)
!758 = !DILocation(line: 586, column: 19, scope: !698)
!759 = !DILocation(line: 586, column: 46, scope: !698)
!760 = !DILocation(line: 587, column: 19, scope: !698)
!761 = !DILocation(line: 587, column: 47, scope: !698)
!762 = !DILocation(line: 588, column: 19, scope: !698)
!763 = !DILocation(line: 588, column: 42, scope: !698)
!764 = !DILocation(line: 590, column: 13, scope: !698)
!765 = !DILocation(line: 590, column: 22, scope: !698)
!766 = !DILocation(line: 591, column: 13, scope: !698)
!767 = !DILocation(line: 591, column: 35, scope: !698)
!768 = !DILocation(line: 591, column: 44, scope: !698)
!769 = !DILocation(line: 591, column: 53, scope: !698)
!770 = !DILocation(line: 594, column: 13, scope: !698)
!771 = !DILocalVariable(name: "x", arg: 1, scope: !772, file: !773, line: 96, type: !835)
!772 = distinct !DISubprogram(name: "new_display<usize>", linkageName: "_ZN4core3fmt2rt8Argument11new_display17h1a6f65cdc9f8fb63E", scope: !774, file: !773, line: 96, type: !833, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !88, retainedNodes: !836)
!773 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "113796e3f7e0ea158177fb3be1c4c32b")
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !552, file: !2, size: 128, align: 64, elements: !775, templateParams: !27, identifier: "92df9959c1cdfbcdd7133c99bcf5419")
!775 = !{!776, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !774, file: !2, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !778, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !779, file: !2, align: 8, elements: !27, identifier: "9b221ef387fa4c24dae3649531e7392e")
!779 = !DINamespace(name: "{extern#0}", scope: !552)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !774, file: !2, baseType: !781, size: 64, align: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !782, size: 64, align: 64, dwarfAddressSpace: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{!784, !777, !802}
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !785, file: !2, size: 8, align: 8, elements: !786, templateParams: !27, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!785 = !DINamespace(name: "result", scope: !81)
!786 = !{!787}
!787 = !DICompositeType(tag: DW_TAG_variant_part, scope: !784, file: !2, size: 8, align: 8, elements: !788, templateParams: !27, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !801)
!788 = !{!789, !797}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !787, file: !2, baseType: !790, size: 8, align: 8, extraData: i64 0)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !784, file: !2, size: 8, align: 8, elements: !791, templateParams: !793, identifier: "d91e207f895b5ed21304fa16506e0f28")
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !790, file: !2, baseType: !7, align: 8, offset: 8)
!793 = !{!794, !795}
!794 = !DITemplateTypeParameter(name: "T", type: !7)
!795 = !DITemplateTypeParameter(name: "E", type: !796)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !553, file: !2, align: 8, elements: !27, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !787, file: !2, baseType: !798, size: 8, align: 8, extraData: i64 1)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !784, file: !2, size: 8, align: 8, elements: !799, templateParams: !793, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !798, file: !2, baseType: !796, align: 8, offset: 8)
!801 = !DIDerivedType(tag: DW_TAG_member, scope: !784, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !803, size: 64, align: 64, dwarfAddressSpace: 0)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !553, file: !2, size: 512, align: 64, elements: !804, templateParams: !27, identifier: "bc7f0caae71140a04b17743f5a695b51")
!804 = !{!805, !806, !808, !809, !821, !822}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !2, baseType: !125, size: 32, align: 32, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !803, file: !2, baseType: !807, size: 32, align: 32, offset: 384)
!807 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !803, file: !2, baseType: !551, size: 8, align: 8, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !803, file: !2, baseType: !810, size: 128, align: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !95, file: !2, size: 128, align: 64, elements: !811, templateParams: !27, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!811 = !{!812}
!812 = !DICompositeType(tag: DW_TAG_variant_part, scope: !810, file: !2, size: 128, align: 64, elements: !813, templateParams: !27, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !820)
!813 = !{!814, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !812, file: !2, baseType: !815, size: 128, align: 64, extraData: i64 0)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !810, file: !2, size: 128, align: 64, elements: !27, templateParams: !88, identifier: "728f4cb196695ca2ab2ce43263435122")
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !812, file: !2, baseType: !817, size: 128, align: 64, extraData: i64 1)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !810, file: !2, size: 128, align: 64, elements: !818, templateParams: !88, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !817, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !810, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !803, file: !2, baseType: !810, size: 128, align: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !803, file: !2, baseType: !823, size: 128, align: 64, offset: 256)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !824, templateParams: !27, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!824 = !{!825, !828}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !823, file: !2, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64, dwarfAddressSpace: 0)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "a80c365aa420df7c35abe384a2fa122f")
!828 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !823, file: !2, baseType: !829, size: 64, align: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !830, size: 64, align: 64, dwarfAddressSpace: 0)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 3, lowerBound: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!774, !835}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!836 = !{!771}
!837 = !DILocation(line: 96, column: 40, scope: !772, inlinedAt: !838)
!838 = distinct !DILocation(line: 594, column: 23, scope: !728)
!839 = !DILocalVariable(name: "x", arg: 1, scope: !840, file: !773, line: 83, type: !835)
!840 = distinct !DISubprogram(name: "new<usize>", linkageName: "_ZN4core3fmt2rt8Argument3new17h7897b373e058375dE", scope: !774, file: !773, line: 83, type: !841, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !88, retainedNodes: !846)
!841 = !DISubroutineType(types: !842)
!842 = !{!774, !835, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&usize, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !844, size: 64, align: 64, dwarfAddressSpace: 0)
!844 = !DISubroutineType(types: !845)
!845 = !{!784, !835, !802}
!846 = !{!839, !847}
!847 = !DILocalVariable(name: "f", arg: 2, scope: !840, file: !773, line: 83, type: !843)
!848 = !DILocation(line: 83, column: 19, scope: !840, inlinedAt: !849)
!849 = distinct !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !838)
!850 = !DILocation(line: 83, column: 29, scope: !840, inlinedAt: !849)
!851 = !DILocation(line: 92, column: 18, scope: !840, inlinedAt: !849)
!852 = !DILocation(line: 93, column: 6, scope: !840, inlinedAt: !849)
!853 = !{i64 1}
!854 = !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !838)
!855 = !DILocation(line: 594, column: 23, scope: !728)
!856 = !DILocation(line: 590, column: 35, scope: !698)
!857 = !DILocation(line: 589, column: 50, scope: !722)
!858 = !DILocation(line: 589, column: 34, scope: !722)
!859 = !DILocation(line: 589, column: 29, scope: !722)
!860 = !DILocation(line: 589, column: 56, scope: !698)
!861 = !{i64 4}
!862 = !DILocation(line: 597, column: 6, scope: !698)
!863 = !DILocation(line: 591, column: 25, scope: !698)
!864 = !DILocation(line: 590, column: 31, scope: !698)
!865 = !DILocation(line: 96, column: 40, scope: !772, inlinedAt: !866)
!866 = distinct !DILocation(line: 590, column: 46, scope: !724)
!867 = !DILocation(line: 83, column: 19, scope: !840, inlinedAt: !868)
!868 = distinct !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !866)
!869 = !DILocation(line: 83, column: 29, scope: !840, inlinedAt: !868)
!870 = !DILocation(line: 92, column: 18, scope: !840, inlinedAt: !868)
!871 = !DILocation(line: 93, column: 6, scope: !840, inlinedAt: !868)
!872 = !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !866)
!873 = !DILocation(line: 590, column: 46, scope: !724)
!874 = !DILocation(line: 595, column: 13, scope: !698)
!875 = !DILocation(line: 96, column: 40, scope: !772, inlinedAt: !876)
!876 = distinct !DILocation(line: 595, column: 18, scope: !730)
!877 = !DILocation(line: 83, column: 19, scope: !840, inlinedAt: !878)
!878 = distinct !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !876)
!879 = !DILocation(line: 83, column: 29, scope: !840, inlinedAt: !878)
!880 = !DILocation(line: 92, column: 18, scope: !840, inlinedAt: !878)
!881 = !DILocation(line: 93, column: 6, scope: !840, inlinedAt: !878)
!882 = !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !876)
!883 = !DILocation(line: 595, column: 18, scope: !730)
!884 = !DILocation(line: 591, column: 21, scope: !698)
!885 = !DILocation(line: 96, column: 40, scope: !772, inlinedAt: !886)
!886 = distinct !DILocation(line: 592, column: 17, scope: !726)
!887 = !DILocation(line: 83, column: 19, scope: !840, inlinedAt: !888)
!888 = distinct !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !886)
!889 = !DILocation(line: 83, column: 29, scope: !840, inlinedAt: !888)
!890 = !DILocation(line: 92, column: 18, scope: !840, inlinedAt: !888)
!891 = !DILocation(line: 93, column: 6, scope: !840, inlinedAt: !888)
!892 = !DILocation(line: 97, column: 9, scope: !772, inlinedAt: !886)
!893 = !DILocation(line: 592, column: 17, scope: !726)
!894 = distinct !DISubprogram(name: "new<pc_keyboard::layouts::us104::Us104Key>", linkageName: "_ZN11pc_keyboard21EventDecoder$LT$L$GT$3new17h7abb6502559a4970E", scope: !398, file: !895, line: 647, type: !896, scopeLine: 647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !420, retainedNodes: !898)
!895 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "6bec53fc8eab0fe8f28a81b677ce329c")
!896 = !DISubroutineType(types: !897)
!897 = !{!398, !417, !401}
!898 = !{!899, !900}
!899 = !DILocalVariable(name: "layout", arg: 1, scope: !894, file: !895, line: 647, type: !417)
!900 = !DILocalVariable(name: "handle_ctrl", arg: 2, scope: !894, file: !895, line: 647, type: !401)
!901 = !DILocation(line: 647, column: 22, scope: !894)
!902 = !DILocation(line: 647, column: 33, scope: !894)
!903 = !DILocation(line: 650, column: 24, scope: !894)
!904 = !DILocation(line: 648, column: 9, scope: !894)
!905 = !DILocation(line: 662, column: 6, scope: !894)
!906 = distinct !DISubprogram(name: "new<pc_keyboard::layouts::us104::Us104Key, pc_keyboard::scancodes::set1::ScancodeSet1>", linkageName: "_ZN11pc_keyboard21Keyboard$LT$L$C$S$GT$3new17h59087364b2e25e5cE", scope: !375, file: !895, line: 498, type: !907, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !422, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!375, !384, !417, !401}
!909 = !{!910, !911, !912}
!910 = !DILocalVariable(name: "scancode_set", arg: 1, scope: !906, file: !895, line: 498, type: !384)
!911 = !DILocalVariable(name: "layout", arg: 2, scope: !906, file: !895, line: 498, type: !417)
!912 = !DILocalVariable(name: "handle_ctrl", arg: 3, scope: !906, file: !895, line: 498, type: !401)
!913 = !DILocation(line: 498, column: 22, scope: !906)
!914 = !DILocation(line: 498, column: 39, scope: !906)
!915 = !DILocation(line: 498, column: 50, scope: !906)
!916 = !DILocation(line: 500, column: 26, scope: !906)
!917 = !DILocation(line: 502, column: 28, scope: !906)
!918 = !DILocation(line: 499, column: 9, scope: !906)
!919 = !DILocation(line: 504, column: 6, scope: !906)
!920 = distinct !DISubprogram(name: "without_interrupts<theo::peripherals::_print::{closure_env#0}, ()>", linkageName: "_ZN14cpu_interrupts18without_interrupts17h7b4d67ff578b5d8aE", scope: !105, file: !921, line: 16, type: !922, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !987, retainedNodes: !985)
!921 = !DIFile(filename: "cpu_interrupts/src/lib.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "d41e9ab8103777331c8ae40b9cd7f55b")
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924}
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !925, file: !2, size: 64, align: 64, elements: !926, templateParams: !27, identifier: "e8f5c21ab48ab9fec890de8ca1260b2b")
!925 = !DINamespace(name: "_print", scope: !268)
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__args", scope: !924, file: !2, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !929, size: 64, align: 64, dwarfAddressSpace: 0)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !553, file: !2, size: 384, align: 64, elements: !930, templateParams: !27, identifier: "84f4de322c722d4ecf7f26fdd881a12a")
!930 = !{!931, !937, !979}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !929, file: !2, baseType: !932, size: 128, align: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !933, templateParams: !27, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!933 = !{!934, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !932, file: !2, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !932, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !929, file: !2, baseType: !938, size: 128, align: 64, offset: 256)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !95, file: !2, size: 128, align: 64, elements: !939, templateParams: !27, identifier: "45e7676749e8833fc9f6788a752fa233")
!939 = !{!940}
!940 = !DICompositeType(tag: DW_TAG_variant_part, scope: !938, file: !2, size: 128, align: 64, elements: !941, templateParams: !27, identifier: "78fc5675d20b0b054937c9b243721b04", discriminator: !978)
!941 = !{!942, !974}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !940, file: !2, baseType: !943, size: 128, align: 64, extraData: i64 0)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !938, file: !2, size: 128, align: 64, elements: !27, templateParams: !944, identifier: "7d6e0642c5fd326d5dedec8db5f1b626")
!944 = !{!945}
!945 = !DITemplateTypeParameter(name: "T", type: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !947, templateParams: !27, identifier: "2bdd0a1d249b9615818490cbe02637d0")
!947 = !{!948, !973}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !946, file: !2, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64, dwarfAddressSpace: 0)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !552, file: !2, size: 448, align: 64, elements: !951, templateParams: !27, identifier: "60d1cd8e27ed5e572e6b6b32ddcefdd4")
!951 = !{!952, !953, !954, !955, !956, !972}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !950, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !950, file: !2, baseType: !807, size: 32, align: 32, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !950, file: !2, baseType: !551, size: 8, align: 8, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !2, baseType: !125, size: 32, align: 32, offset: 352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !950, file: !2, baseType: !957, size: 128, align: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !552, file: !2, size: 128, align: 64, elements: !958, templateParams: !27, identifier: "8e436bf796d1bd1040afe66a54932e93")
!958 = !{!959}
!959 = !DICompositeType(tag: DW_TAG_variant_part, scope: !957, file: !2, size: 128, align: 64, elements: !960, templateParams: !27, identifier: "a16b1bf0ef6abe7338d550f54b3197c9", discriminator: !971)
!960 = !{!961, !965, !969}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !959, file: !2, baseType: !962, size: 128, align: 64, extraData: i64 0)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !957, file: !2, size: 128, align: 64, elements: !963, templateParams: !27, identifier: "bb2788de63ecf655614eae44833a9683")
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !962, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !959, file: !2, baseType: !966, size: 128, align: 64, extraData: i64 1)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !957, file: !2, size: 128, align: 64, elements: !967, templateParams: !27, identifier: "45b8dfec94a90db1ad28af7e19954195")
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !966, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !959, file: !2, baseType: !970, size: 128, align: 64, extraData: i64 2)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !957, file: !2, size: 128, align: 64, elements: !27, identifier: "b2dd58a70f39c2d6f76f6e2aef3afc0e")
!971 = !DIDerivedType(tag: DW_TAG_member, scope: !957, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !950, file: !2, baseType: !957, size: 128, align: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !946, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !940, file: !2, baseType: !975, size: 128, align: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !938, file: !2, size: 128, align: 64, elements: !976, templateParams: !944, identifier: "17825c15133f27503bca321877d808b")
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !975, file: !2, baseType: !946, size: 128, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, scope: !938, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !929, file: !2, baseType: !980, size: 128, align: 64, offset: 128)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !981, templateParams: !27, identifier: "b8c00ffcd99aa185b2b067e76efe6873")
!981 = !{!982, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !980, file: !2, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64, dwarfAddressSpace: 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !980, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!985 = !{!986}
!986 = !DILocalVariable(name: "f", arg: 1, scope: !920, file: !921, line: 16, type: !924)
!987 = !{!988, !989}
!988 = !DITemplateTypeParameter(name: "F", type: !924)
!989 = !DITemplateTypeParameter(name: "R", type: !7)
!990 = !DILocation(line: 16, column: 33, scope: !920)
!991 = !DILocation(line: 20, column: 5, scope: !920)
!992 = !DILocation(line: 21, column: 2, scope: !920)
!993 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h229fb95b0e890388E", scope: !995, file: !994, line: 2258, type: !996, scopeLine: 2258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !548, templateParams: !1029, retainedNodes: !1026)
!994 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef87442911d64d819773d1c3d54b7ba2")
!995 = !DINamespace(name: "{impl#53}", scope: !553)
!996 = !DISubroutineType(types: !997)
!997 = !{!784, !998, !802}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !999, size: 64, align: 64, dwarfAddressSpace: 0)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !1000, size: 64, align: 64, dwarfAddressSpace: 0)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !1001, file: !2, size: 320, align: 64, elements: !1002, templateParams: !27, identifier: "9fb8169c5307d37671b4078accbfda43")
!1001 = !DINamespace(name: "panic_info", scope: !708)
!1002 = !{!1003, !1010, !1024, !1025}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !1000, file: !2, baseType: !1004, size: 128, align: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !1005, templateParams: !27, identifier: "4aca12c339db55d037343c2d21b228c9")
!1005 = !{!1006, !1009}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1004, file: !2, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64, dwarfAddressSpace: 0)
