; ModuleID = '2cmpswwhidv6z3s2'
source_filename = "2cmpswwhidv6z3s2"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "4f31452b5bae251f7c7e97a56873542e")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "393a49189beaa3e27cce4317032b9e3")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "28d36a770054162cfd7382e232cf39ce")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "d81cb3ae5114649b619cb124c1153c8f")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "5038a7ded012f83f4d8c704f25ef81bd")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "a9a9a5a7b0f21ace8e54495c3bc17ed4")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "c1d9da1cc23a193c3bba11a90b4d7557")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "SAFE_IDT", linkageName: "_ZN4theo10interrupts8SAFE_IDT17h3cf387539d3bcd9fE", scope: !56, file: !58, line: 161, type: !59, isLocal: true, isDefinition: true, align: 8)
!56 = !DINamespace(name: "interrupts", scope: !57)
!57 = !DINamespace(name: "theo", scope: null)
!58 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SAFE_IDT", scope: !56, file: !2, align: 8, elements: !60, templateParams: !27, identifier: "c2991c5756a66362390b733b76ee7492")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !59, file: !2, baseType: !7, align: 8)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h26f9b8b50c4a150dE", scope: !64, file: !67, line: 29, type: !68, isLocal: true, isDefinition: true, align: 128)
!64 = !DINamespace(name: "__stability", scope: !65)
!65 = !DINamespace(name: "deref", scope: !66)
!66 = !DINamespace(name: "{impl#0}", scope: !56)
!67 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !69, file: !2, size: 33024, align: 128, elements: !71, templateParams: !101, identifier: "8520668c5a6a6e0d8e13ce0bd40a6b5f")
!69 = !DINamespace(name: "lazy", scope: !70)
!70 = !DINamespace(name: "lazy_static", scope: null)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !73, size: 33024, align: 128)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !74, file: !2, size: 33024, align: 128, elements: !76, templateParams: !101, identifier: "b0d7823708064c8a8c7c976f2f7e3785")
!74 = !DINamespace(name: "once", scope: !75)
!75 = !DINamespace(name: "spin", scope: null)
!76 = !{!77, !90}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !2, baseType: !78, size: 64, align: 64, offset: 32896)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !79, file: !2, size: 64, align: 64, elements: !82, templateParams: !27, identifier: "659c57a59ea5f4acb12dc0fb02feae6")
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !81)
!81 = !DINamespace(name: "core", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !78, file: !2, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !85, file: !2, size: 64, align: 64, elements: !86, templateParams: !88, identifier: "28001222aea8c66d6df55bf53e0de5fe")
!85 = !DINamespace(name: "cell", scope: !81)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !2, baseType: !9, size: 64, align: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !2, baseType: !91, size: 32896, align: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>>", scope: !85, file: !2, size: 32896, align: 128, elements: !92, templateParams: !264, identifier: "b02cb68321821ea880add3d94bcaab96")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !94, size: 32896, align: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable>", scope: !95, file: !2, size: 32896, align: 128, elements: !96, templateParams: !27, identifier: "6f4f7dddc96d28c690ebdf851609ee7a")
!95 = !DINamespace(name: "option", scope: !81)
!96 = !{!97}
!97 = !DICompositeType(tag: DW_TAG_variant_part, scope: !94, file: !2, size: 32896, align: 128, elements: !98, templateParams: !27, identifier: "d2af3152ede9205168cb171ca3481cc0", discriminator: !263)
!98 = !{!99, !259}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !97, file: !2, baseType: !100, size: 32896, align: 128, extraData: i64 2)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !94, file: !2, size: 32896, align: 128, elements: !27, templateParams: !101, identifier: "c9c0fb9e0124adf05d852dcc5f570f97")
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SafeInterruptDescriptorTable", scope: !104, file: !2, size: 32896, align: 128, elements: !106, templateParams: !27, identifier: "70d6197fc17c473ebb42659c31a75645")
!104 = !DINamespace(name: "interrupt_descriptor_table", scope: !105)
!105 = !DINamespace(name: "cpu_interrupts", scope: null)
!106 = !{!107, !255, !257, !258}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !103, file: !2, baseType: !108, size: 32768, align: 128)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !109, file: !2, size: 32768, align: 128, elements: !112, templateParams: !27, identifier: "344066eefb71a9a4826d6b6e1653983")
!109 = !DINamespace(name: "idt", scope: !110)
!110 = !DINamespace(name: "structures", scope: !111)
!111 = !DINamespace(name: "x86_64", scope: null)
!112 = !{!113, !152, !153, !154, !155, !156, !157, !158, !159, !178, !179, !197, !198, !199, !200, !221, !222, !223, !224, !242, !243, !244, !248, !249, !250, !251}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !108, file: !2, baseType: !114, size: 128, align: 32)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !109, file: !2, size: 128, align: 32, elements: !115, templateParams: !150, identifier: "9bd5d8ba110018e168af56cd5466dd9e")
!115 = !{!116, !118, !119, !123, !124, !126, !127}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !114, file: !2, baseType: !117, size: 16, align: 16)
!117 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !109, file: !2, size: 16, align: 16, elements: !121, templateParams: !27, identifier: "4812ce4d9448c083e7cc764669801651")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !117, size: 16, align: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !114, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !114, file: !2, baseType: !128, align: 8, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !130, identifier: "9b42f4417703ada3a4dd6f23a5f42df9")
!129 = !DINamespace(name: "marker", scope: !81)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !109, file: !2, size: 320, align: 64, elements: !136, templateParams: !27, identifier: "d798f966c7523b884dbf2929e6382c8")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !2, baseType: !138, size: 320, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !109, file: !2, size: 320, align: 64, elements: !139, templateParams: !27, identifier: "d69b69f5b316dfba4c4f4d2cc0ce216a")
!139 = !{!140, !146, !147, !148, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !142, file: !2, size: 64, align: 64, elements: !143, templateParams: !27, identifier: "ea0a2529feb4b989da37585d057ed7")
!142 = !DINamespace(name: "addr", scope: !111)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !141, file: !2, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !138, file: !2, baseType: !145, size: 64, align: 64, offset: 256)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "F", type: !132)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !108, file: !2, baseType: !160, size: 128, align: 32, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !161, templateParams: !176, identifier: "4d73af3ffad0f45f2c8fc406e9c4a66b")
!161 = !{!162, !163, !164, !165, !166, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !160, file: !2, baseType: !117, size: 16, align: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !160, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !160, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !160, file: !2, baseType: !169, align: 8, offset: 128)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !170, identifier: "fac20204074e572ea7976601bff284da")
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !173, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !135, !145}
!175 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "F", type: !172)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1280)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !109, file: !2, size: 128, align: 32, elements: !181, templateParams: !195, identifier: "af8fe3bdefc6e09439055bd187f8f676")
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !180, file: !2, baseType: !117, size: 16, align: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !180, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !180, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !180, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !180, file: !2, baseType: !189, align: 8, offset: 128)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !190, identifier: "49acfd6a6fa583115eb818868a48e51")
!190 = !{!191}
!191 = !DITemplateTypeParameter(name: "T", type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !135, !145}
!195 = !{!196}
!196 = !DITemplateTypeParameter(name: "F", type: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 1664)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !108, file: !2, baseType: !201, size: 128, align: 32, offset: 1792)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !109, file: !2, size: 128, align: 32, elements: !202, templateParams: !219, identifier: "9cc1c6eee881daf56d0d6d3a97072803")
!202 = !{!203, !204, !205, !206, !207, !208, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !201, file: !2, baseType: !117, size: 16, align: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !201, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !201, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !201, file: !2, baseType: !210, align: 8, offset: 128)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !211, identifier: "1b2aa8a60862dca3856ef3fe67ced0fb")
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "T", type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !135, !216}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !109, file: !2, size: 64, align: 64, elements: !217, templateParams: !27, identifier: "f9681c64aed72fd8a4b0d8fe30b4dca3")
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !216, file: !2, baseType: !145, size: 64, align: 64)
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "F", type: !213)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 1920)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2048)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !108, file: !2, baseType: !225, size: 128, align: 32, offset: 2304)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !109, file: !2, size: 128, align: 32, elements: !226, templateParams: !240, identifier: "a39008ed08d706ef43b777f3b1178c9b")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !225, file: !2, baseType: !117, size: 16, align: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !2, baseType: !120, size: 16, align: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !225, file: !2, baseType: !117, size: 16, align: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !225, file: !2, baseType: !125, size: 32, align: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !225, file: !2, baseType: !234, align: 8, offset: 128)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !235, identifier: "b421cc619feec039cc6c686c2a3348ee")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubroutineType(types: !239)
!239 = !{!175, !135}
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "F", type: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !108, file: !2, baseType: !245, size: 1024, align: 32, offset: 2688)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, align: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8, lowerBound: 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3712)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !108, file: !2, baseType: !180, size: 128, align: 32, offset: 3840)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !108, file: !2, baseType: !114, size: 128, align: 32, offset: 3968)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !108, file: !2, baseType: !252, size: 28672, align: 32, offset: 4096)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 28672, align: 32, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 224, lowerBound: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32768)
!256 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32776)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "timer_interrupt_handler_set", scope: !103, file: !2, baseType: !256, size: 8, align: 8, offset: 32784)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !97, file: !2, baseType: !260, size: 32896, align: 128)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !94, file: !2, size: 32896, align: 128, elements: !261, templateParams: !101, identifier: "1e8c6af82d2dde164cfd1cdd5123b085")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !103, size: 32896, align: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !2, baseType: !39, size: 8, align: 8, offset: 32768, flags: DIFlagArtificial)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !94)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN_TEXT_MODE", linkageName: "_ZN4theo11peripherals24VGA_DISPLAY_IN_TEXT_MODE17hf4ca25ebf77e0e73E", scope: !268, file: !58, line: 161, type: !269, isLocal: true, isDefinition: true, align: 8)
!268 = !DINamespace(name: "peripherals", scope: !57)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN_TEXT_MODE", scope: !268, file: !2, align: 8, elements: !270, templateParams: !27, identifier: "b8dcef2ab4ddd5157d00cb1440b66ef8")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !269, file: !2, baseType: !7, align: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h0aff3b482b54b827E", scope: !274, file: !67, line: 29, type: !277, isLocal: true, isDefinition: true, align: 64)
!274 = !DINamespace(name: "__stability", scope: !275)
!275 = !DINamespace(name: "deref", scope: !276)
!276 = !DINamespace(name: "{impl#0}", scope: !268)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !69, file: !2, size: 1920, align: 64, elements: !278, templateParams: !293, identifier: "2f141117e5fc00021b945913795d4663")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !2, baseType: !280, size: 1920, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !74, file: !2, size: 1920, align: 64, elements: !281, templateParams: !293, identifier: "837091f3e81a68a6232256ab4cfafaf0")
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !2, baseType: !78, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !2, baseType: !284, size: 1856, align: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !85, file: !2, size: 1856, align: 64, elements: !285, templateParams: !330, identifier: "91eb0fc20c912a31869778eb1dce3599")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !287, size: 1856, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !95, file: !2, size: 1856, align: 64, elements: !288, templateParams: !27, identifier: "447ea028ea9c0e55a8c5fc793163a842")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 1856, align: 64, elements: !290, templateParams: !27, identifier: "e4e88deb50db3d9b11dd34cc38ecd4ad", discriminator: !329)
!290 = !{!291, !325}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 1856, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 1856, align: 64, elements: !27, templateParams: !293, identifier: "5f7c976f70e1f6e4efe48bcd64a44cd0")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !296, file: !2, size: 1792, align: 64, elements: !297, templateParams: !323, identifier: "4a34083fc127566d9d967e414fef722c")
!296 = !DINamespace(name: "mutex", scope: !75)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !295, file: !2, baseType: !299, size: 1792, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !300, file: !2, size: 1792, align: 64, elements: !301, templateParams: !323, identifier: "3179867fd544301617117d13a353ed64")
!300 = !DINamespace(name: "spin", scope: !296)
!301 = !{!302, !308, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !299, file: !2, baseType: !303, align: 8)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !304, identifier: "d08ddacde7ee926a2a6c950158cb862")
!304 = !{!305}
!305 = !DITemplateTypeParameter(name: "T", type: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !307, file: !2, align: 8, elements: !27, identifier: "679d2a8e1349532871b4b0709c3728ed")
!307 = !DINamespace(name: "relax", scope: !75)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !2, baseType: !309, size: 8, align: 8)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !79, file: !2, size: 8, align: 8, elements: !310, templateParams: !27, identifier: "2d8ea5f5fcbdcc1c1c5046564ca9725e")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !309, file: !2, baseType: !312, size: 8, align: 8)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !85, file: !2, size: 8, align: 8, elements: !313, templateParams: !315, identifier: "41d111d7007d2857cfc9bcb94019386a")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !2, baseType: !39, size: 8, align: 8)
!315 = !{!316}
!316 = !DITemplateTypeParameter(name: "T", type: !39)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !2, baseType: !318, size: 1728, align: 64, offset: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !85, file: !2, size: 1728, align: 64, elements: !319, templateParams: !321, identifier: "546cbf493215d28216f7d0d30ddb916d")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !2, baseType: !15, size: 1728, align: 64)
!321 = !{!322}
!322 = !DITemplateTypeParameter(name: "T", type: !15)
!323 = !{!322, !324}
!324 = !DITemplateTypeParameter(name: "R", type: !306)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !326, size: 1856, align: 64, extraData: i64 1)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 1856, align: 64, elements: !327, templateParams: !293, identifier: "f00c95186b7f84e2751be460100bfded")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !295, size: 1792, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !287)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "SERIAL1", linkageName: "_ZN4theo6serial7SERIAL117h5240d2f1502d4ea0E", scope: !334, file: !58, line: 161, type: !335, isLocal: true, isDefinition: true, align: 8)
!334 = !DINamespace(name: "serial", scope: !57)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "SERIAL1", scope: !334, file: !2, align: 8, elements: !336, templateParams: !27, identifier: "3bf48b2305f03a2f755be8587c22707")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !335, file: !2, baseType: !7, align: 8)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN65_$LT$theo..serial..SERIAL1$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h900de16d7716c952E", scope: !340, file: !67, line: 29, type: !343, isLocal: true, isDefinition: true, align: 64)
!340 = !DINamespace(name: "__stability", scope: !341)
!341 = !DINamespace(name: "deref", scope: !342)
!342 = !DINamespace(name: "{impl#0}", scope: !334)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !69, file: !2, size: 192, align: 64, elements: !344, templateParams: !359, identifier: "c6130bbdbb18e188befa14dc9fba098f")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !346, size: 192, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !74, file: !2, size: 192, align: 64, elements: !347, templateParams: !359, identifier: "aa02e5547d9417445116fb6f5cba6f7a")
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !346, file: !2, baseType: !78, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !2, baseType: !350, size: 128, align: 16)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>>", scope: !85, file: !2, size: 128, align: 16, elements: !351, templateParams: !440, identifier: "5fb58e34e9f615d5b9473eaf85512b5")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !2, baseType: !353, size: 128, align: 16)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<uart_16550::port::SerialPort, spin::relax::Spin>>", scope: !95, file: !2, size: 128, align: 16, elements: !354, templateParams: !27, identifier: "fbf39550eb02060394340ccc0eb9c7ea")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_variant_part, scope: !353, file: !2, size: 128, align: 16, elements: !356, templateParams: !27, identifier: "b2677faec8796a2ff94375fe61a99e98", discriminator: !439)
!356 = !{!357, !435}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !355, file: !2, baseType: !358, size: 128, align: 16, extraData: i64 0)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !353, file: !2, size: 128, align: 16, elements: !27, templateParams: !359, identifier: "18c68ee5484b131b3221658ac1a37b1a")
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !296, file: !2, size: 112, align: 16, elements: !362, templateParams: !434, identifier: "87d5a88df9d74769929dbcb948c0f7e6")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !361, file: !2, baseType: !364, size: 112, align: 16)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<uart_16550::port::SerialPort, spin::relax::Spin>", scope: !300, file: !2, size: 112, align: 16, elements: !365, templateParams: !434, identifier: "91e725ea2a3105d6ab46bb68aff3d78f")
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !364, file: !2, baseType: !303, align: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !364, file: !2, baseType: !309, size: 8, align: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !2, baseType: !369, size: 96, align: 16, offset: 16)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<uart_16550::port::SerialPort>", scope: !85, file: !2, size: 96, align: 16, elements: !370, templateParams: !432, identifier: "244fde77e37ee60f9d9dbb876b2d651")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !2, baseType: !372, size: 96, align: 16)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !373, file: !2, size: 96, align: 16, elements: !375, templateParams: !27, identifier: "6b12e73ecb1b146e840cd6df157bd55a")
!373 = !DINamespace(name: "port", scope: !374)
!374 = !DINamespace(name: "uart_16550", scope: null)
!375 = !{!376, !395, !412, !413, !414, !415}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !372, file: !2, baseType: !377, size: 16, align: 16)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !380, templateParams: !393, identifier: "891b8963aaec3281174b762a7b4c9ced")
!378 = !DINamespace(name: "port", scope: !379)
!379 = !DINamespace(name: "instructions", scope: !111)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !377, file: !2, baseType: !117, size: 16, align: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !377, file: !2, baseType: !383, align: 8)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !384, identifier: "cf1e6ac0b81c4d477067f2210327a959")
!384 = !{!385}
!385 = !DITemplateTypeParameter(name: "T", type: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !2, size: 8, align: 8, elements: !387, templateParams: !27, identifier: "cf2996b5b7cc8925c44f7146ae57577d")
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !386, file: !2, baseType: !39, size: 8, align: 8)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !386, file: !2, baseType: !390, align: 8, offset: 8)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !378, file: !2, align: 8, elements: !391, templateParams: !27, identifier: "db2664ceb848d2dae7bd39140452d55")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !7, align: 8)
!393 = !{!316, !394}
!394 = !DITemplateTypeParameter(name: "A", type: !390)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 16)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !397, templateParams: !410, identifier: "7f717ee20479e70b28a5030221db5144")
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !396, file: !2, baseType: !117, size: 16, align: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !396, file: !2, baseType: !400, align: 8)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !401, identifier: "163283c5974c266433610755ec92f2c5")
!401 = !{!402}
!402 = !DITemplateTypeParameter(name: "T", type: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !2, size: 8, align: 8, elements: !404, templateParams: !27, identifier: "36d4cb01c67257ac7b31f9c10da09c87")
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !39, size: 8, align: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !403, file: !2, baseType: !407, align: 8, offset: 8)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !378, file: !2, align: 8, elements: !408, templateParams: !27, identifier: "ee6af8237358b78ad437f2e31a2cf2cb")
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !407, file: !2, baseType: !7, align: 8)
!410 = !{!316, !411}
!411 = !DITemplateTypeParameter(name: "A", type: !407)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 48)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !372, file: !2, baseType: !396, size: 16, align: 16, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !372, file: !2, baseType: !416, size: 16, align: 16, offset: 80)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !378, file: !2, size: 16, align: 16, elements: !417, templateParams: !430, identifier: "e816ad8078827804fa3d5bcc4bc0149f")
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !416, file: !2, baseType: !117, size: 16, align: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !416, file: !2, baseType: !420, align: 8)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !129, file: !2, align: 8, elements: !27, templateParams: !421, identifier: "90c1041b3a9e595c33c0f90b7bfb2cfb")
!421 = !{!422}
!422 = !DITemplateTypeParameter(name: "T", type: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !2, size: 8, align: 8, elements: !424, templateParams: !27, identifier: "7bede4854495a77b85d2a70b63162d37")
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !423, file: !2, baseType: !39, size: 8, align: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !423, file: !2, baseType: !427, align: 8, offset: 8)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !378, file: !2, align: 8, elements: !428, templateParams: !27, identifier: "923793729ddd42a36b36191642c2996")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !427, file: !2, baseType: !7, align: 8)
!430 = !{!316, !431}
!431 = !DITemplateTypeParameter(name: "A", type: !427)
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !372)
!434 = !{!433, !324}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !355, file: !2, baseType: !436, size: 128, align: 16, extraData: i64 1)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !353, file: !2, size: 128, align: 16, elements: !437, templateParams: !359, identifier: "fae33ee4839c0d496a6959d76ab285de")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !436, file: !2, baseType: !361, size: 112, align: 16, offset: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, scope: !353, file: !2, baseType: !117, size: 16, align: 16, flags: DIFlagArtificial)
!440 = !{!441}
!441 = !DITemplateTypeParameter(name: "T", type: !353)
!442 = !{i32 8, !"PIC Level", i32 2}
!443 = !{i32 7, !"PIE Level", i32 2}
!444 = !{i32 2, !"Dwarf Version", i32 4}
!445 = !{i32 2, !"Debug Info Version", i32 3}
!446 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !447, producer: "clang LLVM (rustc version 1.71.0-nightly (39c6804b9 2023-04-19))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, globals: !465, splitDebugInlining: false)
!447 = !DIFile(filename: "src/main.rs/@/2cmpswwhidv6z3s2", directory: "/Users/yaw/self/theo")
!448 = !{!49, !449, !458}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !450, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !453)
!450 = !DINamespace(name: "v1", scope: !451)
!451 = !DINamespace(name: "rt", scope: !452)
!452 = !DINamespace(name: "fmt", scope: !81)
!453 = !{!454, !455, !456, !457}
!454 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!455 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!456 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!457 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !459)
!459 = !{!460, !461, !462, !463, !464}
!460 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!464 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!465 = !{!0, !54, !62, !266, !272, !332, !338}
!466 = distinct !DISubprogram(name: "index_mut", linkageName: "_ZN109_$LT$x86_64..structures..idt..InterruptDescriptorTable$u20$as$u20$core..ops..index..IndexMut$LT$usize$GT$$GT$9index_mut17h67eea05ec7246576E", scope: !468, file: !467, line: 575, type: !469, scopeLine: 575, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !486)
!467 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!468 = !DINamespace(name: "{impl#2}", scope: !109)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !472, !9, !473}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !475, file: !2, size: 192, align: 64, elements: !477, templateParams: !27, identifier: "890f479934f1e71d4972eb7472510a5")
!475 = !DINamespace(name: "location", scope: !476)
!476 = !DINamespace(name: "panic", scope: !81)
!477 = !{!478, !484, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !474, file: !2, baseType: !479, size: 128, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !480, templateParams: !27, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!480 = !{!481, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !479, file: !2, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !479, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !474, file: !2, baseType: !125, size: 32, align: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !474, file: !2, baseType: !125, size: 32, align: 32, offset: 160)
!486 = !{!487, !488, !489, !491, !493, !495, !497}
!487 = !DILocalVariable(name: "self", arg: 1, scope: !466, file: !467, line: 575, type: !472)
!488 = !DILocalVariable(name: "index", arg: 2, scope: !466, file: !467, line: 575, type: !9)
!489 = !DILocalVariable(name: "i", scope: !490, file: !467, line: 589, type: !9, align: 8)
!490 = distinct !DILexicalBlock(scope: !466, file: !467, line: 589, column: 13)
!491 = !DILocalVariable(name: "i", scope: !492, file: !467, line: 590, type: !9, align: 8)
!492 = distinct !DILexicalBlock(scope: !466, file: !467, line: 590, column: 13)
!493 = !DILocalVariable(name: "i", scope: !494, file: !467, line: 591, type: !9, align: 8)
!494 = distinct !DILexicalBlock(scope: !466, file: !467, line: 591, column: 13)
!495 = !DILocalVariable(name: "i", scope: !496, file: !467, line: 594, type: !9, align: 8)
!496 = distinct !DILexicalBlock(scope: !466, file: !467, line: 594, column: 13)
!497 = !DILocalVariable(name: "i", scope: !498, file: !467, line: 595, type: !9, align: 8)
!498 = distinct !DILexicalBlock(scope: !466, file: !467, line: 595, column: 13)
!499 = !DILocation(line: 575, column: 18, scope: !466)
!500 = !DILocation(line: 575, column: 29, scope: !466)
!501 = !DILocation(line: 589, column: 13, scope: !490)
!502 = !DILocation(line: 590, column: 13, scope: !492)
!503 = !DILocation(line: 591, column: 13, scope: !494)
!504 = !DILocation(line: 594, column: 13, scope: !496)
!505 = !DILocation(line: 595, column: 13, scope: !498)
!506 = !DILocation(line: 576, column: 9, scope: !466)
!507 = !DILocation(line: 589, column: 17, scope: !466)
!508 = !DILocation(line: 577, column: 18, scope: !466)
!509 = !DILocation(line: 577, column: 39, scope: !466)
!510 = !DILocation(line: 578, column: 18, scope: !466)
!511 = !DILocation(line: 578, column: 32, scope: !466)
!512 = !DILocation(line: 579, column: 18, scope: !466)
!513 = !DILocation(line: 579, column: 49, scope: !466)
!514 = !DILocation(line: 580, column: 18, scope: !466)
!515 = !DILocation(line: 580, column: 37, scope: !466)
!516 = !DILocation(line: 581, column: 18, scope: !466)
!517 = !DILocation(line: 581, column: 35, scope: !466)
!518 = !DILocation(line: 582, column: 18, scope: !466)
!519 = !DILocation(line: 582, column: 47, scope: !466)
!520 = !DILocation(line: 583, column: 18, scope: !466)
!521 = !DILocation(line: 583, column: 41, scope: !466)
!522 = !DILocation(line: 584, column: 18, scope: !466)
!523 = !DILocation(line: 584, column: 47, scope: !466)
!524 = !DILocation(line: 585, column: 18, scope: !466)
!525 = !DILocation(line: 585, column: 54, scope: !466)
!526 = !DILocation(line: 586, column: 19, scope: !466)
!527 = !DILocation(line: 586, column: 46, scope: !466)
!528 = !DILocation(line: 587, column: 19, scope: !466)
!529 = !DILocation(line: 587, column: 47, scope: !466)
!530 = !DILocation(line: 588, column: 19, scope: !466)
!531 = !DILocation(line: 588, column: 42, scope: !466)
!532 = !DILocation(line: 590, column: 13, scope: !466)
!533 = !DILocation(line: 590, column: 22, scope: !466)
!534 = !DILocation(line: 591, column: 13, scope: !466)
!535 = !DILocation(line: 591, column: 35, scope: !466)
!536 = !DILocation(line: 591, column: 44, scope: !466)
!537 = !DILocation(line: 591, column: 53, scope: !466)
!538 = !DILocation(line: 594, column: 13, scope: !466)
!539 = !DILocation(line: 594, column: 23, scope: !496)
!540 = !DILocation(line: 590, column: 35, scope: !466)
!541 = !DILocation(line: 589, column: 50, scope: !490)
!542 = !DILocation(line: 589, column: 34, scope: !490)
!543 = !DILocation(line: 589, column: 29, scope: !490)
!544 = !DILocation(line: 589, column: 56, scope: !466)
!545 = !{i64 4}
!546 = !DILocation(line: 597, column: 6, scope: !466)
!547 = !DILocation(line: 591, column: 25, scope: !466)
!548 = !DILocation(line: 590, column: 31, scope: !466)
!549 = !DILocation(line: 590, column: 46, scope: !492)
!550 = !DILocation(line: 595, column: 13, scope: !466)
!551 = !DILocation(line: 595, column: 18, scope: !498)
!552 = !DILocation(line: 591, column: 21, scope: !466)
!553 = !DILocation(line: 592, column: 17, scope: !494)
!554 = distinct !DISubprogram(name: "without_interrupts<theo::peripherals::_print::{closure_env#0}, ()>", linkageName: "_ZN14cpu_interrupts18without_interrupts17h67b0667b0f7b2a23E", scope: !105, file: !555, line: 16, type: !556, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !683, retainedNodes: !681)
!555 = !DIFile(filename: "cpu_interrupts/src/lib.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "d41e9ab8103777331c8ae40b9cd7f55b")
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !559, file: !2, size: 64, align: 64, elements: !560, templateParams: !27, identifier: "5fd9330c4a09a45ae793fc19e62e6e42")
!559 = !DINamespace(name: "_print", scope: !268)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__args", scope: !558, file: !2, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !452, file: !2, size: 384, align: 64, elements: !564, templateParams: !27, identifier: "1c46a498dd7b956f4c3a670fdfba5262")
!564 = !{!565, !571, !617}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !563, file: !2, baseType: !566, size: 128, align: 64, offset: 128)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !567, templateParams: !27, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!567 = !{!568, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !566, file: !2, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !566, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !563, file: !2, baseType: !572, size: 128, align: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !95, file: !2, size: 128, align: 64, elements: !573, templateParams: !27, identifier: "d25d924bb8d51dd413c49dbfa1f11f1")
!573 = !{!574}
!574 = !DICompositeType(tag: DW_TAG_variant_part, scope: !572, file: !2, size: 128, align: 64, elements: !575, templateParams: !27, identifier: "759788f84997b99f6bc91fe0c57058ba", discriminator: !616)
!575 = !{!576, !612}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !574, file: !2, baseType: !577, size: 128, align: 64, extraData: i64 0)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !572, file: !2, size: 128, align: 64, elements: !27, templateParams: !578, identifier: "82efcd94523cf9c0b17ac37e82724639")
!578 = !{!579}
!579 = !DITemplateTypeParameter(name: "T", type: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !581, templateParams: !27, identifier: "de3ba5e1dd56fab311eb54a28d6cb95f")
!581 = !{!582, !611}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !580, file: !2, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64, dwarfAddressSpace: 0)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !450, file: !2, size: 448, align: 64, elements: !585, templateParams: !27, identifier: "9bee5132fe724679d94d9aaa78899300")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !584, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !584, file: !2, baseType: !588, size: 384, align: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !450, file: !2, size: 384, align: 64, elements: !589, templateParams: !27, identifier: "65fce75b527475dfcd89c81174c5b112")
!589 = !{!590, !592, !593, !594, !610}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !588, file: !2, baseType: !591, size: 32, align: 32, offset: 288)
!591 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !588, file: !2, baseType: !449, size: 8, align: 8, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !588, file: !2, baseType: !125, size: 32, align: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !588, file: !2, baseType: !595, size: 128, align: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !450, file: !2, size: 128, align: 64, elements: !596, templateParams: !27, identifier: "eb274483ac6a1a818973f8ef56806ce6")
!596 = !{!597}
!597 = !DICompositeType(tag: DW_TAG_variant_part, scope: !595, file: !2, size: 128, align: 64, elements: !598, templateParams: !27, identifier: "1383065eb0a1d3eb5559cfa60c22a70d", discriminator: !609)
!598 = !{!599, !603, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !597, file: !2, baseType: !600, size: 128, align: 64, extraData: i64 0)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !595, file: !2, size: 128, align: 64, elements: !601, templateParams: !27, identifier: "284bf6fbe777a447ca6ded9ea5417274")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !600, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !597, file: !2, baseType: !604, size: 128, align: 64, extraData: i64 1)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !595, file: !2, size: 128, align: 64, elements: !605, templateParams: !27, identifier: "47998f14b9dfef6b1e659ae3b3c1ad7f")
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !604, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !597, file: !2, baseType: !608, size: 128, align: 64, extraData: i64 2)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !595, file: !2, size: 128, align: 64, elements: !27, identifier: "a9ac2edd79b7a2c052d84739de651359")
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !595, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !588, file: !2, baseType: !595, size: 128, align: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !580, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !574, file: !2, baseType: !613, size: 128, align: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !572, file: !2, size: 128, align: 64, elements: !614, templateParams: !578, identifier: "ecb4a60835a68b86ac55d46be42b6cd5")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !613, file: !2, baseType: !580, size: 128, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !563, file: !2, baseType: !618, size: 128, align: 64, offset: 256)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !619, templateParams: !27, identifier: "1ef2a88983c14e17bd3824c1adc5cb")
!619 = !{!620, !680}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !618, file: !2, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !452, file: !2, size: 128, align: 64, elements: !623, templateParams: !27, identifier: "4e3593181d4a3fd7c7588e4c93e285e5")
!623 = !{!624, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !622, file: !2, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !626, size: 64, align: 64, dwarfAddressSpace: 0)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !627, file: !2, align: 8, elements: !27, identifier: "9d957b9cbc95a5d52c57994d133a21d2")
!627 = !DINamespace(name: "{extern#0}", scope: !452)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !622, file: !2, baseType: !629, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !630, size: 64, align: 64, dwarfAddressSpace: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !625, !650}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !633, file: !2, size: 8, align: 8, elements: !634, templateParams: !27, identifier: "b7fb26f737e54d12fa01aa3853cdbeae")
!633 = !DINamespace(name: "result", scope: !81)
!634 = !{!635}
!635 = !DICompositeType(tag: DW_TAG_variant_part, scope: !632, file: !2, size: 8, align: 8, elements: !636, templateParams: !27, identifier: "a92bdd2eb05472a8bda434c249c29302", discriminator: !649)
!636 = !{!637, !645}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !635, file: !2, baseType: !638, size: 8, align: 8, extraData: i64 0)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !632, file: !2, size: 8, align: 8, elements: !639, templateParams: !641, identifier: "bb2249fac7fb973c2c787a4c375e7dc3")
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !638, file: !2, baseType: !7, align: 8, offset: 8)
!641 = !{!642, !643}
!642 = !DITemplateTypeParameter(name: "T", type: !7)
!643 = !DITemplateTypeParameter(name: "E", type: !644)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !452, file: !2, align: 8, elements: !27, identifier: "db1174efc0a2f975f4813d5134979630")
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !635, file: !2, baseType: !646, size: 8, align: 8, extraData: i64 1)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !632, file: !2, size: 8, align: 8, elements: !647, templateParams: !641, identifier: "eb015aef3c84d8cf3918a665d11906a1")
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !646, file: !2, baseType: !644, align: 8, offset: 8)
!649 = !DIDerivedType(tag: DW_TAG_member, scope: !632, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !651, size: 64, align: 64, dwarfAddressSpace: 0)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !452, file: !2, size: 512, align: 64, elements: !652, templateParams: !27, identifier: "4518b2a8833c3639e2a18f19d8d2d035")
!652 = !{!653, !654, !655, !656, !668, !669}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !651, file: !2, baseType: !125, size: 32, align: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !651, file: !2, baseType: !591, size: 32, align: 32, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !651, file: !2, baseType: !449, size: 8, align: 8, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !651, file: !2, baseType: !657, size: 128, align: 64, offset: 128)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !95, file: !2, size: 128, align: 64, elements: !658, templateParams: !27, identifier: "e509e62aca398ad985d4d7108c999fce")
!658 = !{!659}
!659 = !DICompositeType(tag: DW_TAG_variant_part, scope: !657, file: !2, size: 128, align: 64, elements: !660, templateParams: !27, identifier: "b800028c0f41e5f65055b3206ca16e40", discriminator: !667)
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !659, file: !2, baseType: !662, size: 128, align: 64, extraData: i64 0)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !657, file: !2, size: 128, align: 64, elements: !27, templateParams: !88, identifier: "c64b01d4e9024c6089607fba201241ac")
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !659, file: !2, baseType: !664, size: 128, align: 64, extraData: i64 1)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !657, file: !2, size: 128, align: 64, elements: !665, templateParams: !88, identifier: "d909f9aede69ded5e6a3f34da3cb5ef3")
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !664, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, scope: !657, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !651, file: !2, baseType: !657, size: 128, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !651, file: !2, baseType: !670, size: 128, align: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !671, templateParams: !27, identifier: "f9270966a9fda351195f72d6edc0f59a")
!671 = !{!672, !675}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !670, file: !2, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64, dwarfAddressSpace: 0)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "26797fbb1ceb902d1b523adeae52178")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !670, file: !2, baseType: !676, size: 64, align: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !677, size: 64, align: 64, dwarfAddressSpace: 0)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 3, lowerBound: 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !618, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!681 = !{!682}
!682 = !DILocalVariable(name: "f", arg: 1, scope: !554, file: !555, line: 16, type: !558)
!683 = !{!684, !685}
!684 = !DITemplateTypeParameter(name: "F", type: !558)
!685 = !DITemplateTypeParameter(name: "R", type: !7)
!686 = !DILocation(line: 16, column: 33, scope: !554)
!687 = !DILocation(line: 20, column: 5, scope: !554)
!688 = !DILocation(line: 21, column: 2, scope: !554)
!689 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17ha3b105e3824e88f4E", scope: !691, file: !690, line: 2418, type: !692, scopeLine: 2418, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !725, retainedNodes: !722)
!690 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!691 = !DINamespace(name: "{impl#59}", scope: !452)
!692 = !DISubroutineType(types: !693)
!693 = !{!632, !694, !650}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !695, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !696, size: 64, align: 64, dwarfAddressSpace: 0)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !697, file: !2, size: 320, align: 64, elements: !698, templateParams: !27, identifier: "467c3dfbfc0c465e49124222a10ddce8")
!697 = !DINamespace(name: "panic_info", scope: !476)
!698 = !{!699, !706, !720, !721}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !696, file: !2, baseType: !700, size: 128, align: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !701, templateParams: !27, identifier: "2b49bbbda2605a294b61f2275c6e9e3f")
!701 = !{!702, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !700, file: !2, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "d5e855c967e0abe299d02d06500873b1")
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !700, file: !2, baseType: !676, size: 64, align: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !696, file: !2, baseType: !707, size: 64, align: 64, offset: 128)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !95, file: !2, size: 64, align: 64, elements: !708, templateParams: !27, identifier: "e3aebd2a991f7c105e152e6f42a90ab6")
!708 = !{!709}
!709 = !DICompositeType(tag: DW_TAG_variant_part, scope: !707, file: !2, size: 64, align: 64, elements: !710, templateParams: !27, identifier: "a9e94a1cad10a84fc6de5d1597de7c40", discriminator: !719)
!710 = !{!711, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !709, file: !2, baseType: !712, size: 64, align: 64, extraData: i64 0)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !707, file: !2, size: 64, align: 64, elements: !27, templateParams: !713, identifier: "257cb92f648e0b1c8bc70cac1422642c")
!713 = !{!714}
!714 = !DITemplateTypeParameter(name: "T", type: !562)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !709, file: !2, baseType: !716, size: 64, align: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !707, file: !2, size: 64, align: 64, elements: !717, templateParams: !713, identifier: "d5956a101efbc556351e45f82427eb3")
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !716, file: !2, baseType: !562, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !707, file: !2, baseType: !145, size: 64, align: 64, flags: DIFlagArtificial)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !696, file: !2, baseType: !473, size: 64, align: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !696, file: !2, baseType: !256, size: 8, align: 8, offset: 256)
!722 = !{!723, !724}
!723 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !690, line: 2418, type: !694)
!724 = !DILocalVariable(name: "f", arg: 2, scope: !689, file: !690, line: 2418, type: !650)
!725 = !{!726}
!726 = !DITemplateTypeParameter(name: "T", type: !696)
!727 = !DILocation(line: 2418, column: 20, scope: !689)
!728 = !DILocation(line: 2418, column: 27, scope: !689)
!729 = !DILocation(line: 2418, column: 71, scope: !689)
!730 = !{i64 8}
!731 = !DILocation(line: 2418, column: 62, scope: !689)
!732 = !DILocation(line: 2418, column: 84, scope: !689)
!733 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h2f1a057ffe7a3e36E", scope: !735, file: !734, line: 237, type: !737, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !740)
!734 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!735 = !DINamespace(name: "{impl#2}", scope: !736)
!736 = !DINamespace(name: "bit_field", scope: null)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !739, !9, !256}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!740 = !{!741, !742, !743}
!741 = !DILocalVariable(name: "self", arg: 1, scope: !733, file: !734, line: 237, type: !739)
!742 = !DILocalVariable(name: "bit", arg: 2, scope: !733, file: !734, line: 237, type: !9)
!743 = !DILocalVariable(name: "value", arg: 3, scope: !733, file: !734, line: 237, type: !256)
!744 = !DILocation(line: 237, column: 24, scope: !733)
!745 = !DILocation(line: 237, column: 35, scope: !733)
!746 = !DILocation(line: 237, column: 47, scope: !733)
!747 = !DILocation(line: 238, column: 25, scope: !733)
!748 = !DILocation(line: 238, column: 17, scope: !733)
!749 = !DILocation(line: 240, column: 20, scope: !733)
!750 = !DILocation(line: 243, column: 31, scope: !733)
!751 = !DILocation(line: 241, column: 30, scope: !733)
!752 = !DILocation(line: 241, column: 21, scope: !733)
!753 = !DILocation(line: 240, column: 17, scope: !733)
!754 = !DILocation(line: 247, column: 14, scope: !733)
!755 = !DILocation(line: 243, column: 30, scope: !733)
!756 = !DILocation(line: 243, column: 21, scope: !733)
!757 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17h9b199c45040ec778E", scope: !622, file: !690, line: 340, type: !758, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !764, retainedNodes: !761)
!758 = !DISubroutineType(types: !759)
!759 = !{!622, !694, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !692, size: 64, align: 64, dwarfAddressSpace: 0)
!761 = !{!762, !763}
!762 = !DILocalVariable(name: "x", arg: 1, scope: !757, file: !690, line: 340, type: !694)
!763 = !DILocalVariable(name: "f", arg: 2, scope: !757, file: !690, line: 340, type: !760)
!764 = !{!765}
!765 = !DITemplateTypeParameter(name: "T", type: !695)
!766 = !DILocation(line: 340, column: 23, scope: !757)
!767 = !DILocation(line: 340, column: 33, scope: !757)
!768 = !DILocation(line: 349, column: 18, scope: !757)
!769 = !DILocation(line: 350, column: 6, scope: !757)
!770 = !{i64 1}
!771 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h9d980abf46617d8bE", scope: !622, file: !690, line: 329, type: !772, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !764, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!622, !694}
!774 = !{!775}
!775 = !DILocalVariable(name: "x", arg: 1, scope: !771, file: !690, line: 329, type: !694)
!776 = !DILocation(line: 329, column: 30, scope: !771)
!777 = !DILocation(line: 330, column: 13, scope: !771)
!778 = !DILocation(line: 331, column: 10, scope: !771)
!779 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17hd46f8d6d38023b83E", scope: !780, file: !690, line: 168, type: !781, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !786, retainedNodes: !783)
!780 = !DINamespace(name: "Write", scope: !452)
!781 = !DISubroutineType(types: !782)
!782 = !{!632, !14, !591}
!783 = !{!784, !785}
!784 = !DILocalVariable(name: "self", arg: 1, scope: !779, file: !690, line: 168, type: !14)
!785 = !DILocalVariable(name: "c", arg: 2, scope: !779, file: !690, line: 168, type: !591)
!786 = !{!787}
!787 = !DITemplateTypeParameter(name: "Self", type: !15)
!788 = !DILocation(line: 168, column: 19, scope: !779)
!789 = !DILocation(line: 168, column: 30, scope: !779)
!790 = !DILocation(line: 169, column: 43, scope: !779)
!791 = !DILocation(line: 169, column: 24, scope: !779)
!792 = !DILocation(line: 169, column: 9, scope: !779)
!793 = !DILocation(line: 170, column: 6, scope: !779)
!794 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17hedee6e3ae65ff4b6E", scope: !780, file: !690, line: 196, type: !795, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !786, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!632, !14, !563}
!797 = !{!798, !799}
!798 = !DILocalVariable(name: "self", arg: 1, scope: !794, file: !690, line: 196, type: !14)
!799 = !DILocalVariable(name: "args", arg: 2, scope: !794, file: !690, line: 196, type: !563)
!800 = !DILocation(line: 196, column: 18, scope: !794)
!801 = !DILocation(line: 196, column: 39, scope: !794)
!802 = !DILocation(line: 197, column: 9, scope: !794)
!803 = !DILocation(line: 198, column: 6, scope: !794)
!804 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h96b5a26aac7c8655E", scope: !563, file: !690, line: 443, type: !805, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !810)
!805 = !DISubroutineType(types: !806)
!806 = !{!563, !566, !618, !580, !807}
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !452, file: !2, align: 8, elements: !808, templateParams: !27, identifier: "87fa5f455e1e5965cb07ce17624e505b")
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !807, file: !2, baseType: !7, align: 8)
!810 = !{!811, !812, !813, !814, !815}
!811 = !DILocalVariable(name: "pieces", arg: 1, scope: !804, file: !690, line: 444, type: !566)
!812 = !DILocalVariable(name: "args", arg: 2, scope: !804, file: !690, line: 445, type: !618)
!813 = !DILocalVariable(name: "fmt", arg: 3, scope: !804, file: !690, line: 446, type: !580)
!814 = !DILocalVariable(name: "_unsafe_arg", scope: !804, file: !690, line: 447, type: !807, align: 1)
!815 = !DILocalVariable(arg: 4, scope: !804, file: !690, line: 447, type: !807)
!816 = !DILocation(line: 447, column: 9, scope: !804)
!817 = !DILocation(line: 444, column: 9, scope: !804)
!818 = !DILocation(line: 445, column: 9, scope: !804)
!819 = !DILocation(line: 446, column: 9, scope: !804)
!820 = !DILocation(line: 449, column: 34, scope: !804)
!821 = !DILocation(line: 449, column: 9, scope: !804)
!822 = !DILocation(line: 450, column: 6, scope: !804)
!823 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h1af16309580fa771E", scope: !563, file: !690, line: 412, type: !824, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!563, !566, !618}
!826 = !{!827, !828}
!827 = !DILocalVariable(name: "pieces", arg: 1, scope: !823, file: !690, line: 412, type: !566)
!828 = !DILocalVariable(name: "args", arg: 2, scope: !823, file: !690, line: 412, type: !618)
!829 = !DILocation(line: 412, column: 19, scope: !823)
!830 = !DILocation(line: 412, column: 47, scope: !823)
!831 = !DILocation(line: 413, column: 12, scope: !823)
!832 = !DILocation(line: 413, column: 56, scope: !823)
!833 = !{i8 0, i8 2}
!834 = !DILocation(line: 413, column: 41, scope: !823)
!835 = !DILocation(line: 416, column: 34, scope: !823)
!836 = !DILocation(line: 416, column: 9, scope: !823)
!837 = !DILocation(line: 417, column: 6, scope: !823)
!838 = !DILocation(line: 414, column: 13, scope: !823)
!839 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h9cab7975d060b85bE", scope: !563, file: !690, line: 399, type: !840, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!563, !566}
!842 = !{!843}
!843 = !DILocalVariable(name: "pieces", arg: 1, scope: !839, file: !690, line: 399, type: !566)
!844 = !DILocation(line: 399, column: 28, scope: !839)
!845 = !DILocation(line: 400, column: 12, scope: !839)
!846 = !DILocation(line: 403, column: 34, scope: !839)
!847 = !DILocation(line: 403, column: 9, scope: !839)
!848 = !DILocation(line: 404, column: 6, scope: !839)
!849 = !DILocation(line: 401, column: 13, scope: !839)
!850 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h0964ac807d4f24c9E", scope: !852, file: !851, line: 250, type: !855, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !863, retainedNodes: !860)
!851 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfb73adf0f4bb6df3856d6eaf613e707")
!852 = !DINamespace(name: "FnOnce", scope: !853)
!853 = !DINamespace(name: "function", scope: !854)
!854 = !DINamespace(name: "ops", scope: !81)
!855 = !DISubroutineType(types: !856)
!856 = !{!295, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !858, size: 64, align: 64, dwarfAddressSpace: 0)
!858 = !DISubroutineType(types: !859)
!859 = !{!295}
!860 = !{!861, !862}
!861 = !DILocalVariable(arg: 1, scope: !850, file: !851, line: 250, type: !857)
!862 = !DILocalVariable(arg: 2, scope: !850, file: !851, line: 250, type: !7)
!863 = !{!864, !865}
!864 = !DITemplateTypeParameter(name: "Self", type: !857)
!865 = !DITemplateTypeParameter(name: "Args", type: !7)
!866 = !DILocation(line: 250, column: 5, scope: !850)
!867 = !DILocation(line: 10, column: 32, scope: !868, inlinedAt: !871)
!868 = !DILexicalBlockFile(scope: !870, file: !869, discriminator: 0)
!869 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "b841cfb7999f903f1ec07a993d230219")
!870 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN87_$LT$theo..peripherals..VGA_DISPLAY_IN_TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h6a6f7ce1e9480d99E", scope: !275, file: !58, line: 137, type: !858, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !27)
!871 = distinct !DILocation(line: 250, column: 5, scope: !850)
!872 = !DILocation(line: 10, column: 20, scope: !868, inlinedAt: !871)
!873 = !DILocalVariable(name: "value", arg: 1, scope: !874, file: !875, line: 148, type: !15)
!874 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17he9543157d9e4d2fbE", scope: !295, file: !875, line: 148, type: !876, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !323, retainedNodes: !878)
!875 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "8bd51efe234d6d30883585776287c8e6")
!876 = !DISubroutineType(types: !877)
!877 = !{!295, !15}
!878 = !{!873}
!879 = !DILocation(line: 148, column: 22, scope: !874, inlinedAt: !880)
!880 = distinct !DILocation(line: 10, column: 9, scope: !868, inlinedAt: !871)
!881 = !DILocalVariable(name: "data", arg: 1, scope: !882, file: !883, line: 110, type: !15)
!882 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17habcc39b4d2a8cb19E", scope: !299, file: !883, line: 110, type: !884, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !323, retainedNodes: !886)
!883 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "eafec6adab68eecd5bf401d2ab27702c")
!884 = !DISubroutineType(types: !885)
!885 = !{!299, !15}
!886 = !{!881}
!887 = !DILocation(line: 110, column: 22, scope: !882, inlinedAt: !888)
!888 = distinct !DILocation(line: 150, column: 20, scope: !874, inlinedAt: !880)
!889 = !DILocation(line: 112, column: 19, scope: !882, inlinedAt: !888)
!890 = !DILocalVariable(name: "value", arg: 1, scope: !891, file: !892, line: 2009, type: !15)
!891 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h5df13cac86eea8d8E", scope: !318, file: !892, line: 2009, type: !893, scopeLine: 2009, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !321, retainedNodes: !895)
!892 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "8d01b740129a4b9c32202a274c61d632")
!893 = !DISubroutineType(types: !894)
!894 = !{!318, !15}
!895 = !{!890}
!896 = !DILocation(line: 2009, column: 22, scope: !891, inlinedAt: !897)
!897 = distinct !DILocation(line: 113, column: 19, scope: !882, inlinedAt: !888)
!898 = !DILocation(line: 2010, column: 9, scope: !891, inlinedAt: !897)
!899 = !DILocation(line: 111, column: 9, scope: !882, inlinedAt: !888)
!900 = !DILocation(line: 149, column: 9, scope: !874, inlinedAt: !880)
!901 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h30655f08c47a57a8E", scope: !852, file: !851, line: 250, type: !902, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !910, retainedNodes: !907)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::interrupt_descriptor_table::SafeInterruptDescriptorTable", baseType: !905, size: 64, align: 64, dwarfAddressSpace: 0)
!905 = !DISubroutineType(types: !906)
!906 = !{!103}
!907 = !{!908, !909}
!908 = !DILocalVariable(arg: 1, scope: !901, file: !851, line: 250, type: !904)
!909 = !DILocalVariable(arg: 2, scope: !901, file: !851, line: 250, type: !7)
!910 = !{!911, !865}
!911 = !DITemplateTypeParameter(name: "Self", type: !904)
!912 = !DILocation(line: 250, column: 5, scope: !901)
!913 = !DILocalVariable(name: "idt", scope: !914, file: !915, line: 15, type: !108, align: 16)
!914 = distinct !DILexicalBlock(scope: !916, file: !915, line: 15, column: 9)
!915 = !DIFile(filename: "src/interrupts.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "52bcdfc6417ef08259435380fa31c04c")
!916 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN70_$LT$theo..interrupts..SAFE_IDT$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h4b3f8e4e6a168840E", scope: !65, file: !58, line: 137, type: !905, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !917)
!917 = !{!913}
!918 = !DILocation(line: 15, column: 13, scope: !914, inlinedAt: !919)
!919 = distinct !DILocation(line: 250, column: 5, scope: !901)
!920 = !DILocation(line: 15, column: 23, scope: !921, inlinedAt: !919)
!921 = !DILexicalBlockFile(scope: !916, file: !915, discriminator: 0)
!922 = !DILocation(line: 17, column: 13, scope: !914, inlinedAt: !919)
!923 = !DILocation(line: 20, column: 13, scope: !914, inlinedAt: !919)
!924 = !DILocation(line: 21, column: 17, scope: !914, inlinedAt: !919)
!925 = !DILocation(line: 21, column: 13, scope: !914, inlinedAt: !919)
!926 = !DILocation(line: 25, column: 44, scope: !914, inlinedAt: !919)
!927 = !DILocation(line: 25, column: 9, scope: !914, inlinedAt: !919)
!928 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17hc102d8e9f0dd0d65E", scope: !930, file: !929, line: 490, type: !931, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !936, retainedNodes: !934)
!929 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ed5a5b94ce68ef0bd15ed78a0be1f1f0")
!930 = !DINamespace(name: "ptr", scope: !81)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!934 = !{!935}
!935 = !DILocalVariable(arg: 1, scope: !928, file: !929, line: 490, type: !933)
!936 = !{!937}
!937 = !DITemplateTypeParameter(name: "T", type: !14)
!938 = !DILocation(line: 490, column: 1, scope: !928)
!939 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17h26ba18ad74ecff3cE", scope: !930, file: !929, line: 490, type: !940, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !954, retainedNodes: !952)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !943, size: 64, align: 64, dwarfAddressSpace: 0)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !296, file: !2, size: 128, align: 64, elements: !944, templateParams: !321, identifier: "75e39e83741f8047316ab5f58de1c4c5")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !943, file: !2, baseType: !946, size: 128, align: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !300, file: !2, size: 128, align: 64, elements: !947, templateParams: !321, identifier: "95895415d2cee4e983f22fb0e7afa937")
!947 = !{!948, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !946, file: !2, baseType: !949, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !2, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!952 = !{!953}
!953 = !DILocalVariable(arg: 1, scope: !939, file: !929, line: 490, type: !942)
!954 = !{!955}
!955 = !DITemplateTypeParameter(name: "T", type: !943)
!956 = !DILocation(line: 490, column: 1, scope: !939)
!957 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17hdf9170377edd5623E", scope: !930, file: !929, line: 490, type: !958, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !963, retainedNodes: !961)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !946, size: 64, align: 64, dwarfAddressSpace: 0)
!961 = !{!962}
!962 = !DILocalVariable(arg: 1, scope: !957, file: !929, line: 490, type: !960)
!963 = !{!964}
!964 = !DITemplateTypeParameter(name: "T", type: !946)
!965 = !DILocation(line: 490, column: 1, scope: !957)
!966 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17hac8ec86507fe3b39E", scope: !968, file: !967, line: 197, type: !970, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !980)
!967 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "197638d8a57725d685b49f7f7ce80004")
!968 = !DINamespace(name: "converts", scope: !969)
!969 = !DINamespace(name: "str", scope: !81)
!970 = !DISubroutineType(types: !971)
!971 = !{!972, !976}
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut str", file: !2, size: 128, align: 64, elements: !973, templateParams: !27, identifier: "1a4aa5533b001911d33734073aafaa29")
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !972, file: !2, baseType: !482, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !972, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !977, templateParams: !27, identifier: "5acbf15c847666982b641ea58cf98317")
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !976, file: !2, baseType: !482, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !976, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!980 = !{!981}
!981 = !DILocalVariable(name: "v", arg: 1, scope: !966, file: !967, line: 197, type: !976)
!982 = !DILocation(line: 197, column: 45, scope: !966)
!983 = !DILocation(line: 203, column: 2, scope: !966)
!984 = distinct !DISubprogram(name: "encode_utf8_raw", linkageName: "_ZN4core4char7methods15encode_utf8_raw17he2a0e692906e91fcE", scope: !986, file: !985, line: 1713, type: !988, scopeLine: 1713, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !446, templateParams: !27, retainedNodes: !990)
!985 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/methods.rs", directory: "", checksumkind: CSK_MD5, checksum: "6639fd939de0cc71e2551f3e27d008ab")
!986 = !DINamespace(name: "methods", scope: !987)
!987 = !DINamespace(name: "char", scope: !81)
!988 = !DISubroutineType(types: !989)
!989 = !{!976, !125, !976}
!990 = !{!991, !992, !993, !995, !998, !1000, !1001, !1003, !1004, !1005, !1007, !1008, !1009}
!991 = !DILocalVariable(name: "code", arg: 1, scope: !984, file: !985, line: 1713, type: !125)
!992 = !DILocalVariable(name: "dst", arg: 2, scope: !984, file: !985, line: 1713, type: !976)
!993 = !DILocalVariable(name: "len", scope: !994, file: !985, line: 1714, type: !9, align: 8)
!994 = distinct !DILexicalBlock(scope: !984, file: !985, line: 1714, column: 5)
!995 = !DILocalVariable(name: "a", scope: !996, file: !985, line: 1716, type: !997, align: 8)
!996 = distinct !DILexicalBlock(scope: !994, file: !985, line: 1716, column: 9)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!998 = !DILocalVariable(name: "a", scope: !999, file: !985, line: 1719, type: !997, align: 8)
!999 = distinct !DILexicalBlock(scope: !994, file: !985, line: 1719, column: 9)
!1000 = !DILocalVariable(name: "b", scope: !999, file: !985, line: 1719, type: !997, align: 8)
