; ModuleID = 'uart_16550.0bde4591-cgu.0'
source_filename = "uart_16550.0bde4591-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::sync::atomic::AtomicPtr<u8>" = type { ptr }
%"mmio::MmioSerialPort" = type { %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>" }
%"port::SerialPort" = type { i16, i16, i16, i16, i16, i16 }
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::fmt::Error" = type {}

@alloc471 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1
@alloc470 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc471, [16 x i8] c"k\00\00\00\00\00\00\00\92\01\00\008\00\00\00" }>, align 8
@str.0 = internal constant [28 x i8] c"attempt to add with overflow"
@alloc338 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc337 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc338, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc335 = private unnamed_addr constant <{}> zeroinitializer, align 8

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "clang LLVM (rustc version 1.69.0-nightly (5b8f28453 2023-02-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/uart_16550-0.2.18/src/lib.rs/@/uart_16550.0bde4591-cgu.0", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/uart_16550-0.2.18")
!5 = !{!6, !18}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "v1", scope: !9)
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !19, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "atomic", scope: !20)
!20 = !DINamespace(name: "sync", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h3eb10621de3b9e45E", scope: !29, file: !28, line: 46, type: !33, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !76, retainedNodes: !74)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "7ceb660251058cd474b170c1984cef9f")
!29 = !DINamespace(name: "{impl#1}", scope: !30)
!30 = !DINamespace(name: "copied", scope: !31)
!31 = !DINamespace(name: "adapters", scope: !32)
!32 = !DINamespace(name: "iter", scope: !11)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !36, file: !7, size: 16, align: 8, elements: !37, templateParams: !42, identifier: "af37944720a07a00fb6d5227ae321af2")
!36 = !DINamespace(name: "option", scope: !11)
!37 = !{!38}
!38 = !DICompositeType(tag: DW_TAG_variant_part, scope: !35, file: !7, size: 16, align: 8, elements: !39, templateParams: !42, identifier: "205b2ff9b1e2ae364ba652ccdfad2dc", discriminator: !49)
!39 = !{!40, !45}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !38, file: !7, baseType: !41, size: 16, align: 8, extraData: i64 0)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !35, file: !7, size: 16, align: 8, elements: !42, templateParams: !43, identifier: "34b7d570951508e342f00439c781ecc6")
!42 = !{}
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !12)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !38, file: !7, baseType: !46, size: 16, align: 8, extraData: i64 1)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !35, file: !7, size: 16, align: 8, elements: !47, templateParams: !43, identifier: "f25a6eb74aea068af7675109505a9649")
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !46, file: !7, baseType: !12, size: 8, align: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, scope: !35, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !30, file: !7, size: 128, align: 64, elements: !52, templateParams: !72, identifier: "41327c936185040cafd774eefe9ff972")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !51, file: !7, baseType: !54, size: 128, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !55, file: !7, size: 128, align: 64, elements: !57, templateParams: !43, identifier: "b56b0200c0640d2fa3c402d53d32202")
!55 = !DINamespace(name: "iter", scope: !56)
!56 = !DINamespace(name: "slice", scope: !11)
!57 = !{!58, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !54, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !60, file: !7, size: 64, align: 64, elements: !62, templateParams: !43, identifier: "1e4545bca784297aa4cf95939255613a")
!60 = !DINamespace(name: "non_null", scope: !61)
!61 = !DINamespace(name: "ptr", scope: !11)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !59, file: !7, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !54, file: !7, baseType: !64, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !54, file: !7, baseType: !67, align: 8)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !69, identifier: "ec2571ff490acb3727ff138a9c4dd87d")
!68 = !DINamespace(name: "marker", scope: !11)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "I", type: !54)
!74 = !{!75}
!75 = !DILocalVariable(name: "self", arg: 1, scope: !27, file: !28, line: 46, type: !50)
!76 = !{!73, !44}
!77 = !DILocation(line: 46, column: 13, scope: !27)
!78 = !DILocation(line: 47, column: 9, scope: !27)
!79 = !DILocation(line: 48, column: 6, scope: !27)
!80 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hf3371bda96126c57E", scope: !82, file: !81, line: 401, type: !211, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !213)
!81 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !7, size: 384, align: 64, elements: !83, templateParams: !42, identifier: "aa4495e11001eeb7a8dec7abda538011")
!83 = !{!84, !96, !144}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !82, file: !7, baseType: !85, size: 128, align: 64, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !86, templateParams: !42, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!86 = !{!87, !95}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !7, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !90, templateParams: !42, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !89, file: !7, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !89, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !82, file: !7, baseType: !97, size: 128, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !36, file: !7, size: 128, align: 64, elements: !98, templateParams: !42, identifier: "f20f93edc9b6759569bd27834bca2867")
!98 = !{!99}
!99 = !DICompositeType(tag: DW_TAG_variant_part, scope: !97, file: !7, size: 128, align: 64, elements: !100, templateParams: !42, identifier: "4c2bc57bba010026e96c6b272990e455", discriminator: !143)
!100 = !{!101, !139}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !99, file: !7, baseType: !102, size: 128, align: 64, extraData: i64 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !97, file: !7, size: 128, align: 64, elements: !42, templateParams: !103, identifier: "b03d968f2fa497fccf294fb725789344")
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !7, size: 128, align: 64, elements: !106, templateParams: !42, identifier: "fbc7473a1424cb3193ffa7a7ee24653a")
!106 = !{!107, !138}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !105, file: !7, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 448, align: 64, elements: !110, templateParams: !42, identifier: "5baa9876693e95e5feb1bff2f29eab42")
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !109, file: !7, baseType: !94, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !109, file: !7, baseType: !113, size: 384, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !8, file: !7, size: 384, align: 64, elements: !114, templateParams: !42, identifier: "af655e92005115efb855d950904d628d")
!114 = !{!115, !117, !118, !120, !137}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !113, file: !7, baseType: !116, size: 32, align: 32, offset: 288)
!116 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !113, file: !7, baseType: !6, size: 8, align: 8, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !7, baseType: !119, size: 32, align: 32, offset: 256)
!119 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !113, file: !7, baseType: !121, size: 128, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !122, templateParams: !42, identifier: "bb4b398e5f72abfe68675895ae5e57c7")
!122 = !{!123}
!123 = !DICompositeType(tag: DW_TAG_variant_part, scope: !121, file: !7, size: 128, align: 64, elements: !124, templateParams: !42, identifier: "9d0217852ba0cec4f3ca8286384a753f", discriminator: !135)
!124 = !{!125, !129, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !123, file: !7, baseType: !126, size: 128, align: 64, extraData: i64 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !121, file: !7, size: 128, align: 64, elements: !127, templateParams: !42, identifier: "1bffdda99d4ba93b3632eb9b10e0d6c2")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !126, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !123, file: !7, baseType: !130, size: 128, align: 64, extraData: i64 1)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !121, file: !7, size: 128, align: 64, elements: !131, templateParams: !42, identifier: "93a126390616414615f290788924acea")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !123, file: !7, baseType: !134, size: 128, align: 64, extraData: i64 2)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !121, file: !7, size: 128, align: 64, elements: !42, identifier: "bee9d1aff1e2e0def3297d379f780bc3")
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!136 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !113, file: !7, baseType: !121, size: 128, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !99, file: !7, baseType: !140, size: 128, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !97, file: !7, size: 128, align: 64, elements: !141, templateParams: !103, identifier: "76c5d43fc2261c18f3f3f9fcdeb1ea19")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !7, baseType: !105, size: 128, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !82, file: !7, baseType: !145, size: 128, align: 64, offset: 256)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !7, size: 128, align: 64, elements: !146, templateParams: !42, identifier: "7fd253a118f8ffbba43d5247c666a8bb")
!146 = !{!147, !210}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !145, file: !7, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !10, file: !7, size: 128, align: 64, elements: !150, templateParams: !42, identifier: "71f0688e928e59cfa8d2e89ebf7ebc37")
!150 = !{!151, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !7, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !154, file: !7, align: 8, elements: !42, identifier: "8ad1d27c01883c0662373925bfb88afd")
!154 = !DINamespace(name: "{extern#0}", scope: !10)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !149, file: !7, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !152, !178}
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !160, file: !7, size: 8, align: 8, elements: !161, templateParams: !42, identifier: "439b0028cce69ada54f55b3e334b6ecd")
!160 = !DINamespace(name: "result", scope: !11)
!161 = !{!162}
!162 = !DICompositeType(tag: DW_TAG_variant_part, scope: !159, file: !7, size: 8, align: 8, elements: !163, templateParams: !42, identifier: "be95a66ec545b971daf5682acfef386a", discriminator: !177)
!163 = !{!164, !173}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !162, file: !7, baseType: !165, size: 8, align: 8, extraData: i64 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !159, file: !7, size: 8, align: 8, elements: !166, templateParams: !169, identifier: "970917c63ec9d7b58016c128bd3204c")
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !165, file: !7, baseType: !168, align: 8, offset: 8)
!168 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!169 = !{!170, !171}
!170 = !DITemplateTypeParameter(name: "T", type: !168)
!171 = !DITemplateTypeParameter(name: "E", type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !7, align: 8, elements: !42, identifier: "ba7ee7bf0217687128c0134bf159d064")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !162, file: !7, baseType: !174, size: 8, align: 8, extraData: i64 1)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !159, file: !7, size: 8, align: 8, elements: !175, templateParams: !169, identifier: "277298c56e69e6ae4141f3824479ae34")
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !7, baseType: !172, align: 8, offset: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !7, size: 512, align: 64, elements: !180, templateParams: !42, identifier: "a90501ff6e2f2af5c6a6372291169d97")
!180 = !{!181, !182, !183, !184, !198, !199}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !7, baseType: !119, size: 32, align: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !179, file: !7, baseType: !116, size: 32, align: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !179, file: !7, baseType: !6, size: 8, align: 8, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !179, file: !7, baseType: !185, size: 128, align: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !36, file: !7, size: 128, align: 64, elements: !186, templateParams: !42, identifier: "a061711948cade3933e2c15b599cef32")
!186 = !{!187}
!187 = !DICompositeType(tag: DW_TAG_variant_part, scope: !185, file: !7, size: 128, align: 64, elements: !188, templateParams: !42, identifier: "a12832ba19fc53c9fdb0c372f0b3354e", discriminator: !197)
!188 = !{!189, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !187, file: !7, baseType: !190, size: 128, align: 64, extraData: i64 0)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !185, file: !7, size: 128, align: 64, elements: !42, templateParams: !191, identifier: "c3705e48f19ae18cdc2a5519f6e6f5cb")
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "T", type: !94)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !187, file: !7, baseType: !194, size: 128, align: 64, extraData: i64 1)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !185, file: !7, size: 128, align: 64, elements: !195, templateParams: !191, identifier: "be8b31308e3e31c866943c8d7b3fd52a")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !179, file: !7, baseType: !185, size: 128, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !179, file: !7, baseType: !200, size: 128, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !7, size: 128, align: 64, elements: !201, templateParams: !42, identifier: "a3f442e004e09e017868002c1c14e7e3")
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !200, file: !7, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !7, align: 8, elements: !42, identifier: "fad07e960ab186f2781ffe1a5cde3e23")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !200, file: !7, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, align: 64, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 3, lowerBound: 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!82, !85, !145}
!213 = !{!214, !215}
!214 = !DILocalVariable(name: "pieces", arg: 1, scope: !80, file: !81, line: 401, type: !85)
!215 = !DILocalVariable(name: "args", arg: 2, scope: !80, file: !81, line: 401, type: !145)
!216 = !DILocation(line: 401, column: 25, scope: !80)
!217 = !DILocation(line: 401, column: 53, scope: !80)
!218 = !DILocation(line: 402, column: 12, scope: !80)
!219 = !DILocation(line: 402, column: 56, scope: !80)
!220 = !{i8 0, i8 2}
!221 = !DILocation(line: 402, column: 41, scope: !80)
!222 = !DILocation(line: 405, column: 34, scope: !80)
!223 = !DILocation(line: 405, column: 9, scope: !80)
!224 = !{i64 8}
!225 = !DILocation(line: 406, column: 6, scope: !80)
!226 = !DILocation(line: 403, column: 13, scope: !80)
!227 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17hd964ff9b20a56a94E", scope: !229, file: !228, line: 864, type: !231, scopeLine: 864, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !237)
!228 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e209e33bf0cbeda8e0f6a94101e8fb52")
!229 = !DINamespace(name: "{impl#0}", scope: !230)
!230 = !DINamespace(name: "str", scope: !11)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !89}
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !234, file: !7, size: 128, align: 64, elements: !235, templateParams: !42, identifier: "265794400c57b75849373c8e68e3faa7")
!234 = !DINamespace(name: "iter", scope: !230)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !233, file: !7, baseType: !51, size: 128, align: 64)
!237 = !{!238}
!238 = !DILocalVariable(name: "self", arg: 1, scope: !227, file: !228, line: 864, type: !89)
!239 = !DILocation(line: 864, column: 18, scope: !227)
!240 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !228, line: 325, type: !89)
!241 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h45d96e51f7f0866aE", scope: !229, file: !228, line: 325, type: !242, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !248)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !89}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !7, size: 128, align: 64, elements: !245, templateParams: !42, identifier: "1adda6141450f528e36794b66d53eb6c")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !244, file: !7, baseType: !92, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !244, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!248 = !{!240}
!249 = !DILocation(line: 325, column: 27, scope: !241, inlinedAt: !250)
!250 = distinct !DILocation(line: 865, column: 15, scope: !227)
!251 = !DILocation(line: 327, column: 18, scope: !241, inlinedAt: !250)
!252 = !{i64 1}
!253 = !DILocation(line: 328, column: 6, scope: !241, inlinedAt: !250)
!254 = !DILocation(line: 865, column: 15, scope: !227)
!255 = !DILocation(line: 865, column: 9, scope: !227)
!256 = !DILocation(line: 866, column: 6, scope: !227)
!257 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17h7f8dcf7f67c6db11E", scope: !259, file: !258, line: 3249, type: !262, scopeLine: 3249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !266, retainedNodes: !264)
!258 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "23cd06aaaf3bc69ffec2ba0c61b03a96")
!259 = !DINamespace(name: "Iterator", scope: !260)
!260 = !DINamespace(name: "iterator", scope: !261)
!261 = !DINamespace(name: "traits", scope: !32)
!262 = !DISubroutineType(types: !263)
!263 = !{!51, !54}
!264 = !{!265}
!265 = !DILocalVariable(name: "self", arg: 1, scope: !257, file: !258, line: 3249, type: !54)
!266 = !{!267, !44}
!267 = !DITemplateTypeParameter(name: "Self", type: !54)
!268 = !DILocation(line: 3249, column: 26, scope: !257)
!269 = !DILocation(line: 3254, column: 9, scope: !257)
!270 = !DILocation(line: 3255, column: 6, scope: !257)
!271 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17hb2b524efa4d9ffc9E", scope: !51, file: !28, line: 25, type: !262, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !72, retainedNodes: !272)
!272 = !{!273}
!273 = !DILocalVariable(name: "it", arg: 1, scope: !271, file: !28, line: 25, type: !54)
!274 = !DILocation(line: 25, column: 32, scope: !271)
!275 = !DILocation(line: 26, column: 9, scope: !271)
!276 = !DILocation(line: 27, column: 6, scope: !271)
!277 = distinct !DISubprogram(name: "atomic_load<*mut u8>", linkageName: "_ZN4core4sync6atomic11atomic_load17h9eeb8105b90cdd30E", scope: !19, file: !278, line: 3021, type: !279, scopeLine: 3021, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !286, retainedNodes: !283)
!278 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "a2c9f45452ecc6a9ca8ea9e7e602fc6c")
!279 = !DISubroutineType(types: !280)
!280 = !{!281, !282, !18}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *mut u8", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !{!284, !285}
!284 = !DILocalVariable(name: "dst", arg: 1, scope: !277, file: !278, line: 3021, type: !282)
!285 = !DILocalVariable(name: "order", arg: 2, scope: !277, file: !278, line: 3021, type: !18)
!286 = !{!287}
!287 = !DITemplateTypeParameter(name: "T", type: !281)
!288 = !DILocation(line: 3021, column: 32, scope: !277)
!289 = !DILocation(line: 3021, column: 47, scope: !277)
!290 = !DILocation(line: 3024, column: 15, scope: !277)
!291 = !{i8 0, i8 5}
!292 = !DILocation(line: 3024, column: 9, scope: !277)
!293 = !DILocation(line: 3025, column: 24, scope: !277)
!294 = !DILocation(line: 3028, column: 24, scope: !277)
!295 = !DILocation(line: 3026, column: 24, scope: !277)
!296 = !DILocation(line: 3029, column: 23, scope: !277)
!297 = !DILocation(line: 3027, column: 23, scope: !277)
!298 = !DILocation(line: 3032, column: 2, scope: !277)
!299 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$3new17h6c942856ee65fabdE", scope: !300, file: !278, line: 1016, type: !307, scopeLine: 1016, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !309)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<u8>", scope: !19, file: !7, size: 64, align: 64, elements: !301, templateParams: !43, identifier: "c97a639d84ff5e8d8f871b0c716f2151")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !300, file: !7, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut u8>", scope: !304, file: !7, size: 64, align: 64, elements: !305, templateParams: !286, identifier: "3af59835d5a5126d68ebc888f7720a5")
!304 = !DINamespace(name: "cell", scope: !11)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !7, baseType: !281, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!300, !281}
!309 = !{!310}
!310 = !DILocalVariable(name: "p", arg: 1, scope: !299, file: !278, line: 1016, type: !281)
!311 = !DILocation(line: 1016, column: 22, scope: !299)
!312 = !DILocalVariable(name: "value", arg: 1, scope: !313, file: !314, line: 1962, type: !281)
!313 = distinct !DISubprogram(name: "new<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h0cac6803a9821053E", scope: !303, file: !314, line: 1962, type: !315, scopeLine: 1962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !286, retainedNodes: !317)
!314 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "0a931b3cf4e155135af9f41e879646f7")
!315 = !DISubroutineType(types: !316)
!316 = !{!303, !281}
!317 = !{!312}
!318 = !DILocation(line: 1962, column: 22, scope: !313, inlinedAt: !319)
!319 = distinct !DILocation(line: 1017, column: 24, scope: !299)
!320 = !DILocation(line: 1963, column: 9, scope: !313, inlinedAt: !319)
!321 = !DILocation(line: 1964, column: 6, scope: !313, inlinedAt: !319)
!322 = !DILocation(line: 1017, column: 9, scope: !299)
!323 = !DILocation(line: 1018, column: 6, scope: !299)
!324 = distinct !DISubprogram(name: "load<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$4load17h82828adb01928dc6E", scope: !300, file: !278, line: 1189, type: !325, scopeLine: 1189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !328)
!325 = !DISubroutineType(types: !326)
!326 = !{!281, !327, !18}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicPtr<u8>", baseType: !300, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !{!329, !330}
!329 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !278, line: 1189, type: !327)
!330 = !DILocalVariable(name: "order", arg: 2, scope: !324, file: !278, line: 1189, type: !18)
!331 = !DILocation(line: 1189, column: 17, scope: !324)
!332 = !DILocation(line: 1189, column: 24, scope: !324)
!333 = !DILocalVariable(name: "self", arg: 1, scope: !334, file: !314, line: 2005, type: !338)
!334 = distinct !DISubprogram(name: "get<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h682cfde28f8d681cE", scope: !303, file: !314, line: 2005, type: !335, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !286, retainedNodes: !339)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut u8", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<*mut u8>", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !{!333}
!340 = !DILocation(line: 2005, column: 22, scope: !334, inlinedAt: !341)
!341 = distinct !DILocation(line: 1191, column: 30, scope: !324)
!342 = !DILocation(line: 1191, column: 18, scope: !324)
!343 = !DILocation(line: 1192, column: 6, scope: !324)
!344 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17hf765f1f9cec7460dE", scope: !346, file: !345, line: 1800, type: !357, scopeLine: 1800, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !359)
!345 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "d086cbc744c20a3ae6ac1353844999b2")
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !36, file: !7, size: 64, align: 64, elements: !347, templateParams: !42, identifier: "32c7d0a2bfc89e884aae1012734b33f1")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_variant_part, scope: !346, file: !7, size: 64, align: 64, elements: !349, templateParams: !42, identifier: "624591ddd4d2fdb81c5f7136743be2ec", discriminator: !356)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !348, file: !7, baseType: !351, size: 64, align: 64, extraData: i64 0)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !346, file: !7, size: 64, align: 64, elements: !42, templateParams: !69, identifier: "d35fa1f37846968098e119c949c196cb")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !348, file: !7, baseType: !353, size: 64, align: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !346, file: !7, size: 64, align: 64, elements: !354, templateParams: !69, identifier: "69d2a26fb747c6b660557cde3a9481df")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !353, file: !7, baseType: !71, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!357 = !DISubroutineType(types: !358)
!358 = !{!35, !346}
!359 = !{!360, !361}
!360 = !DILocalVariable(name: "self", arg: 1, scope: !344, file: !345, line: 1800, type: !346)
!361 = !DILocalVariable(name: "v", scope: !362, file: !345, line: 1807, type: !12, align: 1)
!362 = distinct !DILexicalBlock(scope: !344, file: !345, line: 1807, column: 13)
!363 = !DILocation(line: 1800, column: 25, scope: !344)
!364 = !DILocation(line: 1806, column: 15, scope: !344)
!365 = !DILocation(line: 1806, column: 9, scope: !344)
!366 = !DILocation(line: 1808, column: 21, scope: !344)
!367 = !DILocation(line: 1807, column: 19, scope: !344)
!368 = !DILocation(line: 1807, column: 19, scope: !362)
!369 = !DILocation(line: 1807, column: 25, scope: !362)
!370 = !DILocation(line: 1807, column: 31, scope: !344)
!371 = !DILocation(line: 1810, column: 6, scope: !344)
!372 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17h6a4455113ad8b3c1E", scope: !374, file: !373, line: 22, type: !377, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !42)
!373 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "e9362aaa9be7b181a44e347703862012")
!374 = !DINamespace(name: "sse2", scope: !375)
!375 = !DINamespace(name: "x86", scope: !376)
!376 = !DINamespace(name: "core_arch", scope: !11)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DILocation(line: 25, column: 5, scope: !372)
!380 = !DILocation(line: 26, column: 2, scope: !372)
!381 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h7271780c2df9bf45E", scope: !383, file: !382, line: 272, type: !385, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !389, retainedNodes: !387)
!382 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "697d559cdba63f105535b8b53d6ea422")
!383 = !DINamespace(name: "{impl#0}", scope: !384)
!384 = !DINamespace(name: "collect", scope: !261)
!385 = !DISubroutineType(types: !386)
!386 = !{!233, !233}
!387 = !{!388}
!388 = !DILocalVariable(name: "self", arg: 1, scope: !381, file: !382, line: 272, type: !233)
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "I", type: !233)
!391 = !DILocation(line: 272, column: 18, scope: !381)
!392 = !DILocation(line: 274, column: 6, scope: !381)
!393 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h0eb9409b01cde650E", scope: !395, file: !394, line: 134, type: !415, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !413, retainedNodes: !417)
!394 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/x86_64-0.14.10/src/instructions/port.rs", directory: "", checksumkind: CSK_MD5, checksum: "d2d89e3a4061823cc5bef50c152ccf5c")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !396, file: !7, size: 16, align: 16, elements: !399, templateParams: !413, identifier: "487b5835ba017090554a699a3b37275a")
!396 = !DINamespace(name: "port", scope: !397)
!397 = !DINamespace(name: "instructions", scope: !398)
!398 = !DINamespace(name: "x86_64", scope: null)
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !395, file: !7, baseType: !401, size: 16, align: 16)
!401 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !395, file: !7, baseType: !403, align: 8)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !404, identifier: "88cc4282f6d1c4352c5ca6f9ab263a1a")
!404 = !{!405}
!405 = !DITemplateTypeParameter(name: "T", type: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !7, size: 8, align: 8, elements: !407, templateParams: !42, identifier: "3dc30ca0c00117692b3c1c6176279d7b")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !406, file: !7, baseType: !12, size: 8, align: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !406, file: !7, baseType: !410, align: 8, offset: 8)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !396, file: !7, align: 8, elements: !411, templateParams: !42, identifier: "a11bb1c53865c7ec5fd0108bdee572a")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !7, baseType: !168, align: 8)
!413 = !{!44, !414}
!414 = !DITemplateTypeParameter(name: "A", type: !410)
!415 = !DISubroutineType(types: !416)
!416 = !{!395, !401}
!417 = !{!418}
!418 = !DILocalVariable(name: "port", arg: 1, scope: !393, file: !394, line: 134, type: !401)
!419 = !DILocation(line: 134, column: 22, scope: !393)
!420 = !DILocation(line: 135, column: 9, scope: !393)
!421 = !DILocation(line: 139, column: 6, scope: !393)
!422 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h26ccc5386f1dc619E", scope: !423, file: !394, line: 134, type: !439, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !437, retainedNodes: !441)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !396, file: !7, size: 16, align: 16, elements: !424, templateParams: !437, identifier: "25cab3ea99bffd7ba4230c1588763083")
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !423, file: !7, baseType: !401, size: 16, align: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !423, file: !7, baseType: !427, align: 8)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !428, identifier: "299e7dd98773499a114b88ec7a08255f")
!428 = !{!429}
!429 = !DITemplateTypeParameter(name: "T", type: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !7, size: 8, align: 8, elements: !431, templateParams: !42, identifier: "5da5c04d90082913db0fd00925311505")
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !430, file: !7, baseType: !12, size: 8, align: 8)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !430, file: !7, baseType: !434, align: 8, offset: 8)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !396, file: !7, align: 8, elements: !435, templateParams: !42, identifier: "b9f6145b3470dd1ff4311424ce761374")
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !434, file: !7, baseType: !168, align: 8)
!437 = !{!44, !438}
!438 = !DITemplateTypeParameter(name: "A", type: !434)
!439 = !DISubroutineType(types: !440)
!440 = !{!423, !401}
!441 = !{!442}
!442 = !DILocalVariable(name: "port", arg: 1, scope: !422, file: !394, line: 134, type: !401)
!443 = !DILocation(line: 134, column: 22, scope: !422)
!444 = !DILocation(line: 135, column: 9, scope: !422)
!445 = !DILocation(line: 139, column: 6, scope: !422)
!446 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17hc07cdf1ccb4a45dcE", scope: !447, file: !394, line: 134, type: !463, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !461, retainedNodes: !465)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !396, file: !7, size: 16, align: 16, elements: !448, templateParams: !461, identifier: "23781e8935d55c8b86a6bee10347e55")
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !447, file: !7, baseType: !401, size: 16, align: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !447, file: !7, baseType: !451, align: 8)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !452, identifier: "cca00b18374ad9d462bfb22b2f76a310")
!452 = !{!453}
!453 = !DITemplateTypeParameter(name: "T", type: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !7, size: 8, align: 8, elements: !455, templateParams: !42, identifier: "6dc76304a3391c81a20b0390492e7497")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !7, baseType: !12, size: 8, align: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !454, file: !7, baseType: !458, align: 8, offset: 8)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !396, file: !7, align: 8, elements: !459, templateParams: !42, identifier: "ca28d1df1e3260019943234f5ef9b57")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !458, file: !7, baseType: !168, align: 8)
!461 = !{!44, !462}
!462 = !DITemplateTypeParameter(name: "A", type: !458)
!463 = !DISubroutineType(types: !464)
!464 = !{!447, !401}
!465 = !{!466}
!466 = !DILocalVariable(name: "port", arg: 1, scope: !446, file: !394, line: 134, type: !401)
!467 = !DILocation(line: 134, column: 22, scope: !446)
!468 = !DILocation(line: 135, column: 9, scope: !446)
!469 = !DILocation(line: 139, column: 6, scope: !446)
!470 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17h0b362abc634de44eE", scope: !447, file: !394, line: 150, type: !471, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !461, retainedNodes: !474)
!471 = !DISubroutineType(types: !472)
!472 = !{!12, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", baseType: !447, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !{!475}
!475 = !DILocalVariable(name: "self", arg: 1, scope: !470, file: !394, line: 150, type: !473)
!476 = !DILocation(line: 150, column: 24, scope: !470)
!477 = !DILocation(line: 151, column: 36, scope: !470)
!478 = !DILocation(line: 151, column: 18, scope: !470)
!479 = !DILocation(line: 152, column: 6, scope: !470)
!480 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17hdcc65a2ca4ada802E", scope: !395, file: !394, line: 150, type: !481, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !413, retainedNodes: !484)
!481 = !DISubroutineType(types: !482)
!482 = !{!12, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!484 = !{!485}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !480, file: !394, line: 150, type: !483)
!486 = !DILocation(line: 150, column: 24, scope: !480)
!487 = !DILocation(line: 151, column: 36, scope: !480)
!488 = !DILocation(line: 151, column: 18, scope: !480)
!489 = !DILocation(line: 152, column: 6, scope: !480)
!490 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h07df40d17a0c9b8aE", scope: !395, file: !394, line: 163, type: !491, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !413, retainedNodes: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !483, !12}
!493 = !{!494, !495}
!494 = !DILocalVariable(name: "self", arg: 1, scope: !490, file: !394, line: 163, type: !483)
!495 = !DILocalVariable(name: "value", arg: 2, scope: !490, file: !394, line: 163, type: !12)
!496 = !DILocation(line: 163, column: 25, scope: !490)
!497 = !DILocation(line: 163, column: 36, scope: !490)
!498 = !DILocation(line: 164, column: 35, scope: !490)
!499 = !DILocation(line: 164, column: 18, scope: !490)
!500 = !DILocation(line: 165, column: 6, scope: !490)
!501 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h7812b4498cc08582E", scope: !423, file: !394, line: 163, type: !502, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !437, retainedNodes: !505)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504, !12}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !{!506, !507}
!506 = !DILocalVariable(name: "self", arg: 1, scope: !501, file: !394, line: 163, type: !504)
!507 = !DILocalVariable(name: "value", arg: 2, scope: !501, file: !394, line: 163, type: !12)
!508 = !DILocation(line: 163, column: 25, scope: !501)
!509 = !DILocation(line: 163, column: 36, scope: !501)
!510 = !DILocation(line: 164, column: 35, scope: !501)
!511 = !DILocation(line: 164, column: 18, scope: !501)
!512 = !DILocation(line: 165, column: 6, scope: !501)
!513 = distinct !DISubprogram(name: "read_from_port", linkageName: "_ZN6x86_6412instructions4port67_$LT$impl$u20$x86_64..structures..port..PortRead$u20$for$u20$u8$GT$14read_from_port17hb91cf1c70a890133E", scope: !514, file: !394, line: 11, type: !515, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !517)
!514 = !DINamespace(name: "{impl#0}", scope: !396)
!515 = !DISubroutineType(types: !516)
!516 = !{!12, !401}
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "port", arg: 1, scope: !513, file: !394, line: 11, type: !401)
!519 = !DILocalVariable(name: "value", scope: !520, file: !394, line: 12, type: !12, align: 1)
!520 = distinct !DILexicalBlock(scope: !513, file: !394, line: 12, column: 9)
!521 = !DILocation(line: 12, column: 13, scope: !520)
!522 = !DILocation(line: 11, column: 30, scope: !513)
!523 = !DILocation(line: 14, column: 13, scope: !520)
!524 = !{i32 519962}
!525 = !DILocation(line: 17, column: 6, scope: !513)
!526 = distinct !DISubprogram(name: "write_to_port", linkageName: "_ZN6x86_6412instructions4port68_$LT$impl$u20$x86_64..structures..port..PortWrite$u20$for$u20$u8$GT$13write_to_port17ha881de62450e3412E", scope: !527, file: !394, line: 44, type: !528, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !530)
!527 = !DINamespace(name: "{impl#3}", scope: !396)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !401, !12}
!530 = !{!531, !532}
!531 = !DILocalVariable(name: "port", arg: 1, scope: !526, file: !394, line: 44, type: !401)
!532 = !DILocalVariable(name: "value", arg: 2, scope: !526, file: !394, line: 44, type: !12)
!533 = !DILocation(line: 44, column: 29, scope: !526)
!534 = !DILocation(line: 44, column: 40, scope: !526)
!535 = !DILocation(line: 46, column: 13, scope: !526)
!536 = !{i32 520741}
!537 = !DILocation(line: 48, column: 6, scope: !526)
!538 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h7305a2865c5b0dd9E", scope: !540, file: !539, line: 236, type: !541, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !544)
!539 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "0135dff78ee04f1c615bb71321f8b1d8")
!540 = !DINamespace(name: "{impl#9}", scope: !234)
!541 = !DISubroutineType(types: !542)
!542 = !{!35, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !233, size: 64, align: 64, dwarfAddressSpace: 0)
!544 = !{!545}
!545 = !DILocalVariable(name: "self", arg: 1, scope: !538, file: !539, line: 236, type: !543)
!546 = !DILocation(line: 236, column: 13, scope: !538)
!547 = !DILocation(line: 237, column: 9, scope: !538)
!548 = !DILocation(line: 238, column: 6, scope: !538)
!549 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4init17hbbe6eeba92e61746E", scope: !551, file: !550, line: 39, type: !561, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !564)
!550 = !DIFile(filename: "src/mmio.rs", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "6a530ecd49570fb9bf77fb2e8e9e168a")
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "MmioSerialPort", scope: !552, file: !7, size: 384, align: 64, elements: !554, templateParams: !42, identifier: "860d8fb3b46af07edca9fd2f9bde89c9")
!552 = !DINamespace(name: "mmio", scope: !553)
!553 = !DINamespace(name: "uart_16550", scope: null)
!554 = !{!555, !556, !557, !558, !559, !560}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !551, file: !7, baseType: !300, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !551, file: !7, baseType: !300, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !551, file: !7, baseType: !300, size: 64, align: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !551, file: !7, baseType: !300, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !551, file: !7, baseType: !300, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !551, file: !7, baseType: !300, size: 64, align: 64, offset: 320)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::mmio::MmioSerialPort", baseType: !551, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !{!565, !566, !568, !570, !572, !574}
!565 = !DILocalVariable(name: "self", arg: 1, scope: !549, file: !550, line: 39, type: !563)
!566 = !DILocalVariable(name: "self_int_en", scope: !567, file: !550, line: 40, type: !281, align: 8)
!567 = distinct !DILexicalBlock(scope: !549, file: !550, line: 40, column: 9)
!568 = !DILocalVariable(name: "self_line_ctrl", scope: !569, file: !550, line: 41, type: !281, align: 8)
!569 = distinct !DILexicalBlock(scope: !567, file: !550, line: 41, column: 9)
!570 = !DILocalVariable(name: "self_data", scope: !571, file: !550, line: 42, type: !281, align: 8)
!571 = distinct !DILexicalBlock(scope: !569, file: !550, line: 42, column: 9)
!572 = !DILocalVariable(name: "self_fifo_ctrl", scope: !573, file: !550, line: 43, type: !281, align: 8)
!573 = distinct !DILexicalBlock(scope: !571, file: !550, line: 43, column: 9)
!574 = !DILocalVariable(name: "self_modem_ctrl", scope: !575, file: !550, line: 44, type: !281, align: 8)
!575 = distinct !DILexicalBlock(scope: !573, file: !550, line: 44, column: 9)
!576 = !DILocation(line: 39, column: 17, scope: !549)
!577 = !DILocation(line: 40, column: 27, scope: !549)
!578 = !DILocation(line: 40, column: 13, scope: !567)
!579 = !DILocation(line: 41, column: 30, scope: !567)
!580 = !DILocation(line: 41, column: 13, scope: !569)
!581 = !DILocation(line: 42, column: 25, scope: !569)
!582 = !DILocation(line: 42, column: 13, scope: !571)
!583 = !DILocation(line: 43, column: 30, scope: !571)
!584 = !DILocation(line: 43, column: 13, scope: !573)
!585 = !DILocation(line: 44, column: 31, scope: !573)
!586 = !DILocation(line: 44, column: 13, scope: !575)
!587 = !DILocalVariable(name: "self", arg: 1, scope: !588, file: !589, line: 1464, type: !281)
!588 = distinct !DISubprogram(name: "write<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17hc2533494b8115046E", scope: !590, file: !589, line: 1464, type: !592, scopeLine: 1464, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !594)
!589 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ae0dfef55d0b113ecf8d41d1efcd51f")
!590 = !DINamespace(name: "{impl#0}", scope: !591)
!591 = !DINamespace(name: "mut_ptr", scope: !61)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !281, !12}
!594 = !{!587, !595}
!595 = !DILocalVariable(name: "val", arg: 2, scope: !588, file: !589, line: 1464, type: !12)
!596 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !597)
!597 = distinct !DILocation(line: 47, column: 13, scope: !575)
!598 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !597)
!599 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !597)
!600 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !601)
!601 = distinct !DILocation(line: 50, column: 13, scope: !575)
!602 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !601)
!603 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !601)
!604 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !605)
!605 = distinct !DILocation(line: 53, column: 13, scope: !575)
!606 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !605)
!607 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !605)
!608 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !609)
!609 = distinct !DILocation(line: 54, column: 13, scope: !575)
!610 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !609)
!611 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !609)
!612 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !613)
!613 = distinct !DILocation(line: 57, column: 13, scope: !575)
!614 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !613)
!615 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !613)
!616 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !617)
!617 = distinct !DILocation(line: 61, column: 13, scope: !575)
!618 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !617)
!619 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !617)
!620 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !621)
!621 = distinct !DILocation(line: 65, column: 13, scope: !575)
!622 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !621)
!623 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !621)
!624 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !625)
!625 = distinct !DILocation(line: 68, column: 13, scope: !575)
!626 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !625)
!627 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !625)
!628 = !DILocation(line: 70, column: 6, scope: !549)
!629 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504mmio14MmioSerialPort8line_sts17h97d2a7440fbb6990E", scope: !551, file: !550, line: 72, type: !630, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !635)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !563}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineStsFlags", scope: !553, file: !7, size: 8, align: 8, elements: !633, templateParams: !42, identifier: "b8ed6afebd03472021f220c01116044d")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !632, file: !7, baseType: !12, size: 8, align: 8)
!635 = !{!636}
!636 = !DILocalVariable(name: "self", arg: 1, scope: !629, file: !550, line: 72, type: !563)
!637 = !DILocation(line: 72, column: 17, scope: !629)
!638 = !DILocation(line: 73, column: 52, scope: !629)
!639 = !DILocation(line: 73, column: 51, scope: !629)
!640 = !DILocation(line: 73, column: 18, scope: !629)
!641 = !DILocation(line: 74, column: 6, scope: !629)
!642 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4send17h9fd9ec61e82ac5ebE", scope: !551, file: !550, line: 77, type: !643, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !563, !12}
!645 = !{!646, !647, !648}
!646 = !DILocalVariable(name: "self", arg: 1, scope: !642, file: !550, line: 77, type: !563)
!647 = !DILocalVariable(name: "data", arg: 2, scope: !642, file: !550, line: 77, type: !12)
!648 = !DILocalVariable(name: "self_data", scope: !649, file: !550, line: 78, type: !281, align: 8)
!649 = distinct !DILexicalBlock(scope: !642, file: !550, line: 78, column: 9)
!650 = !DILocation(line: 77, column: 17, scope: !642)
!651 = !DILocation(line: 77, column: 28, scope: !642)
!652 = !DILocation(line: 78, column: 25, scope: !642)
!653 = !DILocation(line: 78, column: 13, scope: !649)
!654 = !DILocation(line: 80, column: 13, scope: !649)
!655 = !DILocation(line: 90, column: 31, scope: !649)
!656 = !DILocation(line: 90, column: 21, scope: !649)
!657 = !DILocation(line: 82, column: 31, scope: !649)
!658 = !DILocation(line: 82, column: 21, scope: !649)
!659 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !660)
!660 = distinct !DILocation(line: 91, column: 21, scope: !649)
!661 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !660)
!662 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !660)
!663 = !DILocation(line: 91, column: 21, scope: !649)
!664 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !668)
!665 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h2308dbba41a65b7eE", scope: !667, file: !666, line: 165, type: !377, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !42)
!666 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "2eba1ee5b9c26bf5eea6ed3dac7a7b79")
!667 = !DINamespace(name: "hint", scope: !11)
!668 = distinct !DILocation(line: 90, column: 21, scope: !649)
!669 = !DILocation(line: 95, column: 6, scope: !642)
!670 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !671)
!671 = distinct !DILocation(line: 83, column: 21, scope: !649)
!672 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !671)
!673 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !671)
!674 = !DILocation(line: 83, column: 21, scope: !649)
!675 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !676)
!676 = distinct !DILocation(line: 82, column: 21, scope: !649)
!677 = !DILocation(line: 84, column: 31, scope: !649)
!678 = !DILocation(line: 84, column: 21, scope: !649)
!679 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !680)
!680 = distinct !DILocation(line: 85, column: 21, scope: !649)
!681 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !680)
!682 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !680)
!683 = !DILocation(line: 85, column: 21, scope: !649)
!684 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !685)
!685 = distinct !DILocation(line: 84, column: 21, scope: !649)
!686 = !DILocation(line: 86, column: 31, scope: !649)
!687 = !DILocation(line: 86, column: 21, scope: !649)
!688 = !DILocation(line: 1464, column: 31, scope: !588, inlinedAt: !689)
!689 = distinct !DILocation(line: 87, column: 21, scope: !649)
!690 = !DILocation(line: 1464, column: 37, scope: !588, inlinedAt: !689)
!691 = !DILocation(line: 1469, column: 18, scope: !588, inlinedAt: !689)
!692 = !DILocation(line: 87, column: 21, scope: !649)
!693 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !694)
!694 = distinct !DILocation(line: 86, column: 21, scope: !649)
!695 = distinct !DISubprogram(name: "receive", linkageName: "_ZN10uart_165504mmio14MmioSerialPort7receive17hd35674bb3ffc181aE", scope: !551, file: !550, line: 98, type: !696, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!12, !563}
!698 = !{!699, !700}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !695, file: !550, line: 98, type: !563)
!700 = !DILocalVariable(name: "self_data", scope: !701, file: !550, line: 99, type: !281, align: 8)
!701 = distinct !DILexicalBlock(scope: !695, file: !550, line: 99, column: 9)
!702 = !DILocation(line: 98, column: 20, scope: !695)
!703 = !DILocation(line: 99, column: 25, scope: !695)
!704 = !DILocation(line: 99, column: 13, scope: !701)
!705 = !DILocation(line: 101, column: 23, scope: !701)
!706 = !DILocation(line: 101, column: 13, scope: !701)
!707 = !DILocalVariable(name: "self", arg: 1, scope: !708, file: !589, line: 1313, type: !281)
!708 = distinct !DISubprogram(name: "read<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4read17hae7c43e49e4781bfE", scope: !590, file: !589, line: 1313, type: !709, scopeLine: 1313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{!12, !281}
!711 = !{!707}
!712 = !DILocation(line: 1313, column: 30, scope: !708, inlinedAt: !713)
!713 = distinct !DILocation(line: 102, column: 13, scope: !701)
!714 = !DILocation(line: 1318, column: 18, scope: !708, inlinedAt: !713)
!715 = !DILocation(line: 104, column: 6, scope: !695)
!716 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !717)
!717 = distinct !DILocation(line: 101, column: 13, scope: !701)
!718 = distinct !DISubprogram(name: "write_str", linkageName: "_ZN69_$LT$uart_16550..mmio..MmioSerialPort$u20$as$u20$core..fmt..Write$GT$9write_str17hf49b66da4023ac8bE", scope: !719, file: !550, line: 108, type: !720, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !722)
!719 = !DINamespace(name: "{impl#1}", scope: !552)
!720 = !DISubroutineType(types: !721)
!721 = !{!159, !563, !89}
!722 = !{!723, !724, !725, !727}
!723 = !DILocalVariable(name: "self", arg: 1, scope: !718, file: !550, line: 108, type: !563)
!724 = !DILocalVariable(name: "s", arg: 2, scope: !718, file: !550, line: 108, type: !89)
!725 = !DILocalVariable(name: "iter", scope: !726, file: !550, line: 109, type: !233, align: 8)
!726 = distinct !DILexicalBlock(scope: !718, file: !550, line: 109, column: 9)
!727 = !DILocalVariable(name: "byte", scope: !728, file: !550, line: 109, type: !12, align: 1)
!728 = distinct !DILexicalBlock(scope: !726, file: !550, line: 109, column: 31)
!729 = !DILocation(line: 108, column: 18, scope: !718)
!730 = !DILocation(line: 108, column: 29, scope: !718)
!731 = !DILocation(line: 109, column: 21, scope: !726)
!732 = !DILocation(line: 109, column: 21, scope: !718)
!733 = !DILocation(line: 109, column: 9, scope: !726)
!734 = !DILocation(line: 113, column: 6, scope: !718)
!735 = !DILocation(line: 109, column: 13, scope: !726)
!736 = !DILocation(line: 109, column: 13, scope: !728)
!737 = !DILocation(line: 110, column: 13, scope: !728)
!738 = distinct !DISubprogram(name: "new", linkageName: "_ZN10uart_165504port10SerialPort3new17h9e5b9a85c43e9c7cE", scope: !740, file: !739, line: 23, type: !749, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !751)
!739 = !DIFile(filename: "src/port.rs", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "2b770beb8cfb5c2dd2a7577c385b04ce")
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !741, file: !7, size: 96, align: 16, elements: !742, templateParams: !42, identifier: "cd0e78a1223020139b26741e646bf7e1")
!741 = !DINamespace(name: "port", scope: !553)
!742 = !{!743, !744, !745, !746, !747, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !740, file: !7, baseType: !395, size: 16, align: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !740, file: !7, baseType: !423, size: 16, align: 16, offset: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !740, file: !7, baseType: !423, size: 16, align: 16, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !740, file: !7, baseType: !423, size: 16, align: 16, offset: 48)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !740, file: !7, baseType: !423, size: 16, align: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !740, file: !7, baseType: !447, size: 16, align: 16, offset: 80)
!749 = !DISubroutineType(types: !750)
!750 = !{!740, !401}
!751 = !{!752}
!752 = !DILocalVariable(name: "base", arg: 1, scope: !738, file: !739, line: 23, type: !401)
!753 = !DILocation(line: 23, column: 29, scope: !738)
!754 = !DILocation(line: 25, column: 19, scope: !738)
!755 = !DILocation(line: 26, column: 40, scope: !738)
!756 = !DILocation(line: 26, column: 21, scope: !738)
!757 = !DILocation(line: 27, column: 43, scope: !738)
!758 = !DILocation(line: 27, column: 24, scope: !738)
!759 = !DILocation(line: 28, column: 43, scope: !738)
!760 = !DILocation(line: 28, column: 24, scope: !738)
!761 = !DILocation(line: 29, column: 44, scope: !738)
!762 = !DILocation(line: 29, column: 25, scope: !738)
!763 = !DILocation(line: 30, column: 41, scope: !738)
!764 = !DILocation(line: 30, column: 23, scope: !738)
!765 = !DILocation(line: 24, column: 9, scope: !738)
!766 = !DILocation(line: 32, column: 6, scope: !738)
!767 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504port10SerialPort4init17h6ba3830385d027abE", scope: !740, file: !739, line: 37, type: !768, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !771)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::port::SerialPort", baseType: !740, size: 64, align: 64, dwarfAddressSpace: 0)
!771 = !{!772}
!772 = !DILocalVariable(name: "self", arg: 1, scope: !767, file: !739, line: 37, type: !770)
!773 = !DILocation(line: 37, column: 17, scope: !767)
!774 = !DILocation(line: 40, column: 13, scope: !767)
!775 = !DILocation(line: 43, column: 13, scope: !767)
!776 = !DILocation(line: 46, column: 13, scope: !767)
!777 = !DILocation(line: 47, column: 13, scope: !767)
!778 = !DILocation(line: 50, column: 13, scope: !767)
!779 = !DILocation(line: 54, column: 13, scope: !767)
!780 = !DILocation(line: 58, column: 13, scope: !767)
!781 = !DILocation(line: 61, column: 13, scope: !767)
!782 = !DILocation(line: 63, column: 6, scope: !767)
!783 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504port10SerialPort8line_sts17h1ffd13284e45b4aeE", scope: !740, file: !739, line: 65, type: !784, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!632, !770}
!786 = !{!787}
!787 = !DILocalVariable(name: "self", arg: 1, scope: !783, file: !739, line: 65, type: !770)
!788 = !DILocation(line: 65, column: 17, scope: !783)
!789 = !DILocation(line: 66, column: 51, scope: !783)
!790 = !DILocation(line: 66, column: 18, scope: !783)
!791 = !DILocation(line: 67, column: 6, scope: !783)
!792 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504port10SerialPort4send17ha5b88306c984902fE", scope: !740, file: !739, line: 70, type: !793, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !770, !12}
!795 = !{!796, !797}
!796 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !739, line: 70, type: !770)
!797 = !DILocalVariable(name: "data", arg: 2, scope: !792, file: !739, line: 70, type: !12)
!798 = !DILocation(line: 70, column: 17, scope: !792)
!799 = !DILocation(line: 70, column: 28, scope: !792)
!800 = !DILocation(line: 72, column: 13, scope: !792)
!801 = !DILocation(line: 82, column: 31, scope: !792)
!802 = !DILocation(line: 82, column: 21, scope: !792)
!803 = !DILocation(line: 74, column: 31, scope: !792)
!804 = !DILocation(line: 74, column: 21, scope: !792)
!805 = !DILocation(line: 83, column: 21, scope: !792)
!806 = !DILocation(line: 175, column: 18, scope: !665, inlinedAt: !807)
!807 = distinct !DILocation(line: 82, column: 21, scope: !792)
