; ModuleID = 'uart_16550.1a4fbcd919572e5b-cgu.0'
source_filename = "uart_16550.1a4fbcd919572e5b-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::sync::atomic::AtomicPtr<u8>" = type { ptr }
%"mmio::MmioSerialPort" = type { %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>" }
%"port::SerialPort" = type { i16, i16, i16, i16, i16, i16 }
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::fmt::Error" = type {}

@alloc_513570631223a12912d85da2bec3b15a = private unnamed_addr constant <{}> zeroinitializer, align 8
@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_560206a49c61adca6f3f0639a12632eb = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_c2ea93c90919bb7b1e482f917e413fa1 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{!"rustc version 1.76.0-nightly (ba7c7a301 2023-11-13)"}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.76.0-nightly (ba7c7a301 2023-11-13))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6, splitDebugInlining: false)
!5 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18/src/lib.rs/@/uart_16550.1a4fbcd919572e5b-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18")
!6 = !{!7, !18}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !9, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !19, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "atomic", scope: !20)
!20 = !DINamespace(name: "sync", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17ha156af33a5823945E", scope: !29, file: !28, line: 47, type: !33, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !76, retainedNodes: !74)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "abbb898986bfead2aa6cf525aee62d89")
!29 = !DINamespace(name: "{impl#1}", scope: !30)
!30 = !DINamespace(name: "copied", scope: !31)
!31 = !DINamespace(name: "adapters", scope: !32)
!32 = !DINamespace(name: "iter", scope: !11)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !36, file: !8, size: 16, align: 8, elements: !37, templateParams: !42, identifier: "5f7b738521bd133193ea3bfea0339403")
!36 = !DINamespace(name: "option", scope: !11)
!37 = !{!38}
!38 = !DICompositeType(tag: DW_TAG_variant_part, scope: !35, file: !8, size: 16, align: 8, elements: !39, templateParams: !42, identifier: "735a943cd165613dfbf0b35c64f1769", discriminator: !49)
!39 = !{!40, !45}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !38, file: !8, baseType: !41, size: 16, align: 8, extraData: i128 0)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !35, file: !8, size: 16, align: 8, elements: !42, templateParams: !43, identifier: "673af88bc0520990a90ee46b032e3c68")
!42 = !{}
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !12)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !38, file: !8, baseType: !46, size: 16, align: 8, extraData: i128 1)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !35, file: !8, size: 16, align: 8, elements: !47, templateParams: !43, identifier: "5ae8d7361756462eafc88111258491fb")
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !46, file: !8, baseType: !12, size: 8, align: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, scope: !35, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !30, file: !8, size: 128, align: 64, elements: !52, templateParams: !72, identifier: "d4ca7cc84d74da642abd4e3c8acc67c4")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !51, file: !8, baseType: !54, size: 128, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !55, file: !8, size: 128, align: 64, elements: !57, templateParams: !43, identifier: "84e98b7e80bbba658424199b8d9f2781")
!55 = !DINamespace(name: "iter", scope: !56)
!56 = !DINamespace(name: "slice", scope: !11)
!57 = !{!58, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !54, file: !8, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !60, file: !8, size: 64, align: 64, elements: !62, templateParams: !43, identifier: "7f0d8a6cf3141aa7970bb35f583a5196")
!60 = !DINamespace(name: "non_null", scope: !61)
!61 = !DINamespace(name: "ptr", scope: !11)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !59, file: !8, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !54, file: !8, baseType: !64, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !54, file: !8, baseType: !67, align: 8, offset: 128)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !68, file: !8, align: 8, elements: !42, templateParams: !69, identifier: "a7eed543e45cc3a95000dd815fa89b0")
!68 = !DINamespace(name: "marker", scope: !11)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "I", type: !54)
!74 = !{!75}
!75 = !DILocalVariable(name: "self", arg: 1, scope: !27, file: !28, line: 47, type: !50)
!76 = !{!73, !44}
!77 = !DILocation(line: 47, column: 13, scope: !27)
!78 = !DILocation(line: 48, column: 9, scope: !27)
!79 = !DILocation(line: 49, column: 6, scope: !27)
!80 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h34148a5644e868e7E", scope: !82, file: !81, line: 321, type: !208, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !210, retainedNodes: !211)
!81 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !8, size: 384, align: 64, elements: !83, templateParams: !42, identifier: "29d77776b5eeaa5787f6686b536dabcd")
!83 = !{!84, !96, !141}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !82, file: !8, baseType: !85, size: 128, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !8, size: 128, align: 64, elements: !86, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!86 = !{!87, !95}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !8, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !8, size: 128, align: 64, elements: !90, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !89, file: !8, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !89, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !82, file: !8, baseType: !97, size: 128, align: 64, offset: 256)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !36, file: !8, size: 128, align: 64, elements: !98, templateParams: !42, identifier: "dbc008f239d38d5a2b0d65c09ad511eb")
!98 = !{!99}
!99 = !DICompositeType(tag: DW_TAG_variant_part, scope: !97, file: !8, size: 128, align: 64, elements: !100, templateParams: !42, identifier: "d8cbb791f01bd83aadd129e7c33d2902", discriminator: !140)
!100 = !{!101, !136}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !99, file: !8, baseType: !102, size: 128, align: 64, extraData: i128 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !97, file: !8, size: 128, align: 64, elements: !42, templateParams: !103, identifier: "9d5326c345af3989c3616152c1c18680")
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !8, size: 128, align: 64, elements: !106, templateParams: !42, identifier: "99f06d3095a71b448ddb8c239a6c18a7")
!106 = !{!107, !135}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !105, file: !8, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !9, file: !8, size: 448, align: 64, elements: !110, templateParams: !42, identifier: "9f72193236329857c54aa79ea29f91b9")
!110 = !{!111, !112, !114, !115, !117, !134}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !109, file: !8, baseType: !94, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !109, file: !8, baseType: !113, size: 32, align: 32, offset: 320)
!113 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !109, file: !8, baseType: !7, size: 8, align: 8, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !8, baseType: !116, size: 32, align: 32, offset: 352)
!116 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !109, file: !8, baseType: !118, size: 128, align: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !9, file: !8, size: 128, align: 64, elements: !119, templateParams: !42, identifier: "9ca9e78afbef434435e02fcc00636f1b")
!119 = !{!120}
!120 = !DICompositeType(tag: DW_TAG_variant_part, scope: !118, file: !8, size: 128, align: 64, elements: !121, templateParams: !42, identifier: "237cbc7914887164aaf62f3e838f1bc8", discriminator: !132)
!121 = !{!122, !126, !130}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !120, file: !8, baseType: !123, size: 128, align: 64, extraData: i128 0)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !118, file: !8, size: 128, align: 64, elements: !124, templateParams: !42, identifier: "a810797a776fbeb7b8f2698d8072a0f5")
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !123, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !120, file: !8, baseType: !127, size: 128, align: 64, extraData: i128 1)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !118, file: !8, size: 128, align: 64, elements: !128, templateParams: !42, identifier: "199fdbcd45df80cde39fbdcab18c13b0")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !127, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !120, file: !8, baseType: !131, size: 128, align: 64, extraData: i128 2)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !118, file: !8, size: 128, align: 64, elements: !42, identifier: "d1d69858300428be68613f1b1b1592f1")
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!133 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !109, file: !8, baseType: !118, size: 128, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !99, file: !8, baseType: !137, size: 128, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !97, file: !8, size: 128, align: 64, elements: !138, templateParams: !103, identifier: "bc36249fdd314efe31da7f66b9da4d62")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !8, baseType: !105, size: 128, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !82, file: !8, baseType: !142, size: 128, align: 64, offset: 128)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !8, size: 128, align: 64, elements: !143, templateParams: !42, identifier: "4acc0bde51d5d32f83a091a1ecc1dee9")
!143 = !{!144, !207}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !142, file: !8, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !9, file: !8, size: 128, align: 64, elements: !147, templateParams: !42, identifier: "2c4a5444e0d92b53869b40f69d3ffaed")
!147 = !{!148, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !146, file: !8, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !151, file: !8, align: 8, elements: !42, identifier: "b70c68e913ae9173605580beea0d245c")
!151 = !DINamespace(name: "{extern#0}", scope: !9)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !146, file: !8, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !149, !175}
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !157, file: !8, size: 8, align: 8, elements: !158, templateParams: !42, identifier: "5906980ec2ccb3af508e25734fbaa418")
!157 = !DINamespace(name: "result", scope: !11)
!158 = !{!159}
!159 = !DICompositeType(tag: DW_TAG_variant_part, scope: !156, file: !8, size: 8, align: 8, elements: !160, templateParams: !42, identifier: "2c5b4413825924499a56ad4a433d0021", discriminator: !174)
!160 = !{!161, !170}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !159, file: !8, baseType: !162, size: 8, align: 8, extraData: i128 0)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !156, file: !8, size: 8, align: 8, elements: !163, templateParams: !166, identifier: "70d6e79ec069b99f31e01d9377a553df")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !162, file: !8, baseType: !165, align: 8, offset: 8)
!165 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!166 = !{!167, !168}
!167 = !DITemplateTypeParameter(name: "T", type: !165)
!168 = !DITemplateTypeParameter(name: "E", type: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !8, align: 8, elements: !42, identifier: "7cf1d36f9f5530ad90fe20120d4add11")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !159, file: !8, baseType: !171, size: 8, align: 8, extraData: i128 1)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !156, file: !8, size: 8, align: 8, elements: !172, templateParams: !166, identifier: "be467791cc63661846c3afad316d5207")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !8, baseType: !169, align: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !8, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !176, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !8, size: 512, align: 64, elements: !177, templateParams: !42, identifier: "ed4a662b402d031f445599da2c616ab4")
!177 = !{!178, !179, !180, !181, !195, !196}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !8, baseType: !116, size: 32, align: 32, offset: 416)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !176, file: !8, baseType: !113, size: 32, align: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !176, file: !8, baseType: !7, size: 8, align: 8, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !176, file: !8, baseType: !182, size: 128, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !36, file: !8, size: 128, align: 64, elements: !183, templateParams: !42, identifier: "f3292132f78c3f758153a6fec94906eb")
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_variant_part, scope: !182, file: !8, size: 128, align: 64, elements: !185, templateParams: !42, identifier: "235b53a376875e355595925d79f90f5", discriminator: !194)
!185 = !{!186, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !184, file: !8, baseType: !187, size: 128, align: 64, extraData: i128 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !182, file: !8, size: 128, align: 64, elements: !42, templateParams: !188, identifier: "e1fa595885c4b1e1111e41f04327bb63")
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !94)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !184, file: !8, baseType: !191, size: 128, align: 64, extraData: i128 1)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !182, file: !8, size: 128, align: 64, elements: !192, templateParams: !188, identifier: "f8b7ab10848a3bce778f6027cbe197c")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !176, file: !8, baseType: !182, size: 128, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !176, file: !8, baseType: !197, size: 128, align: 64, offset: 256)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !8, size: 128, align: 64, elements: !198, templateParams: !42, identifier: "45a523bb8347e310abf3ef4b1db60355")
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !197, file: !8, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !8, align: 8, elements: !42, identifier: "e9530a1d4a400337edd68c537c611404")
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !197, file: !8, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, align: 64, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 3, lowerBound: 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !142, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!82, !85}
!210 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h34148a5644e868e7E", scope: !82, file: !81, line: 321, type: !208, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!211 = !{!212}
!212 = !DILocalVariable(name: "pieces", arg: 1, scope: !80, file: !81, line: 321, type: !85)
!213 = !DILocation(line: 321, column: 28, scope: !80)
!214 = !DILocation(line: 322, column: 12, scope: !80)
!215 = !DILocation(line: 325, column: 34, scope: !80)
!216 = !DILocation(line: 325, column: 9, scope: !80)
!217 = !{i64 8}
!218 = !DILocation(line: 326, column: 6, scope: !80)
!219 = !DILocation(line: 323, column: 13, scope: !80)
!220 = distinct !DISubprogram(name: "write<u8>", linkageName: "_ZN4core3ptr5write17h77f9b1f85b2de5c8E", scope: !61, file: !221, line: 1383, type: !222, scopeLine: 1383, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, retainedNodes: !225)
!221 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "438238c3f27b7b9e70a8eb6743e94def")
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !12}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "dst", arg: 1, scope: !220, file: !221, line: 1383, type: !224)
!227 = !DILocalVariable(name: "src", arg: 2, scope: !220, file: !221, line: 1383, type: !12)
!228 = !DILocation(line: 1383, column: 30, scope: !220)
!229 = !DILocation(line: 1383, column: 43, scope: !220)
!230 = !DILocation(line: 1396, column: 9, scope: !220)
!231 = !DILocation(line: 1400, column: 9, scope: !220)
!232 = !DILocation(line: 1402, column: 2, scope: !220)
!233 = !DILocalVariable(name: "dst", arg: 1, scope: !234, file: !235, line: 2530, type: !224)
!234 = distinct !DISubprogram(name: "runtime<u8>", linkageName: "_ZN4core3ptr5write7runtime17hf3198b73a084174fE", scope: !236, file: !235, line: 2530, type: !237, scopeLine: 2530, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, retainedNodes: !239)
!235 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "e8aa50174eef049401f78bfc3f128d62")
!236 = !DINamespace(name: "write", scope: !61)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !224}
!239 = !{!233}
!240 = !DILocation(line: 2530, column: 39, scope: !234, inlinedAt: !241)
!241 = distinct !DILocation(line: 1396, column: 9, scope: !220)
!242 = !DILocation(line: 1398, column: 33, scope: !243, inlinedAt: !241)
!243 = !DILexicalBlockFile(scope: !234, file: !221, discriminator: 0)
!244 = !DILocation(line: 2533, column: 21, scope: !234, inlinedAt: !241)
!245 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17h7c472f6bb1eb5d0bE", scope: !247, file: !246, line: 848, type: !249, scopeLine: 848, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !255)
!246 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c8274f97bb2df0d70523e8dd2acc29b7")
!247 = !DINamespace(name: "{impl#0}", scope: !248)
!248 = !DINamespace(name: "str", scope: !11)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !89}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !252, file: !8, size: 128, align: 64, elements: !253, templateParams: !42, identifier: "84ef5d57ff016e463cb3bc9d8e39f86a")
!252 = !DINamespace(name: "iter", scope: !248)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !251, file: !8, baseType: !51, size: 128, align: 64)
!255 = !{!256}
!256 = !DILocalVariable(name: "self", arg: 1, scope: !245, file: !246, line: 848, type: !89)
!257 = !DILocation(line: 848, column: 18, scope: !245)
!258 = !DILocalVariable(name: "self", arg: 1, scope: !259, file: !246, line: 324, type: !89)
!259 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h3c2a6a1cb9aa1b8bE", scope: !247, file: !246, line: 324, type: !260, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !266)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !89}
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !8, size: 128, align: 64, elements: !263, templateParams: !42, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !262, file: !8, baseType: !92, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !262, file: !8, baseType: !94, size: 64, align: 64, offset: 64)
!266 = !{!258}
!267 = !DILocation(line: 324, column: 27, scope: !259, inlinedAt: !268)
!268 = distinct !DILocation(line: 849, column: 15, scope: !245)
!269 = !DILocation(line: 327, column: 6, scope: !259, inlinedAt: !268)
!270 = !DILocation(line: 849, column: 15, scope: !245)
!271 = !DILocation(line: 849, column: 9, scope: !245)
!272 = !DILocation(line: 850, column: 6, scope: !245)
!273 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17hc0345f2d556c1d73E", scope: !275, file: !274, line: 3469, type: !278, scopeLine: 3469, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !282, retainedNodes: !280)
!274 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "c2ee7f27de3e4c878bd78b0f447cb94f")
!275 = !DINamespace(name: "Iterator", scope: !276)
!276 = !DINamespace(name: "iterator", scope: !277)
!277 = !DINamespace(name: "traits", scope: !32)
!278 = !DISubroutineType(types: !279)
!279 = !{!51, !54}
!280 = !{!281}
!281 = !DILocalVariable(name: "self", arg: 1, scope: !273, file: !274, line: 3469, type: !54)
!282 = !{!283, !44}
!283 = !DITemplateTypeParameter(name: "Self", type: !54)
!284 = !DILocation(line: 3469, column: 26, scope: !273)
!285 = !DILocation(line: 3474, column: 9, scope: !273)
!286 = !DILocation(line: 3475, column: 6, scope: !273)
!287 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17hddb2dece22767dccE", scope: !51, file: !28, line: 26, type: !278, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !72, declaration: !288, retainedNodes: !289)
!288 = !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17hddb2dece22767dccE", scope: !51, file: !28, line: 26, type: !278, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !72)
!289 = !{!290}
!290 = !DILocalVariable(name: "it", arg: 1, scope: !287, file: !28, line: 26, type: !54)
!291 = !DILocation(line: 26, column: 32, scope: !287)
!292 = !DILocation(line: 27, column: 9, scope: !287)
!293 = !DILocation(line: 28, column: 6, scope: !287)
!294 = distinct !DISubprogram(name: "atomic_load<*mut u8>", linkageName: "_ZN4core4sync6atomic11atomic_load17h25f34906ad3f42a3E", scope: !19, file: !295, line: 3284, type: !296, scopeLine: 3284, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !302, retainedNodes: !299)
!295 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdec4181e2f3a3cdf0b87679b25c87fc")
!296 = !DISubroutineType(types: !297)
!297 = !{!224, !298, !18}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *mut u8", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!299 = !{!300, !301}
!300 = !DILocalVariable(name: "dst", arg: 1, scope: !294, file: !295, line: 3284, type: !298)
!301 = !DILocalVariable(name: "order", arg: 2, scope: !294, file: !295, line: 3284, type: !18)
!302 = !{!303}
!303 = !DITemplateTypeParameter(name: "T", type: !224)
!304 = !DILocation(line: 3284, column: 32, scope: !294)
!305 = !DILocation(line: 3284, column: 47, scope: !294)
!306 = !DILocation(line: 3287, column: 15, scope: !294)
!307 = !{i8 0, i8 5}
!308 = !DILocation(line: 3287, column: 9, scope: !294)
!309 = !DILocation(line: 3288, column: 24, scope: !294)
!310 = !DILocation(line: 3291, column: 24, scope: !294)
!311 = !DILocation(line: 3289, column: 24, scope: !294)
!312 = !DILocation(line: 3292, column: 23, scope: !294)
!313 = !DILocation(line: 3290, column: 23, scope: !294)
!314 = !DILocation(line: 3295, column: 2, scope: !294)
!315 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$3new17hf5dd3c4491ad9f78E", scope: !316, file: !295, line: 1200, type: !323, scopeLine: 1200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, declaration: !325, retainedNodes: !326)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<u8>", scope: !19, file: !8, size: 64, align: 64, elements: !317, templateParams: !43, identifier: "f50b3f8ad7b437f514b13a87365aad81")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !316, file: !8, baseType: !319, size: 64, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut u8>", scope: !320, file: !8, size: 64, align: 64, elements: !321, templateParams: !302, identifier: "284a388d07dfa4d3733f2f2e1253a36a")
!320 = !DINamespace(name: "cell", scope: !11)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !319, file: !8, baseType: !224, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!316, !224}
!325 = !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$3new17hf5dd3c4491ad9f78E", scope: !316, file: !295, line: 1200, type: !323, scopeLine: 1200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !43)
!326 = !{!327}
!327 = !DILocalVariable(name: "p", arg: 1, scope: !315, file: !295, line: 1200, type: !224)
!328 = !DILocation(line: 1200, column: 22, scope: !315)
!329 = !DILocalVariable(name: "value", arg: 1, scope: !330, file: !331, line: 2048, type: !224)
!330 = distinct !DISubprogram(name: "new<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h10608516fe917342E", scope: !319, file: !331, line: 2048, type: !332, scopeLine: 2048, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !302, declaration: !334, retainedNodes: !335)
!331 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "37e10f10a4cd1a1ac983f755a5f81ecb")
!332 = !DISubroutineType(types: !333)
!333 = !{!319, !224}
!334 = !DISubprogram(name: "new<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h10608516fe917342E", scope: !319, file: !331, line: 2048, type: !332, scopeLine: 2048, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !302)
!335 = !{!329}
!336 = !DILocation(line: 2048, column: 22, scope: !330, inlinedAt: !337)
!337 = distinct !DILocation(line: 1201, column: 24, scope: !315)
!338 = !DILocation(line: 2049, column: 9, scope: !330, inlinedAt: !337)
!339 = !DILocation(line: 2050, column: 6, scope: !330, inlinedAt: !337)
!340 = !DILocation(line: 1201, column: 9, scope: !315)
!341 = !DILocation(line: 1202, column: 6, scope: !315)
!342 = distinct !DISubprogram(name: "load<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$4load17h1793c945e22d06e1E", scope: !316, file: !295, line: 1421, type: !343, scopeLine: 1421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, declaration: !346, retainedNodes: !347)
!343 = !DISubroutineType(types: !344)
!344 = !{!224, !345, !18}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicPtr<u8>", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!346 = !DISubprogram(name: "load<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$4load17h1793c945e22d06e1E", scope: !316, file: !295, line: 1421, type: !343, scopeLine: 1421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !43)
!347 = !{!348, !349}
!348 = !DILocalVariable(name: "self", arg: 1, scope: !342, file: !295, line: 1421, type: !345)
!349 = !DILocalVariable(name: "order", arg: 2, scope: !342, file: !295, line: 1421, type: !18)
!350 = !DILocation(line: 1421, column: 17, scope: !342)
!351 = !DILocation(line: 1421, column: 24, scope: !342)
!352 = !DILocalVariable(name: "self", arg: 1, scope: !353, file: !331, line: 2113, type: !357)
!353 = distinct !DISubprogram(name: "get<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h7d60fede9be750b4E", scope: !319, file: !331, line: 2113, type: !354, scopeLine: 2113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !302, declaration: !358, retainedNodes: !359)
!354 = !DISubroutineType(types: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut u8", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<*mut u8>", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!358 = !DISubprogram(name: "get<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h7d60fede9be750b4E", scope: !319, file: !331, line: 2113, type: !354, scopeLine: 2113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !302)
!359 = !{!352}
!360 = !DILocation(line: 2113, column: 22, scope: !353, inlinedAt: !361)
!361 = distinct !DILocation(line: 1423, column: 30, scope: !342)
!362 = !DILocation(line: 1423, column: 18, scope: !342)
!363 = !DILocation(line: 1424, column: 6, scope: !342)
!364 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17h29bfb66dc648d5d6E", scope: !366, file: !365, line: 1856, type: !377, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, declaration: !379, retainedNodes: !380)
!365 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef6e68460e4d48c9230b98f88a0ad0f9")
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !36, file: !8, size: 64, align: 64, elements: !367, templateParams: !42, identifier: "7e3921779f0552c575d37731f79163d0")
!367 = !{!368}
!368 = !DICompositeType(tag: DW_TAG_variant_part, scope: !366, file: !8, size: 64, align: 64, elements: !369, templateParams: !42, identifier: "c247b1722bda092d91fc8a0f23bbfad4", discriminator: !376)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !368, file: !8, baseType: !371, size: 64, align: 64, extraData: i128 0)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !366, file: !8, size: 64, align: 64, elements: !42, templateParams: !69, identifier: "319fb6b483aa6a616df3b00eb80d8e89")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !368, file: !8, baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !366, file: !8, size: 64, align: 64, elements: !374, templateParams: !69, identifier: "4219df4e7ed80c2527583410f9657c31")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !373, file: !8, baseType: !71, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !8, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!377 = !DISubroutineType(types: !378)
!378 = !{!35, !366}
!379 = !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17h29bfb66dc648d5d6E", scope: !366, file: !365, line: 1856, type: !377, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !43)
!380 = !{!381, !382}
!381 = !DILocalVariable(name: "self", arg: 1, scope: !364, file: !365, line: 1856, type: !366)
!382 = !DILocalVariable(name: "v", scope: !383, file: !365, line: 1863, type: !12, align: 1)
!383 = distinct !DILexicalBlock(scope: !364, file: !365, line: 1863, column: 13)
!384 = !DILocation(line: 1856, column: 25, scope: !364)
!385 = !DILocation(line: 1862, column: 15, scope: !364)
!386 = !DILocation(line: 1862, column: 9, scope: !364)
!387 = !DILocation(line: 1864, column: 21, scope: !364)
!388 = !DILocation(line: 1863, column: 19, scope: !364)
!389 = !{i64 1}
!390 = !DILocation(line: 1863, column: 19, scope: !383)
!391 = !DILocation(line: 1863, column: 25, scope: !383)
!392 = !DILocation(line: 1863, column: 31, scope: !364)
!393 = !DILocation(line: 1866, column: 6, scope: !364)
!394 = !{i8 0, i8 2}
!395 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17he328b49162977a3dE", scope: !397, file: !396, line: 22, type: !400, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42)
!396 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "1ba6b7846b9683da32108d78d69fb480")
!397 = !DINamespace(name: "sse2", scope: !398)
!398 = !DINamespace(name: "x86", scope: !399)
!399 = !DINamespace(name: "core_arch", scope: !11)
!400 = !DISubroutineType(types: !401)
!401 = !{null}
!402 = !DILocation(line: 25, column: 5, scope: !395)
!403 = !DILocation(line: 26, column: 2, scope: !395)
!404 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h1c4236de19a01d45E", scope: !406, file: !405, line: 278, type: !408, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !412, retainedNodes: !410)
!405 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "b390a74a8068e14f2e90b22e417c358e")
!406 = !DINamespace(name: "{impl#0}", scope: !407)
!407 = !DINamespace(name: "collect", scope: !277)
!408 = !DISubroutineType(types: !409)
!409 = !{!251, !251}
!410 = !{!411}
!411 = !DILocalVariable(name: "self", arg: 1, scope: !404, file: !405, line: 278, type: !251)
!412 = !{!413}
!413 = !DITemplateTypeParameter(name: "I", type: !251)
!414 = !DILocation(line: 278, column: 18, scope: !404)
!415 = !DILocation(line: 280, column: 6, scope: !404)
!416 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h413888cb3ff27f2dE", scope: !418, file: !417, line: 134, type: !438, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !436, declaration: !440, retainedNodes: !441)
!417 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/instructions/port.rs", directory: "", checksumkind: CSK_MD5, checksum: "d2d89e3a4061823cc5bef50c152ccf5c")
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !419, file: !8, size: 16, align: 16, elements: !422, templateParams: !436, identifier: "652879b5286995c8f777e02d66677415")
!419 = !DINamespace(name: "port", scope: !420)
!420 = !DINamespace(name: "instructions", scope: !421)
!421 = !DINamespace(name: "x86_64", scope: null)
!422 = !{!423, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !418, file: !8, baseType: !424, size: 16, align: 16)
!424 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !418, file: !8, baseType: !426, align: 8, offset: 16)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !68, file: !8, align: 8, elements: !42, templateParams: !427, identifier: "83c023c4188012d417d4861271a19967")
!427 = !{!428}
!428 = !DITemplateTypeParameter(name: "T", type: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !8, size: 8, align: 8, elements: !430, templateParams: !42, identifier: "43784d37f74066b3058c1e0cbe3ddfb")
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !429, file: !8, baseType: !12, size: 8, align: 8)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !429, file: !8, baseType: !433, align: 8, offset: 8)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !419, file: !8, align: 8, elements: !434, templateParams: !42, identifier: "fc26b2a0e98957f4c736cfc4da6472c0")
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !433, file: !8, baseType: !165, align: 8)
!436 = !{!44, !437}
!437 = !DITemplateTypeParameter(name: "A", type: !433)
!438 = !DISubroutineType(types: !439)
!439 = !{!418, !424}
!440 = !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h413888cb3ff27f2dE", scope: !418, file: !417, line: 134, type: !438, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !436)
!441 = !{!442}
!442 = !DILocalVariable(name: "port", arg: 1, scope: !416, file: !417, line: 134, type: !424)
!443 = !DILocation(line: 134, column: 22, scope: !416)
!444 = !DILocation(line: 135, column: 9, scope: !416)
!445 = !DILocation(line: 139, column: 6, scope: !416)
!446 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h876f0f255f21c4ffE", scope: !447, file: !417, line: 134, type: !463, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !461, declaration: !465, retainedNodes: !466)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !419, file: !8, size: 16, align: 16, elements: !448, templateParams: !461, identifier: "8572c405b9f8f5ee57685245b15f42a6")
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !447, file: !8, baseType: !424, size: 16, align: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !447, file: !8, baseType: !451, align: 8, offset: 16)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !68, file: !8, align: 8, elements: !42, templateParams: !452, identifier: "4c1e01453058e26be12628de981796b8")
!452 = !{!453}
!453 = !DITemplateTypeParameter(name: "T", type: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !8, size: 8, align: 8, elements: !455, templateParams: !42, identifier: "f264d04de597393de9acf4df08cd3db9")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !8, baseType: !12, size: 8, align: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !454, file: !8, baseType: !458, align: 8, offset: 8)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !419, file: !8, align: 8, elements: !459, templateParams: !42, identifier: "dd45fd45ba6388d070cc8edb764b214c")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !458, file: !8, baseType: !165, align: 8)
!461 = !{!44, !462}
!462 = !DITemplateTypeParameter(name: "A", type: !458)
!463 = !DISubroutineType(types: !464)
!464 = !{!447, !424}
!465 = !DISubprogram(name: "new<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h876f0f255f21c4ffE", scope: !447, file: !417, line: 134, type: !463, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !461)
!466 = !{!467}
!467 = !DILocalVariable(name: "port", arg: 1, scope: !446, file: !417, line: 134, type: !424)
!468 = !DILocation(line: 134, column: 22, scope: !446)
!469 = !DILocation(line: 135, column: 9, scope: !446)
!470 = !DILocation(line: 139, column: 6, scope: !446)
!471 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17hdd2bc09d24557b34E", scope: !472, file: !417, line: 134, type: !488, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !486, declaration: !490, retainedNodes: !491)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !419, file: !8, size: 16, align: 16, elements: !473, templateParams: !486, identifier: "1d0e58b1aee28a789d5cff958b22c13f")
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !472, file: !8, baseType: !424, size: 16, align: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !472, file: !8, baseType: !476, align: 8, offset: 16)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !68, file: !8, align: 8, elements: !42, templateParams: !477, identifier: "f350529978bc78591ad7d82aa28abd72")
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "T", type: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !8, size: 8, align: 8, elements: !480, templateParams: !42, identifier: "a6318b3f3fe9772c383c4d6109f6ab69")
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !479, file: !8, baseType: !12, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !479, file: !8, baseType: !483, align: 8, offset: 8)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !419, file: !8, align: 8, elements: !484, templateParams: !42, identifier: "cb541fe9d493ef5f926a56756f1d0073")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !483, file: !8, baseType: !165, align: 8)
!486 = !{!44, !487}
!487 = !DITemplateTypeParameter(name: "A", type: !483)
!488 = !DISubroutineType(types: !489)
!489 = !{!472, !424}
!490 = !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17hdd2bc09d24557b34E", scope: !472, file: !417, line: 134, type: !488, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !486)
!491 = !{!492}
!492 = !DILocalVariable(name: "port", arg: 1, scope: !471, file: !417, line: 134, type: !424)
!493 = !DILocation(line: 134, column: 22, scope: !471)
!494 = !DILocation(line: 135, column: 9, scope: !471)
!495 = !DILocation(line: 139, column: 6, scope: !471)
!496 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17h657d0ee4e70502a7E", scope: !418, file: !417, line: 150, type: !497, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !436, declaration: !500, retainedNodes: !501)
!497 = !DISubroutineType(types: !498)
!498 = !{!12, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", baseType: !418, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17h657d0ee4e70502a7E", scope: !418, file: !417, line: 150, type: !497, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !436)
!501 = !{!502}
!502 = !DILocalVariable(name: "self", arg: 1, scope: !496, file: !417, line: 150, type: !499)
!503 = !DILocation(line: 150, column: 24, scope: !496)
!504 = !DILocation(line: 151, column: 36, scope: !496)
!505 = !DILocation(line: 151, column: 18, scope: !496)
!506 = !DILocation(line: 152, column: 6, scope: !496)
!507 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17he15ab5ac8b15a60fE", scope: !472, file: !417, line: 150, type: !508, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !486, declaration: !511, retainedNodes: !512)
!508 = !DISubroutineType(types: !509)
!509 = !{!12, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!511 = !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17he15ab5ac8b15a60fE", scope: !472, file: !417, line: 150, type: !508, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !486)
!512 = !{!513}
!513 = !DILocalVariable(name: "self", arg: 1, scope: !507, file: !417, line: 150, type: !510)
!514 = !DILocation(line: 150, column: 24, scope: !507)
!515 = !DILocation(line: 151, column: 36, scope: !507)
!516 = !DILocation(line: 151, column: 18, scope: !507)
!517 = !DILocation(line: 152, column: 6, scope: !507)
!518 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h2a96825379305138E", scope: !418, file: !417, line: 163, type: !519, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !436, declaration: !521, retainedNodes: !522)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !499, !12}
!521 = !DISubprogram(name: "write<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h2a96825379305138E", scope: !418, file: !417, line: 163, type: !519, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !436)
!522 = !{!523, !524}
!523 = !DILocalVariable(name: "self", arg: 1, scope: !518, file: !417, line: 163, type: !499)
!524 = !DILocalVariable(name: "value", arg: 2, scope: !518, file: !417, line: 163, type: !12)
!525 = !DILocation(line: 163, column: 25, scope: !518)
!526 = !DILocation(line: 163, column: 36, scope: !518)
!527 = !DILocation(line: 164, column: 35, scope: !518)
!528 = !DILocation(line: 164, column: 18, scope: !518)
!529 = !DILocation(line: 165, column: 6, scope: !518)
!530 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h2bb6918ef38afae6E", scope: !447, file: !417, line: 163, type: !531, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !461, declaration: !534, retainedNodes: !535)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !533, !12}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", baseType: !447, size: 64, align: 64, dwarfAddressSpace: 0)
!534 = !DISubprogram(name: "write<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h2bb6918ef38afae6E", scope: !447, file: !417, line: 163, type: !531, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !461)
!535 = !{!536, !537}
!536 = !DILocalVariable(name: "self", arg: 1, scope: !530, file: !417, line: 163, type: !533)
!537 = !DILocalVariable(name: "value", arg: 2, scope: !530, file: !417, line: 163, type: !12)
!538 = !DILocation(line: 163, column: 25, scope: !530)
!539 = !DILocation(line: 163, column: 36, scope: !530)
!540 = !DILocation(line: 164, column: 35, scope: !530)
!541 = !DILocation(line: 164, column: 18, scope: !530)
!542 = !DILocation(line: 165, column: 6, scope: !530)
!543 = distinct !DISubprogram(name: "read_from_port", linkageName: "_ZN6x86_6412instructions4port67_$LT$impl$u20$x86_64..structures..port..PortRead$u20$for$u20$u8$GT$14read_from_port17h9827b43a6e92c9fcE", scope: !544, file: !417, line: 11, type: !545, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !547)
!544 = !DINamespace(name: "{impl#0}", scope: !419)
!545 = !DISubroutineType(types: !546)
!546 = !{!12, !424}
!547 = !{!548, !549}
!548 = !DILocalVariable(name: "port", arg: 1, scope: !543, file: !417, line: 11, type: !424)
!549 = !DILocalVariable(name: "value", scope: !550, file: !417, line: 12, type: !12, align: 1)
!550 = distinct !DILexicalBlock(scope: !543, file: !417, line: 12, column: 9)
!551 = !DILocation(line: 11, column: 30, scope: !543)
!552 = !DILocation(line: 12, column: 13, scope: !550)
!553 = !DILocation(line: 14, column: 13, scope: !550)
!554 = !{i32 429437}
!555 = !DILocation(line: 16, column: 9, scope: !550)
!556 = !DILocation(line: 17, column: 6, scope: !543)
!557 = distinct !DISubprogram(name: "write_to_port", linkageName: "_ZN6x86_6412instructions4port68_$LT$impl$u20$x86_64..structures..port..PortWrite$u20$for$u20$u8$GT$13write_to_port17hba38f3dcb7fbda4eE", scope: !558, file: !417, line: 44, type: !559, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !561)
!558 = !DINamespace(name: "{impl#3}", scope: !419)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !424, !12}
!561 = !{!562, !563}
!562 = !DILocalVariable(name: "port", arg: 1, scope: !557, file: !417, line: 44, type: !424)
!563 = !DILocalVariable(name: "value", arg: 2, scope: !557, file: !417, line: 44, type: !12)
!564 = !DILocation(line: 44, column: 29, scope: !557)
!565 = !DILocation(line: 44, column: 40, scope: !557)
!566 = !DILocation(line: 46, column: 13, scope: !557)
!567 = !{i32 430216}
!568 = !DILocation(line: 48, column: 6, scope: !557)
!569 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hb75a5e89fb7a28bfE", scope: !571, file: !570, line: 236, type: !572, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !575)
!570 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ba937acceddaf7e6b1bfebcc52e564d")
!571 = !DINamespace(name: "{impl#9}", scope: !252)
!572 = !DISubroutineType(types: !573)
!573 = !{!35, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !{!576}
!576 = !DILocalVariable(name: "self", arg: 1, scope: !569, file: !570, line: 236, type: !574)
!577 = !DILocation(line: 236, column: 13, scope: !569)
!578 = !DILocation(line: 237, column: 9, scope: !569)
!579 = !DILocation(line: 238, column: 6, scope: !569)
!580 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4init17h83e9134dde6b323bE", scope: !582, file: !581, line: 39, type: !592, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !595, retainedNodes: !596)
!581 = !DIFile(filename: "src/mmio.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "6a530ecd49570fb9bf77fb2e8e9e168a")
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "MmioSerialPort", scope: !583, file: !8, size: 384, align: 64, elements: !585, templateParams: !42, identifier: "bff64a94c085f2ec1c599ed09f02da76")
!583 = !DINamespace(name: "mmio", scope: !584)
!584 = !DINamespace(name: "uart_16550", scope: null)
!585 = !{!586, !587, !588, !589, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !582, file: !8, baseType: !316, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !582, file: !8, baseType: !316, size: 64, align: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !582, file: !8, baseType: !316, size: 64, align: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !582, file: !8, baseType: !316, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !582, file: !8, baseType: !316, size: 64, align: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !582, file: !8, baseType: !316, size: 64, align: 64, offset: 320)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::mmio::MmioSerialPort", baseType: !582, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !DISubprogram(name: "init", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4init17h83e9134dde6b323bE", scope: !582, file: !581, line: 39, type: !592, scopeLine: 39, flags: DIFlagPrototyped, spFlags: 0, templateParams: !42)
!596 = !{!597, !598, !600, !602, !604, !606}
!597 = !DILocalVariable(name: "self", arg: 1, scope: !580, file: !581, line: 39, type: !594)
!598 = !DILocalVariable(name: "self_int_en", scope: !599, file: !581, line: 40, type: !224, align: 8)
!599 = distinct !DILexicalBlock(scope: !580, file: !581, line: 40, column: 9)
!600 = !DILocalVariable(name: "self_line_ctrl", scope: !601, file: !581, line: 41, type: !224, align: 8)
!601 = distinct !DILexicalBlock(scope: !599, file: !581, line: 41, column: 9)
!602 = !DILocalVariable(name: "self_data", scope: !603, file: !581, line: 42, type: !224, align: 8)
!603 = distinct !DILexicalBlock(scope: !601, file: !581, line: 42, column: 9)
!604 = !DILocalVariable(name: "self_fifo_ctrl", scope: !605, file: !581, line: 43, type: !224, align: 8)
!605 = distinct !DILexicalBlock(scope: !603, file: !581, line: 43, column: 9)
!606 = !DILocalVariable(name: "self_modem_ctrl", scope: !607, file: !581, line: 44, type: !224, align: 8)
!607 = distinct !DILexicalBlock(scope: !605, file: !581, line: 44, column: 9)
!608 = !DILocation(line: 39, column: 17, scope: !580)
!609 = !DILocation(line: 40, column: 27, scope: !580)
!610 = !DILocation(line: 40, column: 44, scope: !580)
!611 = !DILocation(line: 40, column: 13, scope: !599)
!612 = !DILocation(line: 41, column: 30, scope: !599)
!613 = !DILocation(line: 41, column: 50, scope: !599)
!614 = !DILocation(line: 41, column: 13, scope: !601)
!615 = !DILocation(line: 42, column: 40, scope: !601)
!616 = !DILocation(line: 42, column: 25, scope: !601)
!617 = !DILocation(line: 42, column: 13, scope: !603)
!618 = !DILocation(line: 43, column: 30, scope: !603)
!619 = !DILocation(line: 43, column: 50, scope: !603)
!620 = !DILocation(line: 43, column: 13, scope: !605)
!621 = !DILocation(line: 44, column: 31, scope: !605)
!622 = !DILocation(line: 44, column: 52, scope: !605)
!623 = !DILocation(line: 44, column: 13, scope: !607)
!624 = !DILocalVariable(name: "self", arg: 1, scope: !625, file: !626, line: 1481, type: !224)
!625 = distinct !DISubprogram(name: "write<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17h5b1ce4113f3aeb09E", scope: !627, file: !626, line: 1481, type: !222, scopeLine: 1481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, retainedNodes: !629)
!626 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "922304d1f6a37760708bafbc903597a3")
!627 = !DINamespace(name: "{impl#0}", scope: !628)
!628 = !DINamespace(name: "mut_ptr", scope: !61)
!629 = !{!624, !630}
!630 = !DILocalVariable(name: "val", arg: 2, scope: !625, file: !626, line: 1481, type: !12)
!631 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !632)
!632 = distinct !DILocation(line: 47, column: 13, scope: !607)
!633 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !632)
!634 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !632)
!635 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !636)
!636 = distinct !DILocation(line: 50, column: 13, scope: !607)
!637 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !636)
!638 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !636)
!639 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !640)
!640 = distinct !DILocation(line: 53, column: 13, scope: !607)
!641 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !640)
!642 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !640)
!643 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !644)
!644 = distinct !DILocation(line: 54, column: 13, scope: !607)
!645 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !644)
!646 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !644)
!647 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !648)
!648 = distinct !DILocation(line: 57, column: 13, scope: !607)
!649 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !648)
!650 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !648)
!651 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !652)
!652 = distinct !DILocation(line: 61, column: 13, scope: !607)
!653 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !652)
!654 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !652)
!655 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !656)
!656 = distinct !DILocation(line: 65, column: 13, scope: !607)
!657 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !656)
!658 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !656)
!659 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !660)
!660 = distinct !DILocation(line: 68, column: 13, scope: !607)
!661 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !660)
!662 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !660)
!663 = !DILocation(line: 70, column: 6, scope: !580)
!664 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504mmio14MmioSerialPort8line_sts17h3f2d6ea60b5dca90E", scope: !582, file: !581, line: 72, type: !665, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !670, retainedNodes: !671)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !594}
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineStsFlags", scope: !584, file: !8, size: 8, align: 8, elements: !668, templateParams: !42, identifier: "e479c2cee782ceb5ed6fd6033602a9d3")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !667, file: !8, baseType: !12, size: 8, align: 8)
!670 = !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504mmio14MmioSerialPort8line_sts17h3f2d6ea60b5dca90E", scope: !582, file: !581, line: 72, type: !665, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!671 = !{!672}
!672 = !DILocalVariable(name: "self", arg: 1, scope: !664, file: !581, line: 72, type: !594)
!673 = !DILocation(line: 72, column: 17, scope: !664)
!674 = !DILocation(line: 73, column: 52, scope: !664)
!675 = !DILocation(line: 73, column: 71, scope: !664)
!676 = !DILocation(line: 73, column: 51, scope: !664)
!677 = !DILocation(line: 73, column: 18, scope: !664)
!678 = !DILocation(line: 74, column: 6, scope: !664)
!679 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4send17h7a5d700797df75ceE", scope: !582, file: !581, line: 77, type: !680, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !682, retainedNodes: !683)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !594, !12}
!682 = !DISubprogram(name: "send", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4send17h7a5d700797df75ceE", scope: !582, file: !581, line: 77, type: !680, scopeLine: 77, flags: DIFlagPrototyped, spFlags: 0, templateParams: !42)
!683 = !{!684, !685, !686}
!684 = !DILocalVariable(name: "self", arg: 1, scope: !679, file: !581, line: 77, type: !594)
!685 = !DILocalVariable(name: "data", arg: 2, scope: !679, file: !581, line: 77, type: !12)
!686 = !DILocalVariable(name: "self_data", scope: !687, file: !581, line: 78, type: !224, align: 8)
!687 = distinct !DILexicalBlock(scope: !679, file: !581, line: 78, column: 9)
!688 = !DILocation(line: 77, column: 17, scope: !679)
!689 = !DILocation(line: 77, column: 28, scope: !679)
!690 = !DILocation(line: 78, column: 40, scope: !679)
!691 = !DILocation(line: 78, column: 25, scope: !679)
!692 = !DILocation(line: 78, column: 13, scope: !687)
!693 = !DILocation(line: 80, column: 13, scope: !687)
!694 = !DILocation(line: 90, column: 31, scope: !687)
!695 = !DILocation(line: 82, column: 31, scope: !687)
!696 = !DILocation(line: 175, column: 18, scope: !697, inlinedAt: !700)
!697 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h160ab077a692fe44E", scope: !699, file: !698, line: 165, type: !400, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42)
!698 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "83ae27415b0777e10095874992cfc336")
!699 = !DINamespace(name: "hint", scope: !11)
!700 = distinct !DILocation(line: 82, column: 21, scope: !687)
!701 = !DILocation(line: 82, column: 21, scope: !687)
!702 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !703)
!703 = distinct !DILocation(line: 83, column: 21, scope: !687)
!704 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !703)
!705 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !703)
!706 = !DILocation(line: 83, column: 21, scope: !687)
!707 = !DILocation(line: 84, column: 31, scope: !687)
!708 = !DILocation(line: 175, column: 18, scope: !697, inlinedAt: !709)
!709 = distinct !DILocation(line: 84, column: 21, scope: !687)
!710 = !DILocation(line: 84, column: 21, scope: !687)
!711 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !712)
!712 = distinct !DILocation(line: 85, column: 21, scope: !687)
!713 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !712)
!714 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !712)
!715 = !DILocation(line: 85, column: 21, scope: !687)
!716 = !DILocation(line: 86, column: 31, scope: !687)
!717 = !DILocation(line: 175, column: 18, scope: !697, inlinedAt: !718)
!718 = distinct !DILocation(line: 86, column: 21, scope: !687)
!719 = !DILocation(line: 86, column: 21, scope: !687)
!720 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !721)
!721 = distinct !DILocation(line: 87, column: 21, scope: !687)
!722 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !721)
!723 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !721)
!724 = !DILocation(line: 87, column: 21, scope: !687)
!725 = !DILocation(line: 95, column: 6, scope: !679)
!726 = !DILocation(line: 175, column: 18, scope: !697, inlinedAt: !727)
!727 = distinct !DILocation(line: 90, column: 21, scope: !687)
!728 = !DILocation(line: 90, column: 21, scope: !687)
!729 = !DILocation(line: 1481, column: 31, scope: !625, inlinedAt: !730)
!730 = distinct !DILocation(line: 91, column: 21, scope: !687)
!731 = !DILocation(line: 1481, column: 37, scope: !625, inlinedAt: !730)
!732 = !DILocation(line: 1486, column: 18, scope: !625, inlinedAt: !730)
!733 = !DILocation(line: 91, column: 21, scope: !687)
!734 = distinct !DISubprogram(name: "receive", linkageName: "_ZN10uart_165504mmio14MmioSerialPort7receive17h1a1d85c5d31041d1E", scope: !582, file: !581, line: 98, type: !735, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !737, retainedNodes: !738)
!735 = !DISubroutineType(types: !736)
!736 = !{!12, !594}
!737 = !DISubprogram(name: "receive", linkageName: "_ZN10uart_165504mmio14MmioSerialPort7receive17h1a1d85c5d31041d1E", scope: !582, file: !581, line: 98, type: !735, scopeLine: 98, flags: DIFlagPrototyped, spFlags: 0, templateParams: !42)
!738 = !{!739, !740}
!739 = !DILocalVariable(name: "self", arg: 1, scope: !734, file: !581, line: 98, type: !594)
!740 = !DILocalVariable(name: "self_data", scope: !741, file: !581, line: 99, type: !224, align: 8)
!741 = distinct !DILexicalBlock(scope: !734, file: !581, line: 99, column: 9)
!742 = !DILocation(line: 98, column: 20, scope: !734)
!743 = !DILocation(line: 99, column: 40, scope: !734)
!744 = !DILocation(line: 99, column: 25, scope: !734)
!745 = !DILocation(line: 99, column: 13, scope: !741)
!746 = !DILocation(line: 101, column: 23, scope: !741)
!747 = !DILocation(line: 175, column: 18, scope: !697, inlinedAt: !748)
!748 = distinct !DILocation(line: 101, column: 13, scope: !741)
!749 = !DILocation(line: 101, column: 13, scope: !741)
!750 = !DILocalVariable(name: "self", arg: 1, scope: !751, file: !626, line: 1330, type: !224)
!751 = distinct !DISubprogram(name: "read<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4read17h910088975b74f201E", scope: !627, file: !626, line: 1330, type: !752, scopeLine: 1330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !43, retainedNodes: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!12, !224}
!754 = !{!750}
!755 = !DILocation(line: 1330, column: 30, scope: !751, inlinedAt: !756)
!756 = distinct !DILocation(line: 102, column: 13, scope: !741)
!757 = !DILocation(line: 1335, column: 18, scope: !751, inlinedAt: !756)
!758 = !DILocation(line: 104, column: 6, scope: !734)
!759 = distinct !DISubprogram(name: "write_str", linkageName: "_ZN69_$LT$uart_16550..mmio..MmioSerialPort$u20$as$u20$core..fmt..Write$GT$9write_str17h2c794e5d95f71d37E", scope: !760, file: !581, line: 108, type: !761, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, retainedNodes: !763)
!760 = !DINamespace(name: "{impl#1}", scope: !583)
!761 = !DISubroutineType(types: !762)
!762 = !{!156, !594, !89}
!763 = !{!764, !765, !766, !768}
!764 = !DILocalVariable(name: "self", arg: 1, scope: !759, file: !581, line: 108, type: !594)
!765 = !DILocalVariable(name: "s", arg: 2, scope: !759, file: !581, line: 108, type: !89)
!766 = !DILocalVariable(name: "iter", scope: !767, file: !581, line: 109, type: !251, align: 8)
!767 = distinct !DILexicalBlock(scope: !759, file: !581, line: 109, column: 9)
!768 = !DILocalVariable(name: "byte", scope: !769, file: !581, line: 109, type: !12, align: 1)
!769 = distinct !DILexicalBlock(scope: !767, file: !581, line: 109, column: 31)
!770 = !DILocation(line: 108, column: 18, scope: !759)
!771 = !DILocation(line: 108, column: 29, scope: !759)
!772 = !DILocation(line: 109, column: 21, scope: !767)
!773 = !DILocation(line: 109, column: 21, scope: !759)
!774 = !DILocation(line: 109, column: 9, scope: !767)
!775 = !DILocation(line: 112, column: 9, scope: !759)
!776 = !DILocation(line: 113, column: 6, scope: !759)
!777 = !DILocation(line: 109, column: 13, scope: !767)
!778 = !DILocation(line: 109, column: 13, scope: !769)
!779 = !DILocation(line: 110, column: 13, scope: !769)
!780 = distinct !DISubprogram(name: "new", linkageName: "_ZN10uart_165504port10SerialPort3new17h9341b51f095e3c79E", scope: !782, file: !781, line: 23, type: !791, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !793, retainedNodes: !794)
!781 = !DIFile(filename: "src/port.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "2b770beb8cfb5c2dd2a7577c385b04ce")
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !783, file: !8, size: 96, align: 16, elements: !784, templateParams: !42, identifier: "a5631a75f1b2855696280d912f4e6756")
!783 = !DINamespace(name: "port", scope: !584)
!784 = !{!785, !786, !787, !788, !789, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !8, baseType: !418, size: 16, align: 16)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !782, file: !8, baseType: !447, size: 16, align: 16, offset: 16)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !782, file: !8, baseType: !447, size: 16, align: 16, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !782, file: !8, baseType: !447, size: 16, align: 16, offset: 48)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !782, file: !8, baseType: !447, size: 16, align: 16, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !782, file: !8, baseType: !472, size: 16, align: 16, offset: 80)
!791 = !DISubroutineType(types: !792)
!792 = !{!782, !424}
!793 = !DISubprogram(name: "new", linkageName: "_ZN10uart_165504port10SerialPort3new17h9341b51f095e3c79E", scope: !782, file: !781, line: 23, type: !791, scopeLine: 23, flags: DIFlagPrototyped, spFlags: 0, templateParams: !42)
!794 = !{!795}
!795 = !DILocalVariable(name: "base", arg: 1, scope: !780, file: !781, line: 23, type: !424)
!796 = !DILocation(line: 23, column: 29, scope: !780)
!797 = !DILocation(line: 25, column: 19, scope: !780)
!798 = !DILocation(line: 26, column: 40, scope: !780)
!799 = !DILocation(line: 26, column: 21, scope: !780)
!800 = !DILocation(line: 27, column: 43, scope: !780)
!801 = !DILocation(line: 27, column: 24, scope: !780)
!802 = !DILocation(line: 28, column: 43, scope: !780)
!803 = !DILocation(line: 28, column: 24, scope: !780)
!804 = !DILocation(line: 29, column: 44, scope: !780)
!805 = !DILocation(line: 29, column: 25, scope: !780)
!806 = !DILocation(line: 30, column: 41, scope: !780)
!807 = !DILocation(line: 30, column: 23, scope: !780)
!808 = !DILocation(line: 24, column: 9, scope: !780)
!809 = !DILocation(line: 32, column: 6, scope: !780)
!810 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504port10SerialPort4init17hfb5a32b82f33e510E", scope: !782, file: !781, line: 37, type: !811, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !814, retainedNodes: !815)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::port::SerialPort", baseType: !782, size: 64, align: 64, dwarfAddressSpace: 0)
!814 = !DISubprogram(name: "init", linkageName: "_ZN10uart_165504port10SerialPort4init17hfb5a32b82f33e510E", scope: !782, file: !781, line: 37, type: !811, scopeLine: 37, flags: DIFlagPrototyped, spFlags: 0, templateParams: !42)
!815 = !{!816}
!816 = !DILocalVariable(name: "self", arg: 1, scope: !810, file: !781, line: 37, type: !813)
!817 = !DILocation(line: 37, column: 17, scope: !810)
!818 = !DILocation(line: 40, column: 13, scope: !810)
!819 = !DILocation(line: 43, column: 13, scope: !810)
!820 = !DILocation(line: 46, column: 13, scope: !810)
!821 = !DILocation(line: 47, column: 13, scope: !810)
!822 = !DILocation(line: 50, column: 13, scope: !810)
!823 = !DILocation(line: 54, column: 13, scope: !810)
!824 = !DILocation(line: 58, column: 13, scope: !810)
!825 = !DILocation(line: 61, column: 13, scope: !810)
!826 = !DILocation(line: 63, column: 6, scope: !810)
!827 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504port10SerialPort8line_sts17h4f1978f3560219e9E", scope: !782, file: !781, line: 65, type: !828, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !830, retainedNodes: !831)
!828 = !DISubroutineType(types: !829)
!829 = !{!667, !813}
!830 = !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504port10SerialPort8line_sts17h4f1978f3560219e9E", scope: !782, file: !781, line: 65, type: !828, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !42)
!831 = !{!832}
!832 = !DILocalVariable(name: "self", arg: 1, scope: !827, file: !781, line: 65, type: !813)
!833 = !DILocation(line: 65, column: 17, scope: !827)
!834 = !DILocation(line: 66, column: 51, scope: !827)
!835 = !DILocation(line: 66, column: 18, scope: !827)
!836 = !DILocation(line: 67, column: 6, scope: !827)
!837 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504port10SerialPort4send17h469a746dbe2c5ce4E", scope: !782, file: !781, line: 70, type: !838, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !42, declaration: !840, retainedNodes: !841)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !813, !12}
