; ModuleID = 'uart_16550.eb430398-cgu.0'
source_filename = "uart_16550.eb430398-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::sync::atomic::AtomicPtr<u8>" = type { ptr }
%"mmio::MmioSerialPort" = type { %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>" }
%"port::SerialPort" = type { i16, i16, i16, i16, i16, i16 }
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::fmt::Error" = type {}

@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_560206a49c61adca6f3f0639a12632eb = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_c2ea93c90919bb7b1e482f917e413fa1 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "clang LLVM (rustc version 1.71.0-nightly (d0f204e4d 2023-04-16))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18/src/lib.rs/@/uart_16550.eb430398-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18")
!5 = !{!6, !18}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "v1", scope: !9)
!9 = !DINamespace(name: "rt", scope: !10)
!10 = !DINamespace(name: "fmt", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !19, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !21)
!19 = !DINamespace(name: "atomic", scope: !20)
!20 = !DINamespace(name: "sync", scope: !11)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!27 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h5e84b6fc4a340e57E", scope: !29, file: !28, line: 47, type: !33, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !76, retainedNodes: !74)
!28 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "c62182f1c70ead07686c37e26ad4aaf1")
!29 = !DINamespace(name: "{impl#1}", scope: !30)
!30 = !DINamespace(name: "copied", scope: !31)
!31 = !DINamespace(name: "adapters", scope: !32)
!32 = !DINamespace(name: "iter", scope: !11)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !36, file: !7, size: 16, align: 8, elements: !37, templateParams: !42, identifier: "99bbbec2a0e35dac1e9286997cfb6c8d")
!36 = !DINamespace(name: "option", scope: !11)
!37 = !{!38}
!38 = !DICompositeType(tag: DW_TAG_variant_part, scope: !35, file: !7, size: 16, align: 8, elements: !39, templateParams: !42, identifier: "57b3c3f4e2027a6266dc9ab669e851db", discriminator: !49)
!39 = !{!40, !45}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !38, file: !7, baseType: !41, size: 16, align: 8, extraData: i64 0)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !35, file: !7, size: 16, align: 8, elements: !42, templateParams: !43, identifier: "7c2e502f65c86591a9596c9e9989cce9")
!42 = !{}
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !12)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !38, file: !7, baseType: !46, size: 16, align: 8, extraData: i64 1)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !35, file: !7, size: 16, align: 8, elements: !47, templateParams: !43, identifier: "412bd9535ded5ce366390802bfd0cdd")
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !46, file: !7, baseType: !12, size: 8, align: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, scope: !35, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !30, file: !7, size: 128, align: 64, elements: !52, templateParams: !72, identifier: "c2e8e2b63e2fd0c36b8766e11cebc636")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !51, file: !7, baseType: !54, size: 128, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !55, file: !7, size: 128, align: 64, elements: !57, templateParams: !43, identifier: "5f90073148b5cfd9cb96baa946b3e555")
!55 = !DINamespace(name: "iter", scope: !56)
!56 = !DINamespace(name: "slice", scope: !11)
!57 = !{!58, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !54, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !60, file: !7, size: 64, align: 64, elements: !62, templateParams: !43, identifier: "c7d0779419e3ba3ced89631c2ee2e04")
!60 = !DINamespace(name: "non_null", scope: !61)
!61 = !DINamespace(name: "ptr", scope: !11)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !59, file: !7, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !54, file: !7, baseType: !64, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !54, file: !7, baseType: !67, align: 8)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !69, identifier: "24e17897fccf9830a20c76067e2ff522")
!68 = !DINamespace(name: "marker", scope: !11)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "I", type: !54)
!74 = !{!75}
!75 = !DILocalVariable(name: "self", arg: 1, scope: !27, file: !28, line: 47, type: !50)
!76 = !{!73, !44}
!77 = !DILocation(line: 47, column: 13, scope: !27)
!78 = !DILocation(line: 48, column: 9, scope: !27)
!79 = !DILocation(line: 49, column: 6, scope: !27)
!80 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hfec148fa76b9bcedE", scope: !82, file: !81, line: 399, type: !211, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !213)
!81 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !7, size: 384, align: 64, elements: !83, templateParams: !42, identifier: "dc49042afee2f796a8fa4685389c4b18")
!83 = !{!84, !96, !144}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !82, file: !7, baseType: !85, size: 128, align: 64, offset: 128)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !86, templateParams: !42, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!86 = !{!87, !95}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !85, file: !7, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !90, templateParams: !42, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !89, file: !7, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !89, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !82, file: !7, baseType: !97, size: 128, align: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !36, file: !7, size: 128, align: 64, elements: !98, templateParams: !42, identifier: "62d362416a1eb41bf984638792a73145")
!98 = !{!99}
!99 = !DICompositeType(tag: DW_TAG_variant_part, scope: !97, file: !7, size: 128, align: 64, elements: !100, templateParams: !42, identifier: "51527d667cbd19b863d93073f3cc474", discriminator: !143)
!100 = !{!101, !139}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !99, file: !7, baseType: !102, size: 128, align: 64, extraData: i64 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !97, file: !7, size: 128, align: 64, elements: !42, templateParams: !103, identifier: "66a59c7143972a6588bd1a9c8246e60f")
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !7, size: 128, align: 64, elements: !106, templateParams: !42, identifier: "66b60dbaad43783577fb935928e2ac56")
!106 = !{!107, !138}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !105, file: !7, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 448, align: 64, elements: !110, templateParams: !42, identifier: "1b0f53c51c2a0850dc27a4ea7530e9b2")
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !109, file: !7, baseType: !94, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !109, file: !7, baseType: !113, size: 384, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !8, file: !7, size: 384, align: 64, elements: !114, templateParams: !42, identifier: "4ceb8823bbeb709d93b7ffb6ddd40132")
!114 = !{!115, !117, !118, !120, !137}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !113, file: !7, baseType: !116, size: 32, align: 32, offset: 288)
!116 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !113, file: !7, baseType: !6, size: 8, align: 8, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !7, baseType: !119, size: 32, align: 32, offset: 256)
!119 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !113, file: !7, baseType: !121, size: 128, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !122, templateParams: !42, identifier: "beb49147a723c973b15fc19c2245c821")
!122 = !{!123}
!123 = !DICompositeType(tag: DW_TAG_variant_part, scope: !121, file: !7, size: 128, align: 64, elements: !124, templateParams: !42, identifier: "c9db73f716fc865c39b9a87ace47fe10", discriminator: !135)
!124 = !{!125, !129, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !123, file: !7, baseType: !126, size: 128, align: 64, extraData: i64 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !121, file: !7, size: 128, align: 64, elements: !127, templateParams: !42, identifier: "db0b97f002b1fae3dbc4ebdd853ff355")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !126, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !123, file: !7, baseType: !130, size: 128, align: 64, extraData: i64 1)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !121, file: !7, size: 128, align: 64, elements: !131, templateParams: !42, identifier: "49d2632f301eeedc951f3431bb382902")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !123, file: !7, baseType: !134, size: 128, align: 64, extraData: i64 2)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !121, file: !7, size: 128, align: 64, elements: !42, identifier: "afc023622f1fd60e7b29fd0e4f997a04")
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!136 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !113, file: !7, baseType: !121, size: 128, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !99, file: !7, baseType: !140, size: 128, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !97, file: !7, size: 128, align: 64, elements: !141, templateParams: !103, identifier: "45eaeac90b0c2cad515177aa4ad012c0")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !140, file: !7, baseType: !105, size: 128, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !82, file: !7, baseType: !145, size: 128, align: 64, offset: 256)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !7, size: 128, align: 64, elements: !146, templateParams: !42, identifier: "83fd9dd078f03ba333a6c21d9c3331b7")
!146 = !{!147, !210}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !145, file: !7, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !10, file: !7, size: 128, align: 64, elements: !150, templateParams: !42, identifier: "3c2ef6ebf262caba6e43777d9c298823")
!150 = !{!151, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !7, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !154, file: !7, align: 8, elements: !42, identifier: "43185ab61ba6b0b799bd1bef1620bc0b")
!154 = !DINamespace(name: "{extern#0}", scope: !10)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !149, file: !7, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !152, !178}
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !160, file: !7, size: 8, align: 8, elements: !161, templateParams: !42, identifier: "1c6ce168e24238e83c13ec35dde7d382")
!160 = !DINamespace(name: "result", scope: !11)
!161 = !{!162}
!162 = !DICompositeType(tag: DW_TAG_variant_part, scope: !159, file: !7, size: 8, align: 8, elements: !163, templateParams: !42, identifier: "42dfca7da53f7734270db51480dbcc24", discriminator: !177)
!163 = !{!164, !173}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !162, file: !7, baseType: !165, size: 8, align: 8, extraData: i64 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !159, file: !7, size: 8, align: 8, elements: !166, templateParams: !169, identifier: "4d011f8c16a13f53ec25b197c7b1903")
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !165, file: !7, baseType: !168, align: 8, offset: 8)
!168 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!169 = !{!170, !171}
!170 = !DITemplateTypeParameter(name: "T", type: !168)
!171 = !DITemplateTypeParameter(name: "E", type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !7, align: 8, elements: !42, identifier: "d361babf030d8dcc5fc2146a5e622473")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !162, file: !7, baseType: !174, size: 8, align: 8, extraData: i64 1)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !159, file: !7, size: 8, align: 8, elements: !175, templateParams: !169, identifier: "c5af1e4fa5907b7a524a9ebbd4a5ec10")
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !7, baseType: !172, align: 8, offset: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !7, baseType: !12, size: 8, align: 8, flags: DIFlagArtificial)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !7, size: 512, align: 64, elements: !180, templateParams: !42, identifier: "a3b888d0a58016a3ad42c934cf971ea3")
!180 = !{!181, !182, !183, !184, !198, !199}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !7, baseType: !119, size: 32, align: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !179, file: !7, baseType: !116, size: 32, align: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !179, file: !7, baseType: !6, size: 8, align: 8, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !179, file: !7, baseType: !185, size: 128, align: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !36, file: !7, size: 128, align: 64, elements: !186, templateParams: !42, identifier: "8d57b0310dad0e81a52a7e1f827929d")
!186 = !{!187}
!187 = !DICompositeType(tag: DW_TAG_variant_part, scope: !185, file: !7, size: 128, align: 64, elements: !188, templateParams: !42, identifier: "1503e6327b896c262eca127cbc35ec74", discriminator: !197)
!188 = !{!189, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !187, file: !7, baseType: !190, size: 128, align: 64, extraData: i64 0)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !185, file: !7, size: 128, align: 64, elements: !42, templateParams: !191, identifier: "b9a11c756332445b5e317b2b2625f528")
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "T", type: !94)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !187, file: !7, baseType: !194, size: 128, align: 64, extraData: i64 1)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !185, file: !7, size: 128, align: 64, elements: !195, templateParams: !191, identifier: "87159a1745a522a36bc4a0700aab6dc3")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !179, file: !7, baseType: !185, size: 128, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !179, file: !7, baseType: !200, size: 128, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !7, size: 128, align: 64, elements: !201, templateParams: !42, identifier: "b58efcb3df0f0beb9aa098f750459fd2")
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !200, file: !7, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !7, align: 8, elements: !42, identifier: "bcfe988c4f0dd1d50291e24ffc6447")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !200, file: !7, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, align: 64, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 3, lowerBound: 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!82, !85}
!213 = !{!214}
!214 = !DILocalVariable(name: "pieces", arg: 1, scope: !80, file: !81, line: 399, type: !85)
!215 = !DILocation(line: 399, column: 28, scope: !80)
!216 = !DILocation(line: 400, column: 12, scope: !80)
!217 = !DILocation(line: 403, column: 34, scope: !80)
!218 = !DILocation(line: 403, column: 9, scope: !80)
!219 = !{i64 8}
!220 = !DILocation(line: 404, column: 6, scope: !80)
!221 = !DILocation(line: 401, column: 13, scope: !80)
!222 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17hd4fe5ed2a6b604a8E", scope: !224, file: !223, line: 864, type: !226, scopeLine: 864, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !232)
!223 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "b8176094d70b96d19ed6eb71a23da935")
!224 = !DINamespace(name: "{impl#0}", scope: !225)
!225 = !DINamespace(name: "str", scope: !11)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !89}
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !229, file: !7, size: 128, align: 64, elements: !230, templateParams: !42, identifier: "8be8eb045418948da0d080a003994773")
!229 = !DINamespace(name: "iter", scope: !225)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !228, file: !7, baseType: !51, size: 128, align: 64)
!232 = !{!233}
!233 = !DILocalVariable(name: "self", arg: 1, scope: !222, file: !223, line: 864, type: !89)
!234 = !DILocation(line: 864, column: 18, scope: !222)
!235 = !DILocalVariable(name: "self", arg: 1, scope: !236, file: !223, line: 325, type: !89)
!236 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h1cd55b9dbce3b1c7E", scope: !224, file: !223, line: 325, type: !237, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !243)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !89}
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !7, size: 128, align: 64, elements: !240, templateParams: !42, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !239, file: !7, baseType: !92, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !239, file: !7, baseType: !94, size: 64, align: 64, offset: 64)
!243 = !{!235}
!244 = !DILocation(line: 325, column: 27, scope: !236, inlinedAt: !245)
!245 = distinct !DILocation(line: 865, column: 15, scope: !222)
!246 = !DILocation(line: 328, column: 6, scope: !236, inlinedAt: !245)
!247 = !DILocation(line: 865, column: 15, scope: !222)
!248 = !DILocation(line: 865, column: 9, scope: !222)
!249 = !DILocation(line: 866, column: 6, scope: !222)
!250 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17hf229e701e993113fE", scope: !252, file: !251, line: 3311, type: !255, scopeLine: 3311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !259, retainedNodes: !257)
!251 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "73d175c00d58c02116c31cf298d75f09")
!252 = !DINamespace(name: "Iterator", scope: !253)
!253 = !DINamespace(name: "iterator", scope: !254)
!254 = !DINamespace(name: "traits", scope: !32)
!255 = !DISubroutineType(types: !256)
!256 = !{!51, !54}
!257 = !{!258}
!258 = !DILocalVariable(name: "self", arg: 1, scope: !250, file: !251, line: 3311, type: !54)
!259 = !{!260, !44}
!260 = !DITemplateTypeParameter(name: "Self", type: !54)
!261 = !DILocation(line: 3311, column: 26, scope: !250)
!262 = !DILocation(line: 3316, column: 9, scope: !250)
!263 = !DILocation(line: 3317, column: 6, scope: !250)
!264 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17h32f21c56e144fe64E", scope: !51, file: !28, line: 26, type: !255, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !72, retainedNodes: !265)
!265 = !{!266}
!266 = !DILocalVariable(name: "it", arg: 1, scope: !264, file: !28, line: 26, type: !54)
!267 = !DILocation(line: 26, column: 32, scope: !264)
!268 = !DILocation(line: 27, column: 9, scope: !264)
!269 = !DILocation(line: 28, column: 6, scope: !264)
!270 = distinct !DISubprogram(name: "atomic_load<*mut u8>", linkageName: "_ZN4core4sync6atomic11atomic_load17ha41a257be8f0e917E", scope: !19, file: !271, line: 3155, type: !272, scopeLine: 3155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !279, retainedNodes: !276)
!271 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "cd92f8d8b05e6b3d85c324633916e8b5")
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !275, !18}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *mut u8", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = !{!277, !278}
!277 = !DILocalVariable(name: "dst", arg: 1, scope: !270, file: !271, line: 3155, type: !275)
!278 = !DILocalVariable(name: "order", arg: 2, scope: !270, file: !271, line: 3155, type: !18)
!279 = !{!280}
!280 = !DITemplateTypeParameter(name: "T", type: !274)
!281 = !DILocation(line: 3155, column: 32, scope: !270)
!282 = !DILocation(line: 3155, column: 47, scope: !270)
!283 = !DILocation(line: 3158, column: 15, scope: !270)
!284 = !{i8 0, i8 5}
!285 = !DILocation(line: 3158, column: 9, scope: !270)
!286 = !DILocation(line: 3159, column: 24, scope: !270)
!287 = !DILocation(line: 3162, column: 24, scope: !270)
!288 = !DILocation(line: 3160, column: 24, scope: !270)
!289 = !DILocation(line: 3163, column: 23, scope: !270)
!290 = !DILocation(line: 3161, column: 23, scope: !270)
!291 = !DILocation(line: 3166, column: 2, scope: !270)
!292 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$3new17h79f946139ec23297E", scope: !293, file: !271, line: 1062, type: !300, scopeLine: 1062, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !302)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<u8>", scope: !19, file: !7, size: 64, align: 64, elements: !294, templateParams: !43, identifier: "2b0ae62343b9af6e815e1680be0af2")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !293, file: !7, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut u8>", scope: !297, file: !7, size: 64, align: 64, elements: !298, templateParams: !279, identifier: "172ee342d105f8fa4b07c4fc8f63be4b")
!297 = !DINamespace(name: "cell", scope: !11)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !7, baseType: !274, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!293, !274}
!302 = !{!303}
!303 = !DILocalVariable(name: "p", arg: 1, scope: !292, file: !271, line: 1062, type: !274)
!304 = !DILocation(line: 1062, column: 22, scope: !292)
!305 = !DILocalVariable(name: "value", arg: 1, scope: !306, file: !307, line: 2011, type: !274)
!306 = distinct !DISubprogram(name: "new<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h78bbbcf819046d4cE", scope: !296, file: !307, line: 2011, type: !308, scopeLine: 2011, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !279, retainedNodes: !310)
!307 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a756604d5b8adc8c373a79367d25e51")
!308 = !DISubroutineType(types: !309)
!309 = !{!296, !274}
!310 = !{!305}
!311 = !DILocation(line: 2011, column: 22, scope: !306, inlinedAt: !312)
!312 = distinct !DILocation(line: 1063, column: 24, scope: !292)
!313 = !DILocation(line: 2012, column: 9, scope: !306, inlinedAt: !312)
!314 = !DILocation(line: 2013, column: 6, scope: !306, inlinedAt: !312)
!315 = !DILocation(line: 1063, column: 9, scope: !292)
!316 = !DILocation(line: 1064, column: 6, scope: !292)
!317 = distinct !DISubprogram(name: "load<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$4load17h1e79633572e4bb02E", scope: !293, file: !271, line: 1279, type: !318, scopeLine: 1279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !321)
!318 = !DISubroutineType(types: !319)
!319 = !{!274, !320, !18}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicPtr<u8>", baseType: !293, size: 64, align: 64, dwarfAddressSpace: 0)
!321 = !{!322, !323}
!322 = !DILocalVariable(name: "self", arg: 1, scope: !317, file: !271, line: 1279, type: !320)
!323 = !DILocalVariable(name: "order", arg: 2, scope: !317, file: !271, line: 1279, type: !18)
!324 = !DILocation(line: 1279, column: 17, scope: !317)
!325 = !DILocation(line: 1279, column: 24, scope: !317)
!326 = !DILocalVariable(name: "self", arg: 1, scope: !327, file: !307, line: 2054, type: !331)
!327 = distinct !DISubprogram(name: "get<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h3b4863ebb071cfb3E", scope: !296, file: !307, line: 2054, type: !328, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !279, retainedNodes: !332)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut u8", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<*mut u8>", baseType: !296, size: 64, align: 64, dwarfAddressSpace: 0)
!332 = !{!326}
!333 = !DILocation(line: 2054, column: 22, scope: !327, inlinedAt: !334)
!334 = distinct !DILocation(line: 1281, column: 30, scope: !317)
!335 = !DILocation(line: 1281, column: 18, scope: !317)
!336 = !DILocation(line: 1282, column: 6, scope: !317)
!337 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17hed3b03d5f9dd6849E", scope: !339, file: !338, line: 1899, type: !350, scopeLine: 1899, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !352)
!338 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "57ab105cef20f1dc79a065da4ca5bc2f")
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !36, file: !7, size: 64, align: 64, elements: !340, templateParams: !42, identifier: "8a609cbe7b29403c6b481516812aeb75")
!340 = !{!341}
!341 = !DICompositeType(tag: DW_TAG_variant_part, scope: !339, file: !7, size: 64, align: 64, elements: !342, templateParams: !42, identifier: "9b5637c8904cadf85b3a34e2d8c6b3df", discriminator: !349)
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !341, file: !7, baseType: !344, size: 64, align: 64, extraData: i64 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !339, file: !7, size: 64, align: 64, elements: !42, templateParams: !69, identifier: "a60e797b847fb1fc654fcb57f68686bc")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !341, file: !7, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !339, file: !7, size: 64, align: 64, elements: !347, templateParams: !69, identifier: "b6bac6d95f4c9cd5195e019f9f81d37c")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !346, file: !7, baseType: !71, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !7, baseType: !136, size: 64, align: 64, flags: DIFlagArtificial)
!350 = !DISubroutineType(types: !351)
!351 = !{!35, !339}
!352 = !{!353, !354}
!353 = !DILocalVariable(name: "self", arg: 1, scope: !337, file: !338, line: 1899, type: !339)
!354 = !DILocalVariable(name: "v", scope: !355, file: !338, line: 1906, type: !12, align: 1)
!355 = distinct !DILexicalBlock(scope: !337, file: !338, line: 1906, column: 13)
!356 = !DILocation(line: 1899, column: 25, scope: !337)
!357 = !DILocation(line: 1905, column: 15, scope: !337)
!358 = !DILocation(line: 1905, column: 9, scope: !337)
!359 = !DILocation(line: 1907, column: 21, scope: !337)
!360 = !DILocation(line: 1906, column: 19, scope: !337)
!361 = !{i64 1}
!362 = !DILocation(line: 1906, column: 19, scope: !355)
!363 = !DILocation(line: 1906, column: 25, scope: !355)
!364 = !DILocation(line: 1906, column: 31, scope: !337)
!365 = !DILocation(line: 1909, column: 6, scope: !337)
!366 = !{i8 0, i8 2}
!367 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17he3316212e2db9da8E", scope: !369, file: !368, line: 22, type: !372, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !42)
!368 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "af15c06b8fe0c45637e9a1b14f5b1c62")
!369 = !DINamespace(name: "sse2", scope: !370)
!370 = !DINamespace(name: "x86", scope: !371)
!371 = !DINamespace(name: "core_arch", scope: !11)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DILocation(line: 25, column: 5, scope: !367)
!375 = !DILocation(line: 26, column: 2, scope: !367)
!376 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h2603b9adfacff9bfE", scope: !378, file: !377, line: 272, type: !380, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !384, retainedNodes: !382)
!377 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "697d559cdba63f105535b8b53d6ea422")
!378 = !DINamespace(name: "{impl#0}", scope: !379)
!379 = !DINamespace(name: "collect", scope: !254)
!380 = !DISubroutineType(types: !381)
!381 = !{!228, !228}
!382 = !{!383}
!383 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !377, line: 272, type: !228)
!384 = !{!385}
!385 = !DITemplateTypeParameter(name: "I", type: !228)
!386 = !DILocation(line: 272, column: 18, scope: !376)
!387 = !DILocation(line: 274, column: 6, scope: !376)
!388 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h16b08ba3d2a59066E", scope: !390, file: !389, line: 134, type: !410, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !408, retainedNodes: !412)
!389 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/instructions/port.rs", directory: "", checksumkind: CSK_MD5, checksum: "d2d89e3a4061823cc5bef50c152ccf5c")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !391, file: !7, size: 16, align: 16, elements: !394, templateParams: !408, identifier: "f491eca81b00aee76f9218cba6b4bf5f")
!391 = !DINamespace(name: "port", scope: !392)
!392 = !DINamespace(name: "instructions", scope: !393)
!393 = !DINamespace(name: "x86_64", scope: null)
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !390, file: !7, baseType: !396, size: 16, align: 16)
!396 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !390, file: !7, baseType: !398, align: 8)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !399, identifier: "69524a05c8dcee762fc634bf4ae0eadd")
!399 = !{!400}
!400 = !DITemplateTypeParameter(name: "T", type: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !7, size: 8, align: 8, elements: !402, templateParams: !42, identifier: "913df7bdd9f6ee5c80105c0817f3c8da")
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !7, baseType: !12, size: 8, align: 8)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !401, file: !7, baseType: !405, align: 8, offset: 8)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !391, file: !7, align: 8, elements: !406, templateParams: !42, identifier: "90201ce8d3293861bd06adb8c990f9b0")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !405, file: !7, baseType: !168, align: 8)
!408 = !{!44, !409}
!409 = !DITemplateTypeParameter(name: "A", type: !405)
!410 = !DISubroutineType(types: !411)
!411 = !{!390, !396}
!412 = !{!413}
!413 = !DILocalVariable(name: "port", arg: 1, scope: !388, file: !389, line: 134, type: !396)
!414 = !DILocation(line: 134, column: 22, scope: !388)
!415 = !DILocation(line: 135, column: 9, scope: !388)
!416 = !DILocation(line: 139, column: 6, scope: !388)
!417 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h31a0435ea77180f7E", scope: !418, file: !389, line: 134, type: !434, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !432, retainedNodes: !436)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !391, file: !7, size: 16, align: 16, elements: !419, templateParams: !432, identifier: "a8eb19b2ce088a9b7e474711afc9a3ab")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !418, file: !7, baseType: !396, size: 16, align: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !418, file: !7, baseType: !422, align: 8)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !423, identifier: "8d33ffc0710a4c2f1f458093d077c9a3")
!423 = !{!424}
!424 = !DITemplateTypeParameter(name: "T", type: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !7, size: 8, align: 8, elements: !426, templateParams: !42, identifier: "61129a9fb5f505dc2c1bda9fef39cabd")
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !7, baseType: !12, size: 8, align: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !425, file: !7, baseType: !429, align: 8, offset: 8)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !391, file: !7, align: 8, elements: !430, templateParams: !42, identifier: "7b61641c06de0483f7557b84ccab5a8b")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !429, file: !7, baseType: !168, align: 8)
!432 = !{!44, !433}
!433 = !DITemplateTypeParameter(name: "A", type: !429)
!434 = !DISubroutineType(types: !435)
!435 = !{!418, !396}
!436 = !{!437}
!437 = !DILocalVariable(name: "port", arg: 1, scope: !417, file: !389, line: 134, type: !396)
!438 = !DILocation(line: 134, column: 22, scope: !417)
!439 = !DILocation(line: 135, column: 9, scope: !417)
!440 = !DILocation(line: 139, column: 6, scope: !417)
!441 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17hc46d4bfbe056d27dE", scope: !442, file: !389, line: 134, type: !458, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !456, retainedNodes: !460)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !391, file: !7, size: 16, align: 16, elements: !443, templateParams: !456, identifier: "550c9cc19a4cb4e49a85e4180dcb750d")
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !442, file: !7, baseType: !396, size: 16, align: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !442, file: !7, baseType: !446, align: 8)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !68, file: !7, align: 8, elements: !42, templateParams: !447, identifier: "28c51fa43b12fc7ea0512a3de568eae")
!447 = !{!448}
!448 = !DITemplateTypeParameter(name: "T", type: !449)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !7, size: 8, align: 8, elements: !450, templateParams: !42, identifier: "ea50742d5ed69251b6c8fa71a4c76d63")
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !449, file: !7, baseType: !12, size: 8, align: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !449, file: !7, baseType: !453, align: 8, offset: 8)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !391, file: !7, align: 8, elements: !454, templateParams: !42, identifier: "ad2eebbeb6c16677e2cecf7281405b3a")
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !453, file: !7, baseType: !168, align: 8)
!456 = !{!44, !457}
!457 = !DITemplateTypeParameter(name: "A", type: !453)
!458 = !DISubroutineType(types: !459)
!459 = !{!442, !396}
!460 = !{!461}
!461 = !DILocalVariable(name: "port", arg: 1, scope: !441, file: !389, line: 134, type: !396)
!462 = !DILocation(line: 134, column: 22, scope: !441)
!463 = !DILocation(line: 135, column: 9, scope: !441)
!464 = !DILocation(line: 139, column: 6, scope: !441)
!465 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17ha0d343901fa23a46E", scope: !418, file: !389, line: 150, type: !466, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !432, retainedNodes: !469)
!466 = !DISubroutineType(types: !467)
!467 = !{!12, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", baseType: !418, size: 64, align: 64, dwarfAddressSpace: 0)
!469 = !{!470}
!470 = !DILocalVariable(name: "self", arg: 1, scope: !465, file: !389, line: 150, type: !468)
!471 = !DILocation(line: 150, column: 24, scope: !465)
!472 = !DILocation(line: 151, column: 36, scope: !465)
!473 = !DILocation(line: 151, column: 18, scope: !465)
!474 = !DILocation(line: 152, column: 6, scope: !465)
!475 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17hd213f1e81433e525E", scope: !390, file: !389, line: 150, type: !476, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !408, retainedNodes: !479)
!476 = !DISubroutineType(types: !477)
!477 = !{!12, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", baseType: !390, size: 64, align: 64, dwarfAddressSpace: 0)
!479 = !{!480}
!480 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !389, line: 150, type: !478)
!481 = !DILocation(line: 150, column: 24, scope: !475)
!482 = !DILocation(line: 151, column: 36, scope: !475)
!483 = !DILocation(line: 151, column: 18, scope: !475)
!484 = !DILocation(line: 152, column: 6, scope: !475)
!485 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h3d9b07908f4a83b8E", scope: !418, file: !389, line: 163, type: !486, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !432, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !468, !12}
!488 = !{!489, !490}
!489 = !DILocalVariable(name: "self", arg: 1, scope: !485, file: !389, line: 163, type: !468)
!490 = !DILocalVariable(name: "value", arg: 2, scope: !485, file: !389, line: 163, type: !12)
!491 = !DILocation(line: 163, column: 25, scope: !485)
!492 = !DILocation(line: 163, column: 36, scope: !485)
!493 = !DILocation(line: 164, column: 35, scope: !485)
!494 = !DILocation(line: 164, column: 18, scope: !485)
!495 = !DILocation(line: 165, column: 6, scope: !485)
!496 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17hcbebc404b82de84fE", scope: !442, file: !389, line: 163, type: !497, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !456, retainedNodes: !500)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499, !12}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", baseType: !442, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !{!501, !502}
!501 = !DILocalVariable(name: "self", arg: 1, scope: !496, file: !389, line: 163, type: !499)
!502 = !DILocalVariable(name: "value", arg: 2, scope: !496, file: !389, line: 163, type: !12)
!503 = !DILocation(line: 163, column: 25, scope: !496)
!504 = !DILocation(line: 163, column: 36, scope: !496)
!505 = !DILocation(line: 164, column: 35, scope: !496)
!506 = !DILocation(line: 164, column: 18, scope: !496)
!507 = !DILocation(line: 165, column: 6, scope: !496)
!508 = distinct !DISubprogram(name: "read_from_port", linkageName: "_ZN6x86_6412instructions4port67_$LT$impl$u20$x86_64..structures..port..PortRead$u20$for$u20$u8$GT$14read_from_port17hf9d70cab70fb54cdE", scope: !509, file: !389, line: 11, type: !510, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !512)
!509 = !DINamespace(name: "{impl#0}", scope: !391)
!510 = !DISubroutineType(types: !511)
!511 = !{!12, !396}
!512 = !{!513, !514}
!513 = !DILocalVariable(name: "port", arg: 1, scope: !508, file: !389, line: 11, type: !396)
!514 = !DILocalVariable(name: "value", scope: !515, file: !389, line: 12, type: !12, align: 1)
!515 = distinct !DILexicalBlock(scope: !508, file: !389, line: 12, column: 9)
!516 = !DILocation(line: 12, column: 13, scope: !515)
!517 = !DILocation(line: 11, column: 30, scope: !508)
!518 = !DILocation(line: 14, column: 13, scope: !515)
!519 = !{i32 420472}
!520 = !DILocation(line: 17, column: 6, scope: !508)
!521 = distinct !DISubprogram(name: "write_to_port", linkageName: "_ZN6x86_6412instructions4port68_$LT$impl$u20$x86_64..structures..port..PortWrite$u20$for$u20$u8$GT$13write_to_port17h89d54a86420a7cc9E", scope: !522, file: !389, line: 44, type: !523, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !525)
!522 = !DINamespace(name: "{impl#3}", scope: !391)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !396, !12}
!525 = !{!526, !527}
!526 = !DILocalVariable(name: "port", arg: 1, scope: !521, file: !389, line: 44, type: !396)
!527 = !DILocalVariable(name: "value", arg: 2, scope: !521, file: !389, line: 44, type: !12)
!528 = !DILocation(line: 44, column: 29, scope: !521)
!529 = !DILocation(line: 44, column: 40, scope: !521)
!530 = !DILocation(line: 46, column: 13, scope: !521)
!531 = !{i32 421251}
!532 = !DILocation(line: 48, column: 6, scope: !521)
!533 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hce769cbdd3de84a4E", scope: !535, file: !534, line: 236, type: !536, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !539)
!534 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "09c36955e811d84967bcb5dbc290ce49")
!535 = !DINamespace(name: "{impl#9}", scope: !229)
!536 = !DISubroutineType(types: !537)
!537 = !{!35, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!539 = !{!540}
!540 = !DILocalVariable(name: "self", arg: 1, scope: !533, file: !534, line: 236, type: !538)
!541 = !DILocation(line: 236, column: 13, scope: !533)
!542 = !DILocation(line: 237, column: 9, scope: !533)
!543 = !DILocation(line: 238, column: 6, scope: !533)
!544 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4init17hbe2aa235581bb972E", scope: !546, file: !545, line: 39, type: !556, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !559)
!545 = !DIFile(filename: "src/mmio.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "6a530ecd49570fb9bf77fb2e8e9e168a")
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "MmioSerialPort", scope: !547, file: !7, size: 384, align: 64, elements: !549, templateParams: !42, identifier: "3c4fa3a95d27c14d9432685ea94fa614")
!547 = !DINamespace(name: "mmio", scope: !548)
!548 = !DINamespace(name: "uart_16550", scope: null)
!549 = !{!550, !551, !552, !553, !554, !555}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !7, baseType: !293, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !546, file: !7, baseType: !293, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !546, file: !7, baseType: !293, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !546, file: !7, baseType: !293, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !546, file: !7, baseType: !293, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !546, file: !7, baseType: !293, size: 64, align: 64, offset: 320)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::mmio::MmioSerialPort", baseType: !546, size: 64, align: 64, dwarfAddressSpace: 0)
!559 = !{!560, !561, !563, !565, !567, !569}
!560 = !DILocalVariable(name: "self", arg: 1, scope: !544, file: !545, line: 39, type: !558)
!561 = !DILocalVariable(name: "self_int_en", scope: !562, file: !545, line: 40, type: !274, align: 8)
!562 = distinct !DILexicalBlock(scope: !544, file: !545, line: 40, column: 9)
!563 = !DILocalVariable(name: "self_line_ctrl", scope: !564, file: !545, line: 41, type: !274, align: 8)
!564 = distinct !DILexicalBlock(scope: !562, file: !545, line: 41, column: 9)
!565 = !DILocalVariable(name: "self_data", scope: !566, file: !545, line: 42, type: !274, align: 8)
!566 = distinct !DILexicalBlock(scope: !564, file: !545, line: 42, column: 9)
!567 = !DILocalVariable(name: "self_fifo_ctrl", scope: !568, file: !545, line: 43, type: !274, align: 8)
!568 = distinct !DILexicalBlock(scope: !566, file: !545, line: 43, column: 9)
!569 = !DILocalVariable(name: "self_modem_ctrl", scope: !570, file: !545, line: 44, type: !274, align: 8)
!570 = distinct !DILexicalBlock(scope: !568, file: !545, line: 44, column: 9)
!571 = !DILocation(line: 39, column: 17, scope: !544)
!572 = !DILocation(line: 40, column: 27, scope: !544)
!573 = !DILocation(line: 40, column: 44, scope: !544)
!574 = !DILocation(line: 40, column: 13, scope: !562)
!575 = !DILocation(line: 41, column: 30, scope: !562)
!576 = !DILocation(line: 41, column: 50, scope: !562)
!577 = !DILocation(line: 41, column: 13, scope: !564)
!578 = !DILocation(line: 42, column: 40, scope: !564)
!579 = !DILocation(line: 42, column: 25, scope: !564)
!580 = !DILocation(line: 42, column: 13, scope: !566)
!581 = !DILocation(line: 43, column: 30, scope: !566)
!582 = !DILocation(line: 43, column: 50, scope: !566)
!583 = !DILocation(line: 43, column: 13, scope: !568)
!584 = !DILocation(line: 44, column: 31, scope: !568)
!585 = !DILocation(line: 44, column: 52, scope: !568)
!586 = !DILocation(line: 44, column: 13, scope: !570)
!587 = !DILocalVariable(name: "self", arg: 1, scope: !588, file: !589, line: 1444, type: !274)
!588 = distinct !DISubprogram(name: "write<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17ha062eee8fcc1a39cE", scope: !590, file: !589, line: 1444, type: !592, scopeLine: 1444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !594)
!589 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "11087a90ad8f3b9862444e143466697a")
!590 = !DINamespace(name: "{impl#0}", scope: !591)
!591 = !DINamespace(name: "mut_ptr", scope: !61)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !274, !12}
!594 = !{!587, !595}
!595 = !DILocalVariable(name: "val", arg: 2, scope: !588, file: !589, line: 1444, type: !12)
!596 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !597)
!597 = distinct !DILocation(line: 47, column: 13, scope: !570)
!598 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !597)
!599 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !597)
!600 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !601)
!601 = distinct !DILocation(line: 50, column: 13, scope: !570)
!602 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !601)
!603 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !601)
!604 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !605)
!605 = distinct !DILocation(line: 53, column: 13, scope: !570)
!606 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !605)
!607 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !605)
!608 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !609)
!609 = distinct !DILocation(line: 54, column: 13, scope: !570)
!610 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !609)
!611 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !609)
!612 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !613)
!613 = distinct !DILocation(line: 57, column: 13, scope: !570)
!614 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !613)
!615 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !613)
!616 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !617)
!617 = distinct !DILocation(line: 61, column: 13, scope: !570)
!618 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !617)
!619 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !617)
!620 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !621)
!621 = distinct !DILocation(line: 65, column: 13, scope: !570)
!622 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !621)
!623 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !621)
!624 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !625)
!625 = distinct !DILocation(line: 68, column: 13, scope: !570)
!626 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !625)
!627 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !625)
!628 = !DILocation(line: 70, column: 6, scope: !544)
!629 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504mmio14MmioSerialPort8line_sts17h6f6ae94a007132d2E", scope: !546, file: !545, line: 72, type: !630, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !635)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !558}
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineStsFlags", scope: !548, file: !7, size: 8, align: 8, elements: !633, templateParams: !42, identifier: "33a7514ae151018aad0561048e643cd0")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !632, file: !7, baseType: !12, size: 8, align: 8)
!635 = !{!636}
!636 = !DILocalVariable(name: "self", arg: 1, scope: !629, file: !545, line: 72, type: !558)
!637 = !DILocation(line: 72, column: 17, scope: !629)
!638 = !DILocation(line: 73, column: 52, scope: !629)
!639 = !DILocation(line: 73, column: 71, scope: !629)
!640 = !DILocation(line: 73, column: 51, scope: !629)
!641 = !DILocation(line: 73, column: 18, scope: !629)
!642 = !DILocation(line: 74, column: 6, scope: !629)
!643 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4send17h46f8df853628b299E", scope: !546, file: !545, line: 77, type: !644, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !646)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !558, !12}
!646 = !{!647, !648, !649}
!647 = !DILocalVariable(name: "self", arg: 1, scope: !643, file: !545, line: 77, type: !558)
!648 = !DILocalVariable(name: "data", arg: 2, scope: !643, file: !545, line: 77, type: !12)
!649 = !DILocalVariable(name: "self_data", scope: !650, file: !545, line: 78, type: !274, align: 8)
!650 = distinct !DILexicalBlock(scope: !643, file: !545, line: 78, column: 9)
!651 = !DILocation(line: 77, column: 17, scope: !643)
!652 = !DILocation(line: 77, column: 28, scope: !643)
!653 = !DILocation(line: 78, column: 40, scope: !643)
!654 = !DILocation(line: 78, column: 25, scope: !643)
!655 = !DILocation(line: 78, column: 13, scope: !650)
!656 = !DILocation(line: 80, column: 13, scope: !650)
!657 = !DILocation(line: 90, column: 31, scope: !650)
!658 = !DILocation(line: 90, column: 21, scope: !650)
!659 = !DILocation(line: 82, column: 31, scope: !650)
!660 = !DILocation(line: 82, column: 21, scope: !650)
!661 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !662)
!662 = distinct !DILocation(line: 91, column: 21, scope: !650)
!663 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !662)
!664 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !662)
!665 = !DILocation(line: 91, column: 21, scope: !650)
!666 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !670)
!667 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h3071c5bbd432a2dbE", scope: !669, file: !668, line: 165, type: !372, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !42)
!668 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdccd67e2121209a433721fb94464813")
!669 = !DINamespace(name: "hint", scope: !11)
!670 = distinct !DILocation(line: 90, column: 21, scope: !650)
!671 = !DILocation(line: 95, column: 6, scope: !643)
!672 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !673)
!673 = distinct !DILocation(line: 83, column: 21, scope: !650)
!674 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !673)
!675 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !673)
!676 = !DILocation(line: 83, column: 21, scope: !650)
!677 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !678)
!678 = distinct !DILocation(line: 82, column: 21, scope: !650)
!679 = !DILocation(line: 84, column: 31, scope: !650)
!680 = !DILocation(line: 84, column: 21, scope: !650)
!681 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !682)
!682 = distinct !DILocation(line: 85, column: 21, scope: !650)
!683 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !682)
!684 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !682)
!685 = !DILocation(line: 85, column: 21, scope: !650)
!686 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !687)
!687 = distinct !DILocation(line: 84, column: 21, scope: !650)
!688 = !DILocation(line: 86, column: 31, scope: !650)
!689 = !DILocation(line: 86, column: 21, scope: !650)
!690 = !DILocation(line: 1444, column: 31, scope: !588, inlinedAt: !691)
!691 = distinct !DILocation(line: 87, column: 21, scope: !650)
!692 = !DILocation(line: 1444, column: 37, scope: !588, inlinedAt: !691)
!693 = !DILocation(line: 1449, column: 18, scope: !588, inlinedAt: !691)
!694 = !DILocation(line: 87, column: 21, scope: !650)
!695 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !696)
!696 = distinct !DILocation(line: 86, column: 21, scope: !650)
!697 = distinct !DISubprogram(name: "receive", linkageName: "_ZN10uart_165504mmio14MmioSerialPort7receive17hd1e267363d68d126E", scope: !546, file: !545, line: 98, type: !698, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{!12, !558}
!700 = !{!701, !702}
!701 = !DILocalVariable(name: "self", arg: 1, scope: !697, file: !545, line: 98, type: !558)
!702 = !DILocalVariable(name: "self_data", scope: !703, file: !545, line: 99, type: !274, align: 8)
!703 = distinct !DILexicalBlock(scope: !697, file: !545, line: 99, column: 9)
!704 = !DILocation(line: 98, column: 20, scope: !697)
!705 = !DILocation(line: 99, column: 40, scope: !697)
!706 = !DILocation(line: 99, column: 25, scope: !697)
!707 = !DILocation(line: 99, column: 13, scope: !703)
!708 = !DILocation(line: 101, column: 23, scope: !703)
!709 = !DILocation(line: 101, column: 13, scope: !703)
!710 = !DILocalVariable(name: "self", arg: 1, scope: !711, file: !589, line: 1293, type: !274)
!711 = distinct !DISubprogram(name: "read<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4read17h94955c9600e3b119E", scope: !590, file: !589, line: 1293, type: !712, scopeLine: 1293, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !43, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{!12, !274}
!714 = !{!710}
!715 = !DILocation(line: 1293, column: 30, scope: !711, inlinedAt: !716)
!716 = distinct !DILocation(line: 102, column: 13, scope: !703)
!717 = !DILocation(line: 1298, column: 18, scope: !711, inlinedAt: !716)
!718 = !DILocation(line: 104, column: 6, scope: !697)
!719 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !720)
!720 = distinct !DILocation(line: 101, column: 13, scope: !703)
!721 = distinct !DISubprogram(name: "write_str", linkageName: "_ZN69_$LT$uart_16550..mmio..MmioSerialPort$u20$as$u20$core..fmt..Write$GT$9write_str17h30313f30b4164dccE", scope: !722, file: !545, line: 108, type: !723, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !725)
!722 = !DINamespace(name: "{impl#1}", scope: !547)
!723 = !DISubroutineType(types: !724)
!724 = !{!159, !558, !89}
!725 = !{!726, !727, !728, !730}
!726 = !DILocalVariable(name: "self", arg: 1, scope: !721, file: !545, line: 108, type: !558)
!727 = !DILocalVariable(name: "s", arg: 2, scope: !721, file: !545, line: 108, type: !89)
!728 = !DILocalVariable(name: "iter", scope: !729, file: !545, line: 109, type: !228, align: 8)
!729 = distinct !DILexicalBlock(scope: !721, file: !545, line: 109, column: 9)
!730 = !DILocalVariable(name: "byte", scope: !731, file: !545, line: 109, type: !12, align: 1)
!731 = distinct !DILexicalBlock(scope: !729, file: !545, line: 109, column: 31)
!732 = !DILocation(line: 108, column: 18, scope: !721)
!733 = !DILocation(line: 108, column: 29, scope: !721)
!734 = !DILocation(line: 109, column: 21, scope: !729)
!735 = !DILocation(line: 109, column: 21, scope: !721)
!736 = !DILocation(line: 109, column: 9, scope: !729)
!737 = !DILocation(line: 112, column: 9, scope: !721)
!738 = !DILocation(line: 113, column: 6, scope: !721)
!739 = !DILocation(line: 109, column: 13, scope: !729)
!740 = !DILocation(line: 109, column: 13, scope: !731)
!741 = !DILocation(line: 110, column: 13, scope: !731)
!742 = distinct !DISubprogram(name: "new", linkageName: "_ZN10uart_165504port10SerialPort3new17h234239137422bde5E", scope: !744, file: !743, line: 23, type: !753, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !755)
!743 = !DIFile(filename: "src/port.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "2b770beb8cfb5c2dd2a7577c385b04ce")
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !745, file: !7, size: 96, align: 16, elements: !746, templateParams: !42, identifier: "6c510780e0485fd28e2b31dbed860fd4")
!745 = !DINamespace(name: "port", scope: !548)
!746 = !{!747, !748, !749, !750, !751, !752}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !744, file: !7, baseType: !418, size: 16, align: 16)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !744, file: !7, baseType: !442, size: 16, align: 16, offset: 16)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !744, file: !7, baseType: !442, size: 16, align: 16, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !744, file: !7, baseType: !442, size: 16, align: 16, offset: 48)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !744, file: !7, baseType: !442, size: 16, align: 16, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !744, file: !7, baseType: !390, size: 16, align: 16, offset: 80)
!753 = !DISubroutineType(types: !754)
!754 = !{!744, !396}
!755 = !{!756}
!756 = !DILocalVariable(name: "base", arg: 1, scope: !742, file: !743, line: 23, type: !396)
!757 = !DILocation(line: 23, column: 29, scope: !742)
!758 = !DILocation(line: 25, column: 19, scope: !742)
!759 = !DILocation(line: 26, column: 40, scope: !742)
!760 = !DILocation(line: 26, column: 21, scope: !742)
!761 = !DILocation(line: 27, column: 43, scope: !742)
!762 = !DILocation(line: 27, column: 24, scope: !742)
!763 = !DILocation(line: 28, column: 43, scope: !742)
!764 = !DILocation(line: 28, column: 24, scope: !742)
!765 = !DILocation(line: 29, column: 44, scope: !742)
!766 = !DILocation(line: 29, column: 25, scope: !742)
!767 = !DILocation(line: 30, column: 41, scope: !742)
!768 = !DILocation(line: 30, column: 23, scope: !742)
!769 = !DILocation(line: 24, column: 9, scope: !742)
!770 = !DILocation(line: 32, column: 6, scope: !742)
!771 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504port10SerialPort4init17h1c025ef3a11ca6bcE", scope: !744, file: !743, line: 37, type: !772, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !775)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !774}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::port::SerialPort", baseType: !744, size: 64, align: 64, dwarfAddressSpace: 0)
!775 = !{!776}
!776 = !DILocalVariable(name: "self", arg: 1, scope: !771, file: !743, line: 37, type: !774)
!777 = !DILocation(line: 37, column: 17, scope: !771)
!778 = !DILocation(line: 40, column: 13, scope: !771)
!779 = !DILocation(line: 43, column: 13, scope: !771)
!780 = !DILocation(line: 46, column: 13, scope: !771)
!781 = !DILocation(line: 47, column: 13, scope: !771)
!782 = !DILocation(line: 50, column: 13, scope: !771)
!783 = !DILocation(line: 54, column: 13, scope: !771)
!784 = !DILocation(line: 58, column: 13, scope: !771)
!785 = !DILocation(line: 61, column: 13, scope: !771)
!786 = !DILocation(line: 63, column: 6, scope: !771)
!787 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504port10SerialPort8line_sts17ha6f4052625334c70E", scope: !744, file: !743, line: 65, type: !788, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{!632, !774}
!790 = !{!791}
!791 = !DILocalVariable(name: "self", arg: 1, scope: !787, file: !743, line: 65, type: !774)
!792 = !DILocation(line: 65, column: 17, scope: !787)
!793 = !DILocation(line: 66, column: 51, scope: !787)
!794 = !DILocation(line: 66, column: 18, scope: !787)
!795 = !DILocation(line: 67, column: 6, scope: !787)
!796 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504port10SerialPort4send17h10e4f2062013a3a4E", scope: !744, file: !743, line: 70, type: !797, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !774, !12}
!799 = !{!800, !801}
!800 = !DILocalVariable(name: "self", arg: 1, scope: !796, file: !743, line: 70, type: !774)
!801 = !DILocalVariable(name: "data", arg: 2, scope: !796, file: !743, line: 70, type: !12)
!802 = !DILocation(line: 70, column: 17, scope: !796)
!803 = !DILocation(line: 70, column: 28, scope: !796)
!804 = !DILocation(line: 72, column: 13, scope: !796)
!805 = !DILocation(line: 82, column: 31, scope: !796)
!806 = !DILocation(line: 82, column: 21, scope: !796)
!807 = !DILocation(line: 74, column: 31, scope: !796)
!808 = !DILocation(line: 74, column: 21, scope: !796)
!809 = !DILocation(line: 83, column: 21, scope: !796)
!810 = !DILocation(line: 175, column: 18, scope: !667, inlinedAt: !811)
!811 = distinct !DILocation(line: 82, column: 21, scope: !796)
