; ModuleID = 'uart_16550.d3fb4069e463be19-cgu.0'
source_filename = "uart_16550.d3fb4069e463be19-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::sync::atomic::AtomicPtr<u8>" = type { ptr }
%"mmio::MmioSerialPort" = type { %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>", %"core::sync::atomic::AtomicPtr<u8>" }
%"port::SerialPort" = type { i16, i16, i16, i16, i16, i16 }
%"core::result::Result<core::convert::Infallible, core::fmt::Error>::Err" = type { %"core::fmt::Error" }
%"core::fmt::Error" = type {}

@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_560206a49c61adca6f3f0639a12632eb = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_c2ea93c90919bb7b1e482f917e413fa1 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18/src/lib.rs/@/uart_16550.d3fb4069e463be19-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18")
!5 = !{!6, !17}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !12)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "rt", scope: !9)
!9 = !DINamespace(name: "fmt", scope: !10)
!10 = !DINamespace(name: "core", scope: null)
!11 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !18, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!18 = !DINamespace(name: "atomic", scope: !19)
!19 = !DINamespace(name: "sync", scope: !10)
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!26 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hb43f0b641fe23064E", scope: !28, file: !27, line: 47, type: !32, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !75, retainedNodes: !73)
!27 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "abbb898986bfead2aa6cf525aee62d89")
!28 = !DINamespace(name: "{impl#1}", scope: !29)
!29 = !DINamespace(name: "copied", scope: !30)
!30 = !DINamespace(name: "adapters", scope: !31)
!31 = !DINamespace(name: "iter", scope: !10)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !49}
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !35, file: !7, size: 16, align: 8, elements: !36, templateParams: !41, identifier: "d999326cdb2d86cb93875f42c3ca316")
!35 = !DINamespace(name: "option", scope: !10)
!36 = !{!37}
!37 = !DICompositeType(tag: DW_TAG_variant_part, scope: !34, file: !7, size: 16, align: 8, elements: !38, templateParams: !41, identifier: "a25ceedbec3dbb2dc59d08e25327561c", discriminator: !48)
!38 = !{!39, !44}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !37, file: !7, baseType: !40, size: 16, align: 8, extraData: i64 0)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !34, file: !7, size: 16, align: 8, elements: !41, templateParams: !42, identifier: "525ce36ddcf0023f6bb645832b9d8d0a")
!41 = !{}
!42 = !{!43}
!43 = !DITemplateTypeParameter(name: "T", type: !11)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !37, file: !7, baseType: !45, size: 16, align: 8, extraData: i64 1)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !34, file: !7, size: 16, align: 8, elements: !46, templateParams: !42, identifier: "5d588492b4cbaa2d454d6d8f02f9b09f")
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !45, file: !7, baseType: !11, size: 8, align: 8, offset: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, scope: !34, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagArtificial)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !29, file: !7, size: 128, align: 64, elements: !51, templateParams: !71, identifier: "817813a15c997cde7be698c91567f656")
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !50, file: !7, baseType: !53, size: 128, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !54, file: !7, size: 128, align: 64, elements: !56, templateParams: !42, identifier: "23684d47cc0ceaab435dbd0c8abda15e")
!54 = !DINamespace(name: "iter", scope: !55)
!55 = !DINamespace(name: "slice", scope: !10)
!56 = !{!57, !64, !65}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, file: !7, baseType: !58, size: 64, align: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !59, file: !7, size: 64, align: 64, elements: !61, templateParams: !42, identifier: "615429c9f980aa9c81dd21d4637ac526")
!59 = !DINamespace(name: "non_null", scope: !60)
!60 = !DINamespace(name: "ptr", scope: !10)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !58, file: !7, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !53, file: !7, baseType: !63, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !53, file: !7, baseType: !66, align: 8)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !67, file: !7, align: 8, elements: !41, templateParams: !68, identifier: "3051d3ccdfb4906ad1bc1a1818b0f8c8")
!67 = !DINamespace(name: "marker", scope: !10)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "T", type: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "I", type: !53)
!73 = !{!74}
!74 = !DILocalVariable(name: "self", arg: 1, scope: !26, file: !27, line: 47, type: !49)
!75 = !{!72, !43}
!76 = !DILocation(line: 47, column: 13, scope: !26)
!77 = !DILocation(line: 48, column: 9, scope: !26)
!78 = !DILocation(line: 49, column: 6, scope: !26)
!79 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h327469f1384c311fE", scope: !81, file: !80, line: 297, type: !207, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !209)
!80 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef87442911d64d819773d1c3d54b7ba2")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !9, file: !7, size: 384, align: 64, elements: !82, templateParams: !41, identifier: "84f4de322c722d4ecf7f26fdd881a12a")
!82 = !{!83, !95, !140}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !81, file: !7, baseType: !84, size: 128, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !85, templateParams: !41, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!85 = !{!86, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !84, file: !7, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !89, templateParams: !41, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !88, file: !7, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !88, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !84, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !81, file: !7, baseType: !96, size: 128, align: 64, offset: 256)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !35, file: !7, size: 128, align: 64, elements: !97, templateParams: !41, identifier: "45e7676749e8833fc9f6788a752fa233")
!97 = !{!98}
!98 = !DICompositeType(tag: DW_TAG_variant_part, scope: !96, file: !7, size: 128, align: 64, elements: !99, templateParams: !41, identifier: "78fc5675d20b0b054937c9b243721b04", discriminator: !139)
!99 = !{!100, !135}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !98, file: !7, baseType: !101, size: 128, align: 64, extraData: i64 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !96, file: !7, size: 128, align: 64, elements: !41, templateParams: !102, identifier: "7d6e0642c5fd326d5dedec8db5f1b626")
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "T", type: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !7, size: 128, align: 64, elements: !105, templateParams: !41, identifier: "2bdd0a1d249b9615818490cbe02637d0")
!105 = !{!106, !134}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !104, file: !7, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !8, file: !7, size: 448, align: 64, elements: !109, templateParams: !41, identifier: "60d1cd8e27ed5e572e6b6b32ddcefdd4")
!109 = !{!110, !111, !113, !114, !116, !133}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !108, file: !7, baseType: !93, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !108, file: !7, baseType: !112, size: 32, align: 32, offset: 320)
!112 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !108, file: !7, baseType: !6, size: 8, align: 8, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !7, baseType: !115, size: 32, align: 32, offset: 352)
!115 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !108, file: !7, baseType: !117, size: 128, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !118, templateParams: !41, identifier: "8e436bf796d1bd1040afe66a54932e93")
!118 = !{!119}
!119 = !DICompositeType(tag: DW_TAG_variant_part, scope: !117, file: !7, size: 128, align: 64, elements: !120, templateParams: !41, identifier: "a16b1bf0ef6abe7338d550f54b3197c9", discriminator: !131)
!120 = !{!121, !125, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !119, file: !7, baseType: !122, size: 128, align: 64, extraData: i64 0)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !117, file: !7, size: 128, align: 64, elements: !123, templateParams: !41, identifier: "bb2788de63ecf655614eae44833a9683")
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !119, file: !7, baseType: !126, size: 128, align: 64, extraData: i64 1)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !117, file: !7, size: 128, align: 64, elements: !127, templateParams: !41, identifier: "45b8dfec94a90db1ad28af7e19954195")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !126, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !119, file: !7, baseType: !130, size: 128, align: 64, extraData: i64 2)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !117, file: !7, size: 128, align: 64, elements: !41, identifier: "b2dd58a70f39c2d6f76f6e2aef3afc0e")
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !117, file: !7, baseType: !132, size: 64, align: 64, flags: DIFlagArtificial)
!132 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !108, file: !7, baseType: !117, size: 128, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !104, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !98, file: !7, baseType: !136, size: 128, align: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !96, file: !7, size: 128, align: 64, elements: !137, templateParams: !102, identifier: "17825c15133f27503bca321877d808b")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !136, file: !7, baseType: !104, size: 128, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !7, baseType: !132, size: 64, align: 64, flags: DIFlagArtificial)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !81, file: !7, baseType: !141, size: 128, align: 64, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !7, size: 128, align: 64, elements: !142, templateParams: !41, identifier: "b8c00ffcd99aa185b2b067e76efe6873")
!142 = !{!143, !206}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !141, file: !7, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 128, align: 64, elements: !146, templateParams: !41, identifier: "92df9959c1cdfbcdd7133c99bcf5419")
!146 = !{!147, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !145, file: !7, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !150, file: !7, align: 8, elements: !41, identifier: "9b221ef387fa4c24dae3649531e7392e")
!150 = !DINamespace(name: "{extern#0}", scope: !8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !145, file: !7, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !148, !174}
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !156, file: !7, size: 8, align: 8, elements: !157, templateParams: !41, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!156 = !DINamespace(name: "result", scope: !10)
!157 = !{!158}
!158 = !DICompositeType(tag: DW_TAG_variant_part, scope: !155, file: !7, size: 8, align: 8, elements: !159, templateParams: !41, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !173)
!159 = !{!160, !169}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !158, file: !7, baseType: !161, size: 8, align: 8, extraData: i64 0)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !155, file: !7, size: 8, align: 8, elements: !162, templateParams: !165, identifier: "d91e207f895b5ed21304fa16506e0f28")
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !161, file: !7, baseType: !164, align: 8, offset: 8)
!164 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!165 = !{!166, !167}
!166 = !DITemplateTypeParameter(name: "T", type: !164)
!167 = !DITemplateTypeParameter(name: "E", type: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !9, file: !7, align: 8, elements: !41, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !158, file: !7, baseType: !170, size: 8, align: 8, extraData: i64 1)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !155, file: !7, size: 8, align: 8, elements: !171, templateParams: !165, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !170, file: !7, baseType: !168, align: 8, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagArtificial)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !9, file: !7, size: 512, align: 64, elements: !176, templateParams: !41, identifier: "bc7f0caae71140a04b17743f5a695b51")
!176 = !{!177, !178, !179, !180, !194, !195}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !175, file: !7, baseType: !115, size: 32, align: 32, offset: 416)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !175, file: !7, baseType: !112, size: 32, align: 32, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !175, file: !7, baseType: !6, size: 8, align: 8, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !175, file: !7, baseType: !181, size: 128, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !35, file: !7, size: 128, align: 64, elements: !182, templateParams: !41, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!182 = !{!183}
!183 = !DICompositeType(tag: DW_TAG_variant_part, scope: !181, file: !7, size: 128, align: 64, elements: !184, templateParams: !41, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !193)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !183, file: !7, baseType: !186, size: 128, align: 64, extraData: i64 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !181, file: !7, size: 128, align: 64, elements: !41, templateParams: !187, identifier: "728f4cb196695ca2ab2ce43263435122")
!187 = !{!188}
!188 = !DITemplateTypeParameter(name: "T", type: !93)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !183, file: !7, baseType: !190, size: 128, align: 64, extraData: i64 1)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !181, file: !7, size: 128, align: 64, elements: !191, templateParams: !187, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !190, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !7, baseType: !132, size: 64, align: 64, flags: DIFlagArtificial)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !175, file: !7, baseType: !181, size: 128, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !175, file: !7, baseType: !196, size: 128, align: 64, offset: 256)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !7, size: 128, align: 64, elements: !197, templateParams: !41, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!197 = !{!198, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !196, file: !7, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !7, align: 8, elements: !41, identifier: "a80c365aa420df7c35abe384a2fa122f")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !196, file: !7, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !203, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 192, align: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 3, lowerBound: 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!81, !84}
!209 = !{!210}
!210 = !DILocalVariable(name: "pieces", arg: 1, scope: !79, file: !80, line: 297, type: !84)
!211 = !DILocation(line: 297, column: 28, scope: !79)
!212 = !DILocation(line: 298, column: 12, scope: !79)
!213 = !DILocation(line: 301, column: 34, scope: !79)
!214 = !DILocation(line: 301, column: 9, scope: !79)
!215 = !{i64 8}
!216 = !DILocation(line: 302, column: 6, scope: !79)
!217 = !DILocation(line: 299, column: 13, scope: !79)
!218 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17hf44f21aedb77bec1E", scope: !220, file: !219, line: 856, type: !222, scopeLine: 856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !228)
!219 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8f91e5aecc982717403f5cbdc23932fe")
!220 = !DINamespace(name: "{impl#0}", scope: !221)
!221 = !DINamespace(name: "str", scope: !10)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !88}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !225, file: !7, size: 128, align: 64, elements: !226, templateParams: !41, identifier: "99ffaa4bca3c23c6d9671d2fd0e5f376")
!225 = !DINamespace(name: "iter", scope: !221)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !7, baseType: !50, size: 128, align: 64)
!228 = !{!229}
!229 = !DILocalVariable(name: "self", arg: 1, scope: !218, file: !219, line: 856, type: !88)
!230 = !DILocation(line: 856, column: 18, scope: !218)
!231 = !DILocalVariable(name: "self", arg: 1, scope: !232, file: !219, line: 324, type: !88)
!232 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h4fe199bdf74d5d82E", scope: !220, file: !219, line: 324, type: !233, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !239)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !88}
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !7, size: 128, align: 64, elements: !236, templateParams: !41, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !235, file: !7, baseType: !91, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !235, file: !7, baseType: !93, size: 64, align: 64, offset: 64)
!239 = !{!231}
!240 = !DILocation(line: 324, column: 27, scope: !232, inlinedAt: !241)
!241 = distinct !DILocation(line: 857, column: 15, scope: !218)
!242 = !DILocation(line: 327, column: 6, scope: !232, inlinedAt: !241)
!243 = !DILocation(line: 857, column: 15, scope: !218)
!244 = !DILocation(line: 857, column: 9, scope: !218)
!245 = !DILocation(line: 858, column: 6, scope: !218)
!246 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17hab708cbe3923bd12E", scope: !248, file: !247, line: 3310, type: !251, scopeLine: 3310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !255, retainedNodes: !253)
!247 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "95e88b6c652e0490e905763009955c97")
!248 = !DINamespace(name: "Iterator", scope: !249)
!249 = !DINamespace(name: "iterator", scope: !250)
!250 = !DINamespace(name: "traits", scope: !31)
!251 = !DISubroutineType(types: !252)
!252 = !{!50, !53}
!253 = !{!254}
!254 = !DILocalVariable(name: "self", arg: 1, scope: !246, file: !247, line: 3310, type: !53)
!255 = !{!256, !43}
!256 = !DITemplateTypeParameter(name: "Self", type: !53)
!257 = !DILocation(line: 3310, column: 26, scope: !246)
!258 = !DILocation(line: 3315, column: 9, scope: !246)
!259 = !DILocation(line: 3316, column: 6, scope: !246)
!260 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17h974822dcccb3e17eE", scope: !50, file: !27, line: 26, type: !251, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !71, retainedNodes: !261)
!261 = !{!262}
!262 = !DILocalVariable(name: "it", arg: 1, scope: !260, file: !27, line: 26, type: !53)
!263 = !DILocation(line: 26, column: 32, scope: !260)
!264 = !DILocation(line: 27, column: 9, scope: !260)
!265 = !DILocation(line: 28, column: 6, scope: !260)
!266 = distinct !DISubprogram(name: "atomic_load<*mut u8>", linkageName: "_ZN4core4sync6atomic11atomic_load17h5ae3f090cfa809d7E", scope: !18, file: !267, line: 3149, type: !268, scopeLine: 3149, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !275, retainedNodes: !272)
!267 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "f10535d78bf61205f540f8fe0965908b")
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !271, !17}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *mut u8", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!272 = !{!273, !274}
!273 = !DILocalVariable(name: "dst", arg: 1, scope: !266, file: !267, line: 3149, type: !271)
!274 = !DILocalVariable(name: "order", arg: 2, scope: !266, file: !267, line: 3149, type: !17)
!275 = !{!276}
!276 = !DITemplateTypeParameter(name: "T", type: !270)
!277 = !DILocation(line: 3149, column: 32, scope: !266)
!278 = !DILocation(line: 3149, column: 47, scope: !266)
!279 = !DILocation(line: 3152, column: 15, scope: !266)
!280 = !{i8 0, i8 5}
!281 = !DILocation(line: 3152, column: 9, scope: !266)
!282 = !DILocation(line: 3153, column: 24, scope: !266)
!283 = !DILocation(line: 3156, column: 24, scope: !266)
!284 = !DILocation(line: 3154, column: 24, scope: !266)
!285 = !DILocation(line: 3157, column: 23, scope: !266)
!286 = !DILocation(line: 3155, column: 23, scope: !266)
!287 = !DILocation(line: 3160, column: 2, scope: !266)
!288 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$3new17h77595b154dc48d96E", scope: !289, file: !267, line: 1060, type: !296, scopeLine: 1060, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !298)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<u8>", scope: !18, file: !7, size: 64, align: 64, elements: !290, templateParams: !42, identifier: "dda5950945de1717a7c972d7b1766495")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !289, file: !7, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut u8>", scope: !293, file: !7, size: 64, align: 64, elements: !294, templateParams: !275, identifier: "b4b0f330217becaac9162137c89cdb6d")
!293 = !DINamespace(name: "cell", scope: !10)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !7, baseType: !270, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!289, !270}
!298 = !{!299}
!299 = !DILocalVariable(name: "p", arg: 1, scope: !288, file: !267, line: 1060, type: !270)
!300 = !DILocation(line: 1060, column: 22, scope: !288)
!301 = !DILocalVariable(name: "value", arg: 1, scope: !302, file: !303, line: 2009, type: !270)
!302 = distinct !DISubprogram(name: "new<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h240dd6f667defd75E", scope: !292, file: !303, line: 2009, type: !304, scopeLine: 2009, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !275, retainedNodes: !306)
!303 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece7037919146d853ca689245947aa67")
!304 = !DISubroutineType(types: !305)
!305 = !{!292, !270}
!306 = !{!301}
!307 = !DILocation(line: 2009, column: 22, scope: !302, inlinedAt: !308)
!308 = distinct !DILocation(line: 1061, column: 24, scope: !288)
!309 = !DILocation(line: 2010, column: 9, scope: !302, inlinedAt: !308)
!310 = !DILocation(line: 2011, column: 6, scope: !302, inlinedAt: !308)
!311 = !DILocation(line: 1061, column: 9, scope: !288)
!312 = !DILocation(line: 1062, column: 6, scope: !288)
!313 = distinct !DISubprogram(name: "load<u8>", linkageName: "_ZN4core4sync6atomic18AtomicPtr$LT$T$GT$4load17h59de5154e3ce6c26E", scope: !289, file: !267, line: 1277, type: !314, scopeLine: 1277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !317)
!314 = !DISubroutineType(types: !315)
!315 = !{!270, !316, !17}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicPtr<u8>", baseType: !289, size: 64, align: 64, dwarfAddressSpace: 0)
!317 = !{!318, !319}
!318 = !DILocalVariable(name: "self", arg: 1, scope: !313, file: !267, line: 1277, type: !316)
!319 = !DILocalVariable(name: "order", arg: 2, scope: !313, file: !267, line: 1277, type: !17)
!320 = !DILocation(line: 1277, column: 17, scope: !313)
!321 = !DILocation(line: 1277, column: 24, scope: !313)
!322 = !DILocalVariable(name: "self", arg: 1, scope: !323, file: !303, line: 2052, type: !327)
!323 = distinct !DISubprogram(name: "get<*mut u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h7cbe8b77fa7fc35bE", scope: !292, file: !303, line: 2052, type: !324, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !275, retainedNodes: !328)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut u8", baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<*mut u8>", baseType: !292, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !{!322}
!329 = !DILocation(line: 2052, column: 22, scope: !323, inlinedAt: !330)
!330 = distinct !DILocation(line: 1279, column: 30, scope: !313)
!331 = !DILocation(line: 1279, column: 18, scope: !313)
!332 = !DILocation(line: 1280, column: 6, scope: !313)
!333 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17h030ebaebf73f8c34E", scope: !335, file: !334, line: 1810, type: !346, scopeLine: 1810, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !348)
!334 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "6a7876186cbb9dd5ab8c859a9681e99e")
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !35, file: !7, size: 64, align: 64, elements: !336, templateParams: !41, identifier: "7f79abd0e8e453efecb3a5705a890e4b")
!336 = !{!337}
!337 = !DICompositeType(tag: DW_TAG_variant_part, scope: !335, file: !7, size: 64, align: 64, elements: !338, templateParams: !41, identifier: "8405789f24f85d513bc5345766c6be4", discriminator: !345)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !337, file: !7, baseType: !340, size: 64, align: 64, extraData: i64 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !335, file: !7, size: 64, align: 64, elements: !41, templateParams: !68, identifier: "e63c080f871b4cfa4447c6078c683ea8")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !337, file: !7, baseType: !342, size: 64, align: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !335, file: !7, size: 64, align: 64, elements: !343, templateParams: !68, identifier: "551ea0c79f5ade7df02a239be88136b7")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !342, file: !7, baseType: !70, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, scope: !335, file: !7, baseType: !132, size: 64, align: 64, flags: DIFlagArtificial)
!346 = !DISubroutineType(types: !347)
!347 = !{!34, !335}
!348 = !{!349, !350}
!349 = !DILocalVariable(name: "self", arg: 1, scope: !333, file: !334, line: 1810, type: !335)
!350 = !DILocalVariable(name: "v", scope: !351, file: !334, line: 1817, type: !11, align: 1)
!351 = distinct !DILexicalBlock(scope: !333, file: !334, line: 1817, column: 13)
!352 = !DILocation(line: 1810, column: 25, scope: !333)
!353 = !DILocation(line: 1816, column: 15, scope: !333)
!354 = !DILocation(line: 1816, column: 9, scope: !333)
!355 = !DILocation(line: 1818, column: 21, scope: !333)
!356 = !DILocation(line: 1817, column: 19, scope: !333)
!357 = !{i64 1}
!358 = !DILocation(line: 1817, column: 19, scope: !351)
!359 = !DILocation(line: 1817, column: 25, scope: !351)
!360 = !DILocation(line: 1817, column: 31, scope: !333)
!361 = !DILocation(line: 1820, column: 6, scope: !333)
!362 = !{i8 0, i8 2}
!363 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17h6a42051fcd6ad9adE", scope: !365, file: !364, line: 22, type: !368, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !41)
!364 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "af15c06b8fe0c45637e9a1b14f5b1c62")
!365 = !DINamespace(name: "sse2", scope: !366)
!366 = !DINamespace(name: "x86", scope: !367)
!367 = !DINamespace(name: "core_arch", scope: !10)
!368 = !DISubroutineType(types: !369)
!369 = !{null}
!370 = !DILocation(line: 25, column: 5, scope: !363)
!371 = !DILocation(line: 26, column: 2, scope: !363)
!372 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17hdf13611e430913f3E", scope: !374, file: !373, line: 271, type: !376, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !380, retainedNodes: !378)
!373 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "a39b82fc812ed30b3e6ebda5fbc56490")
!374 = !DINamespace(name: "{impl#0}", scope: !375)
!375 = !DINamespace(name: "collect", scope: !250)
!376 = !DISubroutineType(types: !377)
!377 = !{!224, !224}
!378 = !{!379}
!379 = !DILocalVariable(name: "self", arg: 1, scope: !372, file: !373, line: 271, type: !224)
!380 = !{!381}
!381 = !DITemplateTypeParameter(name: "I", type: !224)
!382 = !DILocation(line: 271, column: 18, scope: !372)
!383 = !DILocation(line: 273, column: 6, scope: !372)
!384 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h1e29a2405818df41E", scope: !386, file: !385, line: 134, type: !406, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !404, retainedNodes: !408)
!385 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/instructions/port.rs", directory: "", checksumkind: CSK_MD5, checksum: "d2d89e3a4061823cc5bef50c152ccf5c")
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !387, file: !7, size: 16, align: 16, elements: !390, templateParams: !404, identifier: "c3a533e8b8615a76d657ef1acc22dc20")
!387 = !DINamespace(name: "port", scope: !388)
!388 = !DINamespace(name: "instructions", scope: !389)
!389 = !DINamespace(name: "x86_64", scope: null)
!390 = !{!391, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !386, file: !7, baseType: !392, size: 16, align: 16)
!392 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !386, file: !7, baseType: !394, align: 8)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !67, file: !7, align: 8, elements: !41, templateParams: !395, identifier: "57bead6024b7dfa9330620895d694ea6")
!395 = !{!396}
!396 = !DITemplateTypeParameter(name: "T", type: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !7, size: 8, align: 8, elements: !398, templateParams: !41, identifier: "26ee74012beacbfc8ee2449d78cb9179")
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !397, file: !7, baseType: !11, size: 8, align: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !397, file: !7, baseType: !401, align: 8, offset: 8)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !387, file: !7, align: 8, elements: !402, templateParams: !41, identifier: "dc8d7a3e52183a47225eb87e6874bf7c")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !7, baseType: !164, align: 8)
!404 = !{!43, !405}
!405 = !DITemplateTypeParameter(name: "A", type: !401)
!406 = !DISubroutineType(types: !407)
!407 = !{!386, !392}
!408 = !{!409}
!409 = !DILocalVariable(name: "port", arg: 1, scope: !384, file: !385, line: 134, type: !392)
!410 = !DILocation(line: 134, column: 22, scope: !384)
!411 = !DILocation(line: 135, column: 9, scope: !384)
!412 = !DILocation(line: 139, column: 6, scope: !384)
!413 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17h9a44bc32e0fd6f3fE", scope: !414, file: !385, line: 134, type: !430, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !428, retainedNodes: !432)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", scope: !387, file: !7, size: 16, align: 16, elements: !415, templateParams: !428, identifier: "b4431bca1bcd3753c4002641e9e92305")
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !414, file: !7, baseType: !392, size: 16, align: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !414, file: !7, baseType: !418, align: 8)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::WriteOnlyAccess)>", scope: !67, file: !7, align: 8, elements: !41, templateParams: !419, identifier: "c67dcc86fcd75eb8681fb238d3de2f81")
!419 = !{!420}
!420 = !DITemplateTypeParameter(name: "T", type: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::WriteOnlyAccess)", file: !7, size: 8, align: 8, elements: !422, templateParams: !41, identifier: "bbb1c7cd0bb21ede55d5448878931f3f")
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !421, file: !7, baseType: !11, size: 8, align: 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !421, file: !7, baseType: !425, align: 8, offset: 8)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "WriteOnlyAccess", scope: !387, file: !7, align: 8, elements: !426, templateParams: !41, identifier: "f849551834bee6fbcb9b0372e9db7fea")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !425, file: !7, baseType: !164, align: 8)
!428 = !{!43, !429}
!429 = !DITemplateTypeParameter(name: "A", type: !425)
!430 = !DISubroutineType(types: !431)
!431 = !{!414, !392}
!432 = !{!433}
!433 = !DILocalVariable(name: "port", arg: 1, scope: !413, file: !385, line: 134, type: !392)
!434 = !DILocation(line: 134, column: 22, scope: !413)
!435 = !DILocation(line: 135, column: 9, scope: !413)
!436 = !DILocation(line: 139, column: 6, scope: !413)
!437 = distinct !DISubprogram(name: "new<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$3new17he26a91016c6e43c4E", scope: !438, file: !385, line: 134, type: !454, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !452, retainedNodes: !456)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", scope: !387, file: !7, size: 16, align: 16, elements: !439, templateParams: !452, identifier: "a4010d8eda104223c34b1d33ec1cbf54")
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !438, file: !7, baseType: !392, size: 16, align: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !438, file: !7, baseType: !442, align: 8)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadOnlyAccess)>", scope: !67, file: !7, align: 8, elements: !41, templateParams: !443, identifier: "758ae4749cee6f03dbcaecba4a8c4b75")
!443 = !{!444}
!444 = !DITemplateTypeParameter(name: "T", type: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadOnlyAccess)", file: !7, size: 8, align: 8, elements: !446, templateParams: !41, identifier: "c804277b3fbf99448ba5f0677a74dd6")
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !7, baseType: !11, size: 8, align: 8)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !445, file: !7, baseType: !449, align: 8, offset: 8)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOnlyAccess", scope: !387, file: !7, align: 8, elements: !450, templateParams: !41, identifier: "eb63fa85de98ec4143e7405a4fad1d37")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !449, file: !7, baseType: !164, align: 8)
!452 = !{!43, !453}
!453 = !DITemplateTypeParameter(name: "A", type: !449)
!454 = !DISubroutineType(types: !455)
!455 = !{!438, !392}
!456 = !{!457}
!457 = !DILocalVariable(name: "port", arg: 1, scope: !437, file: !385, line: 134, type: !392)
!458 = !DILocation(line: 134, column: 22, scope: !437)
!459 = !DILocation(line: 135, column: 9, scope: !437)
!460 = !DILocation(line: 139, column: 6, scope: !437)
!461 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17h638056c3b032050cE", scope: !386, file: !385, line: 150, type: !462, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !404, retainedNodes: !465)
!462 = !DISubroutineType(types: !463)
!463 = !{!11, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", baseType: !386, size: 64, align: 64, dwarfAddressSpace: 0)
!465 = !{!466}
!466 = !DILocalVariable(name: "self", arg: 1, scope: !461, file: !385, line: 150, type: !464)
!467 = !DILocation(line: 150, column: 24, scope: !461)
!468 = !DILocation(line: 151, column: 36, scope: !461)
!469 = !DILocation(line: 151, column: 18, scope: !461)
!470 = !DILocation(line: 152, column: 6, scope: !461)
!471 = distinct !DISubprogram(name: "read<u8, x86_64::instructions::port::ReadOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$4read17h99f9aae119240fe7E", scope: !438, file: !385, line: 150, type: !472, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !452, retainedNodes: !475)
!472 = !DISubroutineType(types: !473)
!473 = !{!11, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::ReadOnlyAccess>", baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!475 = !{!476}
!476 = !DILocalVariable(name: "self", arg: 1, scope: !471, file: !385, line: 150, type: !474)
!477 = !DILocation(line: 150, column: 24, scope: !471)
!478 = !DILocation(line: 151, column: 36, scope: !471)
!479 = !DILocation(line: 151, column: 18, scope: !471)
!480 = !DILocation(line: 152, column: 6, scope: !471)
!481 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::ReadWriteAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h545b98dbfdc62e84E", scope: !386, file: !385, line: 163, type: !482, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !404, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !464, !11}
!484 = !{!485, !486}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !481, file: !385, line: 163, type: !464)
!486 = !DILocalVariable(name: "value", arg: 2, scope: !481, file: !385, line: 163, type: !11)
!487 = !DILocation(line: 163, column: 25, scope: !481)
!488 = !DILocation(line: 163, column: 36, scope: !481)
!489 = !DILocation(line: 164, column: 35, scope: !481)
!490 = !DILocation(line: 164, column: 18, scope: !481)
!491 = !DILocation(line: 165, column: 6, scope: !481)
!492 = distinct !DISubprogram(name: "write<u8, x86_64::instructions::port::WriteOnlyAccess>", linkageName: "_ZN6x86_6412instructions4port24PortGeneric$LT$T$C$A$GT$5write17h94256bc508496635E", scope: !414, file: !385, line: 163, type: !493, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !428, retainedNodes: !496)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495, !11}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::instructions::port::PortGeneric<u8, x86_64::instructions::port::WriteOnlyAccess>", baseType: !414, size: 64, align: 64, dwarfAddressSpace: 0)
!496 = !{!497, !498}
!497 = !DILocalVariable(name: "self", arg: 1, scope: !492, file: !385, line: 163, type: !495)
!498 = !DILocalVariable(name: "value", arg: 2, scope: !492, file: !385, line: 163, type: !11)
!499 = !DILocation(line: 163, column: 25, scope: !492)
!500 = !DILocation(line: 163, column: 36, scope: !492)
!501 = !DILocation(line: 164, column: 35, scope: !492)
!502 = !DILocation(line: 164, column: 18, scope: !492)
!503 = !DILocation(line: 165, column: 6, scope: !492)
!504 = distinct !DISubprogram(name: "read_from_port", linkageName: "_ZN6x86_6412instructions4port67_$LT$impl$u20$x86_64..structures..port..PortRead$u20$for$u20$u8$GT$14read_from_port17h3400938ccd8be539E", scope: !505, file: !385, line: 11, type: !506, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !508)
!505 = !DINamespace(name: "{impl#0}", scope: !387)
!506 = !DISubroutineType(types: !507)
!507 = !{!11, !392}
!508 = !{!509, !510}
!509 = !DILocalVariable(name: "port", arg: 1, scope: !504, file: !385, line: 11, type: !392)
!510 = !DILocalVariable(name: "value", scope: !511, file: !385, line: 12, type: !11, align: 1)
!511 = distinct !DILexicalBlock(scope: !504, file: !385, line: 12, column: 9)
!512 = !DILocation(line: 12, column: 13, scope: !511)
!513 = !DILocation(line: 11, column: 30, scope: !504)
!514 = !DILocation(line: 14, column: 13, scope: !511)
!515 = !{i32 417794}
!516 = !DILocation(line: 17, column: 6, scope: !504)
!517 = distinct !DISubprogram(name: "write_to_port", linkageName: "_ZN6x86_6412instructions4port68_$LT$impl$u20$x86_64..structures..port..PortWrite$u20$for$u20$u8$GT$13write_to_port17h56d8e2929fee3c25E", scope: !518, file: !385, line: 44, type: !519, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !521)
!518 = !DINamespace(name: "{impl#3}", scope: !387)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !392, !11}
!521 = !{!522, !523}
!522 = !DILocalVariable(name: "port", arg: 1, scope: !517, file: !385, line: 44, type: !392)
!523 = !DILocalVariable(name: "value", arg: 2, scope: !517, file: !385, line: 44, type: !11)
!524 = !DILocation(line: 44, column: 29, scope: !517)
!525 = !DILocation(line: 44, column: 40, scope: !517)
!526 = !DILocation(line: 46, column: 13, scope: !517)
!527 = !{i32 418573}
!528 = !DILocation(line: 48, column: 6, scope: !517)
!529 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h79ed18d1b0bee1faE", scope: !531, file: !530, line: 236, type: !532, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !535)
!530 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "09c36955e811d84967bcb5dbc290ce49")
!531 = !DINamespace(name: "{impl#9}", scope: !225)
!532 = !DISubroutineType(types: !533)
!533 = !{!34, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!535 = !{!536}
!536 = !DILocalVariable(name: "self", arg: 1, scope: !529, file: !530, line: 236, type: !534)
!537 = !DILocation(line: 236, column: 13, scope: !529)
!538 = !DILocation(line: 237, column: 9, scope: !529)
!539 = !DILocation(line: 238, column: 6, scope: !529)
!540 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4init17hc805f6859241f350E", scope: !542, file: !541, line: 39, type: !552, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !555)
!541 = !DIFile(filename: "src/mmio.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "6a530ecd49570fb9bf77fb2e8e9e168a")
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "MmioSerialPort", scope: !543, file: !7, size: 384, align: 64, elements: !545, templateParams: !41, identifier: "59f89b4e9ba9a3b56acc4609dc3948db")
!543 = !DINamespace(name: "mmio", scope: !544)
!544 = !DINamespace(name: "uart_16550", scope: null)
!545 = !{!546, !547, !548, !549, !550, !551}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !7, baseType: !289, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !542, file: !7, baseType: !289, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !542, file: !7, baseType: !289, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !542, file: !7, baseType: !289, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !542, file: !7, baseType: !289, size: 64, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !542, file: !7, baseType: !289, size: 64, align: 64, offset: 320)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::mmio::MmioSerialPort", baseType: !542, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !{!556, !557, !559, !561, !563, !565}
!556 = !DILocalVariable(name: "self", arg: 1, scope: !540, file: !541, line: 39, type: !554)
!557 = !DILocalVariable(name: "self_int_en", scope: !558, file: !541, line: 40, type: !270, align: 8)
!558 = distinct !DILexicalBlock(scope: !540, file: !541, line: 40, column: 9)
!559 = !DILocalVariable(name: "self_line_ctrl", scope: !560, file: !541, line: 41, type: !270, align: 8)
!560 = distinct !DILexicalBlock(scope: !558, file: !541, line: 41, column: 9)
!561 = !DILocalVariable(name: "self_data", scope: !562, file: !541, line: 42, type: !270, align: 8)
!562 = distinct !DILexicalBlock(scope: !560, file: !541, line: 42, column: 9)
!563 = !DILocalVariable(name: "self_fifo_ctrl", scope: !564, file: !541, line: 43, type: !270, align: 8)
!564 = distinct !DILexicalBlock(scope: !562, file: !541, line: 43, column: 9)
!565 = !DILocalVariable(name: "self_modem_ctrl", scope: !566, file: !541, line: 44, type: !270, align: 8)
!566 = distinct !DILexicalBlock(scope: !564, file: !541, line: 44, column: 9)
!567 = !DILocation(line: 39, column: 17, scope: !540)
!568 = !DILocation(line: 40, column: 27, scope: !540)
!569 = !DILocation(line: 40, column: 44, scope: !540)
!570 = !DILocation(line: 40, column: 13, scope: !558)
!571 = !DILocation(line: 41, column: 30, scope: !558)
!572 = !DILocation(line: 41, column: 50, scope: !558)
!573 = !DILocation(line: 41, column: 13, scope: !560)
!574 = !DILocation(line: 42, column: 40, scope: !560)
!575 = !DILocation(line: 42, column: 25, scope: !560)
!576 = !DILocation(line: 42, column: 13, scope: !562)
!577 = !DILocation(line: 43, column: 30, scope: !562)
!578 = !DILocation(line: 43, column: 50, scope: !562)
!579 = !DILocation(line: 43, column: 13, scope: !564)
!580 = !DILocation(line: 44, column: 31, scope: !564)
!581 = !DILocation(line: 44, column: 52, scope: !564)
!582 = !DILocation(line: 44, column: 13, scope: !566)
!583 = !DILocalVariable(name: "self", arg: 1, scope: !584, file: !585, line: 1462, type: !270)
!584 = distinct !DISubprogram(name: "write<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17h345a603e14f390daE", scope: !586, file: !585, line: 1462, type: !588, scopeLine: 1462, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !590)
!585 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a6afd5ac69802a5308a55262a61b144")
!586 = !DINamespace(name: "{impl#0}", scope: !587)
!587 = !DINamespace(name: "mut_ptr", scope: !60)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !270, !11}
!590 = !{!583, !591}
!591 = !DILocalVariable(name: "val", arg: 2, scope: !584, file: !585, line: 1462, type: !11)
!592 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !593)
!593 = distinct !DILocation(line: 47, column: 13, scope: !566)
!594 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !593)
!595 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !593)
!596 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !597)
!597 = distinct !DILocation(line: 50, column: 13, scope: !566)
!598 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !597)
!599 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !597)
!600 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !601)
!601 = distinct !DILocation(line: 53, column: 13, scope: !566)
!602 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !601)
!603 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !601)
!604 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !605)
!605 = distinct !DILocation(line: 54, column: 13, scope: !566)
!606 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !605)
!607 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !605)
!608 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !609)
!609 = distinct !DILocation(line: 57, column: 13, scope: !566)
!610 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !609)
!611 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !609)
!612 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !613)
!613 = distinct !DILocation(line: 61, column: 13, scope: !566)
!614 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !613)
!615 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !613)
!616 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !617)
!617 = distinct !DILocation(line: 65, column: 13, scope: !566)
!618 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !617)
!619 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !617)
!620 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !621)
!621 = distinct !DILocation(line: 68, column: 13, scope: !566)
!622 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !621)
!623 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !621)
!624 = !DILocation(line: 70, column: 6, scope: !540)
!625 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504mmio14MmioSerialPort8line_sts17ha293fa0dfab248aaE", scope: !542, file: !541, line: 72, type: !626, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !631)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !554}
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineStsFlags", scope: !544, file: !7, size: 8, align: 8, elements: !629, templateParams: !41, identifier: "5eb4e407a3574537dbf2e8de113ffefe")
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !628, file: !7, baseType: !11, size: 8, align: 8)
!631 = !{!632}
!632 = !DILocalVariable(name: "self", arg: 1, scope: !625, file: !541, line: 72, type: !554)
!633 = !DILocation(line: 72, column: 17, scope: !625)
!634 = !DILocation(line: 73, column: 52, scope: !625)
!635 = !DILocation(line: 73, column: 71, scope: !625)
!636 = !DILocation(line: 73, column: 51, scope: !625)
!637 = !DILocation(line: 73, column: 18, scope: !625)
!638 = !DILocation(line: 74, column: 6, scope: !625)
!639 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504mmio14MmioSerialPort4send17hd275dcccd90a888eE", scope: !542, file: !541, line: 77, type: !640, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !554, !11}
!642 = !{!643, !644, !645}
!643 = !DILocalVariable(name: "self", arg: 1, scope: !639, file: !541, line: 77, type: !554)
!644 = !DILocalVariable(name: "data", arg: 2, scope: !639, file: !541, line: 77, type: !11)
!645 = !DILocalVariable(name: "self_data", scope: !646, file: !541, line: 78, type: !270, align: 8)
!646 = distinct !DILexicalBlock(scope: !639, file: !541, line: 78, column: 9)
!647 = !DILocation(line: 77, column: 17, scope: !639)
!648 = !DILocation(line: 77, column: 28, scope: !639)
!649 = !DILocation(line: 78, column: 40, scope: !639)
!650 = !DILocation(line: 78, column: 25, scope: !639)
!651 = !DILocation(line: 78, column: 13, scope: !646)
!652 = !DILocation(line: 80, column: 13, scope: !646)
!653 = !DILocation(line: 90, column: 31, scope: !646)
!654 = !DILocation(line: 90, column: 21, scope: !646)
!655 = !DILocation(line: 82, column: 31, scope: !646)
!656 = !DILocation(line: 82, column: 21, scope: !646)
!657 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !658)
!658 = distinct !DILocation(line: 91, column: 21, scope: !646)
!659 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !658)
!660 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !658)
!661 = !DILocation(line: 91, column: 21, scope: !646)
!662 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !666)
!663 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17hc0e2a9f594bad71dE", scope: !665, file: !664, line: 165, type: !368, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !41)
!664 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "abfb30215b829e2044a72c49db9551bc")
!665 = !DINamespace(name: "hint", scope: !10)
!666 = distinct !DILocation(line: 90, column: 21, scope: !646)
!667 = !DILocation(line: 95, column: 6, scope: !639)
!668 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !669)
!669 = distinct !DILocation(line: 83, column: 21, scope: !646)
!670 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !669)
!671 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !669)
!672 = !DILocation(line: 83, column: 21, scope: !646)
!673 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !674)
!674 = distinct !DILocation(line: 82, column: 21, scope: !646)
!675 = !DILocation(line: 84, column: 31, scope: !646)
!676 = !DILocation(line: 84, column: 21, scope: !646)
!677 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !678)
!678 = distinct !DILocation(line: 85, column: 21, scope: !646)
!679 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !678)
!680 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !678)
!681 = !DILocation(line: 85, column: 21, scope: !646)
!682 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !683)
!683 = distinct !DILocation(line: 84, column: 21, scope: !646)
!684 = !DILocation(line: 86, column: 31, scope: !646)
!685 = !DILocation(line: 86, column: 21, scope: !646)
!686 = !DILocation(line: 1462, column: 31, scope: !584, inlinedAt: !687)
!687 = distinct !DILocation(line: 87, column: 21, scope: !646)
!688 = !DILocation(line: 1462, column: 37, scope: !584, inlinedAt: !687)
!689 = !DILocation(line: 1467, column: 18, scope: !584, inlinedAt: !687)
!690 = !DILocation(line: 87, column: 21, scope: !646)
!691 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !692)
!692 = distinct !DILocation(line: 86, column: 21, scope: !646)
!693 = distinct !DISubprogram(name: "receive", linkageName: "_ZN10uart_165504mmio14MmioSerialPort7receive17hc18e2d2826c00527E", scope: !542, file: !541, line: 98, type: !694, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{!11, !554}
!696 = !{!697, !698}
!697 = !DILocalVariable(name: "self", arg: 1, scope: !693, file: !541, line: 98, type: !554)
!698 = !DILocalVariable(name: "self_data", scope: !699, file: !541, line: 99, type: !270, align: 8)
!699 = distinct !DILexicalBlock(scope: !693, file: !541, line: 99, column: 9)
!700 = !DILocation(line: 98, column: 20, scope: !693)
!701 = !DILocation(line: 99, column: 40, scope: !693)
!702 = !DILocation(line: 99, column: 25, scope: !693)
!703 = !DILocation(line: 99, column: 13, scope: !699)
!704 = !DILocation(line: 101, column: 23, scope: !699)
!705 = !DILocation(line: 101, column: 13, scope: !699)
!706 = !DILocalVariable(name: "self", arg: 1, scope: !707, file: !585, line: 1311, type: !270)
!707 = distinct !DISubprogram(name: "read<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4read17hb184b63f9b43bba3E", scope: !586, file: !585, line: 1311, type: !708, scopeLine: 1311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !42, retainedNodes: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!11, !270}
!710 = !{!706}
!711 = !DILocation(line: 1311, column: 30, scope: !707, inlinedAt: !712)
!712 = distinct !DILocation(line: 102, column: 13, scope: !699)
!713 = !DILocation(line: 1316, column: 18, scope: !707, inlinedAt: !712)
!714 = !DILocation(line: 104, column: 6, scope: !693)
!715 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !716)
!716 = distinct !DILocation(line: 101, column: 13, scope: !699)
!717 = distinct !DISubprogram(name: "write_str", linkageName: "_ZN69_$LT$uart_16550..mmio..MmioSerialPort$u20$as$u20$core..fmt..Write$GT$9write_str17h55c6b0fd523eafc6E", scope: !718, file: !541, line: 108, type: !719, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !721)
!718 = !DINamespace(name: "{impl#1}", scope: !543)
!719 = !DISubroutineType(types: !720)
!720 = !{!155, !554, !88}
!721 = !{!722, !723, !724, !726}
!722 = !DILocalVariable(name: "self", arg: 1, scope: !717, file: !541, line: 108, type: !554)
!723 = !DILocalVariable(name: "s", arg: 2, scope: !717, file: !541, line: 108, type: !88)
!724 = !DILocalVariable(name: "iter", scope: !725, file: !541, line: 109, type: !224, align: 8)
!725 = distinct !DILexicalBlock(scope: !717, file: !541, line: 109, column: 9)
!726 = !DILocalVariable(name: "byte", scope: !727, file: !541, line: 109, type: !11, align: 1)
!727 = distinct !DILexicalBlock(scope: !725, file: !541, line: 109, column: 31)
!728 = !DILocation(line: 108, column: 18, scope: !717)
!729 = !DILocation(line: 108, column: 29, scope: !717)
!730 = !DILocation(line: 109, column: 21, scope: !725)
!731 = !DILocation(line: 109, column: 21, scope: !717)
!732 = !DILocation(line: 109, column: 9, scope: !725)
!733 = !DILocation(line: 112, column: 9, scope: !717)
!734 = !DILocation(line: 113, column: 6, scope: !717)
!735 = !DILocation(line: 109, column: 13, scope: !725)
!736 = !DILocation(line: 109, column: 13, scope: !727)
!737 = !DILocation(line: 110, column: 13, scope: !727)
!738 = distinct !DISubprogram(name: "new", linkageName: "_ZN10uart_165504port10SerialPort3new17h322b2858f6a36f0bE", scope: !740, file: !739, line: 23, type: !749, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !751)
!739 = !DIFile(filename: "src/port.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/uart_16550-0.2.18", checksumkind: CSK_MD5, checksum: "2b770beb8cfb5c2dd2a7577c385b04ce")
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "SerialPort", scope: !741, file: !7, size: 96, align: 16, elements: !742, templateParams: !41, identifier: "6d5291f15095d6a6cd607afe17776871")
!741 = !DINamespace(name: "port", scope: !544)
!742 = !{!743, !744, !745, !746, !747, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !740, file: !7, baseType: !386, size: 16, align: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "int_en", scope: !740, file: !7, baseType: !414, size: 16, align: 16, offset: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_ctrl", scope: !740, file: !7, baseType: !414, size: 16, align: 16, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "line_ctrl", scope: !740, file: !7, baseType: !414, size: 16, align: 16, offset: 48)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "modem_ctrl", scope: !740, file: !7, baseType: !414, size: 16, align: 16, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "line_sts", scope: !740, file: !7, baseType: !438, size: 16, align: 16, offset: 80)
!749 = !DISubroutineType(types: !750)
!750 = !{!740, !392}
!751 = !{!752}
!752 = !DILocalVariable(name: "base", arg: 1, scope: !738, file: !739, line: 23, type: !392)
!753 = !DILocation(line: 23, column: 29, scope: !738)
!754 = !DILocation(line: 25, column: 19, scope: !738)
!755 = !DILocation(line: 26, column: 40, scope: !738)
!756 = !DILocation(line: 26, column: 21, scope: !738)
!757 = !DILocation(line: 27, column: 43, scope: !738)
!758 = !DILocation(line: 27, column: 24, scope: !738)
!759 = !DILocation(line: 28, column: 43, scope: !738)
!760 = !DILocation(line: 28, column: 24, scope: !738)
!761 = !DILocation(line: 29, column: 44, scope: !738)
!762 = !DILocation(line: 29, column: 25, scope: !738)
!763 = !DILocation(line: 30, column: 41, scope: !738)
!764 = !DILocation(line: 30, column: 23, scope: !738)
!765 = !DILocation(line: 24, column: 9, scope: !738)
!766 = !DILocation(line: 32, column: 6, scope: !738)
!767 = distinct !DISubprogram(name: "init", linkageName: "_ZN10uart_165504port10SerialPort4init17hf40c513a1eb38f4bE", scope: !740, file: !739, line: 37, type: !768, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !771)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut uart_16550::port::SerialPort", baseType: !740, size: 64, align: 64, dwarfAddressSpace: 0)
!771 = !{!772}
!772 = !DILocalVariable(name: "self", arg: 1, scope: !767, file: !739, line: 37, type: !770)
!773 = !DILocation(line: 37, column: 17, scope: !767)
!774 = !DILocation(line: 40, column: 13, scope: !767)
!775 = !DILocation(line: 43, column: 13, scope: !767)
!776 = !DILocation(line: 46, column: 13, scope: !767)
!777 = !DILocation(line: 47, column: 13, scope: !767)
!778 = !DILocation(line: 50, column: 13, scope: !767)
!779 = !DILocation(line: 54, column: 13, scope: !767)
!780 = !DILocation(line: 58, column: 13, scope: !767)
!781 = !DILocation(line: 61, column: 13, scope: !767)
!782 = !DILocation(line: 63, column: 6, scope: !767)
!783 = distinct !DISubprogram(name: "line_sts", linkageName: "_ZN10uart_165504port10SerialPort8line_sts17h2501e33d6dfe531bE", scope: !740, file: !739, line: 65, type: !784, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!628, !770}
!786 = !{!787}
!787 = !DILocalVariable(name: "self", arg: 1, scope: !783, file: !739, line: 65, type: !770)
!788 = !DILocation(line: 65, column: 17, scope: !783)
!789 = !DILocation(line: 66, column: 51, scope: !783)
!790 = !DILocation(line: 66, column: 18, scope: !783)
!791 = !DILocation(line: 67, column: 6, scope: !783)
!792 = distinct !DISubprogram(name: "send", linkageName: "_ZN10uart_165504port10SerialPort4send17h24b5966d67a91d45E", scope: !740, file: !739, line: 70, type: !793, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, templateParams: !41, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !770, !11}
!795 = !{!796, !797}
!796 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !739, line: 70, type: !770)
!797 = !DILocalVariable(name: "data", arg: 2, scope: !792, file: !739, line: 70, type: !11)
!798 = !DILocation(line: 70, column: 17, scope: !792)
!799 = !DILocation(line: 70, column: 28, scope: !792)
!800 = !DILocation(line: 72, column: 13, scope: !792)
!801 = !DILocation(line: 82, column: 31, scope: !792)
!802 = !DILocation(line: 82, column: 21, scope: !792)
!803 = !DILocation(line: 74, column: 31, scope: !792)
!804 = !DILocation(line: 74, column: 21, scope: !792)
!805 = !DILocation(line: 83, column: 21, scope: !792)
!806 = !DILocation(line: 175, column: 18, scope: !663, inlinedAt: !807)
!807 = distinct !DILocation(line: 82, column: 21, scope: !792)
