; ModuleID = 'nva2pns4uucn1eq'
source_filename = "nva2pns4uucn1eq"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%Screen = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }

@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_560206a49c61adca6f3f0639a12632eb = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_c2ea93c90919bb7b1e482f917e413fa1 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1
@alloc_3565e73f34d7302748197a3f0bc50374 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_c2ea93c90919bb7b1e482f917e413fa1, [16 x i8] c"k\00\00\00\00\00\00\00\91\01\00\00\0D\00\00\00" }>, align 8
@alloc_513570631223a12912d85da2bec3b15a = private unnamed_addr constant <{}> zeroinitializer, align 8
@alloc_a3bf71499bef7a3e66a38a17ba71b215 = private unnamed_addr constant <{ [111 x i8] }> <{ [111 x i8] c"unsafe precondition(s) violated: ptr::write_volatile requires that the pointer argument is aligned and non-null" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PI_CHAR_CODE", linkageName: "_ZN3vga12PI_CHAR_CODE17h1835ec06b22313bcE", scope: !2, file: !3, line: 30, type: !4, isLocal: true, isDefinition: true, align: 8)
!2 = !DINamespace(name: "vga", scope: null)
!3 = !DIFile(filename: "vga/src/lib.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "6500acedd3b9b6096da095d5f2c5f037")
!4 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "VGA_COLOR_TEXT_MODE_ADDR", linkageName: "_ZN3vga24VGA_COLOR_TEXT_MODE_ADDR17he5e45d0d75b15974E", scope: !2, file: !3, line: 68, type: !7, isLocal: true, isDefinition: true, align: 64)
!7 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!8 = !{i32 8, !"PIC Level", i32 2}
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !12, producer: "clang LLVM (rustc version 1.71.0-nightly (39c6804b9 2023-04-19))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !13, globals: !47, splitDebugInlining: false)
!12 = !DIFile(filename: "vga/src/lib.rs/@/nva2pns4uucn1eq", directory: "/Users/yaw/self/theo")
!13 = !{!14, !25, !43}
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !16, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!15 = !DIFile(filename: "<unknown>", directory: "")
!16 = !DINamespace(name: "v1", scope: !17)
!17 = !DINamespace(name: "rt", scope: !18)
!18 = !DINamespace(name: "fmt", scope: !19)
!19 = !DINamespace(name: "core", scope: null)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Color", scope: !2, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!27 = !DIEnumerator(name: "Black", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "Blue", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "Green", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "Cyan", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "Red", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "Magenta", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "Brown", value: 6, isUnsigned: true)
!34 = !DIEnumerator(name: "LightGray", value: 7, isUnsigned: true)
!35 = !DIEnumerator(name: "DarkGray", value: 8, isUnsigned: true)
!36 = !DIEnumerator(name: "LightBlue", value: 9, isUnsigned: true)
!37 = !DIEnumerator(name: "LightGreen", value: 10, isUnsigned: true)
!38 = !DIEnumerator(name: "LightCyan", value: 11, isUnsigned: true)
!39 = !DIEnumerator(name: "LightRed", value: 12, isUnsigned: true)
!40 = !DIEnumerator(name: "LightMagenta", value: 13, isUnsigned: true)
!41 = !DIEnumerator(name: "Yellow", value: 14, isUnsigned: true)
!42 = !DIEnumerator(name: "White", value: 15, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !2, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagEnumClass, elements: !44)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!47 = !{!0, !5}
!48 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h6a317ca5d8611573E", scope: !50, file: !49, line: 47, type: !54, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !97, retainedNodes: !95)
!49 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "c62182f1c70ead07686c37e26ad4aaf1")
!50 = !DINamespace(name: "{impl#1}", scope: !51)
!51 = !DINamespace(name: "copied", scope: !52)
!52 = !DINamespace(name: "adapters", scope: !53)
!53 = !DINamespace(name: "iter", scope: !19)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !71}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !57, file: !15, size: 16, align: 8, elements: !58, templateParams: !63, identifier: "e28c3ac861fae5eca00f52b20cfdc3c6")
!57 = !DINamespace(name: "option", scope: !19)
!58 = !{!59}
!59 = !DICompositeType(tag: DW_TAG_variant_part, scope: !56, file: !15, size: 16, align: 8, elements: !60, templateParams: !63, identifier: "2e65a2fdd479a5d97ae6e5c054f1103", discriminator: !70)
!60 = !{!61, !66}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !59, file: !15, baseType: !62, size: 16, align: 8, extraData: i64 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !56, file: !15, size: 16, align: 8, elements: !63, templateParams: !64, identifier: "ef4888deeb7baba6dbd568be422f0185")
!63 = !{}
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !59, file: !15, baseType: !67, size: 16, align: 8, extraData: i64 1)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !56, file: !15, size: 16, align: 8, elements: !68, templateParams: !64, identifier: "7cb1208d60cd739c7430d5538f4f44d")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !15, baseType: !4, size: 8, align: 8, offset: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagArtificial)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !51, file: !15, size: 128, align: 64, elements: !73, templateParams: !93, identifier: "abc13a56b4f8a6968251ebdd44b3ec0c")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !72, file: !15, baseType: !75, size: 128, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !76, file: !15, size: 128, align: 64, elements: !78, templateParams: !64, identifier: "b13b7f88e18b544ac0ba138a6efc42b2")
!76 = !DINamespace(name: "iter", scope: !77)
!77 = !DINamespace(name: "slice", scope: !19)
!78 = !{!79, !86, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !75, file: !15, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !81, file: !15, size: 64, align: 64, elements: !83, templateParams: !64, identifier: "d31063e20be0daaf5963d681afdd9d3d")
!81 = !DINamespace(name: "non_null", scope: !82)
!82 = !DINamespace(name: "ptr", scope: !19)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !80, file: !15, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !75, file: !15, baseType: !85, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !75, file: !15, baseType: !88, align: 8)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !89, file: !15, align: 8, elements: !63, templateParams: !90, identifier: "9b3941025524bf1dca1740fddd0a84e9")
!89 = !DINamespace(name: "marker", scope: !19)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !{!94}
!94 = !DITemplateTypeParameter(name: "I", type: !75)
!95 = !{!96}
!96 = !DILocalVariable(name: "self", arg: 1, scope: !48, file: !49, line: 47, type: !71)
!97 = !{!94, !65}
!98 = !DILocation(line: 47, column: 13, scope: !48)
!99 = !DILocation(line: 48, column: 9, scope: !48)
!100 = !DILocation(line: 49, column: 6, scope: !48)
!101 = distinct !DISubprogram(name: "is_aligned_and_not_null<vga::ScreenChar>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h3208db3a0835960cE", scope: !103, file: !102, line: 2503, type: !104, scopeLine: 2503, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !115)
!102 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "275c4f9af6c6ff08216f4f2da85e76cf")
!103 = !DINamespace(name: "intrinsics", scope: !19)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !107}
!106 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !2, file: !15, size: 16, align: 8, elements: !109, templateParams: !63, identifier: "a9a9a5a7b0f21ace8e54495c3bc17ed4")
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !108, file: !15, baseType: !4, size: 8, align: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !108, file: !15, baseType: !112, size: 8, align: 8, offset: 8)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !2, file: !15, size: 8, align: 8, elements: !113, templateParams: !63, identifier: "c1d9da1cc23a193c3bba11a90b4d7557")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !112, file: !15, baseType: !4, size: 8, align: 8)
!115 = !{!116}
!116 = !DILocalVariable(name: "ptr", arg: 1, scope: !101, file: !102, line: 2503, type: !107)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "T", type: !108)
!119 = !DILocation(line: 2503, column: 42, scope: !101)
!120 = !DILocation(line: 2504, column: 6, scope: !101)
!121 = !DILocation(line: 2504, column: 5, scope: !101)
!122 = !DILocation(line: 2504, column: 23, scope: !101)
!123 = !DILocation(line: 2505, column: 2, scope: !101)
!124 = !{i8 0, i8 2}
!125 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hb5c286c68e0566e9E", scope: !127, file: !126, line: 399, type: !255, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !257)
!126 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !18, file: !15, size: 384, align: 64, elements: !128, templateParams: !63, identifier: "1c46a498dd7b956f4c3a670fdfba5262")
!128 = !{!129, !141, !188}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !127, file: !15, baseType: !130, size: 128, align: 64, offset: 128)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !15, size: 128, align: 64, elements: !131, templateParams: !63, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!131 = !{!132, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !130, file: !15, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !15, size: 128, align: 64, elements: !135, templateParams: !63, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !134, file: !15, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !134, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !130, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !127, file: !15, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !57, file: !15, size: 128, align: 64, elements: !143, templateParams: !63, identifier: "d25d924bb8d51dd413c49dbfa1f11f1")
!143 = !{!144}
!144 = !DICompositeType(tag: DW_TAG_variant_part, scope: !142, file: !15, size: 128, align: 64, elements: !145, templateParams: !63, identifier: "759788f84997b99f6bc91fe0c57058ba", discriminator: !187)
!145 = !{!146, !183}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !144, file: !15, baseType: !147, size: 128, align: 64, extraData: i64 0)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !142, file: !15, size: 128, align: 64, elements: !63, templateParams: !148, identifier: "82efcd94523cf9c0b17ac37e82724639")
!148 = !{!149}
!149 = !DITemplateTypeParameter(name: "T", type: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !15, size: 128, align: 64, elements: !151, templateParams: !63, identifier: "de3ba5e1dd56fab311eb54a28d6cb95f")
!151 = !{!152, !182}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !150, file: !15, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !16, file: !15, size: 448, align: 64, elements: !155, templateParams: !63, identifier: "9bee5132fe724679d94d9aaa78899300")
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !154, file: !15, baseType: !139, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !154, file: !15, baseType: !158, size: 384, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !16, file: !15, size: 384, align: 64, elements: !159, templateParams: !63, identifier: "65fce75b527475dfcd89c81174c5b112")
!159 = !{!160, !162, !163, !165, !181}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !158, file: !15, baseType: !161, size: 32, align: 32, offset: 288)
!161 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !158, file: !15, baseType: !14, size: 8, align: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !15, baseType: !164, size: 32, align: 32, offset: 256)
!164 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !158, file: !15, baseType: !166, size: 128, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !16, file: !15, size: 128, align: 64, elements: !167, templateParams: !63, identifier: "eb274483ac6a1a818973f8ef56806ce6")
!167 = !{!168}
!168 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !15, size: 128, align: 64, elements: !169, templateParams: !63, identifier: "1383065eb0a1d3eb5559cfa60c22a70d", discriminator: !180)
!169 = !{!170, !174, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !168, file: !15, baseType: !171, size: 128, align: 64, extraData: i64 0)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !166, file: !15, size: 128, align: 64, elements: !172, templateParams: !63, identifier: "284bf6fbe777a447ca6ded9ea5417274")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !168, file: !15, baseType: !175, size: 128, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !166, file: !15, size: 128, align: 64, elements: !176, templateParams: !63, identifier: "47998f14b9dfef6b1e659ae3b3c1ad7f")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !168, file: !15, baseType: !179, size: 128, align: 64, extraData: i64 2)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !166, file: !15, size: 128, align: 64, elements: !63, identifier: "a9ac2edd79b7a2c052d84739de651359")
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !158, file: !15, baseType: !166, size: 128, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !150, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !144, file: !15, baseType: !184, size: 128, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !142, file: !15, size: 128, align: 64, elements: !185, templateParams: !148, identifier: "ecb4a60835a68b86ac55d46be42b6cd5")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !184, file: !15, baseType: !150, size: 128, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !127, file: !15, baseType: !189, size: 128, align: 64, offset: 256)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !15, size: 128, align: 64, elements: !190, templateParams: !63, identifier: "1ef2a88983c14e17bd3824c1adc5cb")
!190 = !{!191, !254}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !189, file: !15, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !18, file: !15, size: 128, align: 64, elements: !194, templateParams: !63, identifier: "4e3593181d4a3fd7c7588e4c93e285e5")
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !193, file: !15, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !198, file: !15, align: 8, elements: !63, identifier: "9d957b9cbc95a5d52c57994d133a21d2")
!198 = !DINamespace(name: "{extern#0}", scope: !18)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !193, file: !15, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !196, !222}
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !204, file: !15, size: 8, align: 8, elements: !205, templateParams: !63, identifier: "b7fb26f737e54d12fa01aa3853cdbeae")
!204 = !DINamespace(name: "result", scope: !19)
!205 = !{!206}
!206 = !DICompositeType(tag: DW_TAG_variant_part, scope: !203, file: !15, size: 8, align: 8, elements: !207, templateParams: !63, identifier: "a92bdd2eb05472a8bda434c249c29302", discriminator: !221)
!207 = !{!208, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !206, file: !15, baseType: !209, size: 8, align: 8, extraData: i64 0)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !203, file: !15, size: 8, align: 8, elements: !210, templateParams: !213, identifier: "bb2249fac7fb973c2c787a4c375e7dc3")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !15, baseType: !212, align: 8, offset: 8)
!212 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!213 = !{!214, !215}
!214 = !DITemplateTypeParameter(name: "T", type: !212)
!215 = !DITemplateTypeParameter(name: "E", type: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !18, file: !15, align: 8, elements: !63, identifier: "db1174efc0a2f975f4813d5134979630")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !206, file: !15, baseType: !218, size: 8, align: 8, extraData: i64 1)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !203, file: !15, size: 8, align: 8, elements: !219, templateParams: !213, identifier: "eb015aef3c84d8cf3918a665d11906a1")
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !218, file: !15, baseType: !216, align: 8, offset: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !15, baseType: !4, size: 8, align: 8, flags: DIFlagArtificial)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !18, file: !15, size: 512, align: 64, elements: !224, templateParams: !63, identifier: "4518b2a8833c3639e2a18f19d8d2d035")
!224 = !{!225, !226, !227, !228, !242, !243}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !15, baseType: !164, size: 32, align: 32, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !223, file: !15, baseType: !161, size: 32, align: 32, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !223, file: !15, baseType: !14, size: 8, align: 8, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !223, file: !15, baseType: !229, size: 128, align: 64, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !57, file: !15, size: 128, align: 64, elements: !230, templateParams: !63, identifier: "e509e62aca398ad985d4d7108c999fce")
!230 = !{!231}
!231 = !DICompositeType(tag: DW_TAG_variant_part, scope: !229, file: !15, size: 128, align: 64, elements: !232, templateParams: !63, identifier: "b800028c0f41e5f65055b3206ca16e40", discriminator: !241)
!232 = !{!233, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !231, file: !15, baseType: !234, size: 128, align: 64, extraData: i64 0)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !229, file: !15, size: 128, align: 64, elements: !63, templateParams: !235, identifier: "c64b01d4e9024c6089607fba201241ac")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !231, file: !15, baseType: !238, size: 128, align: 64, extraData: i64 1)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !229, file: !15, size: 128, align: 64, elements: !239, templateParams: !235, identifier: "d909f9aede69ded5e6a3f34da3cb5ef3")
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !238, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !223, file: !15, baseType: !229, size: 128, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !15, baseType: !244, size: 128, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !15, size: 128, align: 64, elements: !245, templateParams: !63, identifier: "f9270966a9fda351195f72d6edc0f59a")
!245 = !{!246, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !244, file: !15, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !15, align: 8, elements: !63, identifier: "26797fbb1ceb902d1b523adeae52178")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !244, file: !15, baseType: !250, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, align: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 3, lowerBound: 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !189, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!127, !130}
!257 = !{!258}
!258 = !DILocalVariable(name: "pieces", arg: 1, scope: !125, file: !126, line: 399, type: !130)
!259 = !DILocation(line: 399, column: 28, scope: !125)
!260 = !DILocation(line: 400, column: 12, scope: !125)
!261 = !DILocation(line: 403, column: 34, scope: !125)
!262 = !DILocation(line: 403, column: 9, scope: !125)
!263 = !{i64 8}
!264 = !DILocation(line: 404, column: 6, scope: !125)
!265 = !DILocation(line: 401, column: 13, scope: !125)
!266 = distinct !DISubprogram(name: "write_volatile<vga::ScreenChar>", linkageName: "_ZN4core3ptr14write_volatile17he037de8b219f0050E", scope: !82, file: !267, line: 1620, type: !268, scopeLine: 1620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !271)
!267 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ed5a5b94ce68ef0bd15ed78a0be1f1f0")
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270, !108}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!271 = !{!272, !273}
!272 = !DILocalVariable(name: "dst", arg: 1, scope: !266, file: !267, line: 1620, type: !270)
!273 = !DILocalVariable(name: "src", arg: 2, scope: !266, file: !267, line: 1620, type: !108)
!274 = !DILocation(line: 1620, column: 33, scope: !266)
!275 = !DILocation(line: 1620, column: 46, scope: !266)
!276 = !DILocation(line: 1623, column: 9, scope: !266)
!277 = !DILocation(line: 1627, column: 9, scope: !266)
!278 = !DILocation(line: 1629, column: 2, scope: !266)
!279 = !DILocalVariable(name: "dst", arg: 1, scope: !280, file: !102, line: 2484, type: !270)
!280 = distinct !DISubprogram(name: "runtime<vga::ScreenChar>", linkageName: "_ZN4core3ptr14write_volatile7runtime17h0aab411c27608e64E", scope: !281, file: !102, line: 2484, type: !282, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !284)
!281 = !DINamespace(name: "write_volatile", scope: !82)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !270}
!284 = !{!279}
!285 = !DILocation(line: 2484, column: 39, scope: !280, inlinedAt: !286)
!286 = distinct !DILocation(line: 1623, column: 9, scope: !266)
!287 = !DILocation(line: 1625, column: 33, scope: !288, inlinedAt: !286)
!288 = !DILexicalBlockFile(scope: !280, file: !267, discriminator: 0)
!289 = !DILocation(line: 2485, column: 20, scope: !280, inlinedAt: !286)
!290 = !DILocation(line: 2487, column: 21, scope: !280, inlinedAt: !286)
!291 = distinct !DISubprogram(name: "is_aligned<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$10is_aligned17h7dae54267343147eE", scope: !293, file: !292, line: 1448, type: !104, scopeLine: 1448, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !295)
!292 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdc703bf15683313735b9c5aaf2bed9f")
!293 = !DINamespace(name: "{impl#0}", scope: !294)
!294 = !DINamespace(name: "const_ptr", scope: !82)
!295 = !{!296}
!296 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !292, line: 1448, type: !107)
!297 = !DILocation(line: 1448, column: 29, scope: !291)
!298 = !DILocation(line: 1452, column: 9, scope: !291)
!299 = !DILocation(line: 1453, column: 6, scope: !291)
!300 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to12runtime_impl17h4d3adf1ee3702574E", scope: !301, file: !292, line: 1570, type: !302, scopeLine: 1570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !305)
!301 = !DINamespace(name: "is_aligned_to", scope: !293)
!302 = !DISubroutineType(types: !303)
!303 = !{!106, !304, !139}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !{!306, !307}
!306 = !DILocalVariable(name: "ptr", arg: 1, scope: !300, file: !292, line: 1570, type: !304)
!307 = !DILocalVariable(name: "align", arg: 2, scope: !300, file: !292, line: 1570, type: !139)
!308 = !DILocation(line: 1570, column: 25, scope: !300)
!309 = !DILocation(line: 1570, column: 41, scope: !300)
!310 = !DILocalVariable(name: "self", arg: 1, scope: !311, file: !292, line: 203, type: !304)
!311 = distinct !DISubprogram(name: "addr<()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17hb773f39fe74217beE", scope: !293, file: !292, line: 203, type: !312, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !315, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!139, !304}
!314 = !{!310}
!315 = !{!214}
!316 = !DILocation(line: 203, column: 17, scope: !311, inlinedAt: !317)
!317 = distinct !DILocation(line: 1571, column: 13, scope: !300)
!318 = !DILocalVariable(name: "self", arg: 1, scope: !319, file: !292, line: 58, type: !304)
!319 = distinct !DISubprogram(name: "cast<(), ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hca0ab73fb0ceccacE", scope: !293, file: !292, line: 58, type: !320, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !323, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!304, !304}
!322 = !{!318}
!323 = !{!214, !324}
!324 = !DITemplateTypeParameter(name: "U", type: !212)
!325 = !DILocation(line: 58, column: 26, scope: !319, inlinedAt: !326)
!326 = distinct !DILocation(line: 207, column: 33, scope: !311, inlinedAt: !317)
!327 = !DILocation(line: 207, column: 18, scope: !311, inlinedAt: !317)
!328 = !DILocation(line: 1571, column: 26, scope: !300)
!329 = !DILocation(line: 1571, column: 13, scope: !300)
!330 = !DILocation(line: 1572, column: 10, scope: !300)
!331 = distinct !DISubprogram(name: "is_aligned_to<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13is_aligned_to17h014e8003b8364ba9E", scope: !293, file: !292, line: 1564, type: !332, scopeLine: 1564, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{!106, !107, !139}
!334 = !{!335, !336}
!335 = !DILocalVariable(name: "self", arg: 1, scope: !331, file: !292, line: 1564, type: !107)
!336 = !DILocalVariable(name: "align", arg: 2, scope: !331, file: !292, line: 1564, type: !139)
!337 = !DILocation(line: 1564, column: 32, scope: !331)
!338 = !DILocation(line: 1564, column: 38, scope: !331)
!339 = !DILocalVariable(name: "self", arg: 1, scope: !340, file: !341, line: 2169, type: !139)
!340 = distinct !DISubprogram(name: "is_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15is_power_of_two17h10a26130217e7fecE", scope: !342, file: !341, line: 2169, type: !344, scopeLine: 2169, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !346)
!341 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "9f9a8c2611080e433b531f707b01187e")
!342 = !DINamespace(name: "{impl#11}", scope: !343)
!343 = !DINamespace(name: "num", scope: !19)
!344 = !DISubroutineType(types: !345)
!345 = !{!106, !139}
!346 = !{!339}
!347 = !DILocation(line: 2169, column: 38, scope: !340, inlinedAt: !348)
!348 = distinct !DILocation(line: 1565, column: 13, scope: !331)
!349 = !DILocalVariable(name: "self", arg: 1, scope: !350, file: !341, line: 106, type: !139)
!350 = distinct !DISubprogram(name: "count_ones", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$10count_ones17hc261f83f3aec2ac5E", scope: !342, file: !341, line: 106, type: !351, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !353)
!351 = !DISubroutineType(types: !352)
!352 = !{!164, !139}
!353 = !{!349}
!354 = !DILocation(line: 106, column: 33, scope: !350, inlinedAt: !355)
!355 = distinct !DILocation(line: 2170, column: 13, scope: !340, inlinedAt: !348)
!356 = !DILocation(line: 107, column: 13, scope: !350, inlinedAt: !355)
!357 = !DILocation(line: 2170, column: 13, scope: !340, inlinedAt: !348)
!358 = !DILocation(line: 1565, column: 12, scope: !331)
!359 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !292, line: 58, type: !107)
!360 = distinct !DISubprogram(name: "cast<vga::ScreenChar, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h394ec2fb86aad922E", scope: !293, file: !292, line: 58, type: !361, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !364, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!304, !107}
!363 = !{!359}
!364 = !{!118, !324}
!365 = !DILocation(line: 58, column: 26, scope: !360, inlinedAt: !366)
!366 = distinct !DILocation(line: 1584, column: 37, scope: !331)
!367 = !DILocation(line: 1584, column: 36, scope: !331)
!368 = !DILocation(line: 1584, column: 18, scope: !331)
!369 = !DILocation(line: 1585, column: 6, scope: !331)
!370 = !DILocation(line: 1566, column: 13, scope: !331)
!371 = distinct !DISubprogram(name: "runtime_impl", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null12runtime_impl17h8965049d214f769fE", scope: !372, file: !292, line: 36, type: !373, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !375)
!372 = !DINamespace(name: "is_null", scope: !293)
!373 = !DISubroutineType(types: !374)
!374 = !{!106, !85}
!375 = !{!376}
!376 = !DILocalVariable(name: "ptr", arg: 1, scope: !371, file: !292, line: 36, type: !85)
!377 = !DILocation(line: 36, column: 25, scope: !371)
!378 = !DILocalVariable(name: "self", arg: 1, scope: !379, file: !292, line: 203, type: !85)
!379 = distinct !DISubprogram(name: "addr<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17he9bf9b15aa86c5caE", scope: !293, file: !292, line: 203, type: !380, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !64, retainedNodes: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{!139, !85}
!382 = !{!378}
!383 = !DILocation(line: 203, column: 17, scope: !379, inlinedAt: !384)
!384 = distinct !DILocation(line: 37, column: 13, scope: !371)
!385 = !DILocalVariable(name: "self", arg: 1, scope: !386, file: !292, line: 58, type: !85)
!386 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h6186bdf5da866e4fE", scope: !293, file: !292, line: 58, type: !387, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !390, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!304, !85}
!389 = !{!385}
!390 = !{!65, !324}
!391 = !DILocation(line: 58, column: 26, scope: !386, inlinedAt: !392)
!392 = distinct !DILocation(line: 207, column: 33, scope: !379, inlinedAt: !384)
!393 = !DILocation(line: 207, column: 18, scope: !379, inlinedAt: !384)
!394 = !DILocation(line: 37, column: 13, scope: !371)
!395 = !DILocation(line: 38, column: 10, scope: !371)
!396 = distinct !DISubprogram(name: "is_null<vga::ScreenChar>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h9ea16b1fcdfeea51E", scope: !293, file: !292, line: 34, type: !104, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !117, retainedNodes: !397)
!397 = !{!398}
!398 = !DILocalVariable(name: "self", arg: 1, scope: !396, file: !292, line: 34, type: !107)
!399 = !DILocation(line: 34, column: 26, scope: !396)
!400 = !DILocation(line: 51, column: 36, scope: !396)
!401 = !DILocation(line: 51, column: 18, scope: !396)
!402 = !DILocation(line: 52, column: 6, scope: !396)
!403 = distinct !DISubprogram(name: "bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$5bytes17he496c76c9e9dac11E", scope: !405, file: !404, line: 856, type: !407, scopeLine: 856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !413)
!404 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8f91e5aecc982717403f5cbdc23932fe")
!405 = !DINamespace(name: "{impl#0}", scope: !406)
!406 = !DINamespace(name: "str", scope: !19)
!407 = !DISubroutineType(types: !408)
!408 = !{!409, !134}
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !410, file: !15, size: 128, align: 64, elements: !411, templateParams: !63, identifier: "1c6d0e83664b8ea7ecc7e9eacee8c8b1")
!410 = !DINamespace(name: "iter", scope: !406)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !15, baseType: !72, size: 128, align: 64)
!413 = !{!414}
!414 = !DILocalVariable(name: "self", arg: 1, scope: !403, file: !404, line: 856, type: !134)
!415 = !DILocation(line: 856, column: 18, scope: !403)
!416 = !DILocalVariable(name: "self", arg: 1, scope: !417, file: !404, line: 324, type: !134)
!417 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17hf9fc150870f70375E", scope: !405, file: !404, line: 324, type: !418, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !424)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !134}
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !15, size: 128, align: 64, elements: !421, templateParams: !63, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !420, file: !15, baseType: !137, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !420, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!424 = !{!416}
!425 = !DILocation(line: 324, column: 27, scope: !417, inlinedAt: !426)
!426 = distinct !DILocation(line: 857, column: 15, scope: !403)
!427 = !DILocation(line: 327, column: 6, scope: !417, inlinedAt: !426)
!428 = !DILocation(line: 857, column: 15, scope: !403)
!429 = !DILocation(line: 857, column: 9, scope: !403)
!430 = !DILocation(line: 858, column: 6, scope: !403)
!431 = distinct !DISubprogram(name: "copied<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN4core4iter6traits8iterator8Iterator6copied17hb89f50186587516eE", scope: !433, file: !432, line: 3310, type: !436, scopeLine: 3310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !440, retainedNodes: !438)
!432 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/iterator.rs", directory: "", checksumkind: CSK_MD5, checksum: "95e88b6c652e0490e905763009955c97")
!433 = !DINamespace(name: "Iterator", scope: !434)
!434 = !DINamespace(name: "iterator", scope: !435)
!435 = !DINamespace(name: "traits", scope: !53)
!436 = !DISubroutineType(types: !437)
!437 = !{!72, !75}
!438 = !{!439}
!439 = !DILocalVariable(name: "self", arg: 1, scope: !431, file: !432, line: 3310, type: !75)
!440 = !{!441, !65}
!441 = !DITemplateTypeParameter(name: "Self", type: !75)
!442 = !DILocation(line: 3310, column: 26, scope: !431)
!443 = !DILocation(line: 3315, column: 9, scope: !431)
!444 = !DILocation(line: 3316, column: 6, scope: !431)
!445 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters6copied15Copied$LT$I$GT$3new17h65b28285c1f7d44fE", scope: !72, file: !49, line: 26, type: !436, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !93, retainedNodes: !446)
!446 = !{!447}
!447 = !DILocalVariable(name: "it", arg: 1, scope: !445, file: !49, line: 26, type: !75)
!448 = !DILocation(line: 26, column: 32, scope: !445)
!449 = !DILocation(line: 27, column: 9, scope: !445)
!450 = !DILocation(line: 28, column: 6, scope: !445)
!451 = distinct !DISubprogram(name: "copied<u8>", linkageName: "_ZN4core6option19Option$LT$$RF$T$GT$6copied17ha8ccdc35330a48bfE", scope: !453, file: !452, line: 1828, type: !464, scopeLine: 1828, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !64, retainedNodes: !466)
!452 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "7fe636643511270d6f7e365434dea895")
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&u8>", scope: !57, file: !15, size: 64, align: 64, elements: !454, templateParams: !63, identifier: "bfc495f48dc37f09f478bd3eb09ffe0d")
!454 = !{!455}
!455 = !DICompositeType(tag: DW_TAG_variant_part, scope: !453, file: !15, size: 64, align: 64, elements: !456, templateParams: !63, identifier: "a23d37d5d5b6350b94fb9b5d3f1cd4cc", discriminator: !463)
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !455, file: !15, baseType: !458, size: 64, align: 64, extraData: i64 0)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !453, file: !15, size: 64, align: 64, elements: !63, templateParams: !90, identifier: "42c63ab87d419b0473096dfb98803a15")
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !455, file: !15, baseType: !460, size: 64, align: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !453, file: !15, size: 64, align: 64, elements: !461, templateParams: !90, identifier: "8d0eb3617ba126ce58a6283f6c53b7d9")
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !460, file: !15, baseType: !92, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !15, baseType: !7, size: 64, align: 64, flags: DIFlagArtificial)
!464 = !DISubroutineType(types: !465)
!465 = !{!56, !453}
!466 = !{!467, !468}
!467 = !DILocalVariable(name: "self", arg: 1, scope: !451, file: !452, line: 1828, type: !453)
!468 = !DILocalVariable(name: "v", scope: !469, file: !452, line: 1835, type: !4, align: 1)
!469 = distinct !DILexicalBlock(scope: !451, file: !452, line: 1835, column: 13)
!470 = !DILocation(line: 1828, column: 25, scope: !451)
!471 = !DILocation(line: 1834, column: 15, scope: !451)
!472 = !DILocation(line: 1834, column: 9, scope: !451)
!473 = !DILocation(line: 1836, column: 21, scope: !451)
!474 = !DILocation(line: 1835, column: 19, scope: !451)
!475 = !{i64 1}
!476 = !DILocation(line: 1835, column: 19, scope: !469)
!477 = !DILocation(line: 1835, column: 25, scope: !469)
!478 = !DILocation(line: 1835, column: 31, scope: !451)
!479 = !DILocation(line: 1838, column: 6, scope: !451)
!480 = distinct !DISubprogram(name: "into_iter<core::str::iter::Bytes>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h6ec7592c5a847995E", scope: !482, file: !481, line: 271, type: !484, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !488, retainedNodes: !486)
!481 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "a39b82fc812ed30b3e6ebda5fbc56490")
!482 = !DINamespace(name: "{impl#0}", scope: !483)
!483 = !DINamespace(name: "collect", scope: !435)
!484 = !DISubroutineType(types: !485)
!485 = !{!409, !409}
!486 = !{!487}
!487 = !DILocalVariable(name: "self", arg: 1, scope: !480, file: !481, line: 271, type: !409)
!488 = !{!489}
!489 = !DITemplateTypeParameter(name: "I", type: !409)
!490 = !DILocation(line: 271, column: 18, scope: !480)
!491 = !DILocation(line: 273, column: 6, scope: !480)
!492 = distinct !DISubprogram(name: "next", linkageName: "_ZN81_$LT$core..str..iter..Bytes$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h44e127c8c6f9a63eE", scope: !494, file: !493, line: 236, type: !495, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !498)
!493 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "09c36955e811d84967bcb5dbc290ce49")
!494 = !DINamespace(name: "{impl#9}", scope: !410)
!495 = !DISubroutineType(types: !496)
!496 = !{!56, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::str::iter::Bytes", baseType: !409, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !{!499}
!499 = !DILocalVariable(name: "self", arg: 1, scope: !492, file: !493, line: 236, type: !497)
!500 = !DILocation(line: 236, column: 13, scope: !492)
!501 = !DILocation(line: 237, column: 9, scope: !492)
!502 = !DILocation(line: 238, column: 6, scope: !492)
!503 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga9ColorCode3new17hb7aaf559dc595b41E", scope: !112, file: !3, line: 37, type: !504, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!112, !25, !25}
!506 = !{!507, !508}
!507 = !DILocalVariable(name: "fg", arg: 1, scope: !503, file: !3, line: 37, type: !25)
!508 = !DILocalVariable(name: "bg", arg: 2, scope: !503, file: !3, line: 37, type: !25)
!509 = !DILocation(line: 37, column: 12, scope: !503)
!510 = !DILocation(line: 37, column: 23, scope: !503)
!511 = !DILocation(line: 38, column: 19, scope: !503)
!512 = !{i8 0, i8 16}
!513 = !DILocation(line: 38, column: 37, scope: !503)
!514 = !DILocation(line: 38, column: 9, scope: !503)
!515 = !DILocation(line: 39, column: 6, scope: !503)
!516 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga10ScreenChar3new17h81637eea72a3c0c4E", scope: !108, file: !3, line: 50, type: !517, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!108, !4}
!519 = !{!520}
!520 = !DILocalVariable(name: "c", arg: 1, scope: !516, file: !3, line: 50, type: !4)
!521 = !DILocation(line: 50, column: 12, scope: !516)
!522 = !DILocation(line: 53, column: 40, scope: !516)
!523 = !DILocation(line: 53, column: 55, scope: !516)
!524 = !DILocation(line: 53, column: 25, scope: !516)
!525 = !DILocation(line: 51, column: 9, scope: !516)
!526 = !DILocation(line: 55, column: 6, scope: !516)
!527 = distinct !DISubprogram(name: "inverse", linkageName: "_ZN3vga10ScreenChar7inverse17h3a38e5b27946e2ccE", scope: !108, file: !3, line: 57, type: !517, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !528)
!528 = !{!529}
!529 = !DILocalVariable(name: "c", arg: 1, scope: !527, file: !3, line: 57, type: !4)
!530 = !DILocation(line: 57, column: 16, scope: !527)
!531 = !DILocation(line: 60, column: 40, scope: !527)
!532 = !DILocation(line: 60, column: 55, scope: !527)
!533 = !DILocation(line: 60, column: 25, scope: !527)
!534 = !DILocation(line: 58, column: 9, scope: !527)
!535 = !DILocation(line: 62, column: 6, scope: !527)
!536 = distinct !DISubprogram(name: "x", linkageName: "_ZN3vga6Cursor1x17h1976903b9ae7941fE", scope: !537, file: !3, line: 92, type: !544, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !547)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !2, file: !15, size: 128, align: 64, elements: !538, templateParams: !63, identifier: "28d36a770054162cfd7382e232cf39ce")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !537, file: !15, baseType: !540, size: 128, align: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !2, file: !15, size: 128, align: 64, elements: !541, templateParams: !63, identifier: "d81cb3ae5114649b619cb124c1153c8f")
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !540, file: !15, baseType: !139, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !540, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!139, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&vga::Cursor", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !{!548}
!548 = !DILocalVariable(name: "self", arg: 1, scope: !536, file: !3, line: 92, type: !546)
!549 = !DILocation(line: 92, column: 10, scope: !536)
!550 = !DILocation(line: 93, column: 9, scope: !536)
!551 = !DILocation(line: 94, column: 6, scope: !536)
!552 = distinct !DISubprogram(name: "y", linkageName: "_ZN3vga6Cursor1y17h6d62fb5b12e60708E", scope: !537, file: !3, line: 97, type: !544, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !553)
!553 = !{!554}
!554 = !DILocalVariable(name: "self", arg: 1, scope: !552, file: !3, line: 97, type: !546)
!555 = !DILocation(line: 97, column: 10, scope: !552)
!556 = !DILocation(line: 98, column: 9, scope: !552)
!557 = !DILocation(line: 99, column: 6, scope: !552)
!558 = distinct !DISubprogram(name: "incr_x", linkageName: "_ZN3vga6Cursor6incr_x17hbe3ad4b2d551659eE", scope: !537, file: !3, line: 102, type: !559, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !562)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Cursor", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!562 = !{!563}
!563 = !DILocalVariable(name: "self", arg: 1, scope: !558, file: !3, line: 102, type: !561)
!564 = !DILocation(line: 102, column: 15, scope: !558)
!565 = !DILocation(line: 103, column: 9, scope: !558)
!566 = !DILocation(line: 104, column: 6, scope: !558)
!567 = distinct !DISubprogram(name: "width", linkageName: "_ZN3vga6Screen5width17h26c3827356f44225E", scope: !568, file: !3, line: 145, type: !586, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !589)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !2, file: !15, size: 1728, align: 64, elements: !569, templateParams: !63, identifier: "393a49189beaa3e27cce4317032b9e3")
!569 = !{!570, !571, !572, !573, !584, !585}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !568, file: !15, baseType: !139, size: 64, align: 64, offset: 1536)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !568, file: !15, baseType: !537, size: 128, align: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !568, file: !15, baseType: !540, size: 128, align: 64, offset: 1408)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !568, file: !15, baseType: !574, size: 64, align: 64, offset: 1600)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !575, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !2, file: !15, size: 32000, align: 8, elements: !576, templateParams: !63, identifier: "5038a7ded012f83f4d8c704f25ef81bd")
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !575, file: !15, baseType: !578, size: 32000, align: 8)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 32000, align: 8, elements: !582)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1280, align: 8, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 80, lowerBound: 0)
!582 = !{!583}
!583 = !DISubrange(count: 25, lowerBound: 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !568, file: !15, baseType: !43, size: 8, align: 8, offset: 1664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !568, file: !15, baseType: !579, size: 1280, align: 8)
!586 = !DISubroutineType(types: !587)
!587 = !{!139, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&vga::Screen", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!589 = !{!590}
!590 = !DILocalVariable(name: "self", arg: 1, scope: !567, file: !3, line: 145, type: !588)
!591 = !DILocation(line: 145, column: 14, scope: !567)
!592 = !DILocation(line: 146, column: 9, scope: !567)
!593 = !DILocation(line: 147, column: 6, scope: !567)
!594 = distinct !DISubprogram(name: "height", linkageName: "_ZN3vga6Screen6height17h81fbf84ff81855c7E", scope: !568, file: !3, line: 150, type: !586, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !595)
!595 = !{!596}
!596 = !DILocalVariable(name: "self", arg: 1, scope: !594, file: !3, line: 150, type: !588)
!597 = !DILocation(line: 150, column: 15, scope: !594)
!598 = !DILocation(line: 151, column: 9, scope: !594)
!599 = !DILocation(line: 152, column: 6, scope: !594)
!600 = distinct !DISubprogram(name: "top_down_flow_screen", linkageName: "_ZN3vga6Screen20top_down_flow_screen17h591d21b1dba1f16cE", scope: !568, file: !3, line: 154, type: !601, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!568, !574, !579}
!603 = !{!604, !605, !606}
!604 = !DILocalVariable(name: "buf", arg: 1, scope: !600, file: !3, line: 154, type: !574)
!605 = !DILocalVariable(name: "blank_row", arg: 2, scope: !600, file: !3, line: 154, type: !579)
!606 = !DILocalVariable(name: "origin_dot", scope: !607, file: !3, line: 155, type: !540, align: 8)
!607 = distinct !DILexicalBlock(scope: !600, file: !3, line: 155, column: 9)
!608 = !DILocation(line: 154, column: 29, scope: !600)
!609 = !DILocation(line: 154, column: 55, scope: !600)
!610 = !DILocation(line: 155, column: 13, scope: !607)
!611 = !DILocation(line: 155, column: 26, scope: !600)
!612 = !DILocation(line: 157, column: 18, scope: !607)
!613 = !DILocation(line: 158, column: 21, scope: !607)
!614 = !DILocation(line: 156, column: 9, scope: !607)
!615 = !DILocation(line: 164, column: 6, scope: !600)
!616 = distinct !DISubprogram(name: "bottom_up_flow_screen", linkageName: "_ZN3vga6Screen21bottom_up_flow_screen17h9a77e1cf62756a51E", scope: !568, file: !3, line: 166, type: !601, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !617)
!617 = !{!618, !619, !620, !622}
!618 = !DILocalVariable(name: "buf", arg: 1, scope: !616, file: !3, line: 166, type: !574)
!619 = !DILocalVariable(name: "blank_row", arg: 2, scope: !616, file: !3, line: 166, type: !579)
!620 = !DILocalVariable(name: "perceived_y", scope: !621, file: !3, line: 167, type: !139, align: 8)
!621 = distinct !DILexicalBlock(scope: !616, file: !3, line: 167, column: 9)
!622 = !DILocalVariable(name: "origin_dot", scope: !623, file: !3, line: 168, type: !540, align: 8)
!623 = distinct !DILexicalBlock(scope: !621, file: !3, line: 168, column: 9)
!624 = !DILocation(line: 166, column: 30, scope: !616)
!625 = !DILocation(line: 166, column: 56, scope: !616)
!626 = !DILocation(line: 168, column: 13, scope: !623)
!627 = !DILocation(line: 167, column: 27, scope: !616)
!628 = !DILocation(line: 167, column: 13, scope: !621)
!629 = !DILocation(line: 168, column: 26, scope: !621)
!630 = !DILocation(line: 173, column: 21, scope: !623)
!631 = !DILocation(line: 174, column: 18, scope: !623)
!632 = !DILocation(line: 172, column: 9, scope: !623)
!633 = !DILocation(line: 180, column: 6, scope: !616)
!634 = distinct !DISubprogram(name: "new", linkageName: "_ZN3vga6Screen3new17hafba4fbd3270d1d9E", scope: !568, file: !3, line: 182, type: !635, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !637)
!635 = !DISubroutineType(types: !636)
!636 = !{!568, !43, !4}
!637 = !{!638, !639, !640, !642, !644}
!638 = !DILocalVariable(name: "tfd", arg: 1, scope: !634, file: !3, line: 182, type: !43)
!639 = !DILocalVariable(name: "blank_row_char", arg: 2, scope: !634, file: !3, line: 182, type: !4)
!640 = !DILocalVariable(name: "buf", scope: !641, file: !3, line: 183, type: !574, align: 8)
!641 = distinct !DILexicalBlock(scope: !634, file: !3, line: 183, column: 9)
!642 = !DILocalVariable(name: "blank_row", scope: !643, file: !3, line: 184, type: !579, align: 1)
!643 = distinct !DILexicalBlock(scope: !641, file: !3, line: 184, column: 9)
!644 = !DILocalVariable(name: "screen", scope: !645, file: !3, line: 185, type: !568, align: 8)
!645 = distinct !DILexicalBlock(scope: !643, file: !3, line: 185, column: 9)
!646 = !DILocation(line: 185, column: 13, scope: !645)
!647 = !DILocation(line: 182, column: 16, scope: !634)
!648 = !DILocation(line: 182, column: 40, scope: !634)
!649 = !DILocation(line: 184, column: 13, scope: !643)
!650 = !DILocation(line: 183, column: 35, scope: !634)
!651 = !DILocation(line: 183, column: 34, scope: !634)
!652 = !DILocation(line: 183, column: 28, scope: !634)
!653 = !DILocation(line: 183, column: 13, scope: !641)
!654 = !DILocation(line: 184, column: 26, scope: !641)
!655 = !DILocation(line: 184, column: 25, scope: !641)
!656 = !DILocation(line: 185, column: 32, scope: !643)
!657 = !DILocation(line: 185, column: 26, scope: !643)
!658 = !DILocation(line: 187, column: 43, scope: !643)
!659 = !DILocation(line: 186, column: 44, scope: !643)
!660 = !DILocation(line: 189, column: 9, scope: !645)
!661 = !DILocation(line: 191, column: 6, scope: !634)
!662 = distinct !DISubprogram(name: "clear", linkageName: "_ZN3vga6Screen5clear17h135a6849108ed5acE", scope: !568, file: !3, line: 193, type: !663, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !666)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!666 = !{!667, !668, !678}
!667 = !DILocalVariable(name: "self", arg: 1, scope: !662, file: !3, line: 193, type: !665)
!668 = !DILocalVariable(name: "iter", scope: !669, file: !3, line: 196, type: !670, align: 8)
!669 = distinct !DILexicalBlock(scope: !662, file: !3, line: 196, column: 9)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !671, file: !15, size: 128, align: 64, elements: !673, templateParams: !676, identifier: "a03c8b420abc34aa26dc7c9454c3a97c")
!671 = !DINamespace(name: "range", scope: !672)
!672 = !DINamespace(name: "ops", scope: !19)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !670, file: !15, baseType: !139, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !670, file: !15, baseType: !139, size: 64, align: 64, offset: 64)
!676 = !{!677}
!677 = !DITemplateTypeParameter(name: "Idx", type: !139)
!678 = !DILocalVariable(name: "row", scope: !679, file: !3, line: 196, type: !139, align: 8)
!679 = distinct !DILexicalBlock(scope: !669, file: !3, line: 196, column: 37)
!680 = !DILocation(line: 193, column: 14, scope: !662)
!681 = !DILocation(line: 196, column: 20, scope: !669)
!682 = !DILocation(line: 196, column: 23, scope: !662)
!683 = !DILocation(line: 196, column: 20, scope: !662)
!684 = !DILocation(line: 196, column: 9, scope: !669)
!685 = !{i64 0, i64 2}
!686 = !DILocation(line: 199, column: 6, scope: !662)
!687 = !DILocation(line: 196, column: 13, scope: !669)
!688 = !DILocation(line: 196, column: 13, scope: !679)
!689 = !DILocation(line: 197, column: 35, scope: !679)
!690 = !DILocation(line: 197, column: 13, scope: !679)
!691 = distinct !DISubprogram(name: "print_sc", linkageName: "_ZN3vga6Screen8print_sc17h6b2afcccecafb481E", scope: !568, file: !3, line: 201, type: !692, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !665, !108}
!694 = !{!695, !696, !697}
!695 = !DILocalVariable(name: "self", arg: 1, scope: !691, file: !3, line: 201, type: !665)
!696 = !DILocalVariable(name: "sc", arg: 2, scope: !691, file: !3, line: 201, type: !108)
!697 = !DILocalVariable(name: "dst", scope: !698, file: !3, line: 202, type: !699, align: 8)
!698 = distinct !DILexicalBlock(scope: !691, file: !3, line: 202, column: 9)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::ScreenChar", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!700 = !DILocation(line: 201, column: 17, scope: !691)
!701 = !DILocation(line: 201, column: 28, scope: !691)
!702 = !DILocation(line: 202, column: 39, scope: !691)
!703 = !DILocation(line: 202, column: 24, scope: !691)
!704 = !DILocation(line: 202, column: 56, scope: !691)
!705 = !DILocation(line: 202, column: 19, scope: !691)
!706 = !DILocation(line: 202, column: 13, scope: !698)
!707 = !DILocation(line: 209, column: 18, scope: !698)
!708 = !DILocation(line: 210, column: 9, scope: !698)
!709 = !DILocation(line: 211, column: 6, scope: !691)
!710 = distinct !DISubprogram(name: "should_wrap", linkageName: "_ZN3vga6Screen11should_wrap17h007a9fa87d5e48c6E", scope: !568, file: !3, line: 214, type: !711, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{!106, !588}
!713 = !{!714}
!714 = !DILocalVariable(name: "self", arg: 1, scope: !710, file: !3, line: 214, type: !588)
!715 = !DILocation(line: 214, column: 20, scope: !710)
!716 = !DILocation(line: 215, column: 9, scope: !710)
!717 = !DILocation(line: 215, column: 28, scope: !710)
!718 = !DILocation(line: 216, column: 6, scope: !710)
!719 = distinct !DISubprogram(name: "print", linkageName: "_ZN3vga6Screen5print17h022cb4c8aedc7398E", scope: !568, file: !3, line: 218, type: !720, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !11, templateParams: !63, retainedNodes: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !665, !4}
!722 = !{!723, !724}
!723 = !DILocalVariable(name: "self", arg: 1, scope: !719, file: !3, line: 218, type: !665)
!724 = !DILocalVariable(name: "c", arg: 2, scope: !719, file: !3, line: 218, type: !4)
!725 = !DILocation(line: 218, column: 14, scope: !719)
!726 = !DILocation(line: 218, column: 25, scope: !719)
!727 = !DILocation(line: 221, column: 12, scope: !719)
!728 = !DILocation(line: 224, column: 23, scope: !719)
!729 = !DILocation(line: 224, column: 9, scope: !719)
!730 = !DILocation(line: 225, column: 6, scope: !719)
!731 = !DILocation(line: 222, column: 13, scope: !719)
