; ModuleID = 'x86_64.4333146a342224ae-cgu.0'
source_filename = "x86_64.4333146a342224ae-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !18, identifier: "7fe89d2fe736c707e693e3f883a85c9c")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddrNotValid", scope: !13, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !15, templateParams: !18, identifier: "38c2b732db928fc4222b1757c0be45b")
!13 = !DINamespace(name: "addr", scope: !14)
!14 = !DINamespace(name: "x86_64", scope: null)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !12, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagPublic)
!17 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!18 = !{}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !22, vtableHolder: !27, templateParams: !18, identifier: "79cea1cd2b58d55db78f70a2cabc5764")
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !21, file: !2, baseType: !6, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !21, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !28, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !30, templateParams: !18, identifier: "5c0bf663e13aed18b42e27881fea807c")
!28 = !DINamespace(name: "fmt", scope: !29)
!29 = !DINamespace(name: "core", scope: null)
!30 = !{!31, !43, !95}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !27, file: !2, baseType: !32, size: 128, align: 64, flags: DIFlagPrivate)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !33, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!33 = !{!34, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !32, file: !2, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !37, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!37 = !{!38, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !36, file: !2, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !27, file: !2, baseType: !44, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !18, identifier: "256519899e0672ceeaebd48b858206cf")
!45 = !DINamespace(name: "option", scope: !29)
!46 = !{!47}
!47 = !DICompositeType(tag: DW_TAG_variant_part, scope: !44, file: !2, size: 128, align: 64, elements: !48, templateParams: !18, identifier: "aaa58002f4dea8efe61b6767ac33fc37", discriminator: !94)
!48 = !{!49, !90}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !47, file: !2, baseType: !50, size: 128, align: 64, extraData: i128 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !44, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !51, identifier: "776c1da22c7af6ba33782f68a1b8e37a")
!51 = !{!52}
!52 = !DITemplateTypeParameter(name: "T", type: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !54, templateParams: !18, identifier: "24318146e6c8bdc87822ff535a36a389")
!54 = !{!55, !89}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !53, file: !2, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !58, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !18, identifier: "73ebe3f20ae5650b90547dad65385e3c")
!58 = !DINamespace(name: "rt", scope: !28)
!59 = !{!60, !61, !63, !70, !72, !88}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !57, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !57, file: !2, baseType: !62, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !57, file: !2, baseType: !64, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !58, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !2, baseType: !71, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!71 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !57, file: !2, baseType: !73, size: 128, align: 64, flags: DIFlagPublic)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !58, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !74, templateParams: !18, identifier: "96b697dd48c62362a4fdd24d145e624f")
!74 = !{!75}
!75 = !DICompositeType(tag: DW_TAG_variant_part, scope: !73, file: !2, size: 128, align: 64, elements: !76, templateParams: !18, identifier: "6e17592290dd2b61d78d715af0a82ca", discriminator: !87)
!76 = !{!77, !81, !85}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !75, file: !2, baseType: !78, size: 128, align: 64, extraData: i128 0)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !73, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !79, templateParams: !18, identifier: "7f7125ee2c7058ca1284ed65477ee4b9")
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !78, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !75, file: !2, baseType: !82, size: 128, align: 64, extraData: i128 1)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !73, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !83, templateParams: !18, identifier: "8694fa46b6182d73a7ccc4f5e1fc1992")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !75, file: !2, baseType: !86, size: 128, align: 64, extraData: i128 2)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !73, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, identifier: "a1add839f51aefefecdce3df6110b61f")
!87 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !57, file: !2, baseType: !73, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !47, file: !2, baseType: !91, size: 128, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !44, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !92, templateParams: !51, identifier: "f965b304662f282235bb5dc25f3fae0f")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !91, file: !2, baseType: !53, size: 128, align: 64, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !44, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !27, file: !2, baseType: !96, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !97, templateParams: !18, identifier: "5bf4e31e3e4aabcd62e5de24a0ef4aed")
!97 = !{!98, !160}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !96, file: !2, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !58, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !101, templateParams: !18, identifier: "1a5e8fdf028d4c811a277b23bd1a7ccd")
!101 = !{!102, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !2, baseType: !103, size: 64, align: 64, flags: DIFlagPrivate)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !105, file: !2, align: 8, elements: !18, identifier: "fffd88202d364d3dc6423c86977eda88")
!105 = !DINamespace(name: "{extern#0}", scope: !58)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !100, file: !2, baseType: !107, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !103, !128}
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !111, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !112, templateParams: !18, identifier: "27f960845886d02861ac4e7842c7e3a5")
!111 = !DINamespace(name: "result", scope: !29)
!112 = !{!113}
!113 = !DICompositeType(tag: DW_TAG_variant_part, scope: !110, file: !2, size: 8, align: 8, elements: !114, templateParams: !18, identifier: "66d489f599415104a0443264f219183e", discriminator: !127)
!114 = !{!115, !123}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !113, file: !2, baseType: !116, size: 8, align: 8, extraData: i128 0)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !110, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !117, templateParams: !119, identifier: "32d59cf74d9b6f653b9b9bdadad679d3")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !116, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!119 = !{!120, !121}
!120 = !DITemplateTypeParameter(name: "T", type: !7)
!121 = !DITemplateTypeParameter(name: "E", type: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !28, file: !2, align: 8, flags: DIFlagPublic, elements: !18, identifier: "51fe0299a3d4a0f45904895a145dce6f")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !113, file: !2, baseType: !124, size: 8, align: 8, extraData: i128 1)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !110, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !125, templateParams: !119, identifier: "c5badd8093158a69d1e378abd358f888")
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !124, file: !2, baseType: !122, align: 8, offset: 8, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagArtificial)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !28, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !130, templateParams: !18, identifier: "fc8c5174fb3e28559b9f8ae49cb7e953")
!130 = !{!131, !132, !133, !134, !148, !149}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !2, baseType: !71, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !129, file: !2, baseType: !62, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !129, file: !2, baseType: !64, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !129, file: !2, baseType: !135, size: 128, align: 64, flags: DIFlagPrivate)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !136, templateParams: !18, identifier: "c533b5fb51e1e1ac761f959533d6bfff")
!136 = !{!137}
!137 = !DICompositeType(tag: DW_TAG_variant_part, scope: !135, file: !2, size: 128, align: 64, elements: !138, templateParams: !18, identifier: "6e5d37d4dda7b1d279317f623e9d50c", discriminator: !147)
!138 = !{!139, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !137, file: !2, baseType: !140, size: 128, align: 64, extraData: i128 0)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !135, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !141, identifier: "ae81ebe2a9866af8df117bed47adaee")
!141 = !{!142}
!142 = !DITemplateTypeParameter(name: "T", type: !9)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !137, file: !2, baseType: !144, size: 128, align: 64, extraData: i128 1)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !135, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !145, templateParams: !141, identifier: "a581ef88bb755022340fa98600955727")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !144, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !135, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !129, file: !2, baseType: !135, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !129, file: !2, baseType: !150, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !151, templateParams: !18, identifier: "6607f9b055c62ce71a6a286c8014df9")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !150, file: !2, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !18, identifier: "e54d2d913ff56dbcd50e7c95a4cf29a")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !150, file: !2, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3, lowerBound: 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !96, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !164, vtableHolder: !169, templateParams: !18, identifier: "cc4d06a836eb85b751048971eb6e8389")
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !163, file: !2, baseType: !6, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !163, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !163, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!169 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !173, vtableHolder: !178, templateParams: !18, identifier: "e87765898b81caf871af9c549f47ceaf")
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !172, file: !2, baseType: !6, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !172, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !172, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !172, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !14, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!181 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!182 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!183 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !187, vtableHolder: !192, templateParams: !18, identifier: "2247713a9470b8cb150dd913a592e9df")
!187 = !{!188, !189, !190, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !186, file: !2, baseType: !6, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !186, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !186, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !186, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !13, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !193, templateParams: !18, identifier: "e2f5a87bae0862b07d53d947247abc30")
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !192, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagPrivate)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !198, vtableHolder: !17, templateParams: !18, identifier: "b9b0cb319a7d463144fc74516180638a")
!198 = !{!199, !200, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !197, file: !2, baseType: !6, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !197, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !197, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !206, vtableHolder: !211, templateParams: !18, identifier: "9dc1a3e0e69f4079c636470b4625b901")
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !205, file: !2, baseType: !6, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !205, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !205, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hex", scope: !212, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !216, templateParams: !18, identifier: "22315ae3ec40c7e98e412a636774ddc7")
!212 = !DINamespace(name: "fmt", scope: !213)
!213 = !DINamespace(name: "{impl#11}", scope: !214)
!214 = !DINamespace(name: "idt", scope: !215)
!215 = !DINamespace(name: "structures", scope: !14)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !211, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagProtected)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !221, vtableHolder: !226, templateParams: !18, identifier: "ad33a4b560891dcb9ee705ba28e17c27")
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !220, file: !2, baseType: !6, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !220, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !220, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !220, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!226 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !230, vtableHolder: !235, templateParams: !18, identifier: "17c3fee8f9a7c95bd45ba8925f5d03e0")
!230 = !{!231, !232, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !229, file: !2, baseType: !6, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !229, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !229, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DescriptorTable", scope: !214, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIEnumerator(name: "Gdt", value: 0, isUnsigned: true)
!238 = !DIEnumerator(name: "Idt", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "Ldt", value: 2, isUnsigned: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "_ASSERT_OBJECT_SAFE", linkageName: "_ZN6x86_6410structures6paging6mapper19_ASSERT_OBJECT_SAFE17h79acb89758374ccbE", scope: !242, file: !244, line: 486, type: !245, isLocal: true, isDefinition: true, align: 64)
!242 = !DINamespace(name: "mapper", scope: !243)
!243 = !DINamespace(name: "paging", scope: !215)
!244 = !DIFile(filename: "src/structures/paging/mapper/mod.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10", checksumkind: CSK_MD5, checksum: "0dd5f33c2cee14124470d88449502bc1")
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !18, identifier: "fb6e848b587e2eacfb7d54128697c6c8")
!246 = !{!247}
!247 = !DICompositeType(tag: DW_TAG_variant_part, scope: !245, file: !2, size: 128, align: 64, elements: !248, templateParams: !18, identifier: "2a80dde7af0a67beb3f838c34ef0167a", discriminator: !263)
!248 = !{!249, !259}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !247, file: !2, baseType: !250, size: 128, align: 64, extraData: i128 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !245, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !251, identifier: "ca2efa719dcba64edbc2893672286251")
!251 = !{!252}
!252 = !DITemplateTypeParameter(name: "T", type: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !254, templateParams: !18, identifier: "f1bc21d87721e00a3d64028fc16fe047")
!254 = !{!255, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !253, file: !2, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, align: 8, elements: !18, identifier: "fb1e062ba969d967881f1fbe19b13c3")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !253, file: !2, baseType: !156, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !247, file: !2, baseType: !260, size: 128, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !245, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !261, templateParams: !251, identifier: "d8e6fca3af93bc5351c9b128744a919c")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !260, file: !2, baseType: !253, size: 128, align: 64, flags: DIFlagPublic)
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !267, vtableHolder: !272, templateParams: !18, identifier: "682fda7736fea697ed287b5aa9f90c25")
!267 = !{!268, !269, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !266, file: !2, baseType: !6, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !266, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysAddr", scope: !13, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !273, templateParams: !18, identifier: "d97ed7eebad9cd9cd9ff98a7846cb7f0")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !272, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagPrivate)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !278, vtableHolder: !283, templateParams: !18, identifier: "48669d8390386e186996b4a7fa5efad8")
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !277, file: !2, baseType: !6, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !277, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !277, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !277, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableFlags", scope: !284, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !285, templateParams: !18, identifier: "e46e1a397618028dbcdb145c9ff2ccc2")
!284 = !DINamespace(name: "page_table", scope: !243)
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !283, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagPrivate)
!287 = !{i32 8, !"PIC Level", i32 2}
!288 = !{i32 2, !"Dwarf Version", i32 4}
!289 = !{i32 2, !"Debug Info Version", i32 3}
!290 = !{!"rustc version 1.77.0-nightly (bf8716f1c 2023-12-24)"}
!291 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !292, producer: "clang LLVM (rustc version 1.77.0-nightly (bf8716f1c 2023-12-24))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !293, globals: !333, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/lib.rs/@/x86_64.4333146a342224ae-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10")
!293 = !{!64, !178, !235, !294, !302, !308, !312, !318, !322, !327}
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointSize", scope: !295, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !297)
!295 = !DINamespace(name: "debug", scope: !296)
!296 = !DINamespace(name: "registers", scope: !14)
!297 = !{!298, !299, !300, !301}
!298 = !DIEnumerator(name: "Length1B", value: 0, isUnsigned: true)
!299 = !DIEnumerator(name: "Length2B", value: 1, isUnsigned: true)
!300 = !DIEnumerator(name: "Length8B", value: 2, isUnsigned: true)
!301 = !DIEnumerator(name: "Length4B", value: 3, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointCondition", scope: !295, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIEnumerator(name: "InstructionExecution", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "DataWrites", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "IoReadsWrites", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "DataReadsWrites", value: 3, isUnsigned: true)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameError", scope: !284, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !309)
!309 = !{!310, !311}
!310 = !DIEnumerator(name: "FrameNotPresent", value: 0, isUnsigned: true)
!311 = !DIEnumerator(name: "HugeFrame", value: 1, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAddressRegisterNumber", scope: !295, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIEnumerator(name: "Dr0", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "Dr1", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "Dr2", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "Dr3", value: 3, isUnsigned: true)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlagUpdateError", scope: !242, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !319)
!319 = !{!320, !321}
!320 = !DIEnumerator(name: "PageNotMapped", value: 0, isUnsigned: true)
!321 = !DIEnumerator(name: "ParentEntryHugePage", value: 1, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InvalidPageTable", scope: !323, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !324)
!323 = !DINamespace(name: "recursive_page_table", scope: !242)
!324 = !{!325, !326}
!325 = !DIEnumerator(name: "NotRecursive", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "NotActive", value: 1, isUnsigned: true)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageTableLevel", scope: !284, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIEnumerator(name: "One", value: 1, isUnsigned: true)
!330 = !DIEnumerator(name: "Two", value: 2, isUnsigned: true)
!331 = !DIEnumerator(name: "Three", value: 3, isUnsigned: true)
!332 = !DIEnumerator(name: "Four", value: 4, isUnsigned: true)
!333 = !{!0, !19, !161, !170, !184, !195, !203, !218, !227, !240, !264, !275}
!334 = distinct !DISubprogram(name: "from_residual<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size1GiB>), x86_64::structures::paging::mapper::UnmapError, x86_64::structures::paging::mapper::UnmapError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h844d64cc2dcd6b53E", scope: !336, file: !335, line: 1957, type: !337, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !424, retainedNodes: !420)
!335 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e7b75310a6466c2d8a21cc01e7dba18")
!336 = !DINamespace(name: "{impl#27}", scope: !111)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !394, !412}
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size1GiB>), x86_64::structures::paging::mapper::UnmapError>", scope: !111, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !340, templateParams: !18, identifier: "cc9d4cd6d723d8debfc24633fa22e79")
!340 = !{!341}
!341 = !DICompositeType(tag: DW_TAG_variant_part, scope: !339, file: !2, size: 192, align: 64, elements: !342, templateParams: !18, identifier: "9fcea7ec90da190f958dd68e577b6dfb", discriminator: !393)
!342 = !{!343, !389}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !341, file: !2, baseType: !344, size: 192, align: 64, extraData: i128 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !339, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !345, templateParams: !373, identifier: "117ea6d6c5f9028d30009e052891ba12")
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !344, file: !2, baseType: !347, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size1GiB>)", file: !2, size: 128, align: 64, elements: !348, templateParams: !18, identifier: "ddd52bfacee90cbaa6f3ff4abe03739e")
!348 = !{!349, !365}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !347, file: !2, baseType: !350, size: 64, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size1GiB>", scope: !351, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !352, templateParams: !363, identifier: "1fd5d61f60a0e7395827d72e9853bcb3")
!351 = !DINamespace(name: "frame", scope: !243)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !350, file: !2, baseType: !272, size: 64, align: 64, flags: DIFlagProtected)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !350, file: !2, baseType: !355, align: 8, offset: 64, flags: DIFlagPrivate)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size1GiB>", scope: !356, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !357, identifier: "dfb1af0e7f6596537e1af5cefc6f3234")
!356 = !DINamespace(name: "marker", scope: !29)
!357 = !{!358}
!358 = !DITemplateTypeParameter(name: "T", type: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !360, file: !2, align: 8, flags: DIFlagPublic, elements: !361, templateParams: !18, identifier: "146d7732dc541407794ff1d616772a1")
!360 = !DINamespace(name: "page", scope: !243)
!361 = !{!362}
!362 = !DICompositeType(tag: DW_TAG_variant_part, scope: !359, file: !2, align: 8, elements: !18, identifier: "da9e09475336764422d5241090a950cf")
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "S", type: !359)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !347, file: !2, baseType: !366, size: 64, align: 64, offset: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "MapperFlush<x86_64::structures::paging::page::Size1GiB>", scope: !242, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !367, templateParams: !363, identifier: "9730574daf793f6e182efeb5ddc6f75e")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !366, file: !2, baseType: !369, size: 64, align: 64, flags: DIFlagPrivate)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Page<x86_64::structures::paging::page::Size1GiB>", scope: !360, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !370, templateParams: !363, identifier: "c43bc3410ea34d8921b7cf538ea196d4")
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !369, file: !2, baseType: !192, size: 64, align: 64, flags: DIFlagPrivate)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !369, file: !2, baseType: !355, align: 8, offset: 64, flags: DIFlagPrivate)
!373 = !{!374, !375}
!374 = !DITemplateTypeParameter(name: "T", type: !347)
!375 = !DITemplateTypeParameter(name: "E", type: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnmapError", scope: !242, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !377, templateParams: !18, identifier: "c1e2023685d16f13bcb8b78149630721")
!377 = !{!378}
!378 = !DICompositeType(tag: DW_TAG_variant_part, scope: !376, file: !2, size: 128, align: 64, elements: !379, templateParams: !18, identifier: "6048a8ee5582a6ca5175b0d9a5ec8bfb", discriminator: !388)
!379 = !{!380, !382, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ParentEntryHugePage", scope: !378, file: !2, baseType: !381, size: 128, align: 64, extraData: i128 0)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParentEntryHugePage", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, identifier: "2317cdec9c3d60973f03db8c8bc535a1")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "PageNotMapped", scope: !378, file: !2, baseType: !383, size: 128, align: 64, extraData: i128 1)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageNotMapped", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, identifier: "d8dd5f1b5bf570b465d9ad63b4f5d3ba")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidFrameAddress", scope: !378, file: !2, baseType: !385, size: 128, align: 64, extraData: i128 2)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidFrameAddress", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !386, templateParams: !18, identifier: "54ab1e9cd76943e5ed6300631cf9b931")
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !385, file: !2, baseType: !272, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !341, file: !2, baseType: !390, size: 192, align: 64, extraData: i128 1)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !339, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !391, templateParams: !373, identifier: "5a01ae7d068433f878f52afc513a28e8")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !376, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, x86_64::structures::paging::mapper::UnmapError>", scope: !111, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !395, templateParams: !18, identifier: "5f4c2676c41d91b657292e52332b2f74")
!395 = !{!396}
!396 = !DICompositeType(tag: DW_TAG_variant_part, scope: !394, file: !2, size: 128, align: 64, elements: !397, templateParams: !18, identifier: "5904095ed2c3d42c6f609d3f39723258")
!397 = !{!398, !408}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !396, file: !2, baseType: !399, size: 128, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !394, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !400, templateParams: !406, identifier: "eb698e1c093e6cfac18a423775c9b90")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !399, file: !2, baseType: !402, align: 8, flags: DIFlagPublic)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !403, file: !2, align: 8, flags: DIFlagPublic, elements: !404, templateParams: !18, identifier: "245f21ff7a9b6927717507d68e4319cb")
!403 = !DINamespace(name: "convert", scope: !29)
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !402, file: !2, align: 8, elements: !18, identifier: "687d5cf5e4af6afdd42501ce35a0d623")
!406 = !{!407, !375}
!407 = !DITemplateTypeParameter(name: "T", type: !402)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !396, file: !2, baseType: !409, size: 128, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !394, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !410, templateParams: !406, identifier: "8ef23df2207aaecee7a2d2fb178ed66b")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !2, baseType: !376, size: 128, align: 64, flags: DIFlagPublic)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !413, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !414, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !416, templateParams: !18, identifier: "a313c32de3a8c9bc539767ad1b1d23fa")
!414 = !DINamespace(name: "location", scope: !415)
!415 = !DINamespace(name: "panic", scope: !29)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !413, file: !2, baseType: !36, size: 128, align: 64, flags: DIFlagPrivate)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !413, file: !2, baseType: !71, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !413, file: !2, baseType: !71, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!420 = !{!421, !422}
!421 = !DILocalVariable(name: "residual", arg: 1, scope: !334, file: !335, line: 1957, type: !394)
!422 = !DILocalVariable(name: "e", scope: !423, file: !335, line: 1959, type: !376, align: 8)
!423 = distinct !DILexicalBlock(scope: !334, file: !335, line: 1959, column: 13)
!424 = !{!374, !375, !425}
!425 = !DITemplateTypeParameter(name: "F", type: !376)
!426 = !DILocation(line: 1957, column: 22, scope: !334)
!427 = !DILocation(line: 1959, column: 17, scope: !334)
!428 = !{i64 0, i64 3}
!429 = !DILocation(line: 1959, column: 17, scope: !423)
!430 = !DILocalVariable(name: "t", arg: 1, scope: !431, file: !432, line: 766, type: !376)
!431 = distinct !DISubprogram(name: "from<x86_64::structures::paging::mapper::UnmapError>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h88f80df2f6f374c3E", scope: !433, file: !432, line: 766, type: !434, scopeLine: 766, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !437, retainedNodes: !436)
!432 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "42846d055f67fc97bf276e58c4167411")
!433 = !DINamespace(name: "{impl#4}", scope: !403)
!434 = !DISubroutineType(types: !435)
!435 = !{!376, !376}
!436 = !{!430}
!437 = !{!438}
!438 = !DITemplateTypeParameter(name: "T", type: !376)
!439 = !DILocation(line: 766, column: 13, scope: !431, inlinedAt: !440)
!440 = distinct !DILocation(line: 1959, column: 27, scope: !423)
!441 = !DILocation(line: 768, column: 6, scope: !431, inlinedAt: !440)
!442 = !DILocation(line: 1959, column: 27, scope: !423)
!443 = !DILocation(line: 1959, column: 23, scope: !423)
!444 = !DILocation(line: 1961, column: 6, scope: !334)
!445 = distinct !DISubprogram(name: "from_residual<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size2MiB>), x86_64::structures::paging::mapper::UnmapError, x86_64::structures::paging::mapper::UnmapError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h9a5e04ac0dc09f02E", scope: !336, file: !335, line: 1957, type: !446, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !490, retainedNodes: !486)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !394, !412}
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size2MiB>), x86_64::structures::paging::mapper::UnmapError>", scope: !111, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !449, templateParams: !18, identifier: "fbfabcee4b672210f88e7235937ab164")
!449 = !{!450}
!450 = !DICompositeType(tag: DW_TAG_variant_part, scope: !448, file: !2, size: 192, align: 64, elements: !451, templateParams: !18, identifier: "116f4a3215e0182f8f5b74572e5413a8", discriminator: !485)
!451 = !{!452, !481}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !450, file: !2, baseType: !453, size: 192, align: 64, extraData: i128 0)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !448, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !454, templateParams: !479, identifier: "9c1caff2e70d962653e555f6379237e5")
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !453, file: !2, baseType: !456, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size2MiB>)", file: !2, size: 128, align: 64, elements: !457, templateParams: !18, identifier: "d6641d06740f5b8b6c936db91f1f982f")
!457 = !{!458, !471}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !456, file: !2, baseType: !459, size: 64, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size2MiB>", scope: !351, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !460, templateParams: !469, identifier: "dd14c320cc9c8988be5d65f116798f0")
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !459, file: !2, baseType: !272, size: 64, align: 64, flags: DIFlagProtected)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !459, file: !2, baseType: !463, align: 8, offset: 64, flags: DIFlagPrivate)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size2MiB>", scope: !356, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !464, identifier: "70d121c1ab791bc7101769c7120acf24")
!464 = !{!465}
!465 = !DITemplateTypeParameter(name: "T", type: !466)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !360, file: !2, align: 8, flags: DIFlagPublic, elements: !467, templateParams: !18, identifier: "66d6aa7289b686871f4fe288affd783f")
!467 = !{!468}
!468 = !DICompositeType(tag: DW_TAG_variant_part, scope: !466, file: !2, align: 8, elements: !18, identifier: "e9b5d11775aa3238c2e3ed63fe9977c8")
!469 = !{!470}
!470 = !DITemplateTypeParameter(name: "S", type: !466)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !456, file: !2, baseType: !472, size: 64, align: 64, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "MapperFlush<x86_64::structures::paging::page::Size2MiB>", scope: !242, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !473, templateParams: !469, identifier: "5a2e8b5ce86aeb75b277fb5c1e25a9bb")
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !472, file: !2, baseType: !475, size: 64, align: 64, flags: DIFlagPrivate)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Page<x86_64::structures::paging::page::Size2MiB>", scope: !360, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !476, templateParams: !469, identifier: "dc5b038853c15b0482b7b9dd21d54a27")
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !475, file: !2, baseType: !192, size: 64, align: 64, flags: DIFlagPrivate)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !2, baseType: !463, align: 8, offset: 64, flags: DIFlagPrivate)
!479 = !{!480, !375}
!480 = !DITemplateTypeParameter(name: "T", type: !456)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !450, file: !2, baseType: !482, size: 192, align: 64, extraData: i128 1)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !448, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !483, templateParams: !479, identifier: "93255a5bf55659d52e059a2173432c37")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !482, file: !2, baseType: !376, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !448, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!486 = !{!487, !488}
!487 = !DILocalVariable(name: "residual", arg: 1, scope: !445, file: !335, line: 1957, type: !394)
!488 = !DILocalVariable(name: "e", scope: !489, file: !335, line: 1959, type: !376, align: 8)
!489 = distinct !DILexicalBlock(scope: !445, file: !335, line: 1959, column: 13)
!490 = !{!480, !375, !425}
!491 = !DILocation(line: 1957, column: 22, scope: !445)
!492 = !DILocation(line: 1959, column: 17, scope: !445)
!493 = !DILocation(line: 1959, column: 17, scope: !489)
!494 = !DILocation(line: 766, column: 13, scope: !431, inlinedAt: !495)
!495 = distinct !DILocation(line: 1959, column: 27, scope: !489)
!496 = !DILocation(line: 768, column: 6, scope: !431, inlinedAt: !495)
!497 = !DILocation(line: 1959, column: 27, scope: !489)
!498 = !DILocation(line: 1959, column: 23, scope: !489)
!499 = !DILocation(line: 1961, column: 6, scope: !445)
!500 = distinct !DISubprogram(name: "from_residual<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size4KiB>), x86_64::structures::paging::mapper::UnmapError, x86_64::structures::paging::mapper::UnmapError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17he99303f8fb88bcb3E", scope: !336, file: !335, line: 1957, type: !501, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !545, retainedNodes: !541)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !394, !412}
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size4KiB>), x86_64::structures::paging::mapper::UnmapError>", scope: !111, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !504, templateParams: !18, identifier: "5259de42a0f1f33ea2e157892d403322")
!504 = !{!505}
!505 = !DICompositeType(tag: DW_TAG_variant_part, scope: !503, file: !2, size: 192, align: 64, elements: !506, templateParams: !18, identifier: "eda59de5136a4b5ea75c622a09232382", discriminator: !540)
!506 = !{!507, !536}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !505, file: !2, baseType: !508, size: 192, align: 64, extraData: i128 0)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !503, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !509, templateParams: !534, identifier: "9fe73147dcc8d886bb5db7454ad32ee")
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !508, file: !2, baseType: !511, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "(x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>, x86_64::structures::paging::mapper::MapperFlush<x86_64::structures::paging::page::Size4KiB>)", file: !2, size: 128, align: 64, elements: !512, templateParams: !18, identifier: "a9d73182913a00e1b7c6c2fdbbfadc7c")
!512 = !{!513, !526}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !511, file: !2, baseType: !514, size: 64, align: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size4KiB>", scope: !351, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !515, templateParams: !524, identifier: "c6f2d25f504d29563e6e9b7e351fb0c9")
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !514, file: !2, baseType: !272, size: 64, align: 64, flags: DIFlagProtected)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !2, baseType: !518, align: 8, offset: 64, flags: DIFlagPrivate)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size4KiB>", scope: !356, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !519, identifier: "6195c6edaac9cf0f644795faf993a5e")
!519 = !{!520}
!520 = !DITemplateTypeParameter(name: "T", type: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !360, file: !2, align: 8, flags: DIFlagPublic, elements: !522, templateParams: !18, identifier: "1ac036b13941ba33a364e7eafa084fbc")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_variant_part, scope: !521, file: !2, align: 8, elements: !18, identifier: "a965521e46221956b53a0785bcbb7556")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "S", type: !521)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !511, file: !2, baseType: !527, size: 64, align: 64, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "MapperFlush<x86_64::structures::paging::page::Size4KiB>", scope: !242, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !528, templateParams: !524, identifier: "4bc5d9281cef6f4f2414090f2b8df1ca")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !527, file: !2, baseType: !530, size: 64, align: 64, flags: DIFlagPrivate)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Page<x86_64::structures::paging::page::Size4KiB>", scope: !360, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !531, templateParams: !524, identifier: "c6ed51afd1fc4718852d74993a39657a")
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !530, file: !2, baseType: !192, size: 64, align: 64, flags: DIFlagPrivate)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !530, file: !2, baseType: !518, align: 8, offset: 64, flags: DIFlagPrivate)
!534 = !{!535, !375}
!535 = !DITemplateTypeParameter(name: "T", type: !511)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !505, file: !2, baseType: !537, size: 192, align: 64, extraData: i128 1)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !503, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !538, templateParams: !534, identifier: "2f044723616f1c5639775043fbf96260")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !537, file: !2, baseType: !376, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !503, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!541 = !{!542, !543}
!542 = !DILocalVariable(name: "residual", arg: 1, scope: !500, file: !335, line: 1957, type: !394)
!543 = !DILocalVariable(name: "e", scope: !544, file: !335, line: 1959, type: !376, align: 8)
!544 = distinct !DILexicalBlock(scope: !500, file: !335, line: 1959, column: 13)
!545 = !{!535, !375, !425}
!546 = !DILocation(line: 1957, column: 22, scope: !500)
!547 = !DILocation(line: 1959, column: 17, scope: !500)
!548 = !DILocation(line: 1959, column: 17, scope: !544)
!549 = !DILocation(line: 766, column: 13, scope: !431, inlinedAt: !550)
!550 = distinct !DILocation(line: 1959, column: 27, scope: !544)
!551 = !DILocation(line: 768, column: 6, scope: !431, inlinedAt: !550)
!552 = !DILocation(line: 1959, column: 27, scope: !544)
!553 = !DILocation(line: 1959, column: 23, scope: !544)
!554 = !DILocation(line: 1961, column: 6, scope: !500)
!555 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h6bd201ce000b0294E", scope: !557, file: !556, line: 2325, type: !558, scopeLine: 2325, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !561)
!556 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!557 = !DINamespace(name: "{impl#12}", scope: !28)
!558 = !DISubroutineType(types: !559)
!559 = !{!110, !560, !128}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !{!562, !563}
!562 = !DILocalVariable(name: "self", arg: 1, scope: !555, file: !556, line: 2325, type: !560)
!563 = !DILocalVariable(name: "f", arg: 2, scope: !555, file: !556, line: 2325, type: !128)
!564 = !DILocation(line: 2325, column: 12, scope: !555)
!565 = !DILocation(line: 2325, column: 19, scope: !555)
!566 = !DILocation(line: 2326, column: 9, scope: !555)
!567 = !DILocation(line: 2327, column: 6, scope: !555)
!568 = distinct !DISubprogram(name: "get_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8get_bits17h7b08017188b0c65cE", scope: !570, file: !569, line: 222, type: !572, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !590, retainedNodes: !583)
!569 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "06d6ae76c286c9465509ffd6bd39fdfa")
!570 = !DINamespace(name: "{impl#2}", scope: !571)
!571 = !DINamespace(name: "bit_field", scope: null)
!572 = !DISubroutineType(types: !573)
!573 = !{!169, !574, !575}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !576, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !578, templateParams: !581, identifier: "901b65327c7a0db6ec238473579c070f")
!576 = !DINamespace(name: "range", scope: !577)
!577 = !DINamespace(name: "ops", scope: !29)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !575, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !575, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!581 = !{!582}
!582 = !DITemplateTypeParameter(name: "Idx", type: !9)
!583 = !{!584, !585, !586, !588}
!584 = !DILocalVariable(name: "self", arg: 1, scope: !568, file: !569, line: 222, type: !574)
!585 = !DILocalVariable(name: "range", arg: 2, scope: !568, file: !569, line: 222, type: !575)
!586 = !DILocalVariable(name: "range", scope: !587, file: !569, line: 223, type: !575, align: 8)
!587 = distinct !DILexicalBlock(scope: !568, file: !569, line: 223, column: 17)
!588 = !DILocalVariable(name: "bits", scope: !589, file: !569, line: 230, type: !169, align: 2)
!589 = distinct !DILexicalBlock(scope: !587, file: !569, line: 230, column: 17)
!590 = !{!591}
!591 = !DITemplateTypeParameter(name: "T", type: !575)
!592 = !DILocation(line: 222, column: 48, scope: !568)
!593 = !DILocation(line: 222, column: 55, scope: !568)
!594 = !DILocation(line: 223, column: 29, scope: !568)
!595 = !DILocation(line: 223, column: 21, scope: !587)
!596 = !DILocation(line: 225, column: 25, scope: !587)
!597 = !DILocation(line: 225, column: 17, scope: !587)
!598 = !DILocation(line: 226, column: 25, scope: !587)
!599 = !DILocation(line: 226, column: 17, scope: !587)
!600 = !DILocation(line: 227, column: 25, scope: !587)
!601 = !DILocation(line: 227, column: 17, scope: !587)
!602 = !DILocation(line: 230, column: 28, scope: !587)
!603 = !DILocation(line: 230, column: 37, scope: !587)
!604 = !DILocation(line: 230, column: 71, scope: !587)
!605 = !DILocation(line: 230, column: 21, scope: !589)
!606 = !DILocation(line: 233, column: 17, scope: !589)
!607 = !DILocation(line: 234, column: 14, scope: !568)
!608 = distinct !DISubprogram(name: "get_bit", linkageName: "_ZN43_$LT$u64$u20$as$u20$bit_field..BitField$GT$7get_bit17h7dfd3dab7e76c857E", scope: !609, file: !569, line: 215, type: !610, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !613)
!609 = !DINamespace(name: "{impl#4}", scope: !571)
!610 = !DISubroutineType(types: !611)
!611 = !{!226, !612, !9}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !{!614, !615}
!614 = !DILocalVariable(name: "self", arg: 1, scope: !608, file: !569, line: 215, type: !612)
!615 = !DILocalVariable(name: "bit", arg: 2, scope: !608, file: !569, line: 215, type: !9)
!616 = !DILocation(line: 215, column: 24, scope: !608)
!617 = !DILocation(line: 215, column: 31, scope: !608)
!618 = !DILocation(line: 216, column: 25, scope: !608)
!619 = !DILocation(line: 216, column: 17, scope: !608)
!620 = !DILocation(line: 218, column: 18, scope: !608)
!621 = !DILocation(line: 218, column: 26, scope: !608)
!622 = !DILocation(line: 218, column: 17, scope: !608)
!623 = !DILocation(line: 219, column: 14, scope: !608)
!624 = distinct !DISubprogram(name: "get_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u64$u20$as$u20$bit_field..BitField$GT$8get_bits17h2f217ad10ee0b965E", scope: !609, file: !569, line: 222, type: !625, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !590, retainedNodes: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!17, !612, !575}
!627 = !{!628, !629, !630, !632}
!628 = !DILocalVariable(name: "self", arg: 1, scope: !624, file: !569, line: 222, type: !612)
!629 = !DILocalVariable(name: "range", arg: 2, scope: !624, file: !569, line: 222, type: !575)
!630 = !DILocalVariable(name: "range", scope: !631, file: !569, line: 223, type: !575, align: 8)
!631 = distinct !DILexicalBlock(scope: !624, file: !569, line: 223, column: 17)
!632 = !DILocalVariable(name: "bits", scope: !633, file: !569, line: 230, type: !17, align: 8)
!633 = distinct !DILexicalBlock(scope: !631, file: !569, line: 230, column: 17)
!634 = !DILocation(line: 222, column: 48, scope: !624)
!635 = !DILocation(line: 222, column: 55, scope: !624)
!636 = !DILocation(line: 223, column: 29, scope: !624)
!637 = !DILocation(line: 223, column: 21, scope: !631)
!638 = !DILocation(line: 225, column: 25, scope: !631)
!639 = !DILocation(line: 225, column: 17, scope: !631)
!640 = !DILocation(line: 226, column: 25, scope: !631)
!641 = !DILocation(line: 226, column: 17, scope: !631)
!642 = !DILocation(line: 227, column: 25, scope: !631)
!643 = !DILocation(line: 227, column: 17, scope: !631)
!644 = !DILocation(line: 230, column: 28, scope: !631)
!645 = !DILocation(line: 230, column: 37, scope: !631)
!646 = !DILocation(line: 230, column: 71, scope: !631)
!647 = !DILocation(line: 230, column: 21, scope: !633)
!648 = !DILocation(line: 233, column: 17, scope: !633)
!649 = !DILocation(line: 234, column: 14, scope: !624)
!650 = distinct !DISubprogram(name: "get_bits<core::ops::range::RangeFrom<usize>>", linkageName: "_ZN43_$LT$u64$u20$as$u20$bit_field..BitField$GT$8get_bits17ha1bbc32d3ecac5b1E", scope: !609, file: !569, line: 222, type: !651, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !663, retainedNodes: !656)
!651 = !DISubroutineType(types: !652)
!652 = !{!17, !612, !653}
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !576, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !654, templateParams: !581, identifier: "d15a4769f06d4bd4dfd8f62ca68c0cb5")
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !653, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!656 = !{!657, !658, !659, !661}
!657 = !DILocalVariable(name: "self", arg: 1, scope: !650, file: !569, line: 222, type: !612)
!658 = !DILocalVariable(name: "range", arg: 2, scope: !650, file: !569, line: 222, type: !653)
!659 = !DILocalVariable(name: "range", scope: !660, file: !569, line: 223, type: !575, align: 8)
!660 = distinct !DILexicalBlock(scope: !650, file: !569, line: 223, column: 17)
!661 = !DILocalVariable(name: "bits", scope: !662, file: !569, line: 230, type: !17, align: 8)
!662 = distinct !DILexicalBlock(scope: !660, file: !569, line: 230, column: 17)
!663 = !{!664}
!664 = !DITemplateTypeParameter(name: "T", type: !653)
!665 = !DILocation(line: 222, column: 48, scope: !650)
!666 = !DILocation(line: 222, column: 55, scope: !650)
!667 = !DILocation(line: 223, column: 29, scope: !650)
!668 = !DILocation(line: 223, column: 21, scope: !660)
!669 = !DILocation(line: 225, column: 25, scope: !660)
!670 = !DILocation(line: 225, column: 17, scope: !660)
!671 = !DILocation(line: 226, column: 25, scope: !660)
!672 = !DILocation(line: 226, column: 17, scope: !660)
!673 = !DILocation(line: 227, column: 25, scope: !660)
!674 = !DILocation(line: 227, column: 17, scope: !660)
!675 = !DILocation(line: 230, column: 28, scope: !660)
!676 = !DILocation(line: 230, column: 37, scope: !660)
!677 = !DILocation(line: 230, column: 71, scope: !660)
!678 = !DILocation(line: 230, column: 21, scope: !662)
!679 = !DILocation(line: 233, column: 17, scope: !662)
!680 = !DILocation(line: 234, column: 14, scope: !650)
!681 = distinct !DISubprogram(name: "set_bits<core::ops::range::RangeFrom<usize>>", linkageName: "_ZN43_$LT$u64$u20$as$u20$bit_field..BitField$GT$8set_bits17haaf318cdd880d486E", scope: !609, file: !569, line: 250, type: !682, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !663, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !684, !653, !17}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u64", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!685 = !{!686, !687, !688, !689, !691}
!686 = !DILocalVariable(name: "self", arg: 1, scope: !681, file: !569, line: 250, type: !684)
!687 = !DILocalVariable(name: "range", arg: 2, scope: !681, file: !569, line: 250, type: !653)
!688 = !DILocalVariable(name: "value", arg: 3, scope: !681, file: !569, line: 250, type: !17)
!689 = !DILocalVariable(name: "range", scope: !690, file: !569, line: 251, type: !575, align: 8)
!690 = distinct !DILexicalBlock(scope: !681, file: !569, line: 251, column: 17)
!691 = !DILocalVariable(name: "bitmask", scope: !692, file: !569, line: 260, type: !17, align: 8)
!692 = distinct !DILexicalBlock(scope: !690, file: !569, line: 260, column: 17)
!693 = !DILocation(line: 250, column: 48, scope: !681)
!694 = !DILocation(line: 250, column: 59, scope: !681)
!695 = !DILocation(line: 250, column: 69, scope: !681)
!696 = !DILocation(line: 251, column: 29, scope: !681)
!697 = !DILocation(line: 251, column: 21, scope: !690)
!698 = !DILocation(line: 253, column: 25, scope: !690)
!699 = !DILocation(line: 253, column: 17, scope: !690)
!700 = !DILocation(line: 254, column: 25, scope: !690)
!701 = !DILocation(line: 254, column: 17, scope: !690)
!702 = !DILocation(line: 255, column: 25, scope: !690)
!703 = !DILocation(line: 255, column: 17, scope: !690)
!704 = !DILocation(line: 256, column: 54, scope: !690)
!705 = !DILocation(line: 256, column: 34, scope: !690)
!706 = !DILocation(line: 256, column: 25, scope: !690)
!707 = !DILocation(line: 257, column: 45, scope: !690)
!708 = !DILocation(line: 257, column: 25, scope: !690)
!709 = !DILocation(line: 256, column: 17, scope: !690)
!710 = !DILocation(line: 260, column: 45, scope: !690)
!711 = !DILocation(line: 260, column: 39, scope: !690)
!712 = !DILocation(line: 261, column: 37, scope: !690)
!713 = !DILocation(line: 260, column: 38, scope: !690)
!714 = !DILocation(line: 260, column: 37, scope: !690)
!715 = !DILocation(line: 260, column: 21, scope: !692)
!716 = !DILocation(line: 265, column: 26, scope: !692)
!717 = !DILocation(line: 265, column: 25, scope: !692)
!718 = !DILocation(line: 265, column: 45, scope: !692)
!719 = !DILocation(line: 265, column: 17, scope: !692)
!720 = !DILocation(line: 268, column: 14, scope: !681)
!721 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u64$u20$as$u20$bit_field..BitField$GT$8set_bits17hc3755f31b40a6134E", scope: !609, file: !569, line: 250, type: !722, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !590, retainedNodes: !724)
!722 = !DISubroutineType(types: !723)
!723 = !{!684, !684, !575, !17}
!724 = !{!725, !726, !727, !728, !730}
!725 = !DILocalVariable(name: "self", arg: 1, scope: !721, file: !569, line: 250, type: !684)
!726 = !DILocalVariable(name: "range", arg: 2, scope: !721, file: !569, line: 250, type: !575)
!727 = !DILocalVariable(name: "value", arg: 3, scope: !721, file: !569, line: 250, type: !17)
!728 = !DILocalVariable(name: "range", scope: !729, file: !569, line: 251, type: !575, align: 8)
!729 = distinct !DILexicalBlock(scope: !721, file: !569, line: 251, column: 17)
!730 = !DILocalVariable(name: "bitmask", scope: !731, file: !569, line: 260, type: !17, align: 8)
!731 = distinct !DILexicalBlock(scope: !729, file: !569, line: 260, column: 17)
!732 = !DILocation(line: 250, column: 48, scope: !721)
!733 = !DILocation(line: 250, column: 59, scope: !721)
!734 = !DILocation(line: 250, column: 69, scope: !721)
!735 = !DILocation(line: 251, column: 29, scope: !721)
!736 = !DILocation(line: 251, column: 21, scope: !729)
!737 = !DILocation(line: 253, column: 25, scope: !729)
!738 = !DILocation(line: 253, column: 17, scope: !729)
!739 = !DILocation(line: 254, column: 25, scope: !729)
!740 = !DILocation(line: 254, column: 17, scope: !729)
!741 = !DILocation(line: 255, column: 25, scope: !729)
!742 = !DILocation(line: 255, column: 17, scope: !729)
!743 = !DILocation(line: 256, column: 54, scope: !729)
!744 = !DILocation(line: 256, column: 34, scope: !729)
!745 = !DILocation(line: 256, column: 25, scope: !729)
!746 = !DILocation(line: 257, column: 45, scope: !729)
!747 = !DILocation(line: 257, column: 25, scope: !729)
!748 = !DILocation(line: 256, column: 17, scope: !729)
!749 = !DILocation(line: 260, column: 45, scope: !729)
!750 = !DILocation(line: 260, column: 39, scope: !729)
!751 = !DILocation(line: 261, column: 37, scope: !729)
!752 = !DILocation(line: 260, column: 38, scope: !729)
!753 = !DILocation(line: 260, column: 37, scope: !729)
!754 = !DILocation(line: 260, column: 21, scope: !731)
!755 = !DILocation(line: 265, column: 26, scope: !731)
!756 = !DILocation(line: 265, column: 25, scope: !731)
!757 = !DILocation(line: 265, column: 45, scope: !731)
!758 = !DILocation(line: 265, column: 17, scope: !731)
!759 = !DILocation(line: 268, column: 14, scope: !721)
!760 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u16$GT$3fmt17h63eb0c0692067a7bE", scope: !762, file: !761, line: 189, type: !764, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !766)
!761 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "e54845ef989d12b8a79056a0477bb701")
!762 = !DINamespace(name: "{impl#85}", scope: !763)
!763 = !DINamespace(name: "num", scope: !28)
!764 = !DISubroutineType(types: !765)
!765 = !{!110, !574, !128}
!766 = !{!767, !768}
!767 = !DILocalVariable(name: "self", arg: 1, scope: !760, file: !761, line: 189, type: !574)
!768 = !DILocalVariable(name: "f", arg: 2, scope: !760, file: !761, line: 189, type: !128)
!769 = !DILocation(line: 189, column: 20, scope: !760)
!770 = !DILocation(line: 189, column: 27, scope: !760)
!771 = !DILocation(line: 190, column: 20, scope: !760)
!772 = !DILocation(line: 192, column: 27, scope: !760)
!773 = !DILocation(line: 191, column: 21, scope: !760)
!774 = !DILocation(line: 195, column: 21, scope: !760)
!775 = !DILocation(line: 193, column: 21, scope: !760)
!776 = !DILocation(line: 197, column: 14, scope: !760)
!777 = !{i8 0, i8 2}
!778 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17h5475832f1374dde5E", scope: !779, file: !761, line: 189, type: !780, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !782)
!779 = !DINamespace(name: "{impl#87}", scope: !763)
!780 = !DISubroutineType(types: !781)
!781 = !{!110, !612, !128}
!782 = !{!783, !784}
!783 = !DILocalVariable(name: "self", arg: 1, scope: !778, file: !761, line: 189, type: !612)
!784 = !DILocalVariable(name: "f", arg: 2, scope: !778, file: !761, line: 189, type: !128)
!785 = !DILocation(line: 189, column: 20, scope: !778)
!786 = !DILocation(line: 189, column: 27, scope: !778)
!787 = !DILocation(line: 190, column: 20, scope: !778)
!788 = !DILocation(line: 192, column: 27, scope: !778)
!789 = !DILocation(line: 191, column: 21, scope: !778)
!790 = !DILocation(line: 195, column: 21, scope: !778)
!791 = !DILocation(line: 193, column: 21, scope: !778)
!792 = !DILocation(line: 197, column: 14, scope: !778)
!793 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hf17d20f1d265c757E", scope: !27, file: !556, line: 346, type: !794, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, declaration: !799, retainedNodes: !800)
!794 = !DISubroutineType(types: !795)
!795 = !{!27, !32, !96, !53, !796}
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !58, file: !2, align: 8, flags: DIFlagPublic, elements: !797, templateParams: !18, identifier: "4cc94df58f798619b2bbafc8f6fa66c0")
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !796, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!799 = !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hf17d20f1d265c757E", scope: !27, file: !556, line: 346, type: !794, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!800 = !{!801, !802, !803, !804, !805}
!801 = !DILocalVariable(name: "pieces", arg: 1, scope: !793, file: !556, line: 347, type: !32)
!802 = !DILocalVariable(name: "args", arg: 2, scope: !793, file: !556, line: 348, type: !96)
!803 = !DILocalVariable(name: "fmt", arg: 3, scope: !793, file: !556, line: 349, type: !53)
!804 = !DILocalVariable(name: "_unsafe_arg", scope: !793, file: !556, line: 350, type: !796, align: 1)
!805 = !DILocalVariable(arg: 4, scope: !793, file: !556, line: 350, type: !796)
!806 = !DILocation(line: 350, column: 9, scope: !793)
!807 = !DILocation(line: 347, column: 9, scope: !793)
!808 = !DILocation(line: 348, column: 9, scope: !793)
!809 = !DILocation(line: 349, column: 9, scope: !793)
!810 = !DILocation(line: 352, column: 34, scope: !793)
!811 = !DILocation(line: 352, column: 9, scope: !793)
!812 = !{i64 8}
!813 = !DILocation(line: 353, column: 6, scope: !793)
!814 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hbb9994ecce7fe67eE", scope: !27, file: !556, line: 331, type: !815, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, declaration: !817, retainedNodes: !818)
!815 = !DISubroutineType(types: !816)
!816 = !{!27, !32, !96}
!817 = !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hbb9994ecce7fe67eE", scope: !27, file: !556, line: 331, type: !815, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!818 = !{!819, !820}
!819 = !DILocalVariable(name: "pieces", arg: 1, scope: !814, file: !556, line: 331, type: !32)
!820 = !DILocalVariable(name: "args", arg: 2, scope: !814, file: !556, line: 331, type: !96)
!821 = !DILocation(line: 331, column: 19, scope: !814)
!822 = !DILocation(line: 331, column: 47, scope: !814)
!823 = !DILocation(line: 332, column: 12, scope: !814)
!824 = !DILocation(line: 332, column: 56, scope: !814)
!825 = !DILocation(line: 333, column: 13, scope: !814)
!826 = !DILocation(line: 332, column: 41, scope: !814)
!827 = !DILocation(line: 335, column: 34, scope: !814)
!828 = !DILocation(line: 335, column: 9, scope: !814)
!829 = !DILocation(line: 336, column: 6, scope: !814)
!830 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h83886342be577089E", scope: !27, file: !556, line: 321, type: !831, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, declaration: !833, retainedNodes: !834)
!831 = !DISubroutineType(types: !832)
!832 = !{!27, !32}
!833 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h83886342be577089E", scope: !27, file: !556, line: 321, type: !831, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !18)
!834 = !{!835}
!835 = !DILocalVariable(name: "pieces", arg: 1, scope: !830, file: !556, line: 321, type: !32)
!836 = !DILocation(line: 321, column: 28, scope: !830)
!837 = !DILocation(line: 322, column: 12, scope: !830)
!838 = !DILocation(line: 325, column: 34, scope: !830)
!839 = !DILocation(line: 325, column: 9, scope: !830)
!840 = !DILocation(line: 326, column: 6, scope: !830)
!841 = !DILocation(line: 323, column: 13, scope: !830)
!842 = distinct !DISubprogram(name: "checked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11checked_add17hf75fef985298072bE", scope: !844, file: !843, line: 460, type: !846, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !861)
!843 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "77985b69d8b96d3837a96dc7438f1392")
!844 = !DINamespace(name: "{impl#9}", scope: !845)
!845 = !DINamespace(name: "num", scope: !29)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !17, !17}
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !849, templateParams: !18, identifier: "6f1696d18d23d47c69b222f2f35e16b5")
!849 = !{!850}
!850 = !DICompositeType(tag: DW_TAG_variant_part, scope: !848, file: !2, size: 128, align: 64, elements: !851, templateParams: !18, identifier: "73e7139f007f4e6023be7ef6d253e356", discriminator: !860)
!851 = !{!852, !856}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !850, file: !2, baseType: !853, size: 128, align: 64, extraData: i128 0)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !848, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !854, identifier: "e506bb47389de31fa5a35e49f43ba94d")
!854 = !{!855}
!855 = !DITemplateTypeParameter(name: "T", type: !17)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !850, file: !2, baseType: !857, size: 128, align: 64, extraData: i128 1)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !848, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !858, templateParams: !854, identifier: "7e2f1f2d455f3cb646237311fb922a41")
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !857, file: !2, baseType: !17, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!860 = !DIDerivedType(tag: DW_TAG_member, scope: !848, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagArtificial)
!861 = !{!862, !863, !864, !866}
!862 = !DILocalVariable(name: "self", arg: 1, scope: !842, file: !843, line: 460, type: !17)
!863 = !DILocalVariable(name: "rhs", arg: 2, scope: !842, file: !843, line: 460, type: !17)
!864 = !DILocalVariable(name: "a", scope: !865, file: !843, line: 461, type: !17, align: 8)
!865 = distinct !DILexicalBlock(scope: !842, file: !843, line: 461, column: 13)
!866 = !DILocalVariable(name: "b", scope: !865, file: !843, line: 461, type: !226, align: 1)
!867 = !DILocation(line: 460, column: 34, scope: !842)
!868 = !DILocation(line: 460, column: 40, scope: !842)
!869 = !DILocalVariable(name: "self", arg: 1, scope: !870, file: !843, line: 1520, type: !17)
!870 = distinct !DISubprogram(name: "overflowing_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$15overflowing_add17hd7ac287e1e794cf3E", scope: !844, file: !843, line: 1520, type: !871, scopeLine: 1520, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !877)
!871 = !DISubroutineType(types: !872)
!872 = !{!873, !17, !17}
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, bool)", file: !2, size: 128, align: 64, elements: !874, templateParams: !18, identifier: "c98dcff4c0d28bfa7aa0521041ee799a")
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !873, file: !2, baseType: !17, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !873, file: !2, baseType: !226, size: 8, align: 8, offset: 64)
!877 = !{!869, !878, !879, !881}
!878 = !DILocalVariable(name: "rhs", arg: 2, scope: !870, file: !843, line: 1520, type: !17)
!879 = !DILocalVariable(name: "a", scope: !880, file: !843, line: 1521, type: !17, align: 8)
!880 = distinct !DILexicalBlock(scope: !870, file: !843, line: 1521, column: 13)
!881 = !DILocalVariable(name: "b", scope: !880, file: !843, line: 1521, type: !226, align: 1)
!882 = !DILocation(line: 1520, column: 38, scope: !870, inlinedAt: !883)
!883 = distinct !DILocation(line: 461, column: 26, scope: !842)
!884 = !DILocation(line: 1520, column: 44, scope: !870, inlinedAt: !883)
!885 = !DILocation(line: 1521, column: 26, scope: !870, inlinedAt: !883)
!886 = !DILocation(line: 1521, column: 18, scope: !870, inlinedAt: !883)
!887 = !DILocation(line: 1521, column: 18, scope: !880, inlinedAt: !883)
!888 = !DILocation(line: 1521, column: 21, scope: !870, inlinedAt: !883)
!889 = !DILocation(line: 1521, column: 21, scope: !880, inlinedAt: !883)
!890 = !DILocation(line: 1522, column: 13, scope: !880, inlinedAt: !883)
!891 = !DILocation(line: 1523, column: 10, scope: !870, inlinedAt: !883)
!892 = !DILocation(line: 461, column: 26, scope: !842)
!893 = !DILocation(line: 461, column: 18, scope: !842)
!894 = !DILocation(line: 461, column: 18, scope: !865)
!895 = !DILocation(line: 461, column: 21, scope: !842)
!896 = !DILocation(line: 461, column: 21, scope: !865)
!897 = !DILocation(line: 462, column: 16, scope: !865)
!898 = !DILocation(line: 462, column: 42, scope: !865)
!899 = !DILocation(line: 462, column: 13, scope: !865)
!900 = !DILocation(line: 462, column: 30, scope: !865)
!901 = !DILocation(line: 463, column: 10, scope: !842)
!902 = !{i64 0, i64 2}
!903 = distinct !DISubprogram(name: "checked_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11checked_sub17hb80c8f76826bf7afE", scope: !844, file: !843, line: 529, type: !846, scopeLine: 529, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !904)
!904 = !{!905, !906, !907, !909}
!905 = !DILocalVariable(name: "self", arg: 1, scope: !903, file: !843, line: 529, type: !17)
!906 = !DILocalVariable(name: "rhs", arg: 2, scope: !903, file: !843, line: 529, type: !17)
!907 = !DILocalVariable(name: "a", scope: !908, file: !843, line: 530, type: !17, align: 8)
!908 = distinct !DILexicalBlock(scope: !903, file: !843, line: 530, column: 13)
!909 = !DILocalVariable(name: "b", scope: !908, file: !843, line: 530, type: !226, align: 1)
!910 = !DILocation(line: 529, column: 34, scope: !903)
!911 = !DILocation(line: 529, column: 40, scope: !903)
!912 = !DILocalVariable(name: "self", arg: 1, scope: !913, file: !843, line: 1619, type: !17)
!913 = distinct !DISubprogram(name: "overflowing_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$15overflowing_sub17h3ff41272ffc27b76E", scope: !844, file: !843, line: 1619, type: !871, scopeLine: 1619, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !18, retainedNodes: !914)
!914 = !{!912, !915, !916, !918}
!915 = !DILocalVariable(name: "rhs", arg: 2, scope: !913, file: !843, line: 1619, type: !17)
!916 = !DILocalVariable(name: "a", scope: !917, file: !843, line: 1620, type: !17, align: 8)
!917 = distinct !DILexicalBlock(scope: !913, file: !843, line: 1620, column: 13)
!918 = !DILocalVariable(name: "b", scope: !917, file: !843, line: 1620, type: !226, align: 1)
!919 = !DILocation(line: 1619, column: 38, scope: !913, inlinedAt: !920)
!920 = distinct !DILocation(line: 530, column: 26, scope: !903)
!921 = !DILocation(line: 1619, column: 44, scope: !913, inlinedAt: !920)
!922 = !DILocation(line: 1620, column: 26, scope: !913, inlinedAt: !920)
!923 = !DILocation(line: 1620, column: 18, scope: !913, inlinedAt: !920)
!924 = !DILocation(line: 1620, column: 18, scope: !917, inlinedAt: !920)
!925 = !DILocation(line: 1620, column: 21, scope: !913, inlinedAt: !920)
!926 = !DILocation(line: 1620, column: 21, scope: !917, inlinedAt: !920)
!927 = !DILocation(line: 1621, column: 13, scope: !917, inlinedAt: !920)
!928 = !DILocation(line: 1622, column: 10, scope: !913, inlinedAt: !920)
!929 = !DILocation(line: 530, column: 26, scope: !903)
!930 = !DILocation(line: 530, column: 18, scope: !903)
!931 = !DILocation(line: 530, column: 18, scope: !908)
!932 = !DILocation(line: 530, column: 21, scope: !903)
!933 = !DILocation(line: 530, column: 21, scope: !908)
!934 = !DILocation(line: 531, column: 16, scope: !908)
!935 = !DILocation(line: 531, column: 42, scope: !908)
!936 = !DILocation(line: 531, column: 13, scope: !908)
!937 = !DILocation(line: 531, column: 30, scope: !908)
!938 = !DILocation(line: 532, column: 10, scope: !903)
!939 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::{impl#11}::fmt::Hex>", linkageName: "_ZN4core3ptr116drop_in_place$LT$$LT$x86_64..structures..idt..InterruptStackFrameValue$u20$as$u20$core..fmt..Debug$GT$..fmt..Hex$GT$17h6391e29fd82d5b32E", scope: !941, file: !940, line: 507, type: !942, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !947, retainedNodes: !945)
!940 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "0751cc28170b974ebf5abeae07cf66bf")
!941 = !DINamespace(name: "ptr", scope: !29)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::{impl#11}::fmt::Hex", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!945 = !{!946}
!946 = !DILocalVariable(arg: 1, scope: !939, file: !940, line: 507, type: !944)
!947 = !{!948}
!948 = !DITemplateTypeParameter(name: "T", type: !211)
!949 = !DILocation(line: 507, column: 1, scope: !939)
!950 = distinct !DISubprogram(name: "drop_in_place<u16>", linkageName: "_ZN4core3ptr24drop_in_place$LT$u16$GT$17h1bb4bcff8d7ad1c2E", scope: !941, file: !940, line: 507, type: !951, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !956, retainedNodes: !954)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u16", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!954 = !{!955}
!955 = !DILocalVariable(arg: 1, scope: !950, file: !940, line: 507, type: !953)
!956 = !{!957}
!957 = !DITemplateTypeParameter(name: "T", type: !169)
!958 = !DILocation(line: 507, column: 1, scope: !950)
!959 = distinct !DISubprogram(name: "drop_in_place<u64>", linkageName: "_ZN4core3ptr24drop_in_place$LT$u64$GT$17hc3b48bf1e434f2e0E", scope: !941, file: !940, line: 507, type: !960, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !854, retainedNodes: !963)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u64", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!963 = !{!964}
!964 = !DILocalVariable(arg: 1, scope: !959, file: !940, line: 507, type: !962)
!965 = !DILocation(line: 507, column: 1, scope: !959)
!966 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17h61c224afb6dd3295E", scope: !941, file: !940, line: 507, type: !967, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !972, retainedNodes: !970)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!970 = !{!971}
!971 = !DILocalVariable(arg: 1, scope: !966, file: !940, line: 507, type: !969)
!972 = !{!973}
!973 = !DITemplateTypeParameter(name: "T", type: !226)
!974 = !DILocation(line: 507, column: 1, scope: !966)
!975 = distinct !DISubprogram(name: "drop_in_place<core::fmt::Arguments>", linkageName: "_ZN4core3ptr41drop_in_place$LT$core..fmt..Arguments$GT$17h6b3dc4f1cbe0895eE", scope: !941, file: !940, line: 507, type: !976, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !981, retainedNodes: !979)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::fmt::Arguments", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!979 = !{!980}
!980 = !DILocalVariable(arg: 1, scope: !975, file: !940, line: 507, type: !978)
!981 = !{!982}
!982 = !DITemplateTypeParameter(name: "T", type: !27)
!983 = !DILocation(line: 507, column: 1, scope: !975)
!984 = distinct !DISubprogram(name: "drop_in_place<x86_64::PrivilegeLevel>", linkageName: "_ZN4core3ptr43drop_in_place$LT$x86_64..PrivilegeLevel$GT$17hc2f1e637251fbd96E", scope: !941, file: !940, line: 507, type: !985, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !291, templateParams: !990, retainedNodes: !988)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::PrivilegeLevel", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!988 = !{!989}
