; ModuleID = 'x86_64.8d7ac79a-cgu.0'
source_filename = "x86_64.8d7ac79a-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !21, identifier: "44cd6ac81b8f2233be2c6e2231f4b091")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableEntry", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableEntry", scope: !14, file: !2, size: 64, align: 64, elements: !18, templateParams: !21, identifier: "f8a6e243f11d0a7485bcb1a470954183")
!14 = !DINamespace(name: "page_table", scope: !15)
!15 = !DINamespace(name: "paging", scope: !16)
!16 = !DINamespace(name: "structures", scope: !17)
!17 = !DINamespace(name: "x86_64", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !13, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!21 = !{}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !25, vtableHolder: !30, templateParams: !21, identifier: "d98d748539c4f3693e15b5d596aaac62")
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !24, file: !2, baseType: !6, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !24, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !24, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !24, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::VirtAddr", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !32, file: !2, size: 64, align: 64, elements: !33, templateParams: !21, identifier: "fc988834aae138cad550e9871f92489f")
!32 = !DINamespace(name: "addr", scope: !17)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !31, file: !2, baseType: !20, size: 64, align: 64)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !38, vtableHolder: !43, templateParams: !21, identifier: "2ed75d1d2a47633f270a2f5512bf9023")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !37, file: !2, baseType: !6, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !45, file: !2, size: 128, align: 32, elements: !46, templateParams: !77, identifier: "8b5b3d11b07bfdd3661261e1ba0d3331")
!45 = !DINamespace(name: "idt", scope: !16)
!46 = !{!47, !49, !50, !54, !55, !57, !58}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !44, file: !2, baseType: !48, size: 16, align: 16)
!48 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !44, file: !2, baseType: !48, size: 16, align: 16, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !44, file: !2, baseType: !51, size: 16, align: 16, offset: 32)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !45, file: !2, size: 16, align: 16, elements: !52, templateParams: !21, identifier: "c271fcd2c1d7aa5bd01809e7cba6d06d")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !51, file: !2, baseType: !48, size: 16, align: 16)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !44, file: !2, baseType: !48, size: 16, align: 16, offset: 48)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !44, file: !2, baseType: !56, size: 32, align: 32, offset: 64)
!56 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !44, file: !2, baseType: !56, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !44, file: !2, baseType: !59, align: 8, offset: 128)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !62, identifier: "dff12c0b9f2324db853ec356a73db68")
!60 = !DINamespace(name: "marker", scope: !61)
!61 = !DINamespace(name: "core", scope: null)
!62 = !{!63}
!63 = !DITemplateTypeParameter(name: "T", type: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67}
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !45, file: !2, size: 320, align: 64, elements: !68, templateParams: !21, identifier: "8206937a8d9059696a4b36ade9d63bfe")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !67, file: !2, baseType: !70, size: 320, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !45, file: !2, size: 320, align: 64, elements: !71, templateParams: !21, identifier: "b00c54ce0c827efee3a78e63e2a874ba")
!71 = !{!72, !73, !74, !75, !76}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !70, file: !2, baseType: !31, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !70, file: !2, baseType: !20, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !70, file: !2, baseType: !20, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !70, file: !2, baseType: !31, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !70, file: !2, baseType: !20, size: 64, align: 64, offset: 256)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "F", type: !64)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !82, vtableHolder: !87, templateParams: !21, identifier: "184ea5feff67ba3cb05a7c6730c8c0d0")
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !81, file: !2, baseType: !6, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !81, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !91, vtableHolder: !96, templateParams: !21, identifier: "b427b76cbf07008d18d87370f10aac16")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !90, file: !2, baseType: !6, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !90, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddrNotValid", scope: !32, file: !2, size: 64, align: 64, elements: !97, templateParams: !21, identifier: "334b794c1c06e928b20e98f062ea5577")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !2, baseType: !20, size: 64, align: 64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !102, vtableHolder: !107, templateParams: !21, identifier: "b3a89df681eb7045d9911f91c799b729")
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !101, file: !2, baseType: !6, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !101, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !108, file: !2, size: 384, align: 64, elements: !109, templateParams: !21, identifier: "aa4495e11001eeb7a8dec7abda538011")
!108 = !DINamespace(name: "fmt", scope: !61)
!109 = !{!110, !122, !177}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !107, file: !2, baseType: !111, size: 128, align: 64, offset: 128)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !112, templateParams: !21, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!112 = !{!113, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !111, file: !2, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !116, templateParams: !21, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !115, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !107, file: !2, baseType: !123, size: 128, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !124, file: !2, size: 128, align: 64, elements: !125, templateParams: !21, identifier: "f20f93edc9b6759569bd27834bca2867")
!124 = !DINamespace(name: "option", scope: !61)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !127, templateParams: !21, identifier: "4c2bc57bba010026e96c6b272990e455", discriminator: !176)
!127 = !{!128, !172}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !123, file: !2, size: 128, align: 64, elements: !21, templateParams: !130, identifier: "b03d968f2fa497fccf294fb725789344")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !133, templateParams: !21, identifier: "fbc7473a1424cb3193ffa7a7ee24653a")
!133 = !{!134, !171}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !132, file: !2, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !137, file: !2, size: 448, align: 64, elements: !139, templateParams: !21, identifier: "5baa9876693e95e5feb1bff2f29eab42")
!137 = !DINamespace(name: "v1", scope: !138)
!138 = !DINamespace(name: "rt", scope: !108)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !136, file: !2, baseType: !142, size: 384, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !137, file: !2, size: 384, align: 64, elements: !143, templateParams: !21, identifier: "af655e92005115efb855d950904d628d")
!143 = !{!144, !146, !153, !154, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !142, file: !2, baseType: !145, size: 32, align: 32, offset: 288)
!145 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !142, file: !2, baseType: !147, size: 8, align: 8, offset: 320)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !2, baseType: !56, size: 32, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !142, file: !2, baseType: !155, size: 128, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !137, file: !2, size: 128, align: 64, elements: !156, templateParams: !21, identifier: "bb4b398e5f72abfe68675895ae5e57c7")
!156 = !{!157}
!157 = !DICompositeType(tag: DW_TAG_variant_part, scope: !155, file: !2, size: 128, align: 64, elements: !158, templateParams: !21, identifier: "9d0217852ba0cec4f3ca8286384a753f", discriminator: !169)
!158 = !{!159, !163, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !157, file: !2, baseType: !160, size: 128, align: 64, extraData: i64 0)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !155, file: !2, size: 128, align: 64, elements: !161, templateParams: !21, identifier: "1bffdda99d4ba93b3632eb9b10e0d6c2")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !157, file: !2, baseType: !164, size: 128, align: 64, extraData: i64 1)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !155, file: !2, size: 128, align: 64, elements: !165, templateParams: !21, identifier: "93a126390616414615f290788924acea")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !157, file: !2, baseType: !168, size: 128, align: 64, extraData: i64 2)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !155, file: !2, size: 128, align: 64, elements: !21, identifier: "bee9d1aff1e2e0def3297d379f780bc3")
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !2, baseType: !20, size: 64, align: 64, flags: DIFlagArtificial)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !142, file: !2, baseType: !155, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !173, size: 128, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !123, file: !2, size: 128, align: 64, elements: !174, templateParams: !130, identifier: "76c5d43fc2261c18f3f3f9fcdeb1ea19")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !173, file: !2, baseType: !132, size: 128, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !20, size: 64, align: 64, flags: DIFlagArtificial)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !107, file: !2, baseType: !178, size: 128, align: 64, offset: 256)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !179, templateParams: !21, identifier: "7fd253a118f8ffbba43d5247c666a8bb")
!179 = !{!180, !242}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !2, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !108, file: !2, size: 128, align: 64, elements: !183, templateParams: !21, identifier: "71f0688e928e59cfa8d2e89ebf7ebc37")
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !2, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !187, file: !2, align: 8, elements: !21, identifier: "8ad1d27c01883c0662373925bfb88afd")
!187 = !DINamespace(name: "{extern#0}", scope: !108)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !182, file: !2, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !185, !210}
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !193, file: !2, size: 8, align: 8, elements: !194, templateParams: !21, identifier: "439b0028cce69ada54f55b3e334b6ecd")
!193 = !DINamespace(name: "result", scope: !61)
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !192, file: !2, size: 8, align: 8, elements: !196, templateParams: !21, identifier: "be95a66ec545b971daf5682acfef386a", discriminator: !209)
!196 = !{!197, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !2, baseType: !198, size: 8, align: 8, extraData: i64 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !192, file: !2, size: 8, align: 8, elements: !199, templateParams: !201, identifier: "970917c63ec9d7b58016c128bd3204c")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !2, baseType: !7, align: 8, offset: 8)
!201 = !{!202, !203}
!202 = !DITemplateTypeParameter(name: "T", type: !7)
!203 = !DITemplateTypeParameter(name: "E", type: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !108, file: !2, align: 8, elements: !21, identifier: "ba7ee7bf0217687128c0134bf159d064")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !2, baseType: !206, size: 8, align: 8, extraData: i64 1)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !192, file: !2, size: 8, align: 8, elements: !207, templateParams: !201, identifier: "277298c56e69e6ae4141f3824479ae34")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !204, align: 8, offset: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagArtificial)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !108, file: !2, size: 512, align: 64, elements: !212, templateParams: !21, identifier: "a90501ff6e2f2af5c6a6372291169d97")
!212 = !{!213, !214, !215, !216, !230, !231}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !211, file: !2, baseType: !56, size: 32, align: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !211, file: !2, baseType: !145, size: 32, align: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !211, file: !2, baseType: !147, size: 8, align: 8, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !124, file: !2, size: 128, align: 64, elements: !218, templateParams: !21, identifier: "a061711948cade3933e2c15b599cef32")
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_variant_part, scope: !217, file: !2, size: 128, align: 64, elements: !220, templateParams: !21, identifier: "a12832ba19fc53c9fdb0c372f0b3354e", discriminator: !229)
!220 = !{!221, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !219, file: !2, baseType: !222, size: 128, align: 64, extraData: i64 0)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !217, file: !2, size: 128, align: 64, elements: !21, templateParams: !223, identifier: "c3705e48f19ae18cdc2a5519f6e6f5cb")
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !9)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !219, file: !2, baseType: !226, size: 128, align: 64, extraData: i64 1)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !217, file: !2, size: 128, align: 64, elements: !227, templateParams: !223, identifier: "be8b31308e3e31c866943c8d7b3fd52a")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !226, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !217, file: !2, baseType: !20, size: 64, align: 64, flags: DIFlagArtificial)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !211, file: !2, baseType: !232, size: 128, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !233, templateParams: !21, identifier: "a3f442e004e09e017868002c1c14e7e3")
!233 = !{!234, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !232, file: !2, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !21, identifier: "fad07e960ab186f2781ffe1a5cde3e23")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !232, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 3, lowerBound: 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !246, vtableHolder: !48, templateParams: !21, identifier: "13aed78a48e54e2a7b7fa4c59a2fc9f")
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !245, file: !2, baseType: !6, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !245, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !254, vtableHolder: !259, templateParams: !21, identifier: "7f11c73f1e959269ed747c36fc89ebb")
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !253, file: !2, baseType: !6, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !253, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !17, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !268, vtableHolder: !51, templateParams: !21, identifier: "e73074070291256c7b3efb09ba30edad")
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !267, file: !2, baseType: !6, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !267, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !276, vtableHolder: !31, templateParams: !21, identifier: "9cdbb5e1a0c9b16f458949b581b1664a")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !275, file: !2, baseType: !6, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !275, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !284, vtableHolder: !20, templateParams: !21, identifier: "cbeb207c526e867d954b6cc3781c88ca")
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !283, file: !2, baseType: !6, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !283, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !292, vtableHolder: !297, templateParams: !21, identifier: "2cd0d72f11d09d229617c55a3e657340")
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !291, file: !2, baseType: !6, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !291, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hex", scope: !298, file: !2, size: 64, align: 64, elements: !300, templateParams: !21, identifier: "9a74e3be46b18b7a3c02e3b2ed9b7082")
!298 = !DINamespace(name: "fmt", scope: !299)
!299 = !DINamespace(name: "{impl#11}", scope: !45)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !20, size: 64, align: 64)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !305, vtableHolder: !310, templateParams: !21, identifier: "5466fda85a1e5cfa9b5d88662e5f2c8b")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !304, file: !2, baseType: !6, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !304, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!310 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !314, vtableHolder: !319, templateParams: !21, identifier: "7dab522edff01e05784366d6eb0b6761")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !313, file: !2, baseType: !6, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !313, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DescriptorTable", scope: !45, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIEnumerator(name: "Gdt", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "Idt", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "Ldt", value: 2, isUnsigned: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_ASSERT_OBJECT_SAFE", linkageName: "_ZN6x86_6410structures6paging6mapper19_ASSERT_OBJECT_SAFE17h3d108c46d296931aE", scope: !326, file: !327, line: 486, type: !328, isLocal: true, isDefinition: true, align: 64)
!326 = !DINamespace(name: "mapper", scope: !15)
!327 = !DIFile(filename: "src/structures/paging/mapper/mod.rs", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/x86_64-0.14.10", checksumkind: CSK_MD5, checksum: "0dd5f33c2cee14124470d88449502bc1")
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)>", scope: !124, file: !2, size: 128, align: 64, elements: !329, templateParams: !21, identifier: "6ca25c423ee4f8aa21121f23365a9625")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !2, size: 128, align: 64, elements: !331, templateParams: !21, identifier: "2f417d1fd295d92d11f4930f46076f0d", discriminator: !346)
!331 = !{!332, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !330, file: !2, baseType: !333, size: 128, align: 64, extraData: i64 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !328, file: !2, size: 128, align: 64, elements: !21, templateParams: !334, identifier: "672b6cbe0a27fdefaa0bc7734c33555f")
!334 = !{!335}
!335 = !DITemplateTypeParameter(name: "T", type: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !337, templateParams: !21, identifier: "3e3ef5fe731991ee63324d548ce3dd09")
!337 = !{!338, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !2, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, align: 8, elements: !21, identifier: "ceb8d6ee307366696d86a1f9e0f0bc6b")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !336, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !330, file: !2, baseType: !343, size: 128, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !328, file: !2, size: 128, align: 64, elements: !344, templateParams: !334, identifier: "3f556522494c4bcd2480dfd25bb15088")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !336, size: 128, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !2, baseType: !20, size: 64, align: 64, flags: DIFlagArtificial)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !350, vtableHolder: !355, templateParams: !21, identifier: "854b8f163e70889a4f7021a9a505c511")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !349, file: !2, baseType: !6, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !349, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysAddr", scope: !32, file: !2, size: 64, align: 64, elements: !356, templateParams: !21, identifier: "826de10f58eac388a7aef826b1ccc37a")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !2, baseType: !20, size: 64, align: 64)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !361, vtableHolder: !366, templateParams: !21, identifier: "230c49d21280f6e0a36ed4014cd61294")
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !360, file: !2, baseType: !6, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !360, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableFlags", scope: !14, file: !2, size: 64, align: 64, elements: !367, templateParams: !21, identifier: "9b23b8b99cbdd593d3f00598753ef627")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !366, file: !2, baseType: !20, size: 64, align: 64)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !372, vtableHolder: !377, templateParams: !21, identifier: "5a69e8ff523cc9f8ccf21f19aed66850")
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !371, file: !2, baseType: !6, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !371, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !381, vtableHolder: !386, templateParams: !21, identifier: "37bbaa9b16636b0a7ad5856068d438e8")
!381 = !{!382, !383, !384, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !380, file: !2, baseType: !6, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !380, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::instructions::tlb::Pcid", baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pcid", scope: !388, file: !2, size: 16, align: 16, elements: !390, templateParams: !21, identifier: "e35b4cfd4fa069922addef0252e13f2c")
!388 = !DINamespace(name: "tlb", scope: !389)
!389 = !DINamespace(name: "instructions", scope: !17)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !387, file: !2, baseType: !48, size: 16, align: 16)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "<&u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !395, vtableHolder: !400, templateParams: !21, identifier: "f5fc17f734ebd2bc6c01218b3ab347c3")
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !394, file: !2, baseType: !6, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !394, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !404, vtableHolder: !409, templateParams: !21, identifier: "ea6d7db7a7f5a0f03f08c00aaf1dc1f6")
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !403, file: !2, baseType: !6, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !403, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "<[u64; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[u64; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !413, vtableHolder: !418, templateParams: !21, identifier: "7f18b703758b877aada9ecbc01500fa5")
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !412, file: !2, baseType: !6, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !412, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, align: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 8, lowerBound: 0)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !424, vtableHolder: !429, templateParams: !21, identifier: "178c4101e77993b35ada081d95c11334")
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !423, file: !2, baseType: !6, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !423, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !433, vtableHolder: !44, templateParams: !21, identifier: "26a716e06523e2cdc490aeec80d66281")
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !432, file: !2, baseType: !6, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !432, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !441, vtableHolder: !446, templateParams: !21, identifier: "ad75fa99064c2ef1753fe0bab30eae85")
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !440, file: !2, baseType: !6, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !440, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !45, file: !2, size: 128, align: 32, elements: !447, templateParams: !462, identifier: "27974876ed94946c8db900b79787b1f1")
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !446, file: !2, baseType: !48, size: 16, align: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !446, file: !2, baseType: !48, size: 16, align: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !446, file: !2, baseType: !51, size: 16, align: 16, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !446, file: !2, baseType: !48, size: 16, align: 16, offset: 48)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !446, file: !2, baseType: !56, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !446, file: !2, baseType: !56, size: 32, align: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !446, file: !2, baseType: !455, align: 8, offset: 128)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !456, identifier: "442892f534062711f8850fe54b372bb5")
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !67, !20}
!461 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "F", type: !458)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !467, vtableHolder: !472, templateParams: !21, identifier: "a1252e57fe432900aece31ad3cbb90c1")
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !466, file: !2, baseType: !6, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !466, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !45, file: !2, size: 128, align: 32, elements: !473, templateParams: !487, identifier: "5b021d298ddbe71b4b677c8999c7877a")
!473 = !{!474, !475, !476, !477, !478, !479, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !472, file: !2, baseType: !48, size: 16, align: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !472, file: !2, baseType: !48, size: 16, align: 16, offset: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !472, file: !2, baseType: !51, size: 16, align: 16, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !472, file: !2, baseType: !48, size: 16, align: 16, offset: 48)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !472, file: !2, baseType: !56, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !472, file: !2, baseType: !56, size: 32, align: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !472, file: !2, baseType: !481, align: 8, offset: 128)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !482, identifier: "b864407a6e1f1952b3094afed8ca0f09")
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "T", type: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !67, !20}
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "F", type: !484)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !492, vtableHolder: !497, templateParams: !21, identifier: "7438c3b13d8a81da10b33f91e6b098a0")
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !491, file: !2, baseType: !6, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !491, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !45, file: !2, size: 128, align: 32, elements: !498, templateParams: !515, identifier: "ad267785150872161d61526d43faeacd")
!498 = !{!499, !500, !501, !502, !503, !504, !505}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !497, file: !2, baseType: !48, size: 16, align: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !497, file: !2, baseType: !48, size: 16, align: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !497, file: !2, baseType: !51, size: 16, align: 16, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !497, file: !2, baseType: !48, size: 16, align: 16, offset: 48)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !497, file: !2, baseType: !56, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !497, file: !2, baseType: !56, size: 32, align: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !497, file: !2, baseType: !506, align: 8, offset: 128)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !507, identifier: "cc8c4e092cada6445cf6c66604425a6c")
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !67, !512}
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !45, file: !2, size: 64, align: 64, elements: !513, templateParams: !21, identifier: "7869695357e79e42c3ea4cf8ffbc5646")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !512, file: !2, baseType: !20, size: 64, align: 64)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "F", type: !509)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !520, vtableHolder: !525, templateParams: !21, identifier: "47b3c920c305cbc78558488a5df515f9")
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !519, file: !2, baseType: !6, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !519, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !45, file: !2, size: 128, align: 32, elements: !526, templateParams: !540, identifier: "24a21a25c58352955ce2e8f329a35d93")
!526 = !{!527, !528, !529, !530, !531, !532, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !525, file: !2, baseType: !48, size: 16, align: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !525, file: !2, baseType: !48, size: 16, align: 16, offset: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !525, file: !2, baseType: !51, size: 16, align: 16, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !525, file: !2, baseType: !48, size: 16, align: 16, offset: 48)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !525, file: !2, baseType: !56, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !525, file: !2, baseType: !56, size: 32, align: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !525, file: !2, baseType: !534, align: 8, offset: 128)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !535, identifier: "ae2121149a1bd957b3c57f6b764a915")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !538, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!461, !67}
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "F", type: !537)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !545, vtableHolder: !550, templateParams: !21, identifier: "3a6126b1d8a1d7cc218775f38394b319")
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !544, file: !2, baseType: !6, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !544, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 32, elements: !419)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !554, vtableHolder: !559, templateParams: !21, identifier: "5a94494e517b6b615c68ab286e7c6981")
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !553, file: !2, baseType: !6, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224]", baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 28672, align: 32, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 224, lowerBound: 0)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !566, vtableHolder: !571, templateParams: !21, identifier: "39c8df2e8cfbf9b39438066f1b09343e")
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !565, file: !2, baseType: !6, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !565, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 64, align: 64, elements: !573, templateParams: !579, identifier: "2ca7280440fd0c898b5e6ae81e4b9277")
!572 = !DINamespace(name: "mapped_page_table", scope: !326)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_frame_mapping", scope: !571, file: !2, baseType: !575, size: 64, align: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysOffset", scope: !576, file: !2, size: 64, align: 64, elements: !577, templateParams: !21, identifier: "c9e0b1d0cc4ec39d4e8e9060ef039a6d")
!576 = !DINamespace(name: "offset_page_table", scope: !326)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !575, file: !2, baseType: !31, size: 64, align: 64)
!579 = !{!580}
!580 = !DITemplateTypeParameter(name: "P", type: !575)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !584, vtableHolder: !589, templateParams: !21, identifier: "5c90a2454a6c0841951f07b499669e67")
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !583, file: !2, baseType: !6, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !583, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut x86_64::structures::paging::page_table::PageTable", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::paging::page_table::PageTable", baseType: !591, size: 64, align: 64, dwarfAddressSpace: 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTable", scope: !14, file: !2, size: 32768, align: 32768, elements: !592, templateParams: !21, identifier: "e54171705576456568d661f06f98fd0c")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !591, file: !2, baseType: !594, size: 32768, align: 64)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 32768, align: 64, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 512, lowerBound: 0)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !600, vtableHolder: !605, templateParams: !21, identifier: "2faf72fc66aa24aad7c86e9fd1b8e705")
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !599, file: !2, baseType: !6, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !599, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::offset_page_table::PhysOffset", baseType: !575, size: 64, align: 64, dwarfAddressSpace: 0)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !609, vtableHolder: !614, templateParams: !21, identifier: "2859a5f5959f7fa14d1adb1c23095d")
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !608, file: !2, baseType: !6, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !608, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 128, align: 64, elements: !616, templateParams: !579, identifier: "1ad0977a77050c59c780553fc356f8e7")
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_walker", scope: !615, file: !2, baseType: !571, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "level_4_table", scope: !615, file: !2, baseType: !590, size: 64, align: 64, offset: 64)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !622, vtableHolder: !590, templateParams: !21, identifier: "1c33a23a109dff458a2d8cb918db3b2b")
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !621, file: !2, baseType: !6, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !621, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !630, vtableHolder: !635, templateParams: !21, identifier: "ff84c23d59c5dfe78d1186cf475e31d1")
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !629, file: !2, baseType: !6, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !629, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableIndex", baseType: !636, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableIndex", scope: !14, file: !2, size: 16, align: 16, elements: !637, templateParams: !21, identifier: "6b25540cd7b26affeb49da136c096015")
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !48, size: 16, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !642, vtableHolder: !647, templateParams: !21, identifier: "e9a342b9078068244ddf3043ed40b9d6")
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !641, file: !2, baseType: !6, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !641, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::PhysAddr", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !651, vtableHolder: !656, templateParams: !21, identifier: "b6c0d2234f5021e03d071368a9f2bc51")
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !650, file: !2, baseType: !6, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !650, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedFrame", scope: !326, file: !2, size: 128, align: 64, elements: !657, templateParams: !21, identifier: "80747781d1f471aef40d160a736d6dea")
!657 = !{!658}
!658 = !DICompositeType(tag: DW_TAG_variant_part, scope: !656, file: !2, size: 128, align: 64, elements: !659, templateParams: !21, identifier: "f60047e261cc3a52fa4f50e8aa4eb9a", discriminator: !710)
!659 = !{!660, !678, !694}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Size4KiB", scope: !658, file: !2, baseType: !661, size: 128, align: 64, extraData: i64 0)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !656, file: !2, size: 128, align: 64, elements: !662, templateParams: !21, identifier: "fce8eaa56b26411335edcf1ef0ac01a9")
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !661, file: !2, baseType: !664, size: 64, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size4KiB>", scope: !665, file: !2, size: 64, align: 64, elements: !666, templateParams: !676, identifier: "25071914c9d9abe2a373fd539521175e")
!665 = !DINamespace(name: "frame", scope: !15)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !664, file: !2, baseType: !355, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !2, baseType: !669, align: 8, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size4KiB>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !670, identifier: "bf2c4d0437d4ec4677e47d81468ee4b6")
!670 = !{!671}
!671 = !DITemplateTypeParameter(name: "T", type: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !673, file: !2, align: 8, elements: !674, templateParams: !21, identifier: "dbced0bec5b61eddf2c87019e91a27f")
!673 = !DINamespace(name: "page", scope: !15)
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_variant_part, scope: !672, file: !2, align: 8, elements: !21, identifier: "1f0d16a8654bcd85635e8089e06ce79")
!676 = !{!677}
!677 = !DITemplateTypeParameter(name: "S", type: !672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Size2MiB", scope: !658, file: !2, baseType: !679, size: 128, align: 64, extraData: i64 1)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !656, file: !2, size: 128, align: 64, elements: !680, templateParams: !21, identifier: "6365e7351669780fd696d90051703ce2")
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !682, size: 64, align: 64, offset: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size2MiB>", scope: !665, file: !2, size: 64, align: 64, elements: !683, templateParams: !692, identifier: "3afb8e1695f6d1eaaaec18e63018464")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !682, file: !2, baseType: !355, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !682, file: !2, baseType: !686, align: 8, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size2MiB>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !687, identifier: "d4b0eccbec4c6608c46a72cabb2e050")
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !673, file: !2, align: 8, elements: !690, templateParams: !21, identifier: "bf68178fab0644ecd7e6216dc0f58eda")
!690 = !{!691}
!691 = !DICompositeType(tag: DW_TAG_variant_part, scope: !689, file: !2, align: 8, elements: !21, identifier: "3e491aa5936b2bb166891665b2b8dad8")
!692 = !{!693}
!693 = !DITemplateTypeParameter(name: "S", type: !689)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Size1GiB", scope: !658, file: !2, baseType: !695, size: 128, align: 64, extraData: i64 2)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !656, file: !2, size: 128, align: 64, elements: !696, templateParams: !21, identifier: "197e9db3c5beee337c4bb4528a02fc5a")
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !695, file: !2, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size1GiB>", scope: !665, file: !2, size: 64, align: 64, elements: !699, templateParams: !708, identifier: "22685b7a1491a44d2c792ea7d6cd3017")
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !698, file: !2, baseType: !355, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !2, baseType: !702, align: 8, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size1GiB>", scope: !60, file: !2, align: 8, elements: !21, templateParams: !703, identifier: "6ced17b3e2514c83b4163c656a2eb383")
!703 = !{!704}
!704 = !DITemplateTypeParameter(name: "T", type: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !673, file: !2, align: 8, elements: !706, templateParams: !21, identifier: "5c01c4761d927a70acfe884563b2e62a")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_variant_part, scope: !705, file: !2, align: 8, elements: !21, identifier: "de4059e1846c83b3a1ff04889082c302")
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "S", type: !705)
!710 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !2, baseType: !20, size: 64, align: 64, flags: DIFlagArtificial)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !714, vtableHolder: !719, templateParams: !21, identifier: "847a108c576275428bc7192085ec718d")
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !713, file: !2, baseType: !6, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableFlags", baseType: !366, size: 64, align: 64, dwarfAddressSpace: 0)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !723, vtableHolder: !728, templateParams: !21, identifier: "2aaf8d0b77397cc2f693a8a8665e5e12")
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !722, file: !2, baseType: !6, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !722, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !732, vtableHolder: !737, templateParams: !21, identifier: "cc5f57e6c567a2e7f635ee5773b7ccbe")
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !731, file: !2, baseType: !6, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !731, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>", baseType: !682, size: 64, align: 64, dwarfAddressSpace: 0)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !741, vtableHolder: !746, templateParams: !21, identifier: "cf0c1281a4363f2ad8e9b0a5a5beee44")
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !740, file: !2, baseType: !6, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>", baseType: !664, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !750, vtableHolder: !56, templateParams: !21, identifier: "b03c3bb75ca136e114d2a8d8e93fd6e5")
!750 = !{!751, !752, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !749, file: !2, baseType: !6, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !749, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !758, vtableHolder: !763, templateParams: !21, identifier: "85692bc16caf67aa43ff716f9e00ac5e")
!758 = !{!759, !760, !761, !762}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !757, file: !2, baseType: !6, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !757, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, align: 64, elements: !240)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !767, vtableHolder: !772, templateParams: !21, identifier: "498039378dbae934d35c1432528ac4d7")
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !766, file: !2, baseType: !6, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !766, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 448, align: 64, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 7, lowerBound: 0)
!775 = !{i32 7, !"PIC Level", i32 2}
!776 = !{i32 2, !"Dwarf Version", i32 4}
!777 = !{i32 2, !"Debug Info Version", i32 3}
!778 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !779, producer: "clang LLVM (rustc version 1.69.0-nightly (5b8f28453 2023-02-12))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, globals: !853, splitDebugInlining: false)
!779 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/x86_64-0.14.10/src/lib.rs/@/x86_64.8d7ac79a-cgu.0", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/x86_64-0.14.10")
!780 = !{!147, !259, !319, !781, !789, !795, !799, !805, !809, !814, !820, !845, !849}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointCondition", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !784)
!782 = !DINamespace(name: "debug", scope: !783)
!783 = !DINamespace(name: "registers", scope: !17)
!784 = !{!785, !786, !787, !788}
!785 = !DIEnumerator(name: "InstructionExecution", value: 0, isUnsigned: true)
!786 = !DIEnumerator(name: "DataWrites", value: 1, isUnsigned: true)
!787 = !DIEnumerator(name: "IoReadsWrites", value: 2, isUnsigned: true)
!788 = !DIEnumerator(name: "DataReadsWrites", value: 3, isUnsigned: true)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointSize", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIEnumerator(name: "Length1B", value: 0, isUnsigned: true)
!792 = !DIEnumerator(name: "Length2B", value: 1, isUnsigned: true)
!793 = !DIEnumerator(name: "Length8B", value: 2, isUnsigned: true)
!794 = !DIEnumerator(name: "Length4B", value: 3, isUnsigned: true)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameError", scope: !14, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !796)
!796 = !{!797, !798}
!797 = !DIEnumerator(name: "FrameNotPresent", value: 0, isUnsigned: true)
!798 = !DIEnumerator(name: "HugeFrame", value: 1, isUnsigned: true)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAddressRegisterNumber", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIEnumerator(name: "Dr0", value: 0, isUnsigned: true)
!802 = !DIEnumerator(name: "Dr1", value: 1, isUnsigned: true)
!803 = !DIEnumerator(name: "Dr2", value: 2, isUnsigned: true)
!804 = !DIEnumerator(name: "Dr3", value: 3, isUnsigned: true)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlagUpdateError", scope: !326, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !806)
!806 = !{!807, !808}
!807 = !DIEnumerator(name: "PageNotMapped", value: 0, isUnsigned: true)
!808 = !DIEnumerator(name: "ParentEntryHugePage", value: 1, isUnsigned: true)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InvalidPageTable", scope: !810, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !811)
!810 = !DINamespace(name: "recursive_page_table", scope: !326)
!811 = !{!812, !813}
!812 = !DIEnumerator(name: "NotRecursive", value: 0, isUnsigned: true)
!813 = !DIEnumerator(name: "NotActive", value: 1, isUnsigned: true)
