; ModuleID = 'pc_keyboard.b2003f6af1371c38-cgu.0'
source_filename = "pc_keyboard.b2003f6af1371c38-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<core::option::Option<KeyEvent>, Error>" = type { i8, [1 x i8] }
%"core::result::Result<core::option::Option<KeyEvent>, Error>::Err" = type { [1 x i8], i8 }
%"core::result::Result<core::option::Option<u8>, Error>" = type { i8, [1 x i8] }
%"core::result::Result<core::option::Option<u8>, Error>::Err" = type { [1 x i8], i8 }
%DecodedKey = type { i8, [7 x i8] }
%"DecodedKey::RawKey" = type { [1 x i8], i8 }
%"DecodedKey::Unicode" = type { [1 x i32], i32 }
%Modifiers = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%"layouts::us104::Us104Key" = type {}

@alloc_914b2c69d7eca30497b9feaf15ac92f1 = private unnamed_addr constant <{ [1 x i8] }> zeroinitializer, align 1
@alloc_7395b7fd5052a2200dfc13209d237c6b = private unnamed_addr constant <{ [15 x i8] }> <{ [15 x i8] c"not implemented" }>, align 1
@alloc_4ca2ba91686521ffa01190d37c11fe21 = private unnamed_addr constant <{ [103 x i8] }> <{ [103 x i8] c"/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0/src/scancodes/set1.rs" }>, align 1
@alloc_0d18c3d99ec2c5f0963d00ec7ad390b7 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_4ca2ba91686521ffa01190d37c11fe21, [16 x i8] c"g\00\00\00\00\00\00\006\01\00\00\11\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !13, identifier: "12af6e2defad22563f8ef1f1b4db6125")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!13 = !{}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !17, vtableHolder: !22, templateParams: !13, identifier: "cc1afadd4111f864489066c07bb4800b")
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !16, file: !2, baseType: !6, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !16, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !16, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<pc_keyboard::KeyCode as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<pc_keyboard::KeyCode as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !13, identifier: "24b5566fd648457162b8be9dcebbe20")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyCode", scope: !33, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !34)
!33 = !DINamespace(name: "pc_keyboard", scope: null)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!35 = !DIEnumerator(name: "Escape", value: 0, isUnsigned: true)
!36 = !DIEnumerator(name: "F1", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "F2", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "F3", value: 3, isUnsigned: true)
!39 = !DIEnumerator(name: "F4", value: 4, isUnsigned: true)
!40 = !DIEnumerator(name: "F5", value: 5, isUnsigned: true)
!41 = !DIEnumerator(name: "F6", value: 6, isUnsigned: true)
!42 = !DIEnumerator(name: "F7", value: 7, isUnsigned: true)
!43 = !DIEnumerator(name: "F8", value: 8, isUnsigned: true)
!44 = !DIEnumerator(name: "F9", value: 9, isUnsigned: true)
!45 = !DIEnumerator(name: "F10", value: 10, isUnsigned: true)
!46 = !DIEnumerator(name: "F11", value: 11, isUnsigned: true)
!47 = !DIEnumerator(name: "F12", value: 12, isUnsigned: true)
!48 = !DIEnumerator(name: "PrintScreen", value: 13, isUnsigned: true)
!49 = !DIEnumerator(name: "SysRq", value: 14, isUnsigned: true)
!50 = !DIEnumerator(name: "ScrollLock", value: 15, isUnsigned: true)
!51 = !DIEnumerator(name: "PauseBreak", value: 16, isUnsigned: true)
!52 = !DIEnumerator(name: "Oem8", value: 17, isUnsigned: true)
!53 = !DIEnumerator(name: "Key1", value: 18, isUnsigned: true)
!54 = !DIEnumerator(name: "Key2", value: 19, isUnsigned: true)
!55 = !DIEnumerator(name: "Key3", value: 20, isUnsigned: true)
!56 = !DIEnumerator(name: "Key4", value: 21, isUnsigned: true)
!57 = !DIEnumerator(name: "Key5", value: 22, isUnsigned: true)
!58 = !DIEnumerator(name: "Key6", value: 23, isUnsigned: true)
!59 = !DIEnumerator(name: "Key7", value: 24, isUnsigned: true)
!60 = !DIEnumerator(name: "Key8", value: 25, isUnsigned: true)
!61 = !DIEnumerator(name: "Key9", value: 26, isUnsigned: true)
!62 = !DIEnumerator(name: "Key0", value: 27, isUnsigned: true)
!63 = !DIEnumerator(name: "OemMinus", value: 28, isUnsigned: true)
!64 = !DIEnumerator(name: "OemPlus", value: 29, isUnsigned: true)
!65 = !DIEnumerator(name: "Backspace", value: 30, isUnsigned: true)
!66 = !DIEnumerator(name: "Insert", value: 31, isUnsigned: true)
!67 = !DIEnumerator(name: "Home", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "PageUp", value: 33, isUnsigned: true)
!69 = !DIEnumerator(name: "NumpadLock", value: 34, isUnsigned: true)
!70 = !DIEnumerator(name: "NumpadDivide", value: 35, isUnsigned: true)
!71 = !DIEnumerator(name: "NumpadMultiply", value: 36, isUnsigned: true)
!72 = !DIEnumerator(name: "NumpadSubtract", value: 37, isUnsigned: true)
!73 = !DIEnumerator(name: "Tab", value: 38, isUnsigned: true)
!74 = !DIEnumerator(name: "Q", value: 39, isUnsigned: true)
!75 = !DIEnumerator(name: "W", value: 40, isUnsigned: true)
!76 = !DIEnumerator(name: "E", value: 41, isUnsigned: true)
!77 = !DIEnumerator(name: "R", value: 42, isUnsigned: true)
!78 = !DIEnumerator(name: "T", value: 43, isUnsigned: true)
!79 = !DIEnumerator(name: "Y", value: 44, isUnsigned: true)
!80 = !DIEnumerator(name: "U", value: 45, isUnsigned: true)
!81 = !DIEnumerator(name: "I", value: 46, isUnsigned: true)
!82 = !DIEnumerator(name: "O", value: 47, isUnsigned: true)
!83 = !DIEnumerator(name: "P", value: 48, isUnsigned: true)
!84 = !DIEnumerator(name: "Oem4", value: 49, isUnsigned: true)
!85 = !DIEnumerator(name: "Oem6", value: 50, isUnsigned: true)
!86 = !DIEnumerator(name: "Oem5", value: 51, isUnsigned: true)
!87 = !DIEnumerator(name: "Oem7", value: 52, isUnsigned: true)
!88 = !DIEnumerator(name: "Delete", value: 53, isUnsigned: true)
!89 = !DIEnumerator(name: "End", value: 54, isUnsigned: true)
!90 = !DIEnumerator(name: "PageDown", value: 55, isUnsigned: true)
!91 = !DIEnumerator(name: "Numpad7", value: 56, isUnsigned: true)
!92 = !DIEnumerator(name: "Numpad8", value: 57, isUnsigned: true)
!93 = !DIEnumerator(name: "Numpad9", value: 58, isUnsigned: true)
!94 = !DIEnumerator(name: "NumpadAdd", value: 59, isUnsigned: true)
!95 = !DIEnumerator(name: "CapsLock", value: 60, isUnsigned: true)
!96 = !DIEnumerator(name: "A", value: 61, isUnsigned: true)
!97 = !DIEnumerator(name: "S", value: 62, isUnsigned: true)
!98 = !DIEnumerator(name: "D", value: 63, isUnsigned: true)
!99 = !DIEnumerator(name: "F", value: 64, isUnsigned: true)
!100 = !DIEnumerator(name: "G", value: 65, isUnsigned: true)
!101 = !DIEnumerator(name: "H", value: 66, isUnsigned: true)
!102 = !DIEnumerator(name: "J", value: 67, isUnsigned: true)
!103 = !DIEnumerator(name: "K", value: 68, isUnsigned: true)
!104 = !DIEnumerator(name: "L", value: 69, isUnsigned: true)
!105 = !DIEnumerator(name: "Oem1", value: 70, isUnsigned: true)
!106 = !DIEnumerator(name: "Oem3", value: 71, isUnsigned: true)
!107 = !DIEnumerator(name: "Return", value: 72, isUnsigned: true)
!108 = !DIEnumerator(name: "Numpad4", value: 73, isUnsigned: true)
!109 = !DIEnumerator(name: "Numpad5", value: 74, isUnsigned: true)
!110 = !DIEnumerator(name: "Numpad6", value: 75, isUnsigned: true)
!111 = !DIEnumerator(name: "LShift", value: 76, isUnsigned: true)
!112 = !DIEnumerator(name: "Z", value: 77, isUnsigned: true)
!113 = !DIEnumerator(name: "X", value: 78, isUnsigned: true)
!114 = !DIEnumerator(name: "C", value: 79, isUnsigned: true)
!115 = !DIEnumerator(name: "V", value: 80, isUnsigned: true)
!116 = !DIEnumerator(name: "B", value: 81, isUnsigned: true)
!117 = !DIEnumerator(name: "N", value: 82, isUnsigned: true)
!118 = !DIEnumerator(name: "M", value: 83, isUnsigned: true)
!119 = !DIEnumerator(name: "OemComma", value: 84, isUnsigned: true)
!120 = !DIEnumerator(name: "OemPeriod", value: 85, isUnsigned: true)
!121 = !DIEnumerator(name: "Oem2", value: 86, isUnsigned: true)
!122 = !DIEnumerator(name: "RShift", value: 87, isUnsigned: true)
!123 = !DIEnumerator(name: "ArrowUp", value: 88, isUnsigned: true)
!124 = !DIEnumerator(name: "Numpad1", value: 89, isUnsigned: true)
!125 = !DIEnumerator(name: "Numpad2", value: 90, isUnsigned: true)
!126 = !DIEnumerator(name: "Numpad3", value: 91, isUnsigned: true)
!127 = !DIEnumerator(name: "NumpadEnter", value: 92, isUnsigned: true)
!128 = !DIEnumerator(name: "LControl", value: 93, isUnsigned: true)
!129 = !DIEnumerator(name: "LWin", value: 94, isUnsigned: true)
!130 = !DIEnumerator(name: "LAlt", value: 95, isUnsigned: true)
!131 = !DIEnumerator(name: "Spacebar", value: 96, isUnsigned: true)
!132 = !DIEnumerator(name: "RAltGr", value: 97, isUnsigned: true)
!133 = !DIEnumerator(name: "RWin", value: 98, isUnsigned: true)
!134 = !DIEnumerator(name: "Apps", value: 99, isUnsigned: true)
!135 = !DIEnumerator(name: "RControl", value: 100, isUnsigned: true)
!136 = !DIEnumerator(name: "ArrowLeft", value: 101, isUnsigned: true)
!137 = !DIEnumerator(name: "ArrowDown", value: 102, isUnsigned: true)
!138 = !DIEnumerator(name: "ArrowRight", value: 103, isUnsigned: true)
!139 = !DIEnumerator(name: "Numpad0", value: 104, isUnsigned: true)
!140 = !DIEnumerator(name: "NumpadPeriod", value: 105, isUnsigned: true)
!141 = !DIEnumerator(name: "Oem9", value: 106, isUnsigned: true)
!142 = !DIEnumerator(name: "Oem10", value: 107, isUnsigned: true)
!143 = !DIEnumerator(name: "Oem11", value: 108, isUnsigned: true)
!144 = !DIEnumerator(name: "Oem12", value: 109, isUnsigned: true)
!145 = !DIEnumerator(name: "Oem13", value: 110, isUnsigned: true)
!146 = !DIEnumerator(name: "PrevTrack", value: 111, isUnsigned: true)
!147 = !DIEnumerator(name: "NextTrack", value: 112, isUnsigned: true)
!148 = !DIEnumerator(name: "Mute", value: 113, isUnsigned: true)
!149 = !DIEnumerator(name: "Calculator", value: 114, isUnsigned: true)
!150 = !DIEnumerator(name: "Play", value: 115, isUnsigned: true)
!151 = !DIEnumerator(name: "Stop", value: 116, isUnsigned: true)
!152 = !DIEnumerator(name: "VolumeDown", value: 117, isUnsigned: true)
!153 = !DIEnumerator(name: "VolumeUp", value: 118, isUnsigned: true)
!154 = !DIEnumerator(name: "WWWHome", value: 119, isUnsigned: true)
!155 = !DIEnumerator(name: "PowerOnTestOk", value: 120, isUnsigned: true)
!156 = !DIEnumerator(name: "TooManyKeys", value: 121, isUnsigned: true)
!157 = !DIEnumerator(name: "RControl2", value: 122, isUnsigned: true)
!158 = !DIEnumerator(name: "RAlt2", value: 123, isUnsigned: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "<&pc_keyboard::KeyState as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&pc_keyboard::KeyState as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !162, vtableHolder: !167, templateParams: !13, identifier: "234c17edc64b292c707007a7bc616fe3")
!162 = !{!163, !164, !165, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !161, file: !2, baseType: !6, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !161, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !161, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !161, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&pc_keyboard::KeyState", baseType: !168, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "KeyState", scope: !33, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIEnumerator(name: "Up", value: 0, isUnsigned: true)
!171 = !DIEnumerator(name: "Down", value: 1, isUnsigned: true)
!172 = !DIEnumerator(name: "SingleShot", value: 2, isUnsigned: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !176, vtableHolder: !181, templateParams: !13, identifier: "b40b152e9971b32bdc56ea76d81ae47b")
!176 = !{!177, !178, !179, !180}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !175, file: !2, baseType: !6, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !175, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !175, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!181 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !185, vtableHolder: !190, templateParams: !13, identifier: "c7e817bcfe8ab7c0bbea3df07e9376b7")
!185 = !{!186, !187, !188, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !184, file: !2, baseType: !6, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !184, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "<&char as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&char as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !194, vtableHolder: !199, templateParams: !13, identifier: "92e2bd7304cd1d9faec5b03467c48c73")
!194 = !{!195, !196, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !193, file: !2, baseType: !6, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !193, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !193, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&char", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "<&pc_keyboard::KeyCode as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&pc_keyboard::KeyCode as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !204, vtableHolder: !209, templateParams: !13, identifier: "880d0b5a1ce367dfde60f323a93faf9e")
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !203, file: !2, baseType: !6, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !203, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&pc_keyboard::KeyCode", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !{i32 8, !"PIC Level", i32 2}
!211 = !{i32 2, !"Dwarf Version", i32 4}
!212 = !{i32 2, !"Debug Info Version", i32 3}
!213 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !214, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !215, globals: !244, splitDebugInlining: false)
!214 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0/src/lib.rs/@/pc_keyboard.b2003f6af1371c38-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0")
!215 = !{!32, !168, !216, !223, !232, !236}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Error", scope: !33, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !217)
!217 = !{!218, !219, !220, !221, !222}
!218 = !DIEnumerator(name: "BadStartBit", value: 0, isUnsigned: true)
!219 = !DIEnumerator(name: "BadStopBit", value: 1, isUnsigned: true)
!220 = !DIEnumerator(name: "ParityError", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "UnknownKeyCode", value: 3, isUnsigned: true)
!222 = !DIEnumerator(name: "InvalidState", value: 4, isUnsigned: true)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !224, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !227)
!224 = !DINamespace(name: "rt", scope: !225)
!225 = !DINamespace(name: "fmt", scope: !226)
!226 = !DINamespace(name: "core", scope: null)
!227 = !{!228, !229, !230, !231}
!228 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandleControl", scope: !33, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !233)
!233 = !{!234, !235}
!234 = !DIEnumerator(name: "MapLettersToUnicode", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "Ignore", value: 1, isUnsigned: true)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DecodeState", scope: !33, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagEnumClass, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243}
!238 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!239 = !DIEnumerator(name: "Extended", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "Release", value: 2, isUnsigned: true)
!241 = !DIEnumerator(name: "ExtendedRelease", value: 3, isUnsigned: true)
!242 = !DIEnumerator(name: "Extended2", value: 4, isUnsigned: true)
!243 = !DIEnumerator(name: "Extended2Release", value: 5, isUnsigned: true)
!244 = !{!0, !14, !24, !159, !173, !182, !191, !201}
!245 = distinct !DISubprogram(name: "from_residual<core::option::Option<pc_keyboard::KeyEvent>, pc_keyboard::Error, pc_keyboard::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h1b3c74bd15cc4ee7E", scope: !247, file: !246, line: 1959, type: !249, scopeLine: 1959, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !321, retainedNodes: !317)
!246 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f5ea4225648c8122dcfad60e08bb96c")
!247 = !DINamespace(name: "{impl#27}", scope: !248)
!248 = !DINamespace(name: "result", scope: !226)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !285, !303}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::option::Option<pc_keyboard::KeyEvent>, pc_keyboard::Error>", scope: !248, file: !2, size: 16, align: 8, elements: !252, templateParams: !13, identifier: "9b024c0bed14799e573817562c43f324")
!252 = !{!253}
!253 = !DICompositeType(tag: DW_TAG_variant_part, scope: !251, file: !2, size: 16, align: 8, elements: !254, templateParams: !13, identifier: "8b61050e0775a723c8751567d86b47ab", discriminator: !284)
!254 = !{!255, !280}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !253, file: !2, baseType: !256, size: 16, align: 8)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !251, file: !2, size: 16, align: 8, elements: !257, templateParams: !277, identifier: "650ef67a278a60fe6b270866ccfa09b")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !256, file: !2, baseType: !259, size: 16, align: 8)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<pc_keyboard::KeyEvent>", scope: !260, file: !2, size: 16, align: 8, elements: !261, templateParams: !13, identifier: "6496d6e7b4a48c80bfce922c851f212e")
!260 = !DINamespace(name: "option", scope: !226)
!261 = !{!262}
!262 = !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !2, size: 16, align: 8, elements: !263, templateParams: !13, identifier: "2fb0ae22fd489b4a44c474cbebb420d0", discriminator: !276)
!263 = !{!264, !272}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !262, file: !2, baseType: !265, size: 16, align: 8, extraData: i64 3)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !259, file: !2, size: 16, align: 8, elements: !13, templateParams: !266, identifier: "f53711612eafe0d0b08c512ffe7f07ab")
!266 = !{!267}
!267 = !DITemplateTypeParameter(name: "T", type: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyEvent", scope: !33, file: !2, size: 16, align: 8, elements: !269, templateParams: !13, identifier: "af6c1075512c0bc59de11b8c5396f5a3")
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !268, file: !2, baseType: !32, size: 8, align: 8, offset: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !268, file: !2, baseType: !168, size: 8, align: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !262, file: !2, baseType: !273, size: 16, align: 8)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !259, file: !2, size: 16, align: 8, elements: !274, templateParams: !266, identifier: "97e3fcc58192833386933731673d202")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !273, file: !2, baseType: !268, size: 16, align: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!277 = !{!278, !279}
!278 = !DITemplateTypeParameter(name: "T", type: !259)
!279 = !DITemplateTypeParameter(name: "E", type: !216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !253, file: !2, baseType: !281, size: 16, align: 8, extraData: i64 4)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !251, file: !2, size: 16, align: 8, elements: !282, templateParams: !277, identifier: "cacbfbce69a4dff98dfaca9f21f0a953")
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !281, file: !2, baseType: !216, size: 8, align: 8, offset: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, scope: !251, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, pc_keyboard::Error>", scope: !248, file: !2, size: 8, align: 8, elements: !286, templateParams: !13, identifier: "a661d4710c44f449fcd72de851b8cbfd")
!286 = !{!287}
!287 = !DICompositeType(tag: DW_TAG_variant_part, scope: !285, file: !2, size: 8, align: 8, elements: !288, templateParams: !13, identifier: "8fbda35b0332850f411dc7cfa9a46f1b")
!288 = !{!289, !299}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !287, file: !2, baseType: !290, size: 8, align: 8)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !285, file: !2, size: 8, align: 8, elements: !291, templateParams: !297, identifier: "f10066c33cbe5e7f602e130180e9d1e1")
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !290, file: !2, baseType: !293, align: 8)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !294, file: !2, align: 8, elements: !295, templateParams: !13, identifier: "33771e1960043c76ff356e361bc81a5")
!294 = !DINamespace(name: "convert", scope: !226)
!295 = !{!296}
!296 = !DICompositeType(tag: DW_TAG_variant_part, scope: !293, file: !2, align: 8, elements: !13, identifier: "75162751df9d48d24116d7ae8044fbdf")
!297 = !{!298, !279}
!298 = !DITemplateTypeParameter(name: "T", type: !293)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !287, file: !2, baseType: !300, size: 8, align: 8)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !285, file: !2, size: 8, align: 8, elements: !301, templateParams: !297, identifier: "fc92d681a38283971770d8d3c481b0c2")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !300, file: !2, baseType: !216, size: 8, align: 8)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !304, size: 64, align: 64, dwarfAddressSpace: 0)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !305, file: !2, size: 192, align: 64, elements: !307, templateParams: !13, identifier: "58edb26be50e546f2f545926f1f4db80")
!305 = !DINamespace(name: "location", scope: !306)
!306 = !DINamespace(name: "panic", scope: !226)
!307 = !{!308, !314, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !304, file: !2, baseType: !309, size: 128, align: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !310, templateParams: !13, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!310 = !{!311, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !309, file: !2, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !309, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !304, file: !2, baseType: !315, size: 32, align: 32, offset: 128)
!315 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !304, file: !2, baseType: !315, size: 32, align: 32, offset: 160)
!317 = !{!318, !319}
!318 = !DILocalVariable(name: "residual", arg: 1, scope: !245, file: !246, line: 1959, type: !285)
!319 = !DILocalVariable(name: "e", scope: !320, file: !246, line: 1961, type: !216, align: 1)
!320 = distinct !DILexicalBlock(scope: !245, file: !246, line: 1961, column: 13)
!321 = !{!278, !279, !322}
!322 = !DITemplateTypeParameter(name: "F", type: !216)
!323 = !DILocation(line: 1959, column: 22, scope: !245)
!324 = !DILocation(line: 1961, column: 17, scope: !245)
!325 = !{i8 0, i8 5}
!326 = !DILocation(line: 1961, column: 17, scope: !320)
!327 = !DILocalVariable(name: "t", arg: 1, scope: !328, file: !329, line: 726, type: !216)
!328 = distinct !DISubprogram(name: "from<pc_keyboard::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h5c3d94e7ca212475E", scope: !330, file: !329, line: 726, type: !331, scopeLine: 726, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !334, retainedNodes: !333)
!329 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ed58a16a1636c00df27e10b1a9ddc20")
!330 = !DINamespace(name: "{impl#4}", scope: !294)
!331 = !DISubroutineType(types: !332)
!332 = !{!216, !216}
!333 = !{!327}
!334 = !{!335}
!335 = !DITemplateTypeParameter(name: "T", type: !216)
!336 = !DILocation(line: 726, column: 13, scope: !328, inlinedAt: !337)
!337 = distinct !DILocation(line: 1961, column: 27, scope: !320)
!338 = !DILocation(line: 1961, column: 23, scope: !320)
!339 = !DILocation(line: 1963, column: 6, scope: !245)
!340 = distinct !DISubprogram(name: "from_residual<core::option::Option<u8>, pc_keyboard::Error, pc_keyboard::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h1e131c8761546f89E", scope: !247, file: !246, line: 1959, type: !341, scopeLine: 1959, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !375, retainedNodes: !371)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !285, !303}
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::option::Option<u8>, pc_keyboard::Error>", scope: !248, file: !2, size: 16, align: 8, elements: !344, templateParams: !13, identifier: "f6efc027043355aed00092a9e4300825")
!344 = !{!345}
!345 = !DICompositeType(tag: DW_TAG_variant_part, scope: !343, file: !2, size: 16, align: 8, elements: !346, templateParams: !13, identifier: "a5523c06c18f85257bd7faa818243c99", discriminator: !370)
!346 = !{!347, !366}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !345, file: !2, baseType: !348, size: 16, align: 8)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !343, file: !2, size: 16, align: 8, elements: !349, templateParams: !364, identifier: "9cf3236c9ba6949ca13154fed0c1ce24")
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !348, file: !2, baseType: !351, size: 16, align: 8)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !260, file: !2, size: 16, align: 8, elements: !352, templateParams: !13, identifier: "d999326cdb2d86cb93875f42c3ca316")
!352 = !{!353}
!353 = !DICompositeType(tag: DW_TAG_variant_part, scope: !351, file: !2, size: 16, align: 8, elements: !354, templateParams: !13, identifier: "a25ceedbec3dbb2dc59d08e25327561c", discriminator: !363)
!354 = !{!355, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !353, file: !2, baseType: !356, size: 16, align: 8, extraData: i64 0)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !351, file: !2, size: 16, align: 8, elements: !13, templateParams: !357, identifier: "525ce36ddcf0023f6bb645832b9d8d0a")
!357 = !{!358}
!358 = !DITemplateTypeParameter(name: "T", type: !23)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !353, file: !2, baseType: !360, size: 16, align: 8, extraData: i64 1)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !351, file: !2, size: 16, align: 8, elements: !361, templateParams: !357, identifier: "5d588492b4cbaa2d454d6d8f02f9b09f")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !360, file: !2, baseType: !23, size: 8, align: 8, offset: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !351, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!364 = !{!365, !279}
!365 = !DITemplateTypeParameter(name: "T", type: !351)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !345, file: !2, baseType: !367, size: 16, align: 8, extraData: i64 2)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !343, file: !2, size: 16, align: 8, elements: !368, templateParams: !364, identifier: "89036e313eabc84e514abda834d172a")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !367, file: !2, baseType: !216, size: 8, align: 8, offset: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !343, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!371 = !{!372, !373}
!372 = !DILocalVariable(name: "residual", arg: 1, scope: !340, file: !246, line: 1959, type: !285)
!373 = !DILocalVariable(name: "e", scope: !374, file: !246, line: 1961, type: !216, align: 1)
!374 = distinct !DILexicalBlock(scope: !340, file: !246, line: 1961, column: 13)
!375 = !{!365, !279, !322}
!376 = !DILocation(line: 1959, column: 22, scope: !340)
!377 = !DILocation(line: 1961, column: 17, scope: !340)
!378 = !DILocation(line: 1961, column: 17, scope: !374)
!379 = !DILocation(line: 726, column: 13, scope: !328, inlinedAt: !380)
!380 = distinct !DILocation(line: 1961, column: 27, scope: !374)
!381 = !DILocation(line: 1961, column: 23, scope: !374)
!382 = !DILocation(line: 1963, column: 6, scope: !340)
!383 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h3c7777d9d17c3dbcE", scope: !385, file: !384, line: 2287, type: !386, scopeLine: 2287, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !13, retainedNodes: !438)
!384 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef87442911d64d819773d1c3d54b7ba2")
!385 = !DINamespace(name: "{impl#12}", scope: !225)
!386 = !DISubroutineType(types: !387)
!387 = !{!388, !190, !405}
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !248, file: !2, size: 8, align: 8, elements: !389, templateParams: !13, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!389 = !{!390}
!390 = !DICompositeType(tag: DW_TAG_variant_part, scope: !388, file: !2, size: 8, align: 8, elements: !391, templateParams: !13, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !404)
!391 = !{!392, !400}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !390, file: !2, baseType: !393, size: 8, align: 8, extraData: i64 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !388, file: !2, size: 8, align: 8, elements: !394, templateParams: !396, identifier: "d91e207f895b5ed21304fa16506e0f28")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !393, file: !2, baseType: !7, align: 8, offset: 8)
!396 = !{!397, !398}
!397 = !DITemplateTypeParameter(name: "T", type: !7)
!398 = !DITemplateTypeParameter(name: "E", type: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !225, file: !2, align: 8, elements: !13, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !390, file: !2, baseType: !401, size: 8, align: 8, extraData: i64 1)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !388, file: !2, size: 8, align: 8, elements: !402, templateParams: !396, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !401, file: !2, baseType: !399, align: 8, offset: 8)
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !406, size: 64, align: 64, dwarfAddressSpace: 0)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !225, file: !2, size: 512, align: 64, elements: !407, templateParams: !13, identifier: "bc7f0caae71140a04b17743f5a695b51")
!407 = !{!408, !409, !410, !411, !426, !427}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !406, file: !2, baseType: !315, size: 32, align: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !406, file: !2, baseType: !200, size: 32, align: 32, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !406, file: !2, baseType: !223, size: 8, align: 8, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !406, file: !2, baseType: !412, size: 128, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !260, file: !2, size: 128, align: 64, elements: !413, templateParams: !13, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!413 = !{!414}
!414 = !DICompositeType(tag: DW_TAG_variant_part, scope: !412, file: !2, size: 128, align: 64, elements: !415, templateParams: !13, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !424)
!415 = !{!416, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !414, file: !2, baseType: !417, size: 128, align: 64, extraData: i64 0)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !412, file: !2, size: 128, align: 64, elements: !13, templateParams: !418, identifier: "728f4cb196695ca2ab2ce43263435122")
!418 = !{!419}
!419 = !DITemplateTypeParameter(name: "T", type: !9)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !414, file: !2, baseType: !421, size: 128, align: 64, extraData: i64 1)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !412, file: !2, size: 128, align: 64, elements: !422, templateParams: !418, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !421, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !412, file: !2, baseType: !425, size: 64, align: 64, flags: DIFlagArtificial)
!425 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !406, file: !2, baseType: !412, size: 128, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !406, file: !2, baseType: !428, size: 128, align: 64, offset: 256)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !429, templateParams: !13, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!429 = !{!430, !433}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !428, file: !2, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !13, identifier: "a80c365aa420df7c35abe384a2fa122f")
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !428, file: !2, baseType: !434, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 3, lowerBound: 0)
!438 = !{!439, !440}
!439 = !DILocalVariable(name: "self", arg: 1, scope: !383, file: !384, line: 2287, type: !190)
!440 = !DILocalVariable(name: "f", arg: 2, scope: !383, file: !384, line: 2287, type: !405)
!441 = !DILocation(line: 2287, column: 12, scope: !383)
!442 = !DILocation(line: 2287, column: 19, scope: !383)
!443 = !DILocation(line: 2288, column: 9, scope: !383)
!444 = !DILocation(line: 2289, column: 6, scope: !383)
!445 = distinct !DISubprogram(name: "fmt<pc_keyboard::KeyCode>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h15f21ca5ea0e0355E", scope: !446, file: !384, line: 2258, type: !447, scopeLine: 2258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !453, retainedNodes: !450)
!446 = !DINamespace(name: "{impl#53}", scope: !225)
!447 = !DISubroutineType(types: !448)
!448 = !{!388, !449, !405}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&pc_keyboard::KeyCode", baseType: !209, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !{!451, !452}
!451 = !DILocalVariable(name: "self", arg: 1, scope: !445, file: !384, line: 2258, type: !449)
!452 = !DILocalVariable(name: "f", arg: 2, scope: !445, file: !384, line: 2258, type: !405)
!453 = !{!454}
!454 = !DITemplateTypeParameter(name: "T", type: !32)
!455 = !DILocation(line: 2258, column: 20, scope: !445)
!456 = !DILocation(line: 2258, column: 27, scope: !445)
!457 = !DILocation(line: 2258, column: 71, scope: !445)
!458 = !{i64 1}
!459 = !DILocation(line: 2258, column: 62, scope: !445)
!460 = !DILocation(line: 2258, column: 84, scope: !445)
!461 = distinct !DISubprogram(name: "fmt<pc_keyboard::KeyState>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6622ccf72cf45942E", scope: !446, file: !384, line: 2258, type: !462, scopeLine: 2258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !468, retainedNodes: !465)
!462 = !DISubroutineType(types: !463)
!463 = !{!388, !464, !405}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&pc_keyboard::KeyState", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!465 = !{!466, !467}
!466 = !DILocalVariable(name: "self", arg: 1, scope: !461, file: !384, line: 2258, type: !464)
!467 = !DILocalVariable(name: "f", arg: 2, scope: !461, file: !384, line: 2258, type: !405)
!468 = !{!469}
!469 = !DITemplateTypeParameter(name: "T", type: !168)
!470 = !DILocation(line: 2258, column: 20, scope: !461)
!471 = !DILocation(line: 2258, column: 27, scope: !461)
!472 = !DILocation(line: 2258, column: 71, scope: !461)
!473 = !DILocation(line: 2258, column: 62, scope: !461)
!474 = !DILocation(line: 2258, column: 84, scope: !461)
!475 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u16$GT$3fmt17hc12453e291a1b7f7E", scope: !477, file: !476, line: 185, type: !479, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !13, retainedNodes: !482)
!476 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "02359a317e793c1b82de7b934f87f847")
!477 = !DINamespace(name: "{impl#85}", scope: !478)
!478 = !DINamespace(name: "num", scope: !225)
!479 = !DISubroutineType(types: !480)
!480 = !{!388, !481, !405}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!482 = !{!483, !484}
!483 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !476, line: 185, type: !481)
!484 = !DILocalVariable(name: "f", arg: 2, scope: !475, file: !476, line: 185, type: !405)
!485 = !DILocation(line: 185, column: 20, scope: !475)
!486 = !DILocation(line: 185, column: 27, scope: !475)
!487 = !DILocation(line: 186, column: 20, scope: !475)
!488 = !DILocation(line: 188, column: 27, scope: !475)
!489 = !DILocation(line: 187, column: 21, scope: !475)
!490 = !DILocation(line: 193, column: 14, scope: !475)
!491 = !{i8 0, i8 2}
!492 = !DILocation(line: 191, column: 21, scope: !475)
!493 = !DILocation(line: 189, column: 21, scope: !475)
!494 = distinct !DISubprogram(name: "drop_in_place<u16>", linkageName: "_ZN4core3ptr24drop_in_place$LT$u16$GT$17h62dfc1b421aa10a3E", scope: !496, file: !495, line: 491, type: !497, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !502, retainedNodes: !500)
!495 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d71cbcc5c5af3689983c051fcd9aec72")
!496 = !DINamespace(name: "ptr", scope: !226)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u16", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !{!501}
!501 = !DILocalVariable(arg: 1, scope: !494, file: !495, line: 491, type: !499)
!502 = !{!503}
!503 = !DITemplateTypeParameter(name: "T", type: !12)
!504 = !DILocation(line: 491, column: 1, scope: !494)
!505 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17h2af7f48562a3de6dE", scope: !496, file: !495, line: 491, type: !506, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !511, retainedNodes: !509)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !{!510}
!510 = !DILocalVariable(arg: 1, scope: !505, file: !495, line: 491, type: !508)
!511 = !{!512}
!512 = !DITemplateTypeParameter(name: "T", type: !181)
!513 = !DILocation(line: 491, column: 1, scope: !505)
!514 = distinct !DISubprogram(name: "drop_in_place<&u8>", linkageName: "_ZN4core3ptr27drop_in_place$LT$$RF$u8$GT$17hf4feb1d89a833134E", scope: !496, file: !495, line: 491, type: !515, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !520, retainedNodes: !518)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &u8", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !{!519}
!519 = !DILocalVariable(arg: 1, scope: !514, file: !495, line: 491, type: !517)
!520 = !{!521}
!521 = !DITemplateTypeParameter(name: "T", type: !22)
!522 = !DILocation(line: 491, column: 1, scope: !514)
!523 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17h8682ab39ce5d809fE", scope: !496, file: !495, line: 491, type: !524, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !529, retainedNodes: !527)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!527 = !{!528}
!528 = !DILocalVariable(arg: 1, scope: !523, file: !495, line: 491, type: !526)
!529 = !{!530}
!530 = !DITemplateTypeParameter(name: "T", type: !190)
!531 = !DILocation(line: 491, column: 1, scope: !523)
!532 = distinct !DISubprogram(name: "drop_in_place<&char>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$char$GT$17hb3b47589b742b266E", scope: !496, file: !495, line: 491, type: !533, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !538, retainedNodes: !536)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &char", baseType: !199, size: 64, align: 64, dwarfAddressSpace: 0)
!536 = !{!537}
!537 = !DILocalVariable(arg: 1, scope: !532, file: !495, line: 491, type: !535)
!538 = !{!539}
!539 = !DITemplateTypeParameter(name: "T", type: !199)
!540 = !DILocation(line: 491, column: 1, scope: !532)
!541 = distinct !DISubprogram(name: "drop_in_place<pc_keyboard::KeyCode>", linkageName: "_ZN4core3ptr41drop_in_place$LT$pc_keyboard..KeyCode$GT$17h7a57d841ce0e33fdE", scope: !496, file: !495, line: 491, type: !542, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !453, retainedNodes: !545)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pc_keyboard::KeyCode", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !{!546}
!546 = !DILocalVariable(arg: 1, scope: !541, file: !495, line: 491, type: !544)
!547 = !DILocation(line: 491, column: 1, scope: !541)
!548 = distinct !DISubprogram(name: "drop_in_place<&pc_keyboard::KeyCode>", linkageName: "_ZN4core3ptr45drop_in_place$LT$$RF$pc_keyboard..KeyCode$GT$17h2edfc19b1225f02eE", scope: !496, file: !495, line: 491, type: !549, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !554, retainedNodes: !552)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &pc_keyboard::KeyCode", baseType: !209, size: 64, align: 64, dwarfAddressSpace: 0)
!552 = !{!553}
!553 = !DILocalVariable(arg: 1, scope: !548, file: !495, line: 491, type: !551)
!554 = !{!555}
!555 = !DITemplateTypeParameter(name: "T", type: !209)
!556 = !DILocation(line: 491, column: 1, scope: !548)
!557 = distinct !DISubprogram(name: "drop_in_place<&pc_keyboard::KeyState>", linkageName: "_ZN4core3ptr46drop_in_place$LT$$RF$pc_keyboard..KeyState$GT$17hfb309769be524e4dE", scope: !496, file: !495, line: 491, type: !558, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !563, retainedNodes: !561)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &pc_keyboard::KeyState", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !{!562}
!562 = !DILocalVariable(arg: 1, scope: !557, file: !495, line: 491, type: !560)
!563 = !{!564}
!564 = !DITemplateTypeParameter(name: "T", type: !167)
!565 = !DILocation(line: 491, column: 1, scope: !557)
!566 = distinct !DISubprogram(name: "from", linkageName: "_ZN4core4char7convert64_$LT$impl$u20$core..convert..From$LT$u8$GT$$u20$for$u20$char$GT$4from17h3974787ac7b22becE", scope: !568, file: !567, line: 136, type: !571, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !13, retainedNodes: !573)
!567 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/convert.rs", directory: "", checksumkind: CSK_MD5, checksum: "36046ab7416a8de36c5a5637e0fd0b62")
!568 = !DINamespace(name: "{impl#4}", scope: !569)
!569 = !DINamespace(name: "convert", scope: !570)
!570 = !DINamespace(name: "char", scope: !226)
!571 = !DISubroutineType(types: !572)
!572 = !{!200, !23}
!573 = !{!574}
!574 = !DILocalVariable(name: "i", arg: 1, scope: !566, file: !567, line: 136, type: !23)
!575 = !DILocation(line: 136, column: 13, scope: !566)
!576 = !DILocation(line: 137, column: 9, scope: !566)
!577 = !DILocation(line: 138, column: 6, scope: !566)
!578 = distinct !DISubprogram(name: "into<u8, char>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..Into$LT$U$GT$$GT$4into17ha5b37ea2aa7f85acE", scope: !579, file: !329, line: 716, type: !571, scopeLine: 716, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !582, retainedNodes: !580)
!579 = !DINamespace(name: "{impl#3}", scope: !294)
!580 = !{!581}
!581 = !DILocalVariable(name: "self", arg: 1, scope: !578, file: !329, line: 716, type: !23)
!582 = !{!358, !583}
!583 = !DITemplateTypeParameter(name: "U", type: !200)
!584 = !DILocation(line: 716, column: 13, scope: !578)
!585 = !DILocation(line: 717, column: 9, scope: !578)
!586 = !{i32 0, i32 1114112}
!587 = !DILocation(line: 718, column: 6, scope: !578)
!588 = distinct !DISubprogram(name: "branch<pc_keyboard::KeyCode, pc_keyboard::Error>", linkageName: "_ZN79_$LT$core..result..Result$LT$T$C$E$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17h5feda55be29f7c9cE", scope: !589, file: !246, line: 1947, type: !590, scopeLine: 1947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !618, retainedNodes: !624)
!589 = !DINamespace(name: "{impl#26}", scope: !248)
!590 = !DISubroutineType(types: !591)
!591 = !{!592, !610}
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::result::Result<core::convert::Infallible, pc_keyboard::Error>, pc_keyboard::KeyCode>", scope: !593, file: !2, size: 16, align: 8, elements: !595, templateParams: !13, identifier: "1834613ceb11be5edcb64364854dc922")
!593 = !DINamespace(name: "control_flow", scope: !594)
!594 = !DINamespace(name: "ops", scope: !226)
!595 = !{!596}
!596 = !DICompositeType(tag: DW_TAG_variant_part, scope: !592, file: !2, size: 16, align: 8, elements: !597, templateParams: !13, identifier: "1e54cfd94ce9e3322319c2bd8d66361c", discriminator: !609)
!597 = !{!598, !605}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !596, file: !2, baseType: !599, size: 16, align: 8, extraData: i64 0)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !592, file: !2, size: 16, align: 8, elements: !600, templateParams: !602, identifier: "c334bfc1077ac6dfe12dc89c1b96172b")
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !599, file: !2, baseType: !32, size: 8, align: 8, offset: 8)
!602 = !{!603, !604}
!603 = !DITemplateTypeParameter(name: "B", type: !285)
!604 = !DITemplateTypeParameter(name: "C", type: !32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !596, file: !2, baseType: !606, size: 16, align: 8, extraData: i64 1)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !592, file: !2, size: 16, align: 8, elements: !607, templateParams: !602, identifier: "f8620abdb4afd86ae6b140cb7bb7f72f")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !606, file: !2, baseType: !285, size: 8, align: 8, offset: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<pc_keyboard::KeyCode, pc_keyboard::Error>", scope: !248, file: !2, size: 16, align: 8, elements: !611, templateParams: !13, identifier: "99b897526f7e0613d55bb22ecd260841")
!611 = !{!612}
!612 = !DICompositeType(tag: DW_TAG_variant_part, scope: !610, file: !2, size: 16, align: 8, elements: !613, templateParams: !13, identifier: "e48e0db0037b83a19389f616d1aad603", discriminator: !623)
!613 = !{!614, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !612, file: !2, baseType: !615, size: 16, align: 8, extraData: i64 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !610, file: !2, size: 16, align: 8, elements: !616, templateParams: !618, identifier: "8f96bb2d081505ab3c5710dbc363c379")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !615, file: !2, baseType: !32, size: 8, align: 8, offset: 8)
!618 = !{!454, !279}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !612, file: !2, baseType: !620, size: 16, align: 8, extraData: i64 1)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !610, file: !2, size: 16, align: 8, elements: !621, templateParams: !618, identifier: "3b6930b1c7b322949f2b611d4078a025")
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !620, file: !2, baseType: !216, size: 8, align: 8, offset: 8)
!623 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!624 = !{!625, !626, !628}
!625 = !DILocalVariable(name: "self", arg: 1, scope: !588, file: !246, line: 1947, type: !610)
!626 = !DILocalVariable(name: "v", scope: !627, file: !246, line: 1949, type: !32, align: 1)
!627 = distinct !DILexicalBlock(scope: !588, file: !246, line: 1949, column: 13)
!628 = !DILocalVariable(name: "e", scope: !629, file: !246, line: 1950, type: !216, align: 1)
!629 = distinct !DILexicalBlock(scope: !588, file: !246, line: 1950, column: 13)
!630 = !DILocation(line: 1947, column: 15, scope: !588)
!631 = !DILocation(line: 1948, column: 15, scope: !588)
!632 = !DILocation(line: 1948, column: 9, scope: !588)
!633 = !DILocation(line: 1949, column: 16, scope: !588)
!634 = !{i8 0, i8 124}
!635 = !DILocation(line: 1949, column: 16, scope: !627)
!636 = !DILocation(line: 1949, column: 22, scope: !627)
!637 = !DILocation(line: 1949, column: 45, scope: !588)
!638 = !DILocation(line: 1950, column: 17, scope: !588)
!639 = !DILocation(line: 1950, column: 17, scope: !629)
!640 = !DILocation(line: 1950, column: 42, scope: !629)
!641 = !DILocation(line: 1950, column: 23, scope: !629)
!642 = !DILocation(line: 1950, column: 48, scope: !588)
!643 = !DILocation(line: 1952, column: 6, scope: !588)
!644 = distinct !DISubprogram(name: "branch<u8, pc_keyboard::Error>", linkageName: "_ZN79_$LT$core..result..Result$LT$T$C$E$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17hb8b2df966e142cbcE", scope: !589, file: !246, line: 1947, type: !645, scopeLine: 1947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !213, templateParams: !670, retainedNodes: !676)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !662}
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::result::Result<core::convert::Infallible, pc_keyboard::Error>, u8>", scope: !593, file: !2, size: 16, align: 8, elements: !648, templateParams: !13, identifier: "beb5f531b5ddcf909655b58917dc9233")
!648 = !{!649}
!649 = !DICompositeType(tag: DW_TAG_variant_part, scope: !647, file: !2, size: 16, align: 8, elements: !650, templateParams: !13, identifier: "c76baa9843f43e2f7791c471d0423ad6", discriminator: !661)
!650 = !{!651, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !649, file: !2, baseType: !652, size: 16, align: 8, extraData: i64 0)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !647, file: !2, size: 16, align: 8, elements: !653, templateParams: !655, identifier: "440d8426032be064a0bb6ff945303fd0")
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !652, file: !2, baseType: !23, size: 8, align: 8, offset: 8)
!655 = !{!603, !656}
!656 = !DITemplateTypeParameter(name: "C", type: !23)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !649, file: !2, baseType: !658, size: 16, align: 8, extraData: i64 1)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !647, file: !2, size: 16, align: 8, elements: !659, templateParams: !655, identifier: "77ba283c8ea155753f8b4a819b222614")
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !658, file: !2, baseType: !285, size: 8, align: 8, offset: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, scope: !647, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, pc_keyboard::Error>", scope: !248, file: !2, size: 16, align: 8, elements: !663, templateParams: !13, identifier: "33f65b05a5c018709a33fdec2c28dedb")
!663 = !{!664}
!664 = !DICompositeType(tag: DW_TAG_variant_part, scope: !662, file: !2, size: 16, align: 8, elements: !665, templateParams: !13, identifier: "5add4e7d31ecb2345a2b69f133dc34d2", discriminator: !675)
!665 = !{!666, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !664, file: !2, baseType: !667, size: 16, align: 8, extraData: i64 0)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !662, file: !2, size: 16, align: 8, elements: !668, templateParams: !670, identifier: "77d666fa00467f81d48112ad932397e0")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !667, file: !2, baseType: !23, size: 8, align: 8, offset: 8)
!670 = !{!358, !279}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !664, file: !2, baseType: !672, size: 16, align: 8, extraData: i64 1)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !662, file: !2, size: 16, align: 8, elements: !673, templateParams: !670, identifier: "27cc666b0bfa44ccabacc9c3a0243ba8")
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !672, file: !2, baseType: !216, size: 8, align: 8, offset: 8)
!675 = !DIDerivedType(tag: DW_TAG_member, scope: !662, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!676 = !{!677, !678, !680}
!677 = !DILocalVariable(name: "self", arg: 1, scope: !644, file: !246, line: 1947, type: !662)
!678 = !DILocalVariable(name: "v", scope: !679, file: !246, line: 1949, type: !23, align: 1)
!679 = distinct !DILexicalBlock(scope: !644, file: !246, line: 1949, column: 13)
!680 = !DILocalVariable(name: "e", scope: !681, file: !246, line: 1950, type: !216, align: 1)
!681 = distinct !DILexicalBlock(scope: !644, file: !246, line: 1950, column: 13)
!682 = !DILocation(line: 1947, column: 15, scope: !644)
!683 = !DILocation(line: 1948, column: 15, scope: !644)
!684 = !DILocation(line: 1948, column: 9, scope: !644)
!685 = !DILocation(line: 1949, column: 16, scope: !644)
!686 = !DILocation(line: 1949, column: 16, scope: !679)
!687 = !DILocation(line: 1949, column: 22, scope: !679)
!688 = !DILocation(line: 1949, column: 45, scope: !644)
!689 = !DILocation(line: 1950, column: 17, scope: !644)
!690 = !DILocation(line: 1950, column: 17, scope: !681)
!691 = !DILocation(line: 1950, column: 42, scope: !681)
!692 = !DILocation(line: 1950, column: 23, scope: !681)
!693 = !DILocation(line: 1950, column: 48, scope: !644)
!694 = !DILocation(line: 1952, column: 6, scope: !644)
!695 = distinct !DISubprogram(name: "map_keycode", linkageName: "_ZN101_$LT$pc_keyboard..layouts..dvorak_programmer104..DVP104Key$u20$as$u20$pc_keyboard..KeyboardLayout$GT$11map_keycode17h909d4d6f4e1afdc8E", scope: !697, file: !696, line: 11, type: !700, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !213, templateParams: !13, retainedNodes: !728)
!696 = !DIFile(filename: "src/layouts/dvorak_programmer104.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0", checksumkind: CSK_MD5, checksum: "1ce658e75c2c1c0a0c1c439241f066f7")
!697 = !DINamespace(name: "{impl#0}", scope: !698)
!698 = !DINamespace(name: "dvorak_programmer104", scope: !699)
!699 = !DINamespace(name: "layouts", scope: !33)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !715, !32, !717, !232}
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodedKey", scope: !33, file: !2, size: 64, align: 32, elements: !703, templateParams: !13, identifier: "c72cacceb10385e7e594b63b42f5797f")
!703 = !{!704}
!704 = !DICompositeType(tag: DW_TAG_variant_part, scope: !702, file: !2, size: 64, align: 32, elements: !705, templateParams: !13, identifier: "ba6591b106ae2eeb92aa198c793988be", discriminator: !714)
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RawKey", scope: !704, file: !2, baseType: !707, size: 64, align: 32, extraData: i64 0)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawKey", scope: !702, file: !2, size: 64, align: 32, elements: !708, templateParams: !13, identifier: "b64f968376544f75a90b1b2ac646fd48")
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !707, file: !2, baseType: !32, size: 8, align: 8, offset: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Unicode", scope: !704, file: !2, baseType: !711, size: 64, align: 32, extraData: i64 1)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unicode", scope: !702, file: !2, size: 64, align: 32, elements: !712, templateParams: !13, identifier: "1ee5ec9a2cae31ff957e217db386b3ed")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !711, file: !2, baseType: !200, size: 32, align: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, scope: !702, file: !2, baseType: !23, size: 8, align: 8, flags: DIFlagArtificial)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&pc_keyboard::layouts::dvorak_programmer104::DVP104Key", baseType: !716, size: 64, align: 64, dwarfAddressSpace: 0)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "DVP104Key", scope: !698, file: !2, align: 8, elements: !13, identifier: "8c90b352ce5861bec3db1b961d204bad")
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&pc_keyboard::Modifiers", baseType: !718, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Modifiers", scope: !33, file: !2, size: 64, align: 8, elements: !719, templateParams: !13, identifier: "557cd4f8f7e06d6ab0beb7942023fe1c")
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lshift", scope: !718, file: !2, baseType: !181, size: 8, align: 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rshift", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 8)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lctrl", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 24)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "numlock", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "capslock", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 40)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "alt_gr", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 48)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rctrl2", scope: !718, file: !2, baseType: !181, size: 8, align: 8, offset: 56)
!728 = !{!729, !730, !731, !732, !733, !735}
!729 = !DILocalVariable(name: "self", arg: 1, scope: !695, file: !696, line: 12, type: !715)
!730 = !DILocalVariable(name: "keycode", arg: 2, scope: !695, file: !696, line: 13, type: !32)
!731 = !DILocalVariable(name: "modifiers", arg: 3, scope: !695, file: !696, line: 14, type: !717)
!732 = !DILocalVariable(name: "handle_ctrl", arg: 4, scope: !695, file: !696, line: 15, type: !232)
!733 = !DILocalVariable(name: "map_to_unicode", scope: !734, file: !696, line: 17, type: !181, align: 1)
!734 = distinct !DILexicalBlock(scope: !695, file: !696, line: 17, column: 9)
!735 = !DILocalVariable(name: "k", scope: !736, file: !696, line: 482, type: !32, align: 1)
!736 = distinct !DILexicalBlock(scope: !734, file: !696, line: 482, column: 13)
!737 = !DILocation(line: 12, column: 9, scope: !695)
!738 = !DILocation(line: 13, column: 9, scope: !695)
!739 = !DILocation(line: 482, column: 13, scope: !736)
!740 = !DILocation(line: 14, column: 9, scope: !695)
!741 = !DILocation(line: 15, column: 9, scope: !695)
!742 = !DILocation(line: 17, column: 30, scope: !695)
!743 = !DILocation(line: 17, column: 13, scope: !734)
!744 = !DILocation(line: 18, column: 15, scope: !734)
!745 = !DILocation(line: 18, column: 9, scope: !734)
!746 = !DILocation(line: 482, column: 18, scope: !736)
!747 = !DILocation(line: 482, column: 38, scope: !734)
!748 = !DILocation(line: 26, column: 52, scope: !734)
!749 = !DILocation(line: 26, column: 32, scope: !734)
!750 = !DILocation(line: 26, column: 63, scope: !734)
!751 = !DILocation(line: 20, column: 20, scope: !734)
!752 = !DILocation(line: 28, column: 20, scope: !734)
!753 = !DILocation(line: 35, column: 20, scope: !734)
!754 = !DILocation(line: 42, column: 20, scope: !734)
!755 = !DILocation(line: 49, column: 20, scope: !734)
!756 = !DILocation(line: 56, column: 20, scope: !734)
!757 = !DILocation(line: 63, column: 20, scope: !734)
!758 = !DILocation(line: 70, column: 20, scope: !734)
!759 = !DILocation(line: 77, column: 20, scope: !734)
!760 = !DILocation(line: 84, column: 20, scope: !734)
!761 = !DILocation(line: 91, column: 20, scope: !734)
!762 = !DILocation(line: 98, column: 20, scope: !734)
!763 = !DILocation(line: 105, column: 20, scope: !734)
!764 = !DILocation(line: 111, column: 55, scope: !734)
!765 = !DILocation(line: 111, column: 35, scope: !734)
!766 = !DILocation(line: 111, column: 66, scope: !734)
!767 = !DILocation(line: 406, column: 38, scope: !734)
!768 = !DILocation(line: 407, column: 40, scope: !734)
!769 = !DILocation(line: 408, column: 40, scope: !734)
!770 = !DILocation(line: 112, column: 49, scope: !734)
!771 = !DILocation(line: 112, column: 29, scope: !734)
!772 = !DILocation(line: 112, column: 60, scope: !734)
!773 = !DILocation(line: 114, column: 20, scope: !734)
!774 = !DILocation(line: 121, column: 20, scope: !734)
!775 = !DILocation(line: 128, column: 20, scope: !734)
!776 = !DILocation(line: 135, column: 20, scope: !734)
!777 = !DILocation(line: 144, column: 20, scope: !734)
!778 = !DILocation(line: 153, column: 20, scope: !734)
!779 = !DILocation(line: 162, column: 20, scope: !734)
!780 = !DILocation(line: 171, column: 20, scope: !734)
!781 = !DILocation(line: 180, column: 20, scope: !734)
!782 = !DILocation(line: 189, column: 20, scope: !734)
!783 = !DILocation(line: 198, column: 20, scope: !734)
!784 = !DILocation(line: 205, column: 20, scope: !734)
!785 = !DILocation(line: 212, column: 20, scope: !734)
!786 = !DILocation(line: 405, column: 52, scope: !734)
!787 = !DILocation(line: 405, column: 32, scope: !734)
!788 = !DILocation(line: 405, column: 62, scope: !734)
!789 = !DILocation(line: 410, column: 20, scope: !734)
!790 = !DILocation(line: 417, column: 20, scope: !734)
!791 = !DILocation(line: 424, column: 20, scope: !734)
!792 = !DILocation(line: 430, column: 35, scope: !734)
!793 = !DILocation(line: 219, column: 20, scope: !734)
!794 = !DILocation(line: 228, column: 20, scope: !734)
!795 = !DILocation(line: 237, column: 20, scope: !734)
!796 = !DILocation(line: 246, column: 20, scope: !734)
!797 = !DILocation(line: 255, column: 20, scope: !734)
!798 = !DILocation(line: 264, column: 20, scope: !734)
!799 = !DILocation(line: 273, column: 20, scope: !734)
!800 = !DILocation(line: 282, column: 20, scope: !734)
!801 = !DILocation(line: 291, column: 20, scope: !734)
!802 = !DILocation(line: 300, column: 20, scope: !734)
!803 = !DILocation(line: 309, column: 20, scope: !734)
!804 = !DILocation(line: 315, column: 52, scope: !734)
!805 = !DILocation(line: 315, column: 32, scope: !734)
!806 = !DILocation(line: 315, column: 61, scope: !734)
!807 = !DILocation(line: 432, column: 20, scope: !734)
!808 = !DILocation(line: 438, column: 33, scope: !734)
!809 = !DILocation(line: 440, column: 20, scope: !734)
!810 = !DILocation(line: 317, column: 20, scope: !734)
!811 = !DILocation(line: 324, column: 20, scope: !734)
!812 = !DILocation(line: 333, column: 20, scope: !734)
!813 = !DILocation(line: 342, column: 20, scope: !734)
!814 = !DILocation(line: 351, column: 20, scope: !734)
!815 = !DILocation(line: 360, column: 20, scope: !734)
!816 = !DILocation(line: 369, column: 20, scope: !734)
!817 = !DILocation(line: 378, column: 20, scope: !734)
!818 = !DILocation(line: 387, column: 20, scope: !734)
!819 = !DILocation(line: 396, column: 20, scope: !734)
!820 = !DILocation(line: 447, column: 20, scope: !734)
!821 = !DILocation(line: 454, column: 20, scope: !734)
!822 = !DILocation(line: 461, column: 20, scope: !734)
!823 = !DILocation(line: 481, column: 57, scope: !734)
!824 = !DILocation(line: 481, column: 37, scope: !734)
!825 = !DILocation(line: 481, column: 66, scope: !734)
!826 = !DILocation(line: 404, column: 34, scope: !734)
!827 = !DILocation(line: 468, column: 20, scope: !734)
!828 = !DILocation(line: 475, column: 20, scope: !734)
!829 = !DILocation(line: 484, column: 6, scope: !695)
!830 = !DILocation(line: 478, column: 41, scope: !734)
!831 = !DILocation(line: 478, column: 21, scope: !734)
!832 = !DILocation(line: 475, column: 17, scope: !734)
!833 = !DILocation(line: 476, column: 21, scope: !734)
!834 = !DILocation(line: 471, column: 40, scope: !734)
!835 = !DILocation(line: 471, column: 21, scope: !734)
!836 = !DILocation(line: 468, column: 17, scope: !734)
!837 = !DILocation(line: 469, column: 21, scope: !734)
!838 = !DILocation(line: 464, column: 40, scope: !734)
!839 = !DILocation(line: 464, column: 21, scope: !734)
!840 = !DILocation(line: 461, column: 17, scope: !734)
!841 = !DILocation(line: 462, column: 21, scope: !734)
!842 = !DILocation(line: 457, column: 40, scope: !734)
!843 = !DILocation(line: 457, column: 21, scope: !734)
!844 = !DILocation(line: 454, column: 17, scope: !734)
!845 = !DILocation(line: 455, column: 21, scope: !734)
!846 = !DILocation(line: 450, column: 40, scope: !734)
!847 = !DILocation(line: 450, column: 21, scope: !734)
!848 = !DILocation(line: 447, column: 17, scope: !734)
!849 = !DILocation(line: 448, column: 21, scope: !734)
!850 = !DILocation(line: 396, column: 38, scope: !734)
!851 = !DILocation(line: 398, column: 27, scope: !734)
!852 = !DILocation(line: 397, column: 21, scope: !734)
!853 = !DILocation(line: 396, column: 17, scope: !734)
!854 = !DILocation(line: 401, column: 21, scope: !734)
!855 = !DILocation(line: 398, column: 24, scope: !734)
!856 = !DILocation(line: 399, column: 21, scope: !734)
!857 = !DILocation(line: 387, column: 38, scope: !734)
!858 = !DILocation(line: 389, column: 27, scope: !734)
!859 = !DILocation(line: 388, column: 21, scope: !734)
!860 = !DILocation(line: 387, column: 17, scope: !734)
!861 = !DILocation(line: 392, column: 21, scope: !734)
!862 = !DILocation(line: 389, column: 24, scope: !734)
!863 = !DILocation(line: 390, column: 21, scope: !734)
!864 = !DILocation(line: 378, column: 38, scope: !734)
!865 = !DILocation(line: 380, column: 27, scope: !734)
!866 = !DILocation(line: 379, column: 21, scope: !734)
!867 = !DILocation(line: 378, column: 17, scope: !734)
!868 = !DILocation(line: 383, column: 21, scope: !734)
!869 = !DILocation(line: 380, column: 24, scope: !734)
!870 = !DILocation(line: 381, column: 21, scope: !734)
!871 = !DILocation(line: 369, column: 38, scope: !734)
!872 = !DILocation(line: 371, column: 27, scope: !734)
!873 = !DILocation(line: 370, column: 21, scope: !734)
!874 = !DILocation(line: 369, column: 17, scope: !734)
!875 = !DILocation(line: 374, column: 21, scope: !734)
!876 = !DILocation(line: 371, column: 24, scope: !734)
!877 = !DILocation(line: 372, column: 21, scope: !734)
!878 = !DILocation(line: 360, column: 38, scope: !734)
!879 = !DILocation(line: 362, column: 27, scope: !734)
!880 = !DILocation(line: 361, column: 21, scope: !734)
!881 = !DILocation(line: 360, column: 17, scope: !734)
!882 = !DILocation(line: 365, column: 21, scope: !734)
!883 = !DILocation(line: 362, column: 24, scope: !734)
!884 = !DILocation(line: 363, column: 21, scope: !734)
!885 = !DILocation(line: 351, column: 38, scope: !734)
!886 = !DILocation(line: 353, column: 27, scope: !734)
!887 = !DILocation(line: 352, column: 21, scope: !734)
!888 = !DILocation(line: 351, column: 17, scope: !734)
!889 = !DILocation(line: 356, column: 21, scope: !734)
!890 = !DILocation(line: 353, column: 24, scope: !734)
!891 = !DILocation(line: 354, column: 21, scope: !734)
!892 = !DILocation(line: 342, column: 38, scope: !734)
!893 = !DILocation(line: 344, column: 27, scope: !734)
!894 = !DILocation(line: 343, column: 21, scope: !734)
!895 = !DILocation(line: 342, column: 17, scope: !734)
!896 = !DILocation(line: 347, column: 21, scope: !734)
!897 = !DILocation(line: 344, column: 24, scope: !734)
!898 = !DILocation(line: 345, column: 21, scope: !734)
!899 = !DILocation(line: 333, column: 38, scope: !734)
!900 = !DILocation(line: 335, column: 27, scope: !734)
!901 = !DILocation(line: 334, column: 21, scope: !734)
!902 = !DILocation(line: 333, column: 17, scope: !734)
!903 = !DILocation(line: 338, column: 21, scope: !734)
!904 = !DILocation(line: 335, column: 24, scope: !734)
!905 = !DILocation(line: 336, column: 21, scope: !734)
!906 = !DILocation(line: 324, column: 38, scope: !734)
!907 = !DILocation(line: 326, column: 27, scope: !734)
!908 = !DILocation(line: 325, column: 21, scope: !734)
!909 = !DILocation(line: 324, column: 17, scope: !734)
!910 = !DILocation(line: 329, column: 21, scope: !734)
!911 = !DILocation(line: 326, column: 24, scope: !734)
!912 = !DILocation(line: 327, column: 21, scope: !734)
!913 = !DILocation(line: 320, column: 21, scope: !734)
!914 = !DILocation(line: 317, column: 17, scope: !734)
!915 = !DILocation(line: 318, column: 21, scope: !734)
!916 = !DILocation(line: 443, column: 40, scope: !734)
!917 = !DILocation(line: 443, column: 21, scope: !734)
!918 = !DILocation(line: 440, column: 17, scope: !734)
!919 = !DILocation(line: 441, column: 21, scope: !734)
!920 = !DILocation(line: 435, column: 40, scope: !734)
!921 = !DILocation(line: 435, column: 21, scope: !734)
!922 = !DILocation(line: 432, column: 17, scope: !734)
!923 = !DILocation(line: 433, column: 21, scope: !734)
!924 = !DILocation(line: 312, column: 21, scope: !734)
!925 = !DILocation(line: 309, column: 17, scope: !734)
!926 = !DILocation(line: 310, column: 21, scope: !734)
!927 = !DILocation(line: 300, column: 38, scope: !734)
!928 = !DILocation(line: 302, column: 27, scope: !734)
!929 = !DILocation(line: 301, column: 21, scope: !734)
!930 = !DILocation(line: 300, column: 17, scope: !734)
!931 = !DILocation(line: 305, column: 21, scope: !734)
!932 = !DILocation(line: 302, column: 24, scope: !734)
!933 = !DILocation(line: 303, column: 21, scope: !734)
!934 = !DILocation(line: 291, column: 38, scope: !734)
!935 = !DILocation(line: 293, column: 27, scope: !734)
!936 = !DILocation(line: 292, column: 21, scope: !734)
!937 = !DILocation(line: 291, column: 17, scope: !734)
!938 = !DILocation(line: 296, column: 21, scope: !734)
!939 = !DILocation(line: 293, column: 24, scope: !734)
!940 = !DILocation(line: 294, column: 21, scope: !734)
!941 = !DILocation(line: 282, column: 38, scope: !734)
!942 = !DILocation(line: 284, column: 27, scope: !734)
!943 = !DILocation(line: 283, column: 21, scope: !734)
!944 = !DILocation(line: 282, column: 17, scope: !734)
!945 = !DILocation(line: 287, column: 21, scope: !734)
!946 = !DILocation(line: 284, column: 24, scope: !734)
!947 = !DILocation(line: 285, column: 21, scope: !734)
!948 = !DILocation(line: 273, column: 38, scope: !734)
!949 = !DILocation(line: 275, column: 27, scope: !734)
!950 = !DILocation(line: 274, column: 21, scope: !734)
!951 = !DILocation(line: 273, column: 17, scope: !734)
!952 = !DILocation(line: 278, column: 21, scope: !734)
!953 = !DILocation(line: 275, column: 24, scope: !734)
!954 = !DILocation(line: 276, column: 21, scope: !734)
!955 = !DILocation(line: 264, column: 38, scope: !734)
!956 = !DILocation(line: 266, column: 27, scope: !734)
!957 = !DILocation(line: 265, column: 21, scope: !734)
!958 = !DILocation(line: 264, column: 17, scope: !734)
!959 = !DILocation(line: 269, column: 21, scope: !734)
!960 = !DILocation(line: 266, column: 24, scope: !734)
!961 = !DILocation(line: 267, column: 21, scope: !734)
!962 = !DILocation(line: 255, column: 38, scope: !734)
!963 = !DILocation(line: 257, column: 27, scope: !734)
!964 = !DILocation(line: 256, column: 21, scope: !734)
!965 = !DILocation(line: 255, column: 17, scope: !734)
!966 = !DILocation(line: 260, column: 21, scope: !734)
!967 = !DILocation(line: 257, column: 24, scope: !734)
!968 = !DILocation(line: 258, column: 21, scope: !734)
!969 = !DILocation(line: 246, column: 38, scope: !734)
!970 = !DILocation(line: 248, column: 27, scope: !734)
!971 = !DILocation(line: 247, column: 21, scope: !734)
!972 = !DILocation(line: 246, column: 17, scope: !734)
!973 = !DILocation(line: 251, column: 21, scope: !734)
!974 = !DILocation(line: 248, column: 24, scope: !734)
!975 = !DILocation(line: 249, column: 21, scope: !734)
!976 = !DILocation(line: 237, column: 38, scope: !734)
!977 = !DILocation(line: 239, column: 27, scope: !734)
!978 = !DILocation(line: 238, column: 21, scope: !734)
!979 = !DILocation(line: 237, column: 17, scope: !734)
!980 = !DILocation(line: 242, column: 21, scope: !734)
!981 = !DILocation(line: 239, column: 24, scope: !734)
!982 = !DILocation(line: 240, column: 21, scope: !734)
!983 = !DILocation(line: 228, column: 38, scope: !734)
!984 = !DILocation(line: 230, column: 27, scope: !734)
!985 = !DILocation(line: 229, column: 21, scope: !734)
!986 = !DILocation(line: 228, column: 17, scope: !734)
!987 = !DILocation(line: 233, column: 21, scope: !734)
!988 = !DILocation(line: 230, column: 24, scope: !734)
!989 = !DILocation(line: 231, column: 21, scope: !734)
!990 = !DILocation(line: 219, column: 38, scope: !734)
!991 = !DILocation(line: 221, column: 27, scope: !734)
!992 = !DILocation(line: 220, column: 21, scope: !734)
!993 = !DILocation(line: 219, column: 17, scope: !734)
!994 = !DILocation(line: 224, column: 21, scope: !734)
!995 = !DILocation(line: 221, column: 24, scope: !734)
!996 = !DILocation(line: 222, column: 21, scope: !734)
!997 = !DILocation(line: 427, column: 40, scope: !734)
!998 = !DILocation(line: 427, column: 21, scope: !734)
!999 = !DILocation(line: 424, column: 17, scope: !734)
!1000 = !DILocation(line: 425, column: 21, scope: !734)
!1001 = !DILocation(line: 420, column: 40, scope: !734)
!1002 = !DILocation(line: 420, column: 21, scope: !734)
!1003 = !DILocation(line: 417, column: 17, scope: !734)
!1004 = !DILocation(line: 418, column: 21, scope: !734)
!1005 = !DILocation(line: 413, column: 40, scope: !734)
!1006 = !DILocation(line: 413, column: 21, scope: !734)
!1007 = !DILocation(line: 410, column: 17, scope: !734)
!1008 = !DILocation(line: 411, column: 21, scope: !734)
!1009 = !DILocation(line: 215, column: 21, scope: !734)
!1010 = !DILocation(line: 212, column: 17, scope: !734)
!1011 = !DILocation(line: 213, column: 21, scope: !734)
!1012 = !DILocation(line: 208, column: 21, scope: !734)
!1013 = !DILocation(line: 205, column: 17, scope: !734)
!1014 = !DILocation(line: 206, column: 21, scope: !734)
!1015 = !DILocation(line: 201, column: 21, scope: !734)
!1016 = !DILocation(line: 198, column: 17, scope: !734)
!1017 = !DILocation(line: 199, column: 21, scope: !734)
!1018 = !DILocation(line: 189, column: 38, scope: !734)
!1019 = !DILocation(line: 191, column: 27, scope: !734)
!1020 = !DILocation(line: 190, column: 21, scope: !734)
!1021 = !DILocation(line: 189, column: 17, scope: !734)
!1022 = !DILocation(line: 194, column: 21, scope: !734)
!1023 = !DILocation(line: 191, column: 24, scope: !734)
!1024 = !DILocation(line: 192, column: 21, scope: !734)
!1025 = !DILocation(line: 180, column: 38, scope: !734)
!1026 = !DILocation(line: 182, column: 27, scope: !734)
!1027 = !DILocation(line: 181, column: 21, scope: !734)
!1028 = !DILocation(line: 180, column: 17, scope: !734)
!1029 = !DILocation(line: 185, column: 21, scope: !734)
!1030 = !DILocation(line: 182, column: 24, scope: !734)
!1031 = !DILocation(line: 183, column: 21, scope: !734)
!1032 = !DILocation(line: 171, column: 38, scope: !734)
!1033 = !DILocation(line: 173, column: 27, scope: !734)
!1034 = !DILocation(line: 172, column: 21, scope: !734)
!1035 = !DILocation(line: 171, column: 17, scope: !734)
!1036 = !DILocation(line: 176, column: 21, scope: !734)
!1037 = !DILocation(line: 173, column: 24, scope: !734)
!1038 = !DILocation(line: 174, column: 21, scope: !734)
!1039 = !DILocation(line: 162, column: 38, scope: !734)
!1040 = !DILocation(line: 164, column: 27, scope: !734)
!1041 = !DILocation(line: 163, column: 21, scope: !734)
!1042 = !DILocation(line: 162, column: 17, scope: !734)
!1043 = !DILocation(line: 167, column: 21, scope: !734)
!1044 = !DILocation(line: 164, column: 24, scope: !734)
!1045 = !DILocation(line: 165, column: 21, scope: !734)
!1046 = !DILocation(line: 153, column: 38, scope: !734)
!1047 = !DILocation(line: 155, column: 27, scope: !734)
!1048 = !DILocation(line: 154, column: 21, scope: !734)
!1049 = !DILocation(line: 153, column: 17, scope: !734)
!1050 = !DILocation(line: 158, column: 21, scope: !734)
!1051 = !DILocation(line: 155, column: 24, scope: !734)
!1052 = !DILocation(line: 156, column: 21, scope: !734)
!1053 = !DILocation(line: 144, column: 38, scope: !734)
!1054 = !DILocation(line: 146, column: 27, scope: !734)
!1055 = !DILocation(line: 145, column: 21, scope: !734)
!1056 = !DILocation(line: 144, column: 17, scope: !734)
!1057 = !DILocation(line: 149, column: 21, scope: !734)
!1058 = !DILocation(line: 146, column: 24, scope: !734)
!1059 = !DILocation(line: 147, column: 21, scope: !734)
!1060 = !DILocation(line: 135, column: 38, scope: !734)
!1061 = !DILocation(line: 137, column: 27, scope: !734)
!1062 = !DILocation(line: 136, column: 21, scope: !734)
!1063 = !DILocation(line: 135, column: 17, scope: !734)
!1064 = !DILocation(line: 140, column: 21, scope: !734)
!1065 = !DILocation(line: 137, column: 24, scope: !734)
!1066 = !DILocation(line: 138, column: 21, scope: !734)
!1067 = !DILocation(line: 131, column: 21, scope: !734)
!1068 = !DILocation(line: 128, column: 17, scope: !734)
!1069 = !DILocation(line: 129, column: 21, scope: !734)
!1070 = !DILocation(line: 124, column: 21, scope: !734)
!1071 = !DILocation(line: 121, column: 17, scope: !734)
!1072 = !DILocation(line: 122, column: 21, scope: !734)
!1073 = !DILocation(line: 117, column: 21, scope: !734)
!1074 = !DILocation(line: 114, column: 17, scope: !734)
!1075 = !DILocation(line: 115, column: 21, scope: !734)
!1076 = !DILocation(line: 108, column: 21, scope: !734)
!1077 = !DILocation(line: 105, column: 17, scope: !734)
!1078 = !DILocation(line: 106, column: 21, scope: !734)
!1079 = !DILocation(line: 101, column: 21, scope: !734)
!1080 = !DILocation(line: 98, column: 17, scope: !734)
!1081 = !DILocation(line: 99, column: 21, scope: !734)
!1082 = !DILocation(line: 94, column: 21, scope: !734)
!1083 = !DILocation(line: 91, column: 17, scope: !734)
!1084 = !DILocation(line: 92, column: 21, scope: !734)
!1085 = !DILocation(line: 87, column: 21, scope: !734)
!1086 = !DILocation(line: 84, column: 17, scope: !734)
!1087 = !DILocation(line: 85, column: 21, scope: !734)
!1088 = !DILocation(line: 80, column: 21, scope: !734)
!1089 = !DILocation(line: 77, column: 17, scope: !734)
!1090 = !DILocation(line: 78, column: 21, scope: !734)
!1091 = !DILocation(line: 73, column: 21, scope: !734)
!1092 = !DILocation(line: 70, column: 17, scope: !734)
!1093 = !DILocation(line: 71, column: 21, scope: !734)
!1094 = !DILocation(line: 66, column: 21, scope: !734)
!1095 = !DILocation(line: 63, column: 17, scope: !734)
!1096 = !DILocation(line: 64, column: 21, scope: !734)
!1097 = !DILocation(line: 59, column: 21, scope: !734)
!1098 = !DILocation(line: 56, column: 17, scope: !734)
!1099 = !DILocation(line: 57, column: 21, scope: !734)
!1100 = !DILocation(line: 52, column: 21, scope: !734)
!1101 = !DILocation(line: 49, column: 17, scope: !734)
!1102 = !DILocation(line: 50, column: 21, scope: !734)
!1103 = !DILocation(line: 45, column: 21, scope: !734)
!1104 = !DILocation(line: 42, column: 17, scope: !734)
!1105 = !DILocation(line: 43, column: 21, scope: !734)
!1106 = !DILocation(line: 38, column: 21, scope: !734)
!1107 = !DILocation(line: 35, column: 17, scope: !734)
!1108 = !DILocation(line: 36, column: 21, scope: !734)
!1109 = !DILocation(line: 31, column: 21, scope: !734)
!1110 = !DILocation(line: 28, column: 17, scope: !734)
!1111 = !DILocation(line: 29, column: 21, scope: !734)
!1112 = !DILocation(line: 23, column: 21, scope: !734)
!1113 = !DILocation(line: 20, column: 17, scope: !734)
!1114 = !DILocation(line: 21, column: 21, scope: !734)
!1115 = distinct !DISubprogram(name: "map_keycode", linkageName: "_ZN93_$LT$pc_keyboard..layouts..dvorak104..Dvorak104Key$u20$as$u20$pc_keyboard..KeyboardLayout$GT$11map_keycode17hc54c0cfc22326ee8E", scope: !1117, file: !1116, line: 11, type: !1119, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !213, templateParams: !13, retainedNodes: !1123)
!1116 = !DIFile(filename: "src/layouts/dvorak104.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/pc-keyboard-0.7.0", checksumkind: CSK_MD5, checksum: "7841043f37dd050b052961abb05fd45b")
!1117 = !DINamespace(name: "{impl#0}", scope: !1118)
!1118 = !DINamespace(name: "dvorak104", scope: !699)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!702, !1121, !32, !717, !232}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&pc_keyboard::layouts::dvorak104::Dvorak104Key", baseType: !1122, size: 64, align: 64, dwarfAddressSpace: 0)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dvorak104Key", scope: !1118, file: !2, align: 8, elements: !13, identifier: "1328751590d0932648b00fad6168e42f")
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1130, !1132}
!1124 = !DILocalVariable(name: "self", arg: 1, scope: !1115, file: !1116, line: 12, type: !1121)
!1125 = !DILocalVariable(name: "keycode", arg: 2, scope: !1115, file: !1116, line: 13, type: !32)
!1126 = !DILocalVariable(name: "modifiers", arg: 3, scope: !1115, file: !1116, line: 14, type: !717)
!1127 = !DILocalVariable(name: "handle_ctrl", arg: 4, scope: !1115, file: !1116, line: 15, type: !232)
!1128 = !DILocalVariable(name: "map_to_unicode", scope: !1129, file: !1116, line: 17, type: !181, align: 1)
!1129 = distinct !DILexicalBlock(scope: !1115, file: !1116, line: 17, column: 9)
!1130 = !DILocalVariable(name: "e", scope: !1131, file: !1116, line: 298, type: !32, align: 1)
!1131 = distinct !DILexicalBlock(scope: !1129, file: !1116, line: 298, column: 13)
!1132 = !DILocalVariable(name: "us", scope: !1133, file: !1116, line: 299, type: !1134, align: 1)
!1133 = distinct !DILexicalBlock(scope: !1131, file: !1116, line: 299, column: 17)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Us104Key", scope: !1135, file: !2, align: 8, elements: !13, identifier: "fb1d740f4670a8424680d855011a8134")
!1135 = !DINamespace(name: "us104", scope: !699)
!1136 = !DILocation(line: 299, column: 21, scope: !1133)
!1137 = !DILocation(line: 12, column: 9, scope: !1115)
!1138 = !DILocation(line: 13, column: 9, scope: !1115)
!1139 = !DILocation(line: 298, column: 13, scope: !1131)
!1140 = !DILocation(line: 14, column: 9, scope: !1115)
!1141 = !DILocation(line: 15, column: 9, scope: !1115)
!1142 = !DILocation(line: 17, column: 30, scope: !1115)
!1143 = !DILocation(line: 17, column: 13, scope: !1129)
!1144 = !DILocation(line: 18, column: 15, scope: !1129)
!1145 = !DILocation(line: 18, column: 9, scope: !1129)
!1146 = !DILocation(line: 300, column: 17, scope: !1133)
!1147 = !DILocation(line: 20, column: 20, scope: !1129)
!1148 = !DILocation(line: 27, column: 20, scope: !1129)
!1149 = !DILocation(line: 34, column: 20, scope: !1129)
!1150 = !DILocation(line: 41, column: 20, scope: !1129)
!1151 = !DILocation(line: 48, column: 20, scope: !1129)
!1152 = !DILocation(line: 55, column: 20, scope: !1129)
!1153 = !DILocation(line: 64, column: 20, scope: !1129)
!1154 = !DILocation(line: 73, column: 20, scope: !1129)
!1155 = !DILocation(line: 82, column: 20, scope: !1129)
!1156 = !DILocation(line: 91, column: 20, scope: !1129)
!1157 = !DILocation(line: 100, column: 20, scope: !1129)
!1158 = !DILocation(line: 109, column: 20, scope: !1129)
!1159 = !DILocation(line: 118, column: 20, scope: !1129)
!1160 = !DILocation(line: 125, column: 20, scope: !1129)
!1161 = !DILocation(line: 132, column: 20, scope: !1129)
!1162 = !DILocation(line: 141, column: 20, scope: !1129)
!1163 = !DILocation(line: 150, column: 20, scope: !1129)
!1164 = !DILocation(line: 159, column: 20, scope: !1129)
!1165 = !DILocation(line: 168, column: 20, scope: !1129)
!1166 = !DILocation(line: 177, column: 20, scope: !1129)
!1167 = !DILocation(line: 186, column: 20, scope: !1129)
!1168 = !DILocation(line: 195, column: 20, scope: !1129)
!1169 = !DILocation(line: 204, column: 20, scope: !1129)
!1170 = !DILocation(line: 213, column: 20, scope: !1129)
!1171 = !DILocation(line: 220, column: 20, scope: !1129)
!1172 = !DILocation(line: 227, column: 20, scope: !1129)
!1173 = !DILocation(line: 236, column: 20, scope: !1129)
!1174 = !DILocation(line: 245, column: 20, scope: !1129)
!1175 = !DILocation(line: 254, column: 20, scope: !1129)
!1176 = !DILocation(line: 263, column: 20, scope: !1129)
!1177 = !DILocation(line: 272, column: 20, scope: !1129)
!1178 = !DILocation(line: 281, column: 20, scope: !1129)
!1179 = !DILocation(line: 290, column: 20, scope: !1129)
!1180 = !DILocation(line: 303, column: 6, scope: !1115)
!1181 = !DILocation(line: 290, column: 38, scope: !1129)
!1182 = !DILocation(line: 292, column: 27, scope: !1129)
!1183 = !DILocation(line: 291, column: 21, scope: !1129)
!1184 = !DILocation(line: 290, column: 17, scope: !1129)
!1185 = !DILocation(line: 295, column: 21, scope: !1129)
!1186 = !DILocation(line: 292, column: 24, scope: !1129)
!1187 = !DILocation(line: 293, column: 21, scope: !1129)
!1188 = !DILocation(line: 281, column: 38, scope: !1129)
!1189 = !DILocation(line: 283, column: 27, scope: !1129)
!1190 = !DILocation(line: 282, column: 21, scope: !1129)
!1191 = !DILocation(line: 281, column: 17, scope: !1129)
!1192 = !DILocation(line: 286, column: 21, scope: !1129)
!1193 = !DILocation(line: 283, column: 24, scope: !1129)
!1194 = !DILocation(line: 284, column: 21, scope: !1129)
!1195 = !DILocation(line: 272, column: 38, scope: !1129)
!1196 = !DILocation(line: 274, column: 27, scope: !1129)
!1197 = !DILocation(line: 273, column: 21, scope: !1129)
!1198 = !DILocation(line: 272, column: 17, scope: !1129)
!1199 = !DILocation(line: 277, column: 21, scope: !1129)
!1200 = !DILocation(line: 274, column: 24, scope: !1129)
!1201 = !DILocation(line: 275, column: 21, scope: !1129)
!1202 = !DILocation(line: 263, column: 38, scope: !1129)
!1203 = !DILocation(line: 265, column: 27, scope: !1129)
!1204 = !DILocation(line: 264, column: 21, scope: !1129)
!1205 = !DILocation(line: 263, column: 17, scope: !1129)
!1206 = !DILocation(line: 268, column: 21, scope: !1129)
!1207 = !DILocation(line: 265, column: 24, scope: !1129)
!1208 = !DILocation(line: 266, column: 21, scope: !1129)
!1209 = !DILocation(line: 254, column: 38, scope: !1129)
!1210 = !DILocation(line: 256, column: 27, scope: !1129)
!1211 = !DILocation(line: 255, column: 21, scope: !1129)
!1212 = !DILocation(line: 254, column: 17, scope: !1129)
!1213 = !DILocation(line: 259, column: 21, scope: !1129)
!1214 = !DILocation(line: 256, column: 24, scope: !1129)
!1215 = !DILocation(line: 257, column: 21, scope: !1129)
!1216 = !DILocation(line: 245, column: 38, scope: !1129)
!1217 = !DILocation(line: 247, column: 27, scope: !1129)
!1218 = !DILocation(line: 246, column: 21, scope: !1129)
!1219 = !DILocation(line: 245, column: 17, scope: !1129)
!1220 = !DILocation(line: 250, column: 21, scope: !1129)
!1221 = !DILocation(line: 247, column: 24, scope: !1129)
!1222 = !DILocation(line: 248, column: 21, scope: !1129)
!1223 = !DILocation(line: 236, column: 38, scope: !1129)
!1224 = !DILocation(line: 238, column: 27, scope: !1129)
!1225 = !DILocation(line: 237, column: 21, scope: !1129)
!1226 = !DILocation(line: 236, column: 17, scope: !1129)
!1227 = !DILocation(line: 241, column: 21, scope: !1129)
!1228 = !DILocation(line: 238, column: 24, scope: !1129)
!1229 = !DILocation(line: 239, column: 21, scope: !1129)
!1230 = !DILocation(line: 227, column: 38, scope: !1129)
!1231 = !DILocation(line: 229, column: 27, scope: !1129)
!1232 = !DILocation(line: 228, column: 21, scope: !1129)
!1233 = !DILocation(line: 227, column: 17, scope: !1129)
!1234 = !DILocation(line: 232, column: 21, scope: !1129)
!1235 = !DILocation(line: 229, column: 24, scope: !1129)
!1236 = !DILocation(line: 230, column: 21, scope: !1129)
!1237 = !DILocation(line: 223, column: 21, scope: !1129)
!1238 = !DILocation(line: 220, column: 17, scope: !1129)
!1239 = !DILocation(line: 221, column: 21, scope: !1129)
!1240 = !DILocation(line: 216, column: 21, scope: !1129)
!1241 = !DILocation(line: 213, column: 17, scope: !1129)
!1242 = !DILocation(line: 214, column: 21, scope: !1129)
!1243 = !DILocation(line: 204, column: 38, scope: !1129)
!1244 = !DILocation(line: 206, column: 27, scope: !1129)
!1245 = !DILocation(line: 205, column: 21, scope: !1129)
!1246 = !DILocation(line: 204, column: 17, scope: !1129)
!1247 = !DILocation(line: 209, column: 21, scope: !1129)
!1248 = !DILocation(line: 206, column: 24, scope: !1129)
!1249 = !DILocation(line: 207, column: 21, scope: !1129)
!1250 = !DILocation(line: 195, column: 38, scope: !1129)
!1251 = !DILocation(line: 197, column: 27, scope: !1129)
!1252 = !DILocation(line: 196, column: 21, scope: !1129)
