; ModuleID = 'alloc.86517141-cgu.0'
source_filename = "alloc.86517141-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"[closure@<usize as core::iter::traits::accum::Sum>::sum<core::iter::adapters::map::Map<core::slice::iter::Iter<'_, &str>, [closure@core::fmt::Arguments<'_>::estimated_capacity::{closure#0}]>>::{closure#0}]" = type {}
%"core::iter::adapters::skip_while::SkipWhile<core::iter::adapters::rev::Rev<core::str::iter::Chars<'_>>, [closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39]>" = type { %"[closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39]", { ptr, ptr }, i8, [7 x i8] }
%"[closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39]" = type {}
%"core::iter::adapters::skip_while::SkipWhile<core::str::iter::Chars<'_>, [closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39]>" = type { %"[closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39].0", { ptr, ptr }, i8, [7 x i8] }
%"[closure@/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/str.rs:414:35: 414:39].0" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !45, identifier: "8a47c881cc07076782db8e82e941cfc4")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !16, file: !2, size: 192, align: 64, elements: !18, templateParams: !45, identifier: "2c5b583fbf443cbf527c45e3182975")
!16 = !DINamespace(name: "string", scope: !17)
!17 = !DINamespace(name: "alloc", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !15, file: !2, baseType: !20, size: 192, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !21, file: !2, size: 192, align: 64, elements: !22, templateParams: !50, identifier: "5506e2e8f8d7702126b223aaa73bf279")
!21 = !DINamespace(name: "vec", scope: !17)
!22 = !{!23, !52}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !20, file: !2, baseType: !24, size: 128, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !25, file: !2, size: 128, align: 64, elements: !26, templateParams: !50, identifier: "b6a21d468dd801231c5e624582a77c35")
!25 = !DINamespace(name: "raw_vec", scope: !17)
!26 = !{!27, !46, !47}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, file: !2, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !29, file: !2, size: 64, align: 64, elements: !32, templateParams: !40, identifier: "a50c6ade683ba6a919ab0e412c83359c")
!29 = !DINamespace(name: "unique", scope: !30)
!30 = !DINamespace(name: "ptr", scope: !31)
!31 = !DINamespace(name: "core", scope: null)
!32 = !{!33, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !28, file: !2, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !35, file: !2, size: 64, align: 64, elements: !36, templateParams: !40, identifier: "1dbb83832a28bb2882fc75217f980e7b")
!35 = !DINamespace(name: "non_null", scope: !30)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !34, file: !2, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !{!41}
!41 = !DITemplateTypeParameter(name: "T", type: !39)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !28, file: !2, baseType: !43, align: 8)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !40, identifier: "c8e69dbe5f0987887aa4eced1a928fda")
!44 = !DINamespace(name: "marker", scope: !31)
!45 = !{}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !24, file: !2, baseType: !9, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !24, file: !2, baseType: !48, align: 8)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !49, file: !2, align: 8, elements: !45, identifier: "12a7b3b9b13848a3919c7829caa50987")
!49 = !DINamespace(name: "alloc", scope: !17)
!50 = !{!41, !51}
!51 = !DITemplateTypeParameter(name: "A", type: !48)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !20, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !56, vtableHolder: !61, templateParams: !45, identifier: "6c903baf65742b0d5728e89cc10633d7")
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !55, file: !2, baseType: !6, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !55, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !55, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !62, file: !2, align: 8, elements: !45, identifier: "c2c8f2f945c37359aa57422093183824")
!62 = !DINamespace(name: "fmt", scope: !31)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !66, vtableHolder: !71, templateParams: !45, identifier: "f999e2471f87aae4d72bb836efdf2e5")
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !65, file: !2, baseType: !6, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !65, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !65, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !65, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !72, file: !2, align: 8, elements: !45, identifier: "1fc73594517d6fd26413b8694e96eb28")
!72 = !DINamespace(name: "layout", scope: !73)
!73 = !DINamespace(name: "alloc", scope: !31)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !77, vtableHolder: !82, templateParams: !45, identifier: "cb6125574af392bad7a37a98a6b2eb00")
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !76, file: !2, baseType: !6, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !76, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !84, file: !2, size: 16, align: 8, elements: !85, templateParams: !45, identifier: "229491c31d962cde8cdc335a4618cda5")
!84 = !DINamespace(name: "option", scope: !31)
!85 = !{!86}
!86 = !DICompositeType(tag: DW_TAG_variant_part, scope: !83, file: !2, size: 16, align: 8, elements: !87, templateParams: !45, identifier: "af3768464e0cb35cd41a5abbdb5b64a", discriminator: !94)
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !86, file: !2, baseType: !89, size: 16, align: 8, extraData: i64 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !83, file: !2, size: 16, align: 8, elements: !45, templateParams: !40, identifier: "4703aea512139fcbcd228c08e9ea8714")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !86, file: !2, baseType: !91, size: 16, align: 8, extraData: i64 1)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !83, file: !2, size: 16, align: 8, elements: !92, templateParams: !40, identifier: "b301832da17747c0977af8baefb464c7")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !91, file: !2, baseType: !39, size: 8, align: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !83, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "<alloc::boxed::{impl#66}::from::StringError as core::error::Error>::{vtable}", scope: null, file: !2, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::{impl#66}::from::StringError as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !98, vtableHolder: !110, templateParams: !45, identifier: "bbacb2012a0a5573a4ff08f20409dbe6")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !97, file: !2, baseType: !6, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !97, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !97, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !111, file: !2, size: 192, align: 64, elements: !114, templateParams: !45, identifier: "54af44e982db291377fb5822b5461a49")
!111 = !DINamespace(name: "from", scope: !112)
!112 = !DINamespace(name: "{impl#66}", scope: !113)
!113 = !DINamespace(name: "boxed", scope: !17)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !110, file: !2, baseType: !15, size: 192, align: 64)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::error::Error>::{vtable}", scope: null, file: !2, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !119, vtableHolder: !131, templateParams: !45, identifier: "c31185a3d18684d8a63e761bafbeec24")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !118, file: !2, baseType: !6, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !118, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !132, file: !2, size: 128, align: 64, elements: !134, templateParams: !45, identifier: "c0815af1087de138b17fc1e2204a5e53")
!132 = !DINamespace(name: "error", scope: !133)
!133 = !DINamespace(name: "str", scope: !31)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !131, file: !2, baseType: !9, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !131, file: !2, baseType: !83, size: 16, align: 8, offset: 64)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !140, vtableHolder: !145, templateParams: !45, identifier: "6ce4ed7cbfd7be81fb22c9d50efcbdfd")
!140 = !{!141, !142, !143, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !139, file: !2, baseType: !6, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !139, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !139, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !146, templateParams: !45, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !145, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "<&alloc::collections::TryReserveErrorKind as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::collections::TryReserveErrorKind as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !153, vtableHolder: !158, templateParams: !45, identifier: "472505c445d4c352e3435f1084a678f1")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !152, file: !2, baseType: !6, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !152, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !152, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::collections::TryReserveErrorKind", baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryReserveErrorKind", scope: !160, file: !2, size: 128, align: 64, elements: !161, templateParams: !45, identifier: "1b625b19f99caec84f7b65a2b3e9aad8")
!160 = !DINamespace(name: "collections", scope: !17)
!161 = !{!162}
!162 = !DICompositeType(tag: DW_TAG_variant_part, scope: !159, file: !2, size: 128, align: 64, elements: !163, templateParams: !45, identifier: "c57cd609b7525659ad8a4f23c5336ace", discriminator: !246)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CapacityOverflow", scope: !162, file: !2, baseType: !165, size: 128, align: 64, extraData: i64 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "CapacityOverflow", scope: !159, file: !2, size: 128, align: 64, elements: !45, identifier: "d65db193f4af75acc49b799ded9070a5")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "AllocError", scope: !162, file: !2, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !159, file: !2, size: 128, align: 64, elements: !168, templateParams: !45, identifier: "2dca856992069e37b34fb8308eb3b559")
!168 = !{!169, !245}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !167, file: !2, baseType: !170, size: 128, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !72, file: !2, size: 128, align: 64, elements: !171, templateParams: !45, identifier: "7681e0d6a93ede6089cf17652b902872")
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !2, baseType: !9, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !170, file: !2, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !175, file: !2, size: 64, align: 64, elements: !176, templateParams: !45, identifier: "dfe5915dd9e8e8e960f4980b74b2c034")
!175 = !DINamespace(name: "alignment", scope: !30)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !2, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !175, file: !2, baseType: !179, size: 64, align: 64, flags: DIFlagEnumClass, elements: !180)
!179 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!181 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!204 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!205 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!206 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!207 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!208 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!209 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!221 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!222 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!223 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!224 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!225 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!226 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!227 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!228 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!229 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!230 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!231 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!232 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!233 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!234 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!235 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!236 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!237 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!238 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!239 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!240 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!241 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!242 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!243 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!244 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "non_exhaustive", scope: !167, file: !2, baseType: !7, align: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !2, baseType: !179, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "<core::alloc::layout::Layout as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::Layout as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !250, vtableHolder: !170, templateParams: !45, identifier: "140afabdfcf4673520c93484b8a8563f")
!250 = !{!251, !252, !253, !254}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !249, file: !2, baseType: !6, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !249, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !249, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !249, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !258, vtableHolder: !263, templateParams: !45, identifier: "a9f38c2ed237b51291b57ada18f179ad")
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !257, file: !2, baseType: !6, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !257, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !257, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !257, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !267, vtableHolder: !9, templateParams: !45, identifier: "f187bbea7555e11a91db7aa6190c0480")
!267 = !{!268, !269, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !266, file: !2, baseType: !6, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !266, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !275, vtableHolder: !280, templateParams: !45, identifier: "38c413d85e1155ba9b13e1ef5c8dd7f2")
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !274, file: !2, baseType: !6, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !274, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !274, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !274, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !284, vtableHolder: !289, templateParams: !45, identifier: "859d9c451b8060d4f0e9133cc45ec238")
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !283, file: !2, baseType: !6, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !283, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::FromBytesWithNulErrorKind as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::FromBytesWithNulErrorKind as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !293, vtableHolder: !298, templateParams: !45, identifier: "b4e41b52c4cb0fbf62244d1e597c5058")
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !292, file: !2, baseType: !6, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !292, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !292, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromBytesWithNulErrorKind", scope: !299, file: !2, size: 128, align: 64, elements: !301, templateParams: !45, identifier: "a4aae2e19c28b001a8278910cb11ef31")
!299 = !DINamespace(name: "c_str", scope: !300)
!300 = !DINamespace(name: "ffi", scope: !17)
!301 = !{!302}
!302 = !DICompositeType(tag: DW_TAG_variant_part, scope: !298, file: !2, size: 128, align: 64, elements: !303, templateParams: !45, identifier: "2dcfab23834dade5e0f08dfe14cbafd3", discriminator: !310)
!303 = !{!304, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "InteriorNul", scope: !302, file: !2, baseType: !305, size: 128, align: 64, extraData: i64 0)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "InteriorNul", scope: !298, file: !2, size: 128, align: 64, elements: !306, templateParams: !45, identifier: "3ec61d6bb3bb6d9ffece21ccc7c9349b")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "NotNulTerminated", scope: !302, file: !2, baseType: !309, size: 128, align: 64, extraData: i64 1)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotNulTerminated", scope: !298, file: !2, size: 128, align: 64, elements: !45, identifier: "fee82e22bddda9fc6aa95d40d55f25d3")
!310 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !2, baseType: !179, size: 64, align: 64, flags: DIFlagArtificial)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::CString as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::CString as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !314, vtableHolder: !319, templateParams: !45, identifier: "f62c63d2158986f523ae7c454bfbcc82")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !313, file: !2, baseType: !6, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !313, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !299, file: !2, size: 128, align: 64, elements: !320, templateParams: !45, identifier: "baefcce9b01ca8bcf0a4df74fc596e8f")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !319, file: !2, baseType: !322, size: 128, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !323, templateParams: !45, identifier: "cf765f0df2d3de00c9da26f9d83fb2d2")
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !322, file: !2, baseType: !148, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !322, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !329, vtableHolder: !334, templateParams: !45, identifier: "de0ddb29feae03b5dffd674820ef7ad6")
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !328, file: !2, baseType: !6, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !328, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !328, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !328, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::str::error::Utf8Error", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !338, vtableHolder: !20, templateParams: !45, identifier: "1f2b457110a889bbfb243aeca72f16d2")
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !337, file: !2, baseType: !6, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !337, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !337, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !337, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!343 = !{i32 7, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !374, splitDebugInlining: false)
!347 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/lib.rs/@/alloc.86517141-cgu.0", directory: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc")
!348 = !{!178, !349, !357, !364, !370}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !352)
!350 = !DINamespace(name: "v1", scope: !351)
!351 = !DINamespace(name: "rt", scope: !62)
!352 = !{!353, !354, !355, !356}
!353 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !358, file: !2, baseType: !359, size: 8, align: 8, flags: DIFlagEnumClass, elements: !360)
!358 = !DINamespace(name: "cmp", scope: !31)
!359 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!360 = !{!361, !362, !363}
!361 = !DIEnumerator(name: "Less", value: -1)
!362 = !DIEnumerator(name: "Equal", value: 0)
!363 = !DIEnumerator(name: "Greater", value: 1)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !365, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !366)
!365 = !DINamespace(name: "panicking", scope: !31)
!366 = !{!367, !368, !369}
!367 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !25, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !371)
!371 = !{!372, !373}
!372 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!374 = !{!0, !53, !63, !74, !95, !116, !137, !150, !247, !255, !264, !272, !281, !290, !311, !326, !335}
!375 = distinct !DISubprogram(name: "fold<usize, core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}, usize, core::iter::traits::accum::{impl#48}::sum::{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h6731b00e9f66dbe2E", scope: !377, file: !376, line: 120, type: !381, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !419, retainedNodes: !415)
!376 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "97b07ff42844decce9ce91a8c0ee38b9")
!377 = !DINamespace(name: "{impl#2}", scope: !378)
!378 = !DINamespace(name: "map", scope: !379)
!379 = !DINamespace(name: "adapters", scope: !380)
!380 = !DINamespace(name: "iter", scope: !31)
!381 = !DISubroutineType(types: !382)
!382 = !{!9, !383, !9, !410}
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>", scope: !378, file: !2, size: 128, align: 64, elements: !384, templateParams: !407, identifier: "ff0cb8495d0bf6343914137acfbe140c")
!384 = !{!385, !403}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !383, file: !2, baseType: !386, size: 128, align: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !387, file: !2, size: 128, align: 64, elements: !389, templateParams: !395, identifier: "5ca3b307acb2f10917941b157b54bf31")
!387 = !DINamespace(name: "iter", scope: !388)
!388 = !DINamespace(name: "slice", scope: !31)
!389 = !{!390, !397, !398}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !386, file: !2, baseType: !391, size: 64, align: 64, offset: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !35, file: !2, size: 64, align: 64, elements: !392, templateParams: !395, identifier: "c4deff9cd1fa3f3f6b2ffc1383c215ab")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !391, file: !2, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !{!396}
!396 = !DITemplateTypeParameter(name: "T", type: !145)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !386, file: !2, baseType: !394, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !386, file: !2, baseType: !399, align: 8)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !400, identifier: "f1f533e64b4f19607cc2bbaf1716716b")
!400 = !{!401}
!401 = !DITemplateTypeParameter(name: "T", type: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !383, file: !2, baseType: !404, align: 8)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !405, file: !2, align: 8, elements: !45, identifier: "4f54b2d0b1ebdc82f076f53688e1a5")
!405 = !DINamespace(name: "estimated_capacity", scope: !406)
!406 = !DINamespace(name: "{impl#4}", scope: !62)
!407 = !{!408, !409}
!408 = !DITemplateTypeParameter(name: "I", type: !386)
!409 = !DITemplateTypeParameter(name: "F", type: !404)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>", scope: !411, file: !2, align: 8, elements: !45, identifier: "7a0dc7d4d3ee9579c4a07489d9f2fc38")
!411 = !DINamespace(name: "sum", scope: !412)
!412 = !DINamespace(name: "{impl#48}", scope: !413)
!413 = !DINamespace(name: "accum", scope: !414)
!414 = !DINamespace(name: "traits", scope: !380)
!415 = !{!416, !417, !418}
!416 = !DILocalVariable(name: "self", arg: 1, scope: !375, file: !376, line: 120, type: !383)
!417 = !DILocalVariable(name: "init", arg: 2, scope: !375, file: !376, line: 120, type: !9)
!418 = !DILocalVariable(name: "g", arg: 3, scope: !375, file: !376, line: 120, type: !410)
!419 = !{!420, !408, !409, !421, !422}
!420 = !DITemplateTypeParameter(name: "B", type: !9)
!421 = !DITemplateTypeParameter(name: "Acc", type: !9)
!422 = !DITemplateTypeParameter(name: "G", type: !410)
!423 = !DILocation(line: 120, column: 21, scope: !375)
!424 = !DILocation(line: 120, column: 27, scope: !375)
!425 = !DILocation(line: 120, column: 38, scope: !375)
!426 = !DILocation(line: 124, column: 30, scope: !375)
!427 = !DILocation(line: 124, column: 9, scope: !375)
!428 = !DILocation(line: 125, column: 6, scope: !375)
!429 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u16>, u16>", linkageName: "_ZN104_$LT$core..iter..adapters..cloned..Cloned$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h236747a0ed2b2f8fE", scope: !431, file: !430, line: 39, type: !433, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !470, retainedNodes: !468)
!430 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/cloned.rs", directory: "", checksumkind: CSK_MD5, checksum: "cb9d3235a75a94801397645d98265ba5")
!431 = !DINamespace(name: "{impl#1}", scope: !432)
!432 = !DINamespace(name: "cloned", scope: !379)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !449}
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u16>", scope: !84, file: !2, size: 32, align: 16, elements: !436, templateParams: !45, identifier: "9dd843bb6affbc75e369cb39d345fa08")
!436 = !{!437}
!437 = !DICompositeType(tag: DW_TAG_variant_part, scope: !435, file: !2, size: 32, align: 16, elements: !438, templateParams: !45, identifier: "f9c0e2ee3f52ee5c35a27c448fe59c12", discriminator: !448)
!438 = !{!439, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !437, file: !2, baseType: !440, size: 32, align: 16, extraData: i64 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !435, file: !2, size: 32, align: 16, elements: !45, templateParams: !441, identifier: "f51b4ecb22a1c5992ba7b5dd4dcb7fe9")
!441 = !{!442}
!442 = !DITemplateTypeParameter(name: "T", type: !443)
!443 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !437, file: !2, baseType: !445, size: 32, align: 16, extraData: i64 1)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !435, file: !2, size: 32, align: 16, elements: !446, templateParams: !441, identifier: "f60b28e809609d2c581fe837c3ac2204")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !443, size: 16, align: 16, offset: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !2, baseType: !443, size: 16, align: 16, flags: DIFlagArtificial)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>", baseType: !450, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cloned<core::slice::iter::Iter<u16>>", scope: !432, file: !2, size: 128, align: 64, elements: !451, templateParams: !466, identifier: "c5e2edcfc0b9598acfcc0c2f1dd2cb0a")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !450, file: !2, baseType: !453, size: 128, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u16>", scope: !387, file: !2, size: 128, align: 64, elements: !454, templateParams: !441, identifier: "6406343ab9c56275ba646978a29e7fb5")
!454 = !{!455, !460, !461}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !453, file: !2, baseType: !456, size: 64, align: 64, offset: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u16>", scope: !35, file: !2, size: 64, align: 64, elements: !457, templateParams: !441, identifier: "8cc7125df7db2cb558dab8cc84359a8f")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !456, file: !2, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !453, file: !2, baseType: !459, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !453, file: !2, baseType: !462, align: 8)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u16>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !463, identifier: "3b85578db320a00ac933cd8f172ff273")
!463 = !{!464}
!464 = !DITemplateTypeParameter(name: "T", type: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !{!467}
!467 = !DITemplateTypeParameter(name: "I", type: !453)
!468 = !{!469}
!469 = !DILocalVariable(name: "self", arg: 1, scope: !429, file: !430, line: 39, type: !449)
!470 = !{!467, !442}
!471 = !DILocation(line: 39, column: 13, scope: !429)
!472 = !DILocation(line: 40, column: 9, scope: !429)
!473 = !DILocation(line: 41, column: 6, scope: !429)
!474 = distinct !DISubprogram(name: "from_residual<char, ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h7baf4f06fa1440fcE", scope: !476, file: !475, line: 123, type: !479, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !489, retainedNodes: !517)
!475 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "18814020abf99e8db034f7354ec821c9")
!476 = !DINamespace(name: "{impl#1}", scope: !477)
!477 = !DINamespace(name: "control_flow", scope: !478)
!478 = !DINamespace(name: "ops", scope: !31)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !499}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<char, ()>", scope: !477, file: !2, size: 32, align: 32, elements: !482, templateParams: !45, identifier: "67f9f31ca92f6b8fc6cfe1fd3c6eb7fc")
!482 = !{!483}
!483 = !DICompositeType(tag: DW_TAG_variant_part, scope: !481, file: !2, size: 32, align: 32, elements: !484, templateParams: !45, identifier: "7d66c47d91dd4ef829e721be3ec89193", discriminator: !497)
!484 = !{!485, !493}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !483, file: !2, baseType: !486, size: 32, align: 32, extraData: i64 1114112)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !481, file: !2, size: 32, align: 32, elements: !487, templateParams: !489, identifier: "b93724eed23efd4aa53c2faa830aad89")
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !486, file: !2, baseType: !7, align: 8)
!489 = !{!490, !492}
!490 = !DITemplateTypeParameter(name: "B", type: !491)
!491 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!492 = !DITemplateTypeParameter(name: "C", type: !7)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !483, file: !2, baseType: !494, size: 32, align: 32)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !481, file: !2, size: 32, align: 32, elements: !495, templateParams: !489, identifier: "33c0339853996b89ac81ad06d4cf85f6")
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !494, file: !2, baseType: !491, size: 32, align: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !2, baseType: !498, size: 32, align: 32, flags: DIFlagArtificial)
!498 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<char, core::convert::Infallible>", scope: !477, file: !2, size: 32, align: 32, elements: !500, templateParams: !45, identifier: "403d6428f3a77010381e597f06e746f6")
!500 = !{!501}
!501 = !DICompositeType(tag: DW_TAG_variant_part, scope: !499, file: !2, size: 32, align: 32, elements: !502, templateParams: !45, identifier: "61f951a5183776cae612972d4f1ac8ce")
!502 = !{!503, !513}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !501, file: !2, baseType: !504, size: 32, align: 32)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !499, file: !2, size: 32, align: 32, elements: !505, templateParams: !511, identifier: "7907ab97da0b39e447038aa5a5d09f28")
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !504, file: !2, baseType: !507, align: 8)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !508, file: !2, align: 8, elements: !509, templateParams: !45, identifier: "8a2a5bae2fcbafab106f83f211f89369")
!508 = !DINamespace(name: "convert", scope: !31)
!509 = !{!510}
!510 = !DICompositeType(tag: DW_TAG_variant_part, scope: !507, file: !2, align: 8, elements: !45, identifier: "1019b8bdfb9e2631aa941b08872a2da")
!511 = !{!490, !512}
!512 = !DITemplateTypeParameter(name: "C", type: !507)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !501, file: !2, baseType: !514, size: 32, align: 32)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !499, file: !2, size: 32, align: 32, elements: !515, templateParams: !511, identifier: "2f28925a0e1d132182ef2a85cd415f0d")
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !514, file: !2, baseType: !491, size: 32, align: 32)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "residual", arg: 1, scope: !474, file: !475, line: 123, type: !499)
!519 = !DILocalVariable(name: "b", scope: !520, file: !475, line: 125, type: !491, align: 4)
!520 = distinct !DILexicalBlock(scope: !474, file: !475, line: 125, column: 13)
!521 = !DILocation(line: 123, column: 22, scope: !474)
!522 = !DILocation(line: 125, column: 32, scope: !474)
!523 = !{i32 0, i32 1114112}
!524 = !DILocation(line: 125, column: 32, scope: !520)
!525 = !DILocation(line: 125, column: 38, scope: !520)
!526 = !DILocation(line: 127, column: 6, scope: !474)
!527 = !{i32 0, i32 1114113}
!528 = distinct !DISubprogram(name: "next<core::iter::adapters::rev::Rev<core::str::iter::Chars>, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h4567bd3a028715ceE", scope: !530, file: !529, line: 42, type: !532, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !578, retainedNodes: !581)
!529 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/skip_while.rs", directory: "", checksumkind: CSK_MD5, checksum: "9bb200840149e00cc3b24508ffd19c57")
!530 = !DINamespace(name: "{impl#2}", scope: !531)
!531 = !DINamespace(name: "skip_while", scope: !379)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !547}
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<char>", scope: !84, file: !2, size: 32, align: 32, elements: !535, templateParams: !45, identifier: "7666df883ba6194384db85a9ed545c64")
!535 = !{!536}
!536 = !DICompositeType(tag: DW_TAG_variant_part, scope: !534, file: !2, size: 32, align: 32, elements: !537, templateParams: !45, identifier: "20323711fe52003fa854b31ca358377", discriminator: !546)
!537 = !{!538, !542}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !536, file: !2, baseType: !539, size: 32, align: 32, extraData: i64 1114112)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !534, file: !2, size: 32, align: 32, elements: !45, templateParams: !540, identifier: "d8b16b0330fd153df544d9c66403896a")
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "T", type: !491)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !536, file: !2, baseType: !543, size: 32, align: 32)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !534, file: !2, size: 32, align: 32, elements: !544, templateParams: !540, identifier: "fae2df8c727d016915a9b3dc6fd150c6")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !543, file: !2, baseType: !491, size: 32, align: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !2, baseType: !498, size: 32, align: 32, flags: DIFlagArtificial)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::skip_while::SkipWhile<core::iter::adapters::rev::Rev<core::str::iter::Chars>, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", baseType: !548, size: 64, align: 64, dwarfAddressSpace: 0)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "SkipWhile<core::iter::adapters::rev::Rev<core::str::iter::Chars>, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", scope: !531, file: !2, size: 192, align: 64, elements: !549, templateParams: !578, identifier: "570ce3fe52288f84908238b0c1a5a51d")
!549 = !{!550, !570, !572}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !548, file: !2, baseType: !551, size: 128, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rev<core::str::iter::Chars>", scope: !552, file: !2, size: 128, align: 64, elements: !553, templateParams: !568, identifier: "a7c74f192b47f7744e11ac07867ab7a3")
!552 = !DINamespace(name: "rev", scope: !379)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !551, file: !2, baseType: !555, size: 128, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !556, file: !2, size: 128, align: 64, elements: !557, templateParams: !45, identifier: "4def1dd83cc7646ec3c5ea8d74842fa8")
!556 = !DINamespace(name: "iter", scope: !133)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !555, file: !2, baseType: !559, size: 128, align: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !387, file: !2, size: 128, align: 64, elements: !560, templateParams: !40, identifier: "49f2839d0cd9fb05fd95863bd53ba425")
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !559, file: !2, baseType: !34, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !559, file: !2, baseType: !38, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !559, file: !2, baseType: !564, align: 8)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !565, identifier: "6b78a19adc8500268cf33f83184ddd9a")
!565 = !{!566}
!566 = !DITemplateTypeParameter(name: "T", type: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !{!569}
!569 = !DITemplateTypeParameter(name: "T", type: !555)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !2, baseType: !571, size: 8, align: 8, offset: 128)
!571 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !548, file: !2, baseType: !573, align: 8)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>", scope: !574, file: !2, align: 8, elements: !45, identifier: "83374b902d3e8cc71413e0bf83c78ca")
!574 = !DINamespace(name: "case_ignoreable_then_cased", scope: !575)
!575 = !DINamespace(name: "to_lowercase", scope: !576)
!576 = !DINamespace(name: "{impl#5}", scope: !577)
!577 = !DINamespace(name: "str", scope: !17)
!578 = !{!579, !580}
!579 = !DITemplateTypeParameter(name: "I", type: !551)
!580 = !DITemplateTypeParameter(name: "P", type: !573)
!581 = !{!582, !583, !586}
!582 = !DILocalVariable(name: "self", arg: 1, scope: !528, file: !529, line: 42, type: !547)
!583 = !DILocalVariable(name: "flag", scope: !584, file: !529, line: 57, type: !585, align: 8)
!584 = distinct !DILexicalBlock(scope: !528, file: !529, line: 57, column: 9)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bool", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!586 = !DILocalVariable(name: "pred", scope: !587, file: !529, line: 58, type: !588, align: 8)
!587 = distinct !DILexicalBlock(scope: !584, file: !529, line: 58, column: 9)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>", baseType: !573, size: 64, align: 64, dwarfAddressSpace: 0)
!589 = !DILocation(line: 42, column: 13, scope: !528)
!590 = !DILocation(line: 57, column: 20, scope: !528)
!591 = !DILocation(line: 57, column: 13, scope: !584)
!592 = !DILocation(line: 58, column: 20, scope: !584)
!593 = !DILocation(line: 58, column: 13, scope: !587)
!594 = !DILocation(line: 59, column: 24, scope: !587)
!595 = !DILocation(line: 59, column: 9, scope: !587)
!596 = !DILocation(line: 60, column: 6, scope: !528)
!597 = distinct !DISubprogram(name: "next<core::str::iter::Chars, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h5c77ee3a77e52598E", scope: !530, file: !529, line: 42, type: !598, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !607, retainedNodes: !610)
!598 = !DISubroutineType(types: !599)
!599 = !{!534, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::skip_while::SkipWhile<core::str::iter::Chars, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", baseType: !601, size: 64, align: 64, dwarfAddressSpace: 0)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "SkipWhile<core::str::iter::Chars, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", scope: !531, file: !2, size: 192, align: 64, elements: !602, templateParams: !607, identifier: "a3ca77620320fc488150575a22514509")
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !601, file: !2, baseType: !555, size: 128, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !2, baseType: !571, size: 8, align: 8, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !601, file: !2, baseType: !606, align: 8)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::str::iter::Chars>", scope: !574, file: !2, align: 8, elements: !45, identifier: "2846598a73b19e938c6db16250b508dd")
!607 = !{!608, !609}
!608 = !DITemplateTypeParameter(name: "I", type: !555)
!609 = !DITemplateTypeParameter(name: "P", type: !606)
!610 = !{!611, !612, !614}
!611 = !DILocalVariable(name: "self", arg: 1, scope: !597, file: !529, line: 42, type: !600)
!612 = !DILocalVariable(name: "flag", scope: !613, file: !529, line: 57, type: !585, align: 8)
!613 = distinct !DILexicalBlock(scope: !597, file: !529, line: 57, column: 9)
!614 = !DILocalVariable(name: "pred", scope: !615, file: !529, line: 58, type: !616, align: 8)
!615 = distinct !DILexicalBlock(scope: !613, file: !529, line: 58, column: 9)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>", baseType: !606, size: 64, align: 64, dwarfAddressSpace: 0)
!617 = !DILocation(line: 42, column: 13, scope: !597)
!618 = !DILocation(line: 57, column: 20, scope: !597)
!619 = !DILocation(line: 57, column: 13, scope: !613)
!620 = !DILocation(line: 58, column: 20, scope: !613)
!621 = !DILocation(line: 58, column: 13, scope: !615)
!622 = !DILocation(line: 59, column: 24, scope: !615)
!623 = !DILocation(line: 59, column: 9, scope: !615)
!624 = !DILocation(line: 60, column: 6, scope: !597)
!625 = distinct !DISubprogram(name: "check<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next5check17h740395a9de9b7556E", scope: !626, file: !529, line: 43, type: !627, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !637, retainedNodes: !634)
!626 = !DINamespace(name: "next", scope: !530)
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !585, !588}
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", scope: !630, file: !2, size: 128, align: 64, elements: !631, templateParams: !45, identifier: "fdc0a77bc762689d746a965feb600689")
!630 = !DINamespace(name: "check", scope: !626)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !2, baseType: !585, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !629, file: !2, baseType: !588, size: 64, align: 64, offset: 64)
!634 = !{!635, !636}
!635 = !DILocalVariable(name: "flag", arg: 1, scope: !625, file: !529, line: 44, type: !585)
!636 = !DILocalVariable(name: "pred", arg: 2, scope: !625, file: !529, line: 45, type: !588)
!637 = !{!541, !638}
!638 = !DITemplateTypeParameter(name: "impl FnMut(&T) -> bool", type: !573)
!639 = !DILocation(line: 44, column: 13, scope: !625)
!640 = !DILocation(line: 45, column: 13, scope: !625)
!641 = !DILocation(line: 47, column: 13, scope: !625)
!642 = !DILocation(line: 55, column: 10, scope: !625)
!643 = !{i64 1}
!644 = distinct !DISubprogram(name: "check<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next5check17h82c86c3488a72399E", scope: !626, file: !529, line: 43, type: !645, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !654, retainedNodes: !651)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !585, !616}
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", scope: !630, file: !2, size: 128, align: 64, elements: !648, templateParams: !45, identifier: "270f2132864e75b5b7c0156389893814")
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !2, baseType: !585, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !647, file: !2, baseType: !616, size: 64, align: 64, offset: 64)
!651 = !{!652, !653}
!652 = !DILocalVariable(name: "flag", arg: 1, scope: !644, file: !529, line: 44, type: !585)
!653 = !DILocalVariable(name: "pred", arg: 2, scope: !644, file: !529, line: 45, type: !616)
!654 = !{!541, !655}
!655 = !DITemplateTypeParameter(name: "impl FnMut(&T) -> bool", type: !606)
!656 = !DILocation(line: 44, column: 13, scope: !644)
!657 = !DILocation(line: 45, column: 13, scope: !644)
!658 = !DILocation(line: 47, column: 13, scope: !644)
!659 = !DILocation(line: 55, column: 10, scope: !644)
!660 = distinct !DISubprogram(name: "{closure#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next5check28_$u7b$$u7b$closure$u7d$$u7d$17h6861385569cb6a98E", scope: !630, file: !529, line: 47, type: !661, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !637, retainedNodes: !665)
!661 = !DISubroutineType(types: !662)
!662 = !{!571, !663, !664}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::skip_while::{impl#2}::next::check::{closure_env#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::iter::adapters::rev::Rev<core::str::iter::Chars>>>", baseType: !629, size: 64, align: 64, dwarfAddressSpace: 0)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&char", baseType: !491, size: 64, align: 64, dwarfAddressSpace: 0)
!665 = !{!666, !667, !668}
!666 = !DILocalVariable(name: "x", arg: 2, scope: !660, file: !529, line: 47, type: !664)
!667 = !DILocalVariable(name: "flag", scope: !660, file: !529, line: 44, type: !585, align: 8)
!668 = !DILocalVariable(name: "pred", scope: !660, file: !529, line: 45, type: !588, align: 8)
!669 = !DILocation(line: 44, column: 13, scope: !660)
!670 = !DILocation(line: 45, column: 13, scope: !660)
!671 = !DILocation(line: 47, column: 19, scope: !660)
!672 = !DILocation(line: 48, column: 20, scope: !660)
!673 = !{i8 0, i8 2}
!674 = !DILocation(line: 48, column: 30, scope: !660)
!675 = !{i64 4}
!676 = !DILocation(line: 48, column: 29, scope: !660)
!677 = !DILocation(line: 52, column: 21, scope: !660)
!678 = !DILocation(line: 48, column: 17, scope: !660)
!679 = !DILocation(line: 49, column: 21, scope: !660)
!680 = !DILocation(line: 50, column: 21, scope: !660)
!681 = !DILocation(line: 54, column: 14, scope: !660)
!682 = distinct !DISubprogram(name: "{closure#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", linkageName: "_ZN115_$LT$core..iter..adapters..skip_while..SkipWhile$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next5check28_$u7b$$u7b$closure$u7d$$u7d$17hb307dce8a79ea034E", scope: !630, file: !529, line: 47, type: !683, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !654, retainedNodes: !686)
!683 = !DISubroutineType(types: !684)
!684 = !{!571, !685, !664}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::skip_while::{impl#2}::next::check::{closure_env#0}<char, alloc::str::{impl#5}::to_lowercase::case_ignoreable_then_cased::{closure_env#0}<core::str::iter::Chars>>", baseType: !647, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !{!687, !688, !689}
!687 = !DILocalVariable(name: "x", arg: 2, scope: !682, file: !529, line: 47, type: !664)
!688 = !DILocalVariable(name: "flag", scope: !682, file: !529, line: 44, type: !585, align: 8)
!689 = !DILocalVariable(name: "pred", scope: !682, file: !529, line: 45, type: !616, align: 8)
!690 = !DILocation(line: 44, column: 13, scope: !682)
!691 = !DILocation(line: 45, column: 13, scope: !682)
!692 = !DILocation(line: 47, column: 19, scope: !682)
!693 = !DILocation(line: 48, column: 20, scope: !682)
!694 = !DILocation(line: 48, column: 30, scope: !682)
!695 = !DILocation(line: 48, column: 29, scope: !682)
!696 = !DILocation(line: 52, column: 21, scope: !682)
!697 = !DILocation(line: 48, column: 17, scope: !682)
!698 = !DILocation(line: 49, column: 21, scope: !682)
!699 = !DILocation(line: 50, column: 21, scope: !682)
!700 = !DILocation(line: 54, column: 14, scope: !682)
!701 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17ha4a5f23a1739fb8bE", scope: !703, file: !702, line: 765, type: !704, scopeLine: 765, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !40, retainedNodes: !706)
!702 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "489a545a71841a1f316d99c11467aaa5")
!703 = !DINamespace(name: "{impl#16}", scope: !35)
!704 = !DISubroutineType(types: !705)
!705 = !{!34, !28}
!706 = !{!707}
!707 = !DILocalVariable(name: "unique", arg: 1, scope: !701, file: !702, line: 765, type: !28)
!708 = !DILocation(line: 765, column: 13, scope: !701)
!709 = !DILocation(line: 768, column: 41, scope: !701)
!710 = !DILocation(line: 768, column: 18, scope: !701)
!711 = !DILocation(line: 769, column: 6, scope: !701)
!712 = distinct !DISubprogram(name: "from<[u8; 0]>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17h48b8596408a422faE", scope: !714, file: !713, line: 190, type: !715, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !727, retainedNodes: !731)
!713 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "acdefab5f14df6e5aef1141fd6b768c9")
!714 = !DINamespace(name: "{impl#11}", scope: !29)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !720}
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<[u8; 0]>", scope: !29, file: !2, size: 64, align: 64, elements: !718, templateParams: !727, identifier: "20be80438db85043462acfa72464a03e")
!718 = !{!719, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !717, file: !2, baseType: !720, size: 64, align: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u8; 0]>", scope: !35, file: !2, size: 64, align: 64, elements: !721, templateParams: !727, identifier: "428bf8fdbb0fe2963c30fdb7002363d")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !720, file: !2, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const [u8; 0]", baseType: !724, size: 64, align: 64, dwarfAddressSpace: 0)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, align: 8, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 0, lowerBound: 0)
!727 = !{!728}
!728 = !DITemplateTypeParameter(name: "T", type: !724)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !717, file: !2, baseType: !730, align: 8)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<[u8; 0]>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !727, identifier: "30d24200179e8d86d4315db1890ebf6")
!731 = !{!732}
!732 = !DILocalVariable(name: "pointer", arg: 1, scope: !712, file: !713, line: 190, type: !720)
!733 = !DILocation(line: 190, column: 13, scope: !712)
!734 = !DILocation(line: 191, column: 9, scope: !712)
!735 = !DILocation(line: 192, column: 6, scope: !712)
!736 = distinct !DISubprogram(name: "from<[core::mem::maybe_uninit::MaybeUninit<u8>]>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17h5a77d6d20903ef2aE", scope: !714, file: !713, line: 190, type: !737, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !760, retainedNodes: !764)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !742}
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<[core::mem::maybe_uninit::MaybeUninit<u8>]>", scope: !29, file: !2, size: 128, align: 64, elements: !740, templateParams: !760, identifier: "29b68cf3be205be142c6d322f903f372")
!740 = !{!741, !762}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !739, file: !2, baseType: !742, size: 128, align: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[core::mem::maybe_uninit::MaybeUninit<u8>]>", scope: !35, file: !2, size: 128, align: 64, elements: !743, templateParams: !760, identifier: "eb62c45e67218a4c86169e2acd636597")
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !742, file: !2, baseType: !745, size: 128, align: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [core::mem::maybe_uninit::MaybeUninit<u8>]", file: !2, size: 128, align: 64, elements: !746, templateParams: !45, identifier: "4e1bf22cee3e7ce11723bc183bff295")
!746 = !{!747, !759}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !745, file: !2, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64, dwarfAddressSpace: 0)
!749 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u8>", scope: !750, file: !2, size: 8, align: 8, elements: !752, templateParams: !40, identifier: "40fd747698d94c057e48eb3c7fee6fc")
!750 = !DINamespace(name: "maybe_uninit", scope: !751)
!751 = !DINamespace(name: "mem", scope: !31)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !749, file: !2, baseType: !7, align: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !749, file: !2, baseType: !755, size: 8, align: 8)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u8>", scope: !756, file: !2, size: 8, align: 8, elements: !757, templateParams: !40, identifier: "5dbc9cafe97ace481d2dac1d5bd5267a")
!756 = !DINamespace(name: "manually_drop", scope: !751)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !755, file: !2, baseType: !39, size: 8, align: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !745, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!760 = !{!761}
!761 = !DITemplateTypeParameter(name: "T", type: !749)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !739, file: !2, baseType: !763, align: 8)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<[core::mem::maybe_uninit::MaybeUninit<u8>]>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !760, identifier: "953eec82a4a7584194a6b3527f670997")
!764 = !{!765}
!765 = !DILocalVariable(name: "pointer", arg: 1, scope: !736, file: !713, line: 190, type: !742)
!766 = !DILocation(line: 190, column: 13, scope: !736)
!767 = !DILocation(line: 191, column: 9, scope: !736)
!768 = !DILocation(line: 192, column: 6, scope: !736)
!769 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17h6536788035efc0bdE", scope: !714, file: !713, line: 190, type: !770, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !40, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{!28, !34}
!772 = !{!773}
!773 = !DILocalVariable(name: "pointer", arg: 1, scope: !769, file: !713, line: 190, type: !34)
!774 = !DILocation(line: 190, column: 13, scope: !769)
!775 = !DILocation(line: 191, column: 9, scope: !769)
!776 = !DILocation(line: 192, column: 6, scope: !769)
!777 = distinct !DISubprogram(name: "from<str>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17h8dfa8cec0e925604E", scope: !714, file: !713, line: 190, type: !778, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !40, retainedNodes: !792)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !783}
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<str>", scope: !29, file: !2, size: 128, align: 64, elements: !781, templateParams: !40, identifier: "fb9f4ec8829d1c4efe4a50625708415f")
!781 = !{!782, !790}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !780, file: !2, baseType: !783, size: 128, align: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !35, file: !2, size: 128, align: 64, elements: !784, templateParams: !40, identifier: "5866ba504ccf839c2ac7101c98e84240")
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !783, file: !2, baseType: !786, size: 128, align: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !2, size: 128, align: 64, elements: !787, templateParams: !45, identifier: "f98710a4228be0581aad3740ad57a225")
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !786, file: !2, baseType: !148, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !786, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !780, file: !2, baseType: !791, align: 8)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<str>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !40, identifier: "d75c7dbf27c1f150c8cd8cff08ecea4d")
!792 = !{!793}
!793 = !DILocalVariable(name: "pointer", arg: 1, scope: !777, file: !713, line: 190, type: !783)
!794 = !DILocation(line: 190, column: 13, scope: !777)
!795 = !DILocation(line: 191, column: 9, scope: !777)
!796 = !DILocation(line: 192, column: 6, scope: !777)
!797 = distinct !DISubprogram(name: "from<core::ffi::c_str::CStr>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17ha1829cc479268ba9E", scope: !714, file: !713, line: 190, type: !798, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !816, retainedNodes: !820)
!798 = !DISubroutineType(types: !799)
!799 = !{!800, !803}
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<core::ffi::c_str::CStr>", scope: !29, file: !2, size: 128, align: 64, elements: !801, templateParams: !816, identifier: "69ed0c85845f060e74ab63466a38f9ca")
!801 = !{!802, !818}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !800, file: !2, baseType: !803, size: 128, align: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<core::ffi::c_str::CStr>", scope: !35, file: !2, size: 128, align: 64, elements: !804, templateParams: !816, identifier: "fa49617a6fd17cbdbb10ddd4635d2873")
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !803, file: !2, baseType: !806, size: 128, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const core::ffi::c_str::CStr", file: !2, size: 128, align: 64, elements: !807, templateParams: !45, identifier: "4b4e427c1a206ebef8621b8de5fdf892")
!807 = !{!808, !815}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !806, file: !2, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64, dwarfAddressSpace: 0)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !811, file: !2, align: 8, elements: !813, templateParams: !45, identifier: "753805a36f2fd8f155e636a59bb1c88")
!811 = !DINamespace(name: "c_str", scope: !812)
!812 = !DINamespace(name: "ffi", scope: !31)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !810, file: !2, baseType: !359, align: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !806, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!816 = !{!817}
!817 = !DITemplateTypeParameter(name: "T", type: !810)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !800, file: !2, baseType: !819, align: 8)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::ffi::c_str::CStr>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !816, identifier: "85df20104f47bc5e55719db4d8773653")
!820 = !{!821}
!821 = !DILocalVariable(name: "pointer", arg: 1, scope: !797, file: !713, line: 190, type: !803)
!822 = !DILocation(line: 190, column: 13, scope: !797)
!823 = !DILocation(line: 191, column: 9, scope: !797)
!824 = !DILocation(line: 192, column: 6, scope: !797)
!825 = distinct !DISubprogram(name: "from<[u8]>", linkageName: "_ZN119_$LT$core..ptr..unique..Unique$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..non_null..NonNull$LT$T$GT$$GT$$GT$4from17hbf2c858b77d1c5ebE", scope: !714, file: !713, line: 190, type: !826, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !40, retainedNodes: !840)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !831}
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<[u8]>", scope: !29, file: !2, size: 128, align: 64, elements: !829, templateParams: !40, identifier: "4faa34217a27fdc91b1109cb1ee8bfab")
!829 = !{!830, !838}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !828, file: !2, baseType: !831, size: 128, align: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u8]>", scope: !35, file: !2, size: 128, align: 64, elements: !832, templateParams: !40, identifier: "696c8d3781c125ac4e7afd49024fcfb8")
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !831, file: !2, baseType: !834, size: 128, align: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !835, templateParams: !45, identifier: "2081d302591cc0e6b89f57ab75a79c1e")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !834, file: !2, baseType: !148, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !834, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !828, file: !2, baseType: !839, align: 8)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<[u8]>", scope: !44, file: !2, align: 8, elements: !45, templateParams: !40, identifier: "cd6dca73c2ef8df4caa41f43700d48f5")
!840 = !{!841}
!841 = !DILocalVariable(name: "pointer", arg: 1, scope: !825, file: !713, line: 190, type: !831)
!842 = !DILocation(line: 190, column: 13, scope: !825)
!843 = !DILocation(line: 191, column: 9, scope: !825)
!844 = !DILocation(line: 192, column: 6, scope: !825)
!845 = distinct !DISubprogram(name: "from_residual<core::ptr::non_null::NonNull<[u8]>, core::alloc::AllocError, core::alloc::AllocError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h1b03909c43de7f90E", scope: !847, file: !846, line: 2063, type: !849, scopeLine: 2063, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !894, retainedNodes: !890)
!846 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "097aea327b3dc3b771148939f46917a3")
!847 = !DINamespace(name: "{impl#27}", scope: !848)
!848 = !DINamespace(name: "result", scope: !31)
!849 = !DISubroutineType(types: !850)
!850 = !{!851, !868, !882}
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::ptr::non_null::NonNull<[u8]>, core::alloc::AllocError>", scope: !848, file: !2, size: 128, align: 64, elements: !852, templateParams: !45, identifier: "10f1913033e084028e724c5aec5f856f")
!852 = !{!853}
!853 = !DICompositeType(tag: DW_TAG_variant_part, scope: !851, file: !2, size: 128, align: 64, elements: !854, templateParams: !45, identifier: "8d3a35d4632dd3b3840c6533598bf74e", discriminator: !867)
!854 = !{!855, !863}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !853, file: !2, baseType: !856, size: 128, align: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !851, file: !2, size: 128, align: 64, elements: !857, templateParams: !859, identifier: "b87ef6b218dc2ac784710d6b8e43e3c1")
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !856, file: !2, baseType: !831, size: 128, align: 64)
!859 = !{!860, !861}
!860 = !DITemplateTypeParameter(name: "T", type: !831)
!861 = !DITemplateTypeParameter(name: "E", type: !862)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !73, file: !2, align: 8, elements: !45, identifier: "f5465d7a9582e154f8b3023072fa24a3")
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !853, file: !2, baseType: !864, size: 128, align: 64, extraData: i64 0)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !851, file: !2, size: 128, align: 64, elements: !865, templateParams: !859, identifier: "afe2690fa6a46df5a954c97d3f8c8a81")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !864, file: !2, baseType: !862, align: 8)
!867 = !DIDerivedType(tag: DW_TAG_member, scope: !851, file: !2, baseType: !179, size: 64, align: 64, flags: DIFlagArtificial)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, core::alloc::AllocError>", scope: !848, file: !2, align: 8, elements: !869, templateParams: !45, identifier: "399aeb575799f33d115b93051b14a81")
!869 = !{!870}
!870 = !DICompositeType(tag: DW_TAG_variant_part, scope: !868, file: !2, align: 8, elements: !871, templateParams: !45, identifier: "fd669fc4436aac305b39584779459ed6")
!871 = !{!872, !878}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !870, file: !2, baseType: !873, align: 8)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !868, file: !2, align: 8, elements: !874, templateParams: !876, identifier: "6fd8b71b04a4db836c392b2a9e5782f7")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !873, file: !2, baseType: !507, align: 8)
!876 = !{!877, !861}
!877 = !DITemplateTypeParameter(name: "T", type: !507)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !870, file: !2, baseType: !879, align: 8)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !868, file: !2, align: 8, elements: !880, templateParams: !876, identifier: "30a490d6e346ddd65d1f655e515453fa")
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !879, file: !2, baseType: !862, align: 8)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !883, size: 64, align: 64, dwarfAddressSpace: 0)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !884, file: !2, size: 192, align: 64, elements: !886, templateParams: !45, identifier: "ce713e8941e9786f7cd6b9ed5cdf02a8")
!884 = !DINamespace(name: "location", scope: !885)
!885 = !DINamespace(name: "panic", scope: !31)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !883, file: !2, baseType: !145, size: 128, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !883, file: !2, baseType: !498, size: 32, align: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !883, file: !2, baseType: !498, size: 32, align: 32, offset: 160)
!890 = !{!891, !892}
!891 = !DILocalVariable(name: "residual", arg: 1, scope: !845, file: !846, line: 2063, type: !868)
!892 = !DILocalVariable(name: "e", scope: !893, file: !846, line: 2065, type: !862, align: 1)
!893 = distinct !DILexicalBlock(scope: !845, file: !846, line: 2065, column: 13)
!894 = !{!860, !861, !895}
!895 = !DITemplateTypeParameter(name: "F", type: !862)
!896 = !DILocation(line: 2063, column: 22, scope: !845)
!897 = !DILocation(line: 2065, column: 17, scope: !893)
!898 = !DILocalVariable(name: "t", arg: 1, scope: !899, file: !900, line: 736, type: !862)
!899 = distinct !DISubprogram(name: "from<core::alloc::AllocError>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17h99d2a5a68a99042eE", scope: !901, file: !900, line: 736, type: !902, scopeLine: 736, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !905, retainedNodes: !904)
!900 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "390fdc6ff25847f674c5185e049f1be3")
!901 = !DINamespace(name: "{impl#4}", scope: !508)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !862}
!904 = !{!898}
!905 = !{!906}
!906 = !DITemplateTypeParameter(name: "T", type: !862)
!907 = !DILocation(line: 736, column: 13, scope: !899, inlinedAt: !908)
!908 = distinct !DILocation(line: 2065, column: 27, scope: !893)
!909 = !DILocation(line: 2065, column: 23, scope: !893)
!910 = !DILocation(line: 2067, column: 6, scope: !845)
!911 = distinct !DISubprogram(name: "from_residual<(core::alloc::layout::Layout, usize), core::alloc::layout::LayoutError, core::alloc::layout::LayoutError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h73bf25d0b11c1868E", scope: !847, file: !846, line: 2063, type: !912, scopeLine: 2063, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !951, retainedNodes: !947)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !934, !882}
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(core::alloc::layout::Layout, usize), core::alloc::layout::LayoutError>", scope: !848, file: !2, size: 192, align: 64, elements: !915, templateParams: !45, identifier: "4fdfd919e33b937672c3cf5139b7fe2")
!915 = !{!916}
!916 = !DICompositeType(tag: DW_TAG_variant_part, scope: !914, file: !2, size: 192, align: 64, elements: !917, templateParams: !45, identifier: "eea53f99908490bba172b7223697b37d", discriminator: !933)
!917 = !{!918, !929}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !916, file: !2, baseType: !919, size: 192, align: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !914, file: !2, size: 192, align: 64, elements: !920, templateParams: !926, identifier: "b772daacd7a567788f0bba6314db679")
!920 = !{!921}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !919, file: !2, baseType: !922, size: 192, align: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "(core::alloc::layout::Layout, usize)", file: !2, size: 192, align: 64, elements: !923, templateParams: !45, identifier: "258040b7dca5c79ddb5a4bd217d28b44")
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !922, file: !2, baseType: !170, size: 128, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !922, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!926 = !{!927, !928}
!927 = !DITemplateTypeParameter(name: "T", type: !922)
!928 = !DITemplateTypeParameter(name: "E", type: !71)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !916, file: !2, baseType: !930, size: 192, align: 64, extraData: i64 0)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !914, file: !2, size: 192, align: 64, elements: !931, templateParams: !926, identifier: "21ef46f33d7d5309107e652539b9d095")
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !930, file: !2, baseType: !71, align: 8)
!933 = !DIDerivedType(tag: DW_TAG_member, scope: !914, file: !2, baseType: !179, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, core::alloc::layout::LayoutError>", scope: !848, file: !2, align: 8, elements: !935, templateParams: !45, identifier: "619a748db3196ff38403e8c764e77079")
!935 = !{!936}
!936 = !DICompositeType(tag: DW_TAG_variant_part, scope: !934, file: !2, align: 8, elements: !937, templateParams: !45, identifier: "241f70200af41e506230471542f20f11")
!937 = !{!938, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !936, file: !2, baseType: !939, align: 8)
