; ModuleID = '4jtevq6r31n8kvlo'
source_filename = "4jtevq6r31n8kvlo"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17hba4eaf5e93cdd413E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "297e2374cece695484c7c5e8c6fe815")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "52758cefa01f6f0ebbf977b6037ddf70")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "17abc2047d12d943ff6695b3656bf45d")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "b63ed6577c63c77dce767c5615340103")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "2d8ea5f5fcbdcc1c1c5046564ca9725e")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "41d111d7007d2857cfc9bcb94019386a")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "98412a1efb6d9b67f09abe1e95eab8d0")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "866b282a5328880528869d9d683c107")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "4ee32042f013a04624927183a5413fcd")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "2324db514e3f3fe2d2ad3e46134cf1d")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "af824b275b4ab63b792938753d661493")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "39465a72604add86abd7449696332153")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "70d908a34ad78a7fdd0d1fbc2c292954")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h7bdd90c9bba73703E", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "bd21ff12e449cab12a9b1c092914870e")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h5aa7b6aadc9da2b5E", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "fa4ba1eb4cf1a298f87f92a425558695")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "239117bd6487b76a366cccdd564e5727")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h3f27645c1008483bE", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17ha98ec13058eb8480E", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "acc5a86bc20cc62c9074567c60e77cc0")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "6a0984e3a7cfdc255ba4a6d8e423ddeb")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "659c57a59ea5f4acb12dc0fb02feae6")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "28001222aea8c66d6df55bf53e0de5fe")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "365b816ab5682533a3ec520c4e5441fd")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "18b9917a98fb82b6ac53ca73c695ad1f")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "528f7689e204ad81218cd83b1bf17a3b", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "26f8a9466e60f82119fb0aa69b9f041c")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "ea3f08770bfb7d73c69fa9d32329ba29")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "eab66b0a1a4cdf93e6b5f9b78e8ba9ac")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "e4795308be99e84eb3907098fbf4215e")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "4328a60b70d59b133896116fe0acc4e4")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "daead634521aad75b706968b853cd281")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !190, templateParams: !18, identifier: "cef1efd5498b23751720ed6a27a3494d")
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !191, file: !6, size: 32768, align: 128, elements: !192, templateParams: !18, identifier: "f010f92fbab21b08e3d0726860a4f0ff")
!191 = !DINamespace(name: "idt", scope: !92)
!192 = !{!193, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !269, !270, !271, !272, !293, !294, !295, !296, !314, !315, !316, !318, !319, !320, !321}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !190, file: !6, baseType: !194, size: 128, align: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !191, file: !6, size: 128, align: 32, elements: !195, templateParams: !222, identifier: "70a931648e60bf3ef3c563f9d9f17148")
!195 = !{!196, !197, !198, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !194, file: !6, baseType: !55, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !191, file: !6, size: 16, align: 16, elements: !200, templateParams: !18, identifier: "f08f0d89c88887a250d1d1a8b88a591")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !6, baseType: !55, size: 16, align: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !194, file: !6, baseType: !206, align: 8, offset: 128)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !207, identifier: "478274c50e622797dab82b651135faa8")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !191, file: !6, size: 320, align: 64, elements: !213, templateParams: !18, identifier: "d9a876ab5f9bf679c1acbdf8c0e90304")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !6, baseType: !215, size: 320, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !191, file: !6, size: 320, align: 64, elements: !216, templateParams: !18, identifier: "b395fc8a40cf495f85001eb594e0064a")
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "F", type: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !190, file: !6, baseType: !232, size: 128, align: 32, offset: 1024)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !233, templateParams: !248, identifier: "d9acc2e6ff6af56abec6b1c817727694")
!233 = !{!234, !235, !236, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !232, file: !6, baseType: !55, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !232, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !6, baseType: !241, align: 8, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !242, identifier: "fe9756dbc95afe505e41fd48acaf6a13")
!242 = !{!243}
!243 = !DITemplateTypeParameter(name: "T", type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !212, !102}
!247 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "F", type: !244)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1280)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !191, file: !6, size: 128, align: 32, elements: !253, templateParams: !267, identifier: "8806b7410cebb0e93823fc777cb017ef")
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !252, file: !6, baseType: !55, size: 16, align: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !252, file: !6, baseType: !261, align: 8, offset: 128)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !262, identifier: "75f191a8d44c41fe54d9bf5245f5ca0f")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !102}
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "F", type: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !190, file: !6, baseType: !273, size: 128, align: 32, offset: 1792)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !191, file: !6, size: 128, align: 32, elements: !274, templateParams: !291, identifier: "cd2785b24348350097d0d22522b319f9")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !273, file: !6, baseType: !55, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !273, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !273, file: !6, baseType: !282, align: 8, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !283, identifier: "ab8cc3d871ce2efb97f4572c01acde0e")
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !212, !288}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !191, file: !6, size: 64, align: 64, elements: !289, templateParams: !18, identifier: "1f7163a5c8fee47d681395106ba20e8")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !288, file: !6, baseType: !102, size: 64, align: 64)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "F", type: !285)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !190, file: !6, baseType: !297, size: 128, align: 32, offset: 2304)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !298, templateParams: !312, identifier: "e604d9220661f66fbfbfa943e39d5a87")
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !297, file: !6, baseType: !55, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !297, file: !6, baseType: !306, align: 8, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !307, identifier: "1d5be208feb5edc1dfb4723fa48d209c")
!307 = !{!308}
!308 = !DITemplateTypeParameter(name: "T", type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DISubroutineType(types: !311)
!311 = !{!247, !212}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "F", type: !309)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !190, file: !6, baseType: !317, size: 1024, align: 32, offset: 2688)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 32, elements: !161)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3712)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 3968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !190, file: !6, baseType: !322, size: 28672, align: 32, offset: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 28672, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 224, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !18, identifier: "54d2a8d44f5c82ae1dec8428b06d8176")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !6, baseType: !186, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!333 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !18, identifier: "d5bee897a87db50b20c0206b87ef2d8a")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !6, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.71.0-nightly (39c6804b9 2023-04-19))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !371, splitDebugInlining: false)
!347 = !DIFile(filename: "src/lib.rs/@/4jtevq6r31n8kvlo", directory: "/Users/yaw/self/theo/cpu_interrupts")
!348 = !{!349, !358, !365}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !353)
!350 = !DINamespace(name: "v1", scope: !351)
!351 = !DINamespace(name: "rt", scope: !352)
!352 = !DINamespace(name: "fmt", scope: !17)
!353 = !{!354, !355, !356, !357}
!354 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!361 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!362 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!363 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!364 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!370 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!371 = !{!0, !77, !84, !113, !118, !181, !325, !334}
!372 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h449694e339d4070aE", scope: !374, file: !373, line: 2447, type: !375, scopeLine: 2447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !424)
!373 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!374 = !DINamespace(name: "{impl#14}", scope: !352)
!375 = !DISubroutineType(types: !376)
!376 = !{!377, !342, !395}
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !378, file: !6, size: 8, align: 8, elements: !379, templateParams: !18, identifier: "b7fb26f737e54d12fa01aa3853cdbeae")
!378 = !DINamespace(name: "result", scope: !17)
!379 = !{!380}
!380 = !DICompositeType(tag: DW_TAG_variant_part, scope: !377, file: !6, size: 8, align: 8, elements: !381, templateParams: !18, identifier: "a92bdd2eb05472a8bda434c249c29302", discriminator: !394)
!381 = !{!382, !390}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !380, file: !6, baseType: !383, size: 8, align: 8, extraData: i64 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !377, file: !6, size: 8, align: 8, elements: !384, templateParams: !386, identifier: "bb2249fac7fb973c2c787a4c375e7dc3")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !6, baseType: !67, align: 8, offset: 8)
!386 = !{!387, !388}
!387 = !DITemplateTypeParameter(name: "T", type: !67)
!388 = !DITemplateTypeParameter(name: "E", type: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !352, file: !6, align: 8, elements: !18, identifier: "db1174efc0a2f975f4813d5134979630")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !380, file: !6, baseType: !391, size: 8, align: 8, extraData: i64 1)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !377, file: !6, size: 8, align: 8, elements: !392, templateParams: !386, identifier: "eb015aef3c84d8cf3918a665d11906a1")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !391, file: !6, baseType: !389, align: 8, offset: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !352, file: !6, size: 512, align: 64, elements: !397, templateParams: !18, identifier: "4518b2a8833c3639e2a18f19d8d2d035")
!397 = !{!398, !399, !401, !402, !414, !415}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !6, baseType: !95, size: 32, align: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !396, file: !6, baseType: !400, size: 32, align: 32, offset: 416)
!400 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !396, file: !6, baseType: !349, size: 8, align: 8, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !396, file: !6, baseType: !403, size: 128, align: 64, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !404, templateParams: !18, identifier: "e509e62aca398ad985d4d7108c999fce")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !403, file: !6, size: 128, align: 64, elements: !406, templateParams: !18, identifier: "b800028c0f41e5f65055b3206ca16e40", discriminator: !413)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !405, file: !6, baseType: !408, size: 128, align: 64, extraData: i64 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !403, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "c64b01d4e9024c6089607fba201241ac")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !405, file: !6, baseType: !410, size: 128, align: 64, extraData: i64 1)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !403, file: !6, size: 128, align: 64, elements: !411, templateParams: !138, identifier: "d909f9aede69ded5e6a3f34da3cb5ef3")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !396, file: !6, baseType: !403, size: 128, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !396, file: !6, baseType: !416, size: 128, align: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !417, templateParams: !18, identifier: "f9270966a9fda351195f72d6edc0f59a")
!417 = !{!418, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !416, file: !6, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64, dwarfAddressSpace: 0)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "26797fbb1ceb902d1b523adeae52178")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !416, file: !6, baseType: !422, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!424 = !{!425, !426}
!425 = !DILocalVariable(name: "self", arg: 1, scope: !372, file: !373, line: 2447, type: !342)
!426 = !DILocalVariable(name: "f", arg: 2, scope: !372, file: !373, line: 2447, type: !395)
!427 = !DILocation(line: 2447, column: 12, scope: !372)
!428 = !DILocation(line: 2447, column: 19, scope: !372)
!429 = !DILocation(line: 2448, column: 9, scope: !372)
!430 = !DILocation(line: 2449, column: 6, scope: !372)
!431 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17hce8b2ce14cd57d11E", scope: !433, file: !432, line: 240, type: !435, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !451)
!432 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f61be3e42d6221d30b5488a425dbc01")
!433 = !DINamespace(name: "{impl#2}", scope: !434)
!434 = !DINamespace(name: "bit_field", scope: null)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !437, !137, !333, !438}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !439, size: 64, align: 64, dwarfAddressSpace: 0)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !440, file: !6, size: 192, align: 64, elements: !442, templateParams: !18, identifier: "890f479934f1e71d4972eb7472510a5")
!440 = !DINamespace(name: "location", scope: !441)
!441 = !DINamespace(name: "panic", scope: !17)
!442 = !{!443, !449, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !439, file: !6, baseType: !444, size: 128, align: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !445, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !444, file: !6, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !444, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !439, file: !6, baseType: !95, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !439, file: !6, baseType: !95, size: 32, align: 32, offset: 160)
!451 = !{!452, !453, !454}
!452 = !DILocalVariable(name: "self", arg: 1, scope: !431, file: !432, line: 240, type: !437)
!453 = !DILocalVariable(name: "bit", arg: 2, scope: !431, file: !432, line: 240, type: !137)
!454 = !DILocalVariable(name: "value", arg: 3, scope: !431, file: !432, line: 240, type: !333)
!455 = !DILocation(line: 240, column: 24, scope: !431)
!456 = !DILocation(line: 240, column: 35, scope: !431)
!457 = !DILocation(line: 240, column: 47, scope: !431)
!458 = !DILocation(line: 241, column: 25, scope: !431)
!459 = !DILocation(line: 241, column: 17, scope: !431)
!460 = !DILocation(line: 243, column: 20, scope: !431)
!461 = !DILocation(line: 246, column: 31, scope: !431)
!462 = !DILocation(line: 244, column: 30, scope: !431)
!463 = !DILocation(line: 244, column: 21, scope: !431)
!464 = !DILocation(line: 243, column: 17, scope: !431)
!465 = !DILocation(line: 250, column: 14, scope: !431)
!466 = !DILocation(line: 246, column: 30, scope: !431)
!467 = !DILocation(line: 246, column: 21, scope: !431)
!468 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17h042cd3d8f1393c3cE", scope: !433, file: !432, line: 254, type: !469, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !487, retainedNodes: !479)
!469 = !DISubroutineType(types: !470)
!470 = !{!437, !437, !471, !55, !438}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !472, file: !6, size: 128, align: 64, elements: !474, templateParams: !477, identifier: "a03c8b420abc34aa26dc7c9454c3a97c")
!472 = !DINamespace(name: "range", scope: !473)
!473 = !DINamespace(name: "ops", scope: !17)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !471, file: !6, baseType: !137, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !471, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "Idx", type: !137)
!479 = !{!480, !481, !482, !483, !485}
!480 = !DILocalVariable(name: "self", arg: 1, scope: !468, file: !432, line: 254, type: !437)
!481 = !DILocalVariable(name: "range", arg: 2, scope: !468, file: !432, line: 254, type: !471)
!482 = !DILocalVariable(name: "value", arg: 3, scope: !468, file: !432, line: 254, type: !55)
!483 = !DILocalVariable(name: "range", scope: !484, file: !432, line: 255, type: !471, align: 8)
!484 = distinct !DILexicalBlock(scope: !468, file: !432, line: 255, column: 17)
!485 = !DILocalVariable(name: "bitmask", scope: !486, file: !432, line: 264, type: !55, align: 2)
!486 = distinct !DILexicalBlock(scope: !484, file: !432, line: 264, column: 17)
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "T", type: !471)
!489 = !DILocation(line: 254, column: 48, scope: !468)
!490 = !DILocation(line: 254, column: 59, scope: !468)
!491 = !DILocation(line: 254, column: 69, scope: !468)
!492 = !DILocation(line: 255, column: 29, scope: !468)
!493 = !DILocation(line: 255, column: 21, scope: !484)
!494 = !DILocation(line: 257, column: 25, scope: !484)
!495 = !DILocation(line: 257, column: 17, scope: !484)
!496 = !DILocation(line: 258, column: 25, scope: !484)
!497 = !DILocation(line: 258, column: 17, scope: !484)
!498 = !DILocation(line: 259, column: 25, scope: !484)
!499 = !DILocation(line: 259, column: 17, scope: !484)
!500 = !DILocation(line: 260, column: 54, scope: !484)
!501 = !DILocation(line: 260, column: 34, scope: !484)
!502 = !DILocation(line: 260, column: 25, scope: !484)
!503 = !DILocation(line: 261, column: 45, scope: !484)
!504 = !DILocation(line: 261, column: 25, scope: !484)
!505 = !DILocation(line: 260, column: 17, scope: !484)
!506 = !DILocation(line: 264, column: 45, scope: !484)
!507 = !DILocation(line: 264, column: 39, scope: !484)
!508 = !DILocation(line: 265, column: 37, scope: !484)
!509 = !DILocation(line: 264, column: 38, scope: !484)
!510 = !DILocation(line: 264, column: 37, scope: !484)
!511 = !DILocation(line: 264, column: 21, scope: !486)
!512 = !DILocation(line: 269, column: 26, scope: !486)
!513 = !DILocation(line: 269, column: 25, scope: !486)
!514 = !DILocation(line: 269, column: 45, scope: !486)
!515 = !DILocation(line: 269, column: 17, scope: !486)
!516 = !DILocation(line: 272, column: 14, scope: !468)
!517 = distinct !DISubprogram(name: "new<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV13new17h82bde6be3fb5a350E", scope: !518, file: !373, line: 340, type: !528, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !537, retainedNodes: !534)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !352, file: !6, size: 128, align: 64, elements: !519, templateParams: !18, identifier: "4e3593181d4a3fd7c7588e4c93e285e5")
!519 = !{!520, !524}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !518, file: !6, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !522, size: 64, align: 64, dwarfAddressSpace: 0)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !523, file: !6, align: 8, elements: !18, identifier: "9d957b9cbc95a5d52c57994d133a21d2")
!523 = !DINamespace(name: "{extern#0}", scope: !352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !518, file: !6, baseType: !525, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !526, size: 64, align: 64, dwarfAddressSpace: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!377, !521, !395}
!528 = !DISubroutineType(types: !529)
!529 = !{!518, !530, !531}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::InterruptStackFrame", baseType: !212, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&x86_64::structures::idt::InterruptStackFrame, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !532, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DISubroutineType(types: !533)
!533 = !{!377, !530, !395}
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "x", arg: 1, scope: !517, file: !373, line: 340, type: !530)
!536 = !DILocalVariable(name: "f", arg: 2, scope: !517, file: !373, line: 340, type: !531)
!537 = !{!538}
!538 = !DITemplateTypeParameter(name: "T", type: !212)
!539 = !DILocation(line: 340, column: 23, scope: !517)
!540 = !DILocation(line: 340, column: 33, scope: !517)
!541 = !DILocation(line: 349, column: 18, scope: !517)
!542 = !DILocation(line: 350, column: 6, scope: !517)
!543 = !{i64 1}
!544 = distinct !DISubprogram(name: "new_debug<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17hde7ac84ec1ddca2bE", scope: !518, file: !373, line: 329, type: !545, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !537, retainedNodes: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{!518, !530}
!547 = !{!548}
!548 = !DILocalVariable(name: "x", arg: 1, scope: !544, file: !373, line: 329, type: !530)
!549 = !DILocation(line: 329, column: 30, scope: !544)
!550 = !DILocation(line: 330, column: 13, scope: !544)
!551 = !DILocation(line: 331, column: 10, scope: !544)
!552 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hcd0c4ce7c9674d99E", scope: !553, file: !373, line: 443, type: !612, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !617)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !352, file: !6, size: 384, align: 64, elements: !554, templateParams: !18, identifier: "1c46a498dd7b956f4c3a670fdfba5262")
!554 = !{!555, !561, !606}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !553, file: !6, baseType: !556, size: 128, align: 64, offset: 128)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !557, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !556, file: !6, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !556, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !553, file: !6, baseType: !562, size: 128, align: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !145, file: !6, size: 128, align: 64, elements: !563, templateParams: !18, identifier: "d25d924bb8d51dd413c49dbfa1f11f1")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_variant_part, scope: !562, file: !6, size: 128, align: 64, elements: !565, templateParams: !18, identifier: "759788f84997b99f6bc91fe0c57058ba", discriminator: !605)
!565 = !{!566, !601}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !564, file: !6, baseType: !567, size: 128, align: 64, extraData: i64 0)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !562, file: !6, size: 128, align: 64, elements: !18, templateParams: !568, identifier: "82efcd94523cf9c0b17ac37e82724639")
!568 = !{!569}
!569 = !DITemplateTypeParameter(name: "T", type: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !571, templateParams: !18, identifier: "de3ba5e1dd56fab311eb54a28d6cb95f")
!571 = !{!572, !600}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !570, file: !6, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64, dwarfAddressSpace: 0)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !350, file: !6, size: 448, align: 64, elements: !575, templateParams: !18, identifier: "9bee5132fe724679d94d9aaa78899300")
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !574, file: !6, baseType: !137, size: 64, align: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !574, file: !6, baseType: !578, size: 384, align: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !350, file: !6, size: 384, align: 64, elements: !579, templateParams: !18, identifier: "65fce75b527475dfcd89c81174c5b112")
!579 = !{!580, !581, !582, !583, !599}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !578, file: !6, baseType: !400, size: 32, align: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !578, file: !6, baseType: !349, size: 8, align: 8, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !6, baseType: !95, size: 32, align: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !578, file: !6, baseType: !584, size: 128, align: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !350, file: !6, size: 128, align: 64, elements: !585, templateParams: !18, identifier: "eb274483ac6a1a818973f8ef56806ce6")
!585 = !{!586}
!586 = !DICompositeType(tag: DW_TAG_variant_part, scope: !584, file: !6, size: 128, align: 64, elements: !587, templateParams: !18, identifier: "1383065eb0a1d3eb5559cfa60c22a70d", discriminator: !598)
!587 = !{!588, !592, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !586, file: !6, baseType: !589, size: 128, align: 64, extraData: i64 0)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !584, file: !6, size: 128, align: 64, elements: !590, templateParams: !18, identifier: "284bf6fbe777a447ca6ded9ea5417274")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !589, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !586, file: !6, baseType: !593, size: 128, align: 64, extraData: i64 1)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !584, file: !6, size: 128, align: 64, elements: !594, templateParams: !18, identifier: "47998f14b9dfef6b1e659ae3b3c1ad7f")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !593, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !586, file: !6, baseType: !597, size: 128, align: 64, extraData: i64 2)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !584, file: !6, size: 128, align: 64, elements: !18, identifier: "a9ac2edd79b7a2c052d84739de651359")
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !584, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !578, file: !6, baseType: !584, size: 128, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !570, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !564, file: !6, baseType: !602, size: 128, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !562, file: !6, size: 128, align: 64, elements: !603, templateParams: !568, identifier: "ecb4a60835a68b86ac55d46be42b6cd5")
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !602, file: !6, baseType: !570, size: 128, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, scope: !562, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !553, file: !6, baseType: !607, size: 128, align: 64, offset: 256)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !608, templateParams: !18, identifier: "1ef2a88983c14e17bd3824c1adc5cb")
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !607, file: !6, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64, dwarfAddressSpace: 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !607, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!553, !556, !607, !570, !614}
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !352, file: !6, align: 8, elements: !615, templateParams: !18, identifier: "87fa5f455e1e5965cb07ce17624e505b")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !614, file: !6, baseType: !67, align: 8)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DILocalVariable(name: "pieces", arg: 1, scope: !552, file: !373, line: 444, type: !556)
!619 = !DILocalVariable(name: "args", arg: 2, scope: !552, file: !373, line: 445, type: !607)
!620 = !DILocalVariable(name: "fmt", arg: 3, scope: !552, file: !373, line: 446, type: !570)
!621 = !DILocalVariable(name: "_unsafe_arg", scope: !552, file: !373, line: 447, type: !614, align: 1)
!622 = !DILocalVariable(arg: 4, scope: !552, file: !373, line: 447, type: !614)
!623 = !DILocation(line: 447, column: 9, scope: !552)
!624 = !DILocation(line: 444, column: 9, scope: !552)
!625 = !DILocation(line: 445, column: 9, scope: !552)
!626 = !DILocation(line: 446, column: 9, scope: !552)
!627 = !DILocation(line: 449, column: 34, scope: !552)
!628 = !DILocation(line: 449, column: 9, scope: !552)
!629 = !{i64 8}
!630 = !DILocation(line: 450, column: 6, scope: !552)
!631 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hded902bb67e3b28eE", scope: !553, file: !373, line: 399, type: !632, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{!553, !556}
!634 = !{!635}
!635 = !DILocalVariable(name: "pieces", arg: 1, scope: !631, file: !373, line: 399, type: !556)
!636 = !DILocation(line: 399, column: 28, scope: !631)
!637 = !DILocation(line: 400, column: 12, scope: !631)
!638 = !DILocation(line: 403, column: 34, scope: !631)
!639 = !DILocation(line: 403, column: 9, scope: !631)
!640 = !DILocation(line: 404, column: 6, scope: !631)
!641 = !DILocation(line: 401, column: 13, scope: !631)
!642 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h43f4b2f59b66e097E", scope: !644, file: !643, line: 250, type: !646, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !654, retainedNodes: !651)
!643 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfb73adf0f4bb6df3856d6eaf613e707")
!644 = !DINamespace(name: "FnOnce", scope: !645)
!645 = !DINamespace(name: "function", scope: !473)
!646 = !DISubroutineType(types: !647)
!647 = !{!153, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !649, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!153}
!651 = !{!652, !653}
!652 = !DILocalVariable(arg: 1, scope: !642, file: !643, line: 250, type: !648)
!653 = !DILocalVariable(arg: 2, scope: !642, file: !643, line: 250, type: !67)
!654 = !{!655, !656}
!655 = !DITemplateTypeParameter(name: "Self", type: !648)
!656 = !DITemplateTypeParameter(name: "Args", type: !67)
!657 = !DILocation(line: 250, column: 5, scope: !642)
!658 = !DILocalVariable(name: "global_descriptor_table", scope: !659, file: !89, line: 26, type: !156, align: 8)
!659 = distinct !DILexicalBlock(scope: !660, file: !89, line: 26, column: 9)
!660 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hb7b7fe073ef70f60E", scope: !87, file: !80, line: 137, type: !649, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !661)
!661 = !{!658, !662, !664, !666, !668}
!662 = !DILocalVariable(name: "stack_start", scope: !663, file: !89, line: 31, type: !98, align: 8)
!663 = distinct !DILexicalBlock(scope: !659, file: !89, line: 31, column: 17)
!664 = !DILocalVariable(name: "stack_end", scope: !665, file: !89, line: 32, type: !98, align: 8)
!665 = distinct !DILexicalBlock(scope: !663, file: !89, line: 32, column: 17)
!666 = !DILocalVariable(name: "tss_selector", scope: !667, file: !89, line: 38, type: !168, align: 2)
!667 = distinct !DILexicalBlock(scope: !659, file: !89, line: 38, column: 9)
!668 = !DILocalVariable(name: "code_selector", scope: !669, file: !89, line: 39, type: !168, align: 2)
!669 = distinct !DILexicalBlock(scope: !667, file: !89, line: 39, column: 9)
!670 = !DILocation(line: 26, column: 13, scope: !659, inlinedAt: !671)
!671 = distinct !DILocation(line: 250, column: 5, scope: !642)
!672 = !DILocation(line: 26, column: 43, scope: !673, inlinedAt: !671)
!673 = !DILexicalBlockFile(scope: !660, file: !89, discriminator: 0)
!674 = !DILocation(line: 31, column: 35, scope: !659, inlinedAt: !671)
!675 = !DILocation(line: 31, column: 21, scope: !663, inlinedAt: !671)
!676 = !DILocation(line: 32, column: 33, scope: !663, inlinedAt: !671)
!677 = !DILocation(line: 32, column: 21, scope: !665, inlinedAt: !671)
!678 = !DILocation(line: 29, column: 13, scope: !659, inlinedAt: !671)
!679 = !DILocation(line: 38, column: 62, scope: !659, inlinedAt: !671)
!680 = !DILocation(line: 38, column: 28, scope: !659, inlinedAt: !671)
!681 = !DILocation(line: 38, column: 13, scope: !667, inlinedAt: !671)
!682 = !DILocation(line: 39, column: 63, scope: !667, inlinedAt: !671)
!683 = !DILocation(line: 39, column: 29, scope: !667, inlinedAt: !671)
!684 = !DILocation(line: 39, column: 13, scope: !669, inlinedAt: !671)
!685 = !DILocation(line: 41, column: 20, scope: !669, inlinedAt: !671)
!686 = !DILocation(line: 42, column: 24, scope: !669, inlinedAt: !671)
!687 = !DILocation(line: 40, column: 9, scope: !669, inlinedAt: !671)
!688 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17hed3b0a61758d7b1dE", scope: !690, file: !689, line: 490, type: !691, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !696, retainedNodes: !694)
!689 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ed5a5b94ce68ef0bd15ed78a0be1f1f0")
!690 = !DINamespace(name: "ptr", scope: !17)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !{!695}
!695 = !DILocalVariable(arg: 1, scope: !688, file: !689, line: 490, type: !693)
!696 = !{!697}
!697 = !DITemplateTypeParameter(name: "T", type: !333)
!698 = !DILocation(line: 490, column: 1, scope: !688)
!699 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17h0c1f3789c4ecc105E", scope: !690, file: !689, line: 490, type: !700, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !705, retainedNodes: !703)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!703 = !{!704}
!704 = !DILocalVariable(arg: 1, scope: !699, file: !689, line: 490, type: !702)
!705 = !{!706}
!706 = !DITemplateTypeParameter(name: "T", type: !342)
!707 = !DILocation(line: 490, column: 1, scope: !699)
!708 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h3e9aabffaea41d26E", scope: !690, file: !689, line: 490, type: !709, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !719, retainedNodes: !717)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !712, size: 64, align: 64, dwarfAddressSpace: 0)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !713, templateParams: !18, identifier: "cd92f053598e0a24dc2a32b3edecc330")
!713 = !{!714, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !6, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !712, file: !6, baseType: !333, size: 8, align: 8, offset: 64)
!717 = !{!718}
!718 = !DILocalVariable(arg: 1, scope: !708, file: !689, line: 490, type: !711)
!719 = !{!720}
!720 = !DITemplateTypeParameter(name: "T", type: !712)
!721 = !DILocation(line: 490, column: 1, scope: !708)
!722 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::InterruptDescriptorTable>", linkageName: "_ZN4core3ptr70drop_in_place$LT$x86_64..structures..idt..InterruptDescriptorTable$GT$17hb7fbc41e9d29bedaE", scope: !690, file: !689, line: 490, type: !723, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !728, retainedNodes: !726)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !{!727}
!727 = !DILocalVariable(arg: 1, scope: !722, file: !689, line: 490, type: !725)
!728 = !{!729}
!729 = !DITemplateTypeParameter(name: "T", type: !190)
!730 = !DILocation(line: 490, column: 1, scope: !722)
!731 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h9e80d6cac9588238E", scope: !690, file: !689, line: 490, type: !732, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !746, retainedNodes: !744)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !735, size: 64, align: 64, dwarfAddressSpace: 0)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !736, templateParams: !73, identifier: "c639896a6bdcb80bdc89ccd4cac013c8")
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !735, file: !6, baseType: !738, size: 128, align: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !739, templateParams: !73, identifier: "effc2c4a3ff22d86bbf1835d76289653")
!739 = !{!740, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !738, file: !6, baseType: !741, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !738, file: !6, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!744 = !{!745}
!745 = !DILocalVariable(arg: 1, scope: !731, file: !689, line: 490, type: !734)
!746 = !{!747}
!747 = !DITemplateTypeParameter(name: "T", type: !735)
!748 = !DILocation(line: 490, column: 1, scope: !731)
!749 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17hce1365299f7915e6E", scope: !690, file: !689, line: 490, type: !750, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !755, retainedNodes: !753)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !738, size: 64, align: 64, dwarfAddressSpace: 0)
!753 = !{!754}
!754 = !DILocalVariable(arg: 1, scope: !749, file: !689, line: 490, type: !752)
!755 = !{!756}
!756 = !DITemplateTypeParameter(name: "T", type: !738)
!757 = !DILocation(line: 490, column: 1, scope: !749)
!758 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h176723cebe81373dE", scope: !760, file: !759, line: 100, type: !761, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!759 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdccd67e2121209a433721fb94464813")
!760 = !DINamespace(name: "hint", scope: !17)
!761 = !DISubroutineType(types: !762)
!762 = !{null}
!763 = !DILocation(line: 104, column: 9, scope: !758)
!764 = !DILocation(line: 105, column: 9, scope: !758)
!765 = !DILocation(line: 2487, column: 21, scope: !766, inlinedAt: !769)
!766 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17hc8ab74fc0b41b0a0E", scope: !768, file: !767, line: 2484, type: !761, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!767 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "275c4f9af6c6ff08216f4f2da85e76cf")
!768 = !DINamespace(name: "unreachable_unchecked", scope: !760)
!769 = distinct !DILocation(line: 104, column: 9, scope: !758)
!770 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17h83c47fb0d9c4c76bE", scope: !24, file: !771, line: 715, type: !772, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !789)
!771 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "93a0089cd11c622e97239c13f01ff0c9")
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !741, !333, !333, !358, !358}
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !378, file: !6, size: 16, align: 8, elements: !775, templateParams: !18, identifier: "7365c467b915a2a16355365ce242dad")
!775 = !{!776}
!776 = !DICompositeType(tag: DW_TAG_variant_part, scope: !774, file: !6, size: 16, align: 8, elements: !777, templateParams: !18, identifier: "7ec905e07cedf682259b25d865c5c200", discriminator: !788)
!777 = !{!778, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !776, file: !6, baseType: !779, size: 16, align: 8, extraData: i64 0)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !774, file: !6, size: 16, align: 8, elements: !780, templateParams: !782, identifier: "a1eb1370c30a725c379b4d8953d72b30")
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !779, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!782 = !{!697, !783}
!783 = !DITemplateTypeParameter(name: "E", type: !333)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !776, file: !6, baseType: !785, size: 16, align: 8, extraData: i64 1)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !774, file: !6, size: 16, align: 8, elements: !786, templateParams: !782, identifier: "1d4575c4127d5fe3a8e8b4086498e54f")
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !785, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, scope: !774, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!789 = !{!790, !791, !792, !793, !794, !795, !797}
!790 = !DILocalVariable(name: "self", arg: 1, scope: !770, file: !771, line: 716, type: !741)
!791 = !DILocalVariable(name: "current", arg: 2, scope: !770, file: !771, line: 717, type: !333)
!792 = !DILocalVariable(name: "new", arg: 3, scope: !770, file: !771, line: 718, type: !333)
!793 = !DILocalVariable(name: "success", arg: 4, scope: !770, file: !771, line: 719, type: !358)
!794 = !DILocalVariable(name: "failure", arg: 5, scope: !770, file: !771, line: 720, type: !358)
!795 = !DILocalVariable(name: "x", scope: !796, file: !771, line: 726, type: !33, align: 1)
!796 = distinct !DILexicalBlock(scope: !770, file: !771, line: 726, column: 13)
!797 = !DILocalVariable(name: "x", scope: !798, file: !771, line: 727, type: !33, align: 1)
!798 = distinct !DILexicalBlock(scope: !770, file: !771, line: 727, column: 13)
!799 = !DILocation(line: 716, column: 9, scope: !770)
!800 = !DILocation(line: 717, column: 9, scope: !770)
!801 = !DILocation(line: 718, column: 9, scope: !770)
!802 = !DILocation(line: 719, column: 9, scope: !770)
!803 = !DILocation(line: 720, column: 9, scope: !770)
!804 = !DILocalVariable(name: "self", arg: 1, scope: !805, file: !806, line: 2052, type: !810)
!805 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h2bcd436f3b5cd4cbE", scope: !29, file: !806, line: 2052, type: !807, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !811)
!806 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "8d01b740129a4b9c32202a274c61d632")
!807 = !DISubroutineType(types: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!811 = !{!804}
!812 = !DILocation(line: 2052, column: 22, scope: !805, inlinedAt: !813)
!813 = distinct !DILocation(line: 724, column: 42, scope: !770)
!814 = !DILocation(line: 724, column: 56, scope: !770)
!815 = !DILocation(line: 724, column: 71, scope: !770)
!816 = !DILocation(line: 724, column: 13, scope: !770)
!817 = !DILocation(line: 723, column: 15, scope: !770)
!818 = !{i8 0, i8 2}
!819 = !DILocation(line: 723, column: 9, scope: !770)
!820 = !DILocation(line: 726, column: 16, scope: !770)
!821 = !DILocation(line: 726, column: 16, scope: !796)
!822 = !DILocation(line: 726, column: 25, scope: !796)
!823 = !DILocation(line: 726, column: 22, scope: !796)
!824 = !DILocation(line: 726, column: 31, scope: !770)
!825 = !DILocation(line: 727, column: 17, scope: !770)
!826 = !DILocation(line: 727, column: 17, scope: !798)
!827 = !DILocation(line: 727, column: 27, scope: !798)
!828 = !DILocation(line: 727, column: 23, scope: !798)
!829 = !DILocation(line: 727, column: 33, scope: !770)
!830 = !DILocation(line: 729, column: 6, scope: !770)
!831 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17h200bdf441314cb9dE", scope: !24, file: !771, line: 495, type: !832, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!333, !741, !358}
!834 = !{!835, !836}
!835 = !DILocalVariable(name: "self", arg: 1, scope: !831, file: !771, line: 495, type: !741)
!836 = !DILocalVariable(name: "order", arg: 2, scope: !831, file: !771, line: 495, type: !358)
!837 = !DILocation(line: 495, column: 17, scope: !831)
!838 = !DILocation(line: 495, column: 24, scope: !831)
!839 = !DILocation(line: 2052, column: 22, scope: !805, inlinedAt: !840)
!840 = distinct !DILocation(line: 498, column: 30, scope: !831)
!841 = !DILocation(line: 498, column: 18, scope: !831)
!842 = !DILocation(line: 499, column: 6, scope: !831)
!843 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17hc0baf79e2f8d3e42E", scope: !24, file: !771, line: 523, type: !844, scopeLine: 523, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !741, !333, !358}
!846 = !{!847, !848, !849}
!847 = !DILocalVariable(name: "self", arg: 1, scope: !843, file: !771, line: 523, type: !741)
!848 = !DILocalVariable(name: "val", arg: 2, scope: !843, file: !771, line: 523, type: !333)
!849 = !DILocalVariable(name: "order", arg: 3, scope: !843, file: !771, line: 523, type: !358)
!850 = !DILocation(line: 523, column: 18, scope: !843)
!851 = !DILocation(line: 523, column: 25, scope: !843)
!852 = !DILocation(line: 523, column: 36, scope: !843)
!853 = !DILocation(line: 2052, column: 22, scope: !805, inlinedAt: !854)
!854 = distinct !DILocation(line: 527, column: 26, scope: !843)
!855 = !DILocation(line: 527, column: 40, scope: !843)
!856 = !DILocation(line: 527, column: 13, scope: !843)
!857 = !DILocation(line: 529, column: 6, scope: !843)
!858 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hce551756e8b9282aE", scope: !131, file: !771, line: 2369, type: !859, scopeLine: 2369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!137, !715, !137, !137, !358}
!861 = !{!862, !863, !864, !865, !866, !868}
!862 = !DILocalVariable(name: "self", arg: 1, scope: !858, file: !771, line: 2369, type: !715)
!863 = !DILocalVariable(name: "current", arg: 2, scope: !858, file: !771, line: 2370, type: !137)
!864 = !DILocalVariable(name: "new", arg: 3, scope: !858, file: !771, line: 2371, type: !137)
!865 = !DILocalVariable(name: "order", arg: 4, scope: !858, file: !771, line: 2372, type: !358)
!866 = !DILocalVariable(name: "x", scope: !867, file: !771, line: 2377, type: !137, align: 8)
!867 = distinct !DILexicalBlock(scope: !858, file: !771, line: 2377, column: 21)
!868 = !DILocalVariable(name: "x", scope: !869, file: !771, line: 2378, type: !137, align: 8)
!869 = distinct !DILexicalBlock(scope: !858, file: !771, line: 2378, column: 21)
!870 = !DILocation(line: 2369, column: 37, scope: !858)
!871 = !DILocation(line: 2370, column: 37, scope: !858)
!872 = !DILocation(line: 2371, column: 37, scope: !858)
!873 = !DILocation(line: 2372, column: 37, scope: !858)
!874 = !DILocation(line: 2376, column: 45, scope: !858)
!875 = !{i8 0, i8 5}
!876 = !DILocation(line: 2373, column: 23, scope: !858)
!877 = !{i64 0, i64 2}
!878 = !DILocation(line: 2373, column: 17, scope: !858)
!879 = !DILocation(line: 2377, column: 24, scope: !858)
!880 = !DILocation(line: 2377, column: 24, scope: !867)
!881 = !DILocation(line: 2377, column: 30, scope: !867)
!882 = !DILocation(line: 2377, column: 30, scope: !858)
!883 = !DILocation(line: 2378, column: 25, scope: !858)
!884 = !DILocation(line: 2378, column: 25, scope: !869)
!885 = !DILocation(line: 2378, column: 31, scope: !869)
!886 = !DILocation(line: 2378, column: 31, scope: !858)
!887 = !DILocation(line: 2380, column: 14, scope: !858)
!888 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17hb26ee0ee2bfc4e45E", scope: !131, file: !771, line: 2423, type: !889, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !906)
!889 = !DISubroutineType(types: !890)
!890 = !{!891, !715, !137, !137, !358, !358}
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !378, file: !6, size: 128, align: 64, elements: !892, templateParams: !18, identifier: "97070b8587e85ae1b5193880b63935a")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_variant_part, scope: !891, file: !6, size: 128, align: 64, elements: !894, templateParams: !18, identifier: "de3925766c1d72389089bc1cdfe97601", discriminator: !905)
!894 = !{!895, !901}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !893, file: !6, baseType: !896, size: 128, align: 64, extraData: i64 0)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !891, file: !6, size: 128, align: 64, elements: !897, templateParams: !899, identifier: "dbc138c1645d82053e39f40a2e4c40e")
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !896, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!899 = !{!139, !900}
!900 = !DITemplateTypeParameter(name: "E", type: !137)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !893, file: !6, baseType: !902, size: 128, align: 64, extraData: i64 1)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !891, file: !6, size: 128, align: 64, elements: !903, templateParams: !899, identifier: "7a431fbe9c45bd7efe1f873ae7fa06da")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !891, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!906 = !{!907, !908, !909, !910, !911}
!907 = !DILocalVariable(name: "self", arg: 1, scope: !888, file: !771, line: 2423, type: !715)
!908 = !DILocalVariable(name: "current", arg: 2, scope: !888, file: !771, line: 2424, type: !137)
!909 = !DILocalVariable(name: "new", arg: 3, scope: !888, file: !771, line: 2425, type: !137)
!910 = !DILocalVariable(name: "success", arg: 4, scope: !888, file: !771, line: 2426, type: !358)
!911 = !DILocalVariable(name: "failure", arg: 5, scope: !888, file: !771, line: 2427, type: !358)
!912 = !DILocation(line: 2423, column: 37, scope: !888)
!913 = !DILocation(line: 2424, column: 37, scope: !888)
!914 = !DILocation(line: 2425, column: 37, scope: !888)
!915 = !DILocation(line: 2426, column: 37, scope: !888)
!916 = !DILocation(line: 2427, column: 37, scope: !888)
!917 = !DILocalVariable(name: "self", arg: 1, scope: !918, file: !806, line: 2052, type: !922)
!918 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h4a0db8742b3484e1E", scope: !134, file: !806, line: 2052, type: !919, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !923)
!919 = !DISubroutineType(types: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!923 = !{!917}
!924 = !DILocation(line: 2052, column: 22, scope: !918, inlinedAt: !925)
!925 = distinct !DILocation(line: 2429, column: 50, scope: !888)
!926 = !DILocation(line: 2429, column: 26, scope: !888)
!927 = !DILocation(line: 2430, column: 14, scope: !888)
!928 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h51d224278974adbfE", scope: !131, file: !771, line: 2256, type: !929, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !931)
!929 = !DISubroutineType(types: !930)
!930 = !{!137, !715, !358}
!931 = !{!932, !933}
!932 = !DILocalVariable(name: "self", arg: 1, scope: !928, file: !771, line: 2256, type: !715)
!933 = !DILocalVariable(name: "order", arg: 2, scope: !928, file: !771, line: 2256, type: !358)
!934 = !DILocation(line: 2256, column: 25, scope: !928)
!935 = !DILocation(line: 2256, column: 32, scope: !928)
!936 = !DILocation(line: 2052, column: 22, scope: !918, inlinedAt: !937)
!937 = distinct !DILocation(line: 2258, column: 38, scope: !928)
!938 = !DILocation(line: 2258, column: 26, scope: !928)
!939 = !DILocation(line: 2259, column: 14, scope: !928)
!940 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h8db81433792b4502E", scope: !131, file: !771, line: 2283, type: !941, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !715, !137, !358}
!943 = !{!944, !945, !946}
!944 = !DILocalVariable(name: "self", arg: 1, scope: !940, file: !771, line: 2283, type: !715)
!945 = !DILocalVariable(name: "val", arg: 2, scope: !940, file: !771, line: 2283, type: !137)
!946 = !DILocalVariable(name: "order", arg: 3, scope: !940, file: !771, line: 2283, type: !358)
!947 = !DILocation(line: 2283, column: 26, scope: !940)
!948 = !DILocation(line: 2283, column: 33, scope: !940)
!949 = !DILocation(line: 2283, column: 49, scope: !940)
!950 = !DILocation(line: 2052, column: 22, scope: !918, inlinedAt: !951)
!951 = distinct !DILocation(line: 2285, column: 39, scope: !940)
!952 = !DILocation(line: 2285, column: 26, scope: !940)
!953 = !DILocation(line: 2286, column: 14, scope: !940)
!954 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17hc7887eee1c36bb0dE", scope: !25, file: !771, line: 3620, type: !761, scopeLine: 3620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!955 = !DILocation(line: 175, column: 18, scope: !956, inlinedAt: !957)
!956 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h72bd8a61093d3f07E", scope: !760, file: !759, line: 165, type: !761, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!957 = distinct !DILocation(line: 3621, column: 5, scope: !954)
!958 = !DILocation(line: 3622, column: 2, scope: !954)
!959 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h8ff210c5039a6318E", scope: !25, file: !771, line: 3215, type: !960, scopeLine: 3215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !962)
!960 = !DISubroutineType(types: !961)
!961 = !{!891, !921, !137, !137, !358, !358}
!962 = !{!963, !964, !965, !966, !967, !968, !970}
!963 = !DILocalVariable(name: "dst", arg: 1, scope: !959, file: !771, line: 3216, type: !921)
!964 = !DILocalVariable(name: "old", arg: 2, scope: !959, file: !771, line: 3217, type: !137)
!965 = !DILocalVariable(name: "new", arg: 3, scope: !959, file: !771, line: 3218, type: !137)
!966 = !DILocalVariable(name: "success", arg: 4, scope: !959, file: !771, line: 3219, type: !358)
!967 = !DILocalVariable(name: "failure", arg: 5, scope: !959, file: !771, line: 3220, type: !358)
!968 = !DILocalVariable(name: "val", scope: !969, file: !771, line: 3223, type: !137, align: 8)
!969 = distinct !DILexicalBlock(scope: !959, file: !771, line: 3223, column: 5)
!970 = !DILocalVariable(name: "ok", scope: !969, file: !771, line: 3223, type: !333, align: 1)
!971 = !DILocation(line: 3216, column: 5, scope: !959)
!972 = !DILocation(line: 3217, column: 5, scope: !959)
!973 = !DILocation(line: 3218, column: 5, scope: !959)
!974 = !DILocation(line: 3219, column: 5, scope: !959)
!975 = !DILocation(line: 3220, column: 5, scope: !959)
!976 = !DILocation(line: 3224, column: 15, scope: !959)
!977 = !DILocation(line: 3224, column: 9, scope: !959)
!978 = !DILocation(line: 3237, column: 34, scope: !959)
!979 = !DILocation(line: 3238, column: 34, scope: !959)
!980 = !DILocation(line: 3239, column: 33, scope: !959)
!981 = !DILocation(line: 3223, column: 10, scope: !959)
!982 = !DILocation(line: 3223, column: 10, scope: !969)
!983 = !DILocation(line: 3223, column: 15, scope: !959)
!984 = !DILocation(line: 3223, column: 15, scope: !969)
!985 = !DILocation(line: 3244, column: 8, scope: !969)
!986 = !DILocation(line: 3234, column: 34, scope: !959)
!987 = !DILocation(line: 3235, column: 34, scope: !959)
!988 = !DILocation(line: 3236, column: 33, scope: !959)
!989 = !DILocation(line: 3228, column: 35, scope: !959)
!990 = !DILocation(line: 3229, column: 35, scope: !959)
!991 = !DILocation(line: 3230, column: 34, scope: !959)
!992 = !DILocation(line: 3231, column: 35, scope: !959)
!993 = !DILocation(line: 3232, column: 35, scope: !959)
!994 = !DILocation(line: 3233, column: 34, scope: !959)
!995 = !DILocation(line: 3225, column: 35, scope: !959)
!996 = !DILocation(line: 3226, column: 35, scope: !959)
!997 = !DILocation(line: 3227, column: 34, scope: !959)
!998 = !DILocation(line: 3241, column: 29, scope: !959)
!999 = !DILocation(line: 3240, column: 28, scope: !959)
!1000 = !DILocation(line: 3244, column: 30, scope: !969)
!1001 = !DILocation(line: 3244, column: 5, scope: !969)
!1002 = !DILocation(line: 3244, column: 13, scope: !969)
!1003 = !DILocation(line: 3245, column: 2, scope: !959)
!1004 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h507e2001834c13b3E", scope: !25, file: !771, line: 3122, type: !1005, scopeLine: 3122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !1007)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!358, !358}
!1007 = !{!1008}
!1008 = !DILocalVariable(name: "order", arg: 1, scope: !1004, file: !771, line: 3122, type: !358)
!1009 = !DILocation(line: 3122, column: 31, scope: !1004)
!1010 = !DILocation(line: 3123, column: 11, scope: !1004)
!1011 = !DILocation(line: 3123, column: 5, scope: !1004)
!1012 = !DILocation(line: 3125, column: 20, scope: !1004)
!1013 = !DILocation(line: 3124, column: 20, scope: !1004)
!1014 = !DILocation(line: 3127, column: 20, scope: !1004)
!1015 = !DILocation(line: 3128, column: 19, scope: !1004)
!1016 = !DILocation(line: 3126, column: 19, scope: !1004)
!1017 = !DILocation(line: 3130, column: 2, scope: !1004)
!1018 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17h036066ac2675f1f3E", scope: !25, file: !771, line: 3250, type: !1019, scopeLine: 3250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !1036)
