; ModuleID = '3lk20s84a3xryytu'
source_filename = "3lk20s84a3xryytu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::rt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17hac48aa1eaf559515E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "16a7baa677b7b630759a580edfd1c98a")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "185ff687f884b2a787672b9674030b69")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "a0a62136649059d4ffb70c2050bf31eb")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "2390e62313a5f97b15d9722117a955de")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "9104ccfbfda95c7b820c7a9761849c1d")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "941eba023f5e0fd5b22a454bf3b2360d")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "8fab5e3bcf029ad899593b579a018a3f")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "ef862d222fbbcfb2302a4a6d7837d38c")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "3fb7ac1db018f7a835fc5cbfaed8a53a")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "4dbafc38130615ac3b4379996488a17d")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "e0ded7d762d2f7de34793474a4c2a257")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "bbef7cf807929d958310177484321be9")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "242ac2dd8ed3aa3418512189f9902102")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h205b18c28b9dab3dE", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "33cc1f38854344e64eecbe6de30a6054")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h36c419ad1e432dc2E", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "52717d1737e12dacc3d0c22ba3c209cd")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "a865f6ef71f9ef435bb28424bd43a85d")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h856e7e7ce66dd6b6E", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h0c415b714771907eE", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "6044f176f6826f27a137150c0343e53")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "d9c9aab1abd55aef912f7730280b1a0f")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "96aa113e1bfe90e7d61ad001f3b45ae5")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "3448ea56aa98dd3220ed64c0302dee9d")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "7ae51f1b861ed2a930ab7e3f40ad80cd")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "76ac813dd7eebdd4ed4d41c8d8299278")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "8463ad51b3ba1656879eb9639bdc67da", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "b279a17d7620c86160ccbba07cad2db")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "d5cfe62849c28d75dc9ee7787b5a7072")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "61ff581d89305d3a1e3112800d894f21")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "107b1f65a88f0c13be37311a9b3493db")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "f7ad0bf7afc0c6108d65924273a1b00e")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "a5867fa346c882c8c12e30bebac70631")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::InterruptDescriptorTable as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !190, templateParams: !18, identifier: "33861ff3d3104df123d657b6cd43346")
!184 = !{!185, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !6, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptDescriptorTable", scope: !191, file: !6, size: 32768, align: 128, elements: !192, templateParams: !18, identifier: "311c9b9ff039cc0ef0fe1e610f3b810c")
!191 = !DINamespace(name: "idt", scope: !92)
!192 = !{!193, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !269, !270, !271, !272, !293, !294, !295, !296, !314, !315, !316, !318, !319, !320, !321}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "divide_error", scope: !190, file: !6, baseType: !194, size: 128, align: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !191, file: !6, size: 128, align: 32, elements: !195, templateParams: !222, identifier: "171e9df7499988aaf6e9da18ef844b5b")
!195 = !{!196, !197, !198, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !194, file: !6, baseType: !55, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !194, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !191, file: !6, size: 16, align: 16, elements: !200, templateParams: !18, identifier: "5592dfd2062be2d91f128b0f03b8b90d")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !6, baseType: !55, size: 16, align: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !194, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !194, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !194, file: !6, baseType: !206, align: 8, offset: 128)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !207, identifier: "340f5ae25e8187e2f86520a9bb878fe")
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !210, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !191, file: !6, size: 320, align: 64, elements: !213, templateParams: !18, identifier: "5f280c6ac0e6eab8884f6b975a6d0f0e")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !6, baseType: !215, size: 320, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !191, file: !6, size: 320, align: 64, elements: !216, templateParams: !18, identifier: "3be99d543e6592ca6704e6cc7362b9fa")
!216 = !{!217, !218, !219, !220, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !215, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !215, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "F", type: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "non_maskable_interrupt", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "overflow", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bound_range_exceeded", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_opcode", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "device_not_available", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "double_fault", scope: !190, file: !6, baseType: !232, size: 128, align: 32, offset: 1024)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !233, templateParams: !248, identifier: "51f347da4eecc639ef6fd69f32008155")
!233 = !{!234, !235, !236, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !232, file: !6, baseType: !55, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !232, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !232, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !232, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !232, file: !6, baseType: !241, align: 8, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !242, identifier: "24d5549e54850ac7895116688834bdee")
!242 = !{!243}
!243 = !DITemplateTypeParameter(name: "T", type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !212, !102}
!247 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "F", type: !244)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "coprocessor_segment_overrun", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_tss", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1280)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !191, file: !6, size: 128, align: 32, elements: !253, templateParams: !267, identifier: "59b60b7a6bd44ba18158e502162579d9")
!253 = !{!254, !255, !256, !257, !258, !259, !260}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !252, file: !6, baseType: !55, size: 16, align: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !252, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !252, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !252, file: !6, baseType: !261, align: 8, offset: 128)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !262, identifier: "a98ca8f12ccf5761c7f937b6204bdeb")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !102}
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "F", type: !264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segment_not_present", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "general_protection_fault", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "page_fault", scope: !190, file: !6, baseType: !273, size: 128, align: 32, offset: 1792)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !191, file: !6, size: 128, align: 32, elements: !274, templateParams: !291, identifier: "ad1c5e7ae5b81c3ef7527e8bb8e85829")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !273, file: !6, baseType: !55, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !273, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !273, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !273, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !273, file: !6, baseType: !282, align: 8, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !283, identifier: "10bc7c5552fdac59ec9e652fa21135ea")
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !212, !288}
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !191, file: !6, size: 64, align: 64, elements: !289, templateParams: !18, identifier: "8f3e882a1793521be61f54c4c3fa8e16")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !288, file: !6, baseType: !102, size: 64, align: 64)
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "F", type: !285)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x87_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_check", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "machine_check", scope: !190, file: !6, baseType: !297, size: 128, align: 32, offset: 2304)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !191, file: !6, size: 128, align: 32, elements: !298, templateParams: !312, identifier: "7556d76a724377cfdaaa0b923fb77692")
!298 = !{!299, !300, !301, !302, !303, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !297, file: !6, baseType: !55, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !297, file: !6, baseType: !199, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !297, file: !6, baseType: !55, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !297, file: !6, baseType: !95, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !297, file: !6, baseType: !306, align: 8, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !307, identifier: "1833a67908d8e4a5d5e5542ce2fdb")
!307 = !{!308}
!308 = !DITemplateTypeParameter(name: "T", type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DISubroutineType(types: !311)
!311 = !{!247, !212}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "F", type: !309)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "simd_floating_point", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "virtualization", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !190, file: !6, baseType: !317, size: 1024, align: 32, offset: 2688)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1024, align: 32, elements: !161)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vmm_communication_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3712)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "security_exception", scope: !190, file: !6, baseType: !252, size: 128, align: 32, offset: 3840)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !190, file: !6, baseType: !194, size: 128, align: 32, offset: 3968)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !190, file: !6, baseType: !322, size: 28672, align: 32, offset: 4096)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 28672, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 224, lowerBound: 0)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !18, identifier: "b40b152e9971b32bdc56ea76d81ae47b")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !6, baseType: !186, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!333 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&bool as core::fmt::Debug>::{vtable}", scope: null, file: !6, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bool as core::fmt::Debug>::{vtable_type}", file: !6, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !18, identifier: "c7e817bcfe8ab7c0bbea3df07e9376b7")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !6, baseType: !186, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !6, baseType: !137, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !6, baseType: !186, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !370, splitDebugInlining: false)
!347 = !DIFile(filename: "src/lib.rs/@/3lk20s84a3xryytu", directory: "/Users/yaw/self/theo/cpu_interrupts")
!348 = !{!349, !357, !364}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !350, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !352)
!350 = !DINamespace(name: "rt", scope: !351)
!351 = !DINamespace(name: "fmt", scope: !17)
!352 = !{!353, !354, !355, !356}
!353 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!362 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!363 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!367 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!370 = !{!0, !77, !84, !113, !118, !181, !325, !334}
!371 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17ha86193c63c25ec61E", scope: !373, file: !372, line: 2287, type: !374, scopeLine: 2287, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !423)
!372 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef87442911d64d819773d1c3d54b7ba2")
!373 = !DINamespace(name: "{impl#12}", scope: !351)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !342, !394}
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !377, file: !6, size: 8, align: 8, elements: !378, templateParams: !18, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!377 = !DINamespace(name: "result", scope: !17)
!378 = !{!379}
!379 = !DICompositeType(tag: DW_TAG_variant_part, scope: !376, file: !6, size: 8, align: 8, elements: !380, templateParams: !18, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !393)
!380 = !{!381, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !379, file: !6, baseType: !382, size: 8, align: 8, extraData: i64 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !376, file: !6, size: 8, align: 8, elements: !383, templateParams: !385, identifier: "d91e207f895b5ed21304fa16506e0f28")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !6, baseType: !67, align: 8, offset: 8)
!385 = !{!386, !387}
!386 = !DITemplateTypeParameter(name: "T", type: !67)
!387 = !DITemplateTypeParameter(name: "E", type: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !351, file: !6, align: 8, elements: !18, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !379, file: !6, baseType: !390, size: 8, align: 8, extraData: i64 1)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !376, file: !6, size: 8, align: 8, elements: !391, templateParams: !385, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !6, baseType: !388, align: 8, offset: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !351, file: !6, size: 512, align: 64, elements: !396, templateParams: !18, identifier: "bc7f0caae71140a04b17743f5a695b51")
!396 = !{!397, !398, !400, !401, !413, !414}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !395, file: !6, baseType: !95, size: 32, align: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !395, file: !6, baseType: !399, size: 32, align: 32, offset: 384)
!399 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !395, file: !6, baseType: !349, size: 8, align: 8, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !395, file: !6, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !403, templateParams: !18, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!403 = !{!404}
!404 = !DICompositeType(tag: DW_TAG_variant_part, scope: !402, file: !6, size: 128, align: 64, elements: !405, templateParams: !18, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !412)
!405 = !{!406, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !404, file: !6, baseType: !407, size: 128, align: 64, extraData: i64 0)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !402, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "728f4cb196695ca2ab2ce43263435122")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !404, file: !6, baseType: !409, size: 128, align: 64, extraData: i64 1)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !402, file: !6, size: 128, align: 64, elements: !410, templateParams: !138, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !395, file: !6, baseType: !402, size: 128, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !395, file: !6, baseType: !415, size: 128, align: 64, offset: 256)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !416, templateParams: !18, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!416 = !{!417, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !415, file: !6, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64, dwarfAddressSpace: 0)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "a80c365aa420df7c35abe384a2fa122f")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !415, file: !6, baseType: !421, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !422, size: 64, align: 64, dwarfAddressSpace: 0)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!423 = !{!424, !425}
!424 = !DILocalVariable(name: "self", arg: 1, scope: !371, file: !372, line: 2287, type: !342)
!425 = !DILocalVariable(name: "f", arg: 2, scope: !371, file: !372, line: 2287, type: !394)
!426 = !DILocation(line: 2287, column: 12, scope: !371)
!427 = !DILocation(line: 2287, column: 19, scope: !371)
!428 = !DILocation(line: 2288, column: 9, scope: !371)
!429 = !DILocation(line: 2289, column: 6, scope: !371)
!430 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h03d9fd939482a2f5E", scope: !432, file: !431, line: 240, type: !434, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !450)
!431 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f61be3e42d6221d30b5488a425dbc01")
!432 = !DINamespace(name: "{impl#2}", scope: !433)
!433 = !DINamespace(name: "bit_field", scope: null)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !436, !137, !333, !437}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !439, file: !6, size: 192, align: 64, elements: !441, templateParams: !18, identifier: "58edb26be50e546f2f545926f1f4db80")
!439 = !DINamespace(name: "location", scope: !440)
!440 = !DINamespace(name: "panic", scope: !17)
!441 = !{!442, !448, !449}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !438, file: !6, baseType: !443, size: 128, align: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !444, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!444 = !{!445, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !443, file: !6, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !443, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !438, file: !6, baseType: !95, size: 32, align: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !438, file: !6, baseType: !95, size: 32, align: 32, offset: 160)
!450 = !{!451, !452, !453}
!451 = !DILocalVariable(name: "self", arg: 1, scope: !430, file: !431, line: 240, type: !436)
!452 = !DILocalVariable(name: "bit", arg: 2, scope: !430, file: !431, line: 240, type: !137)
!453 = !DILocalVariable(name: "value", arg: 3, scope: !430, file: !431, line: 240, type: !333)
!454 = !DILocation(line: 240, column: 24, scope: !430)
!455 = !DILocation(line: 240, column: 35, scope: !430)
!456 = !DILocation(line: 240, column: 47, scope: !430)
!457 = !DILocation(line: 241, column: 25, scope: !430)
!458 = !DILocation(line: 241, column: 17, scope: !430)
!459 = !DILocation(line: 243, column: 20, scope: !430)
!460 = !DILocation(line: 246, column: 31, scope: !430)
!461 = !DILocation(line: 244, column: 30, scope: !430)
!462 = !DILocation(line: 244, column: 21, scope: !430)
!463 = !DILocation(line: 243, column: 17, scope: !430)
!464 = !DILocation(line: 250, column: 14, scope: !430)
!465 = !DILocation(line: 246, column: 30, scope: !430)
!466 = !DILocation(line: 246, column: 21, scope: !430)
!467 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17h0d6861315206b05eE", scope: !432, file: !431, line: 254, type: !468, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !486, retainedNodes: !478)
!468 = !DISubroutineType(types: !469)
!469 = !{!436, !436, !470, !55, !437}
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !471, file: !6, size: 128, align: 64, elements: !473, templateParams: !476, identifier: "b280d2e9ec4e159a265eba43d83ca756")
!471 = !DINamespace(name: "range", scope: !472)
!472 = !DINamespace(name: "ops", scope: !17)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !470, file: !6, baseType: !137, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !470, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!476 = !{!477}
!477 = !DITemplateTypeParameter(name: "Idx", type: !137)
!478 = !{!479, !480, !481, !482, !484}
!479 = !DILocalVariable(name: "self", arg: 1, scope: !467, file: !431, line: 254, type: !436)
!480 = !DILocalVariable(name: "range", arg: 2, scope: !467, file: !431, line: 254, type: !470)
!481 = !DILocalVariable(name: "value", arg: 3, scope: !467, file: !431, line: 254, type: !55)
!482 = !DILocalVariable(name: "range", scope: !483, file: !431, line: 255, type: !470, align: 8)
!483 = distinct !DILexicalBlock(scope: !467, file: !431, line: 255, column: 17)
!484 = !DILocalVariable(name: "bitmask", scope: !485, file: !431, line: 264, type: !55, align: 2)
!485 = distinct !DILexicalBlock(scope: !483, file: !431, line: 264, column: 17)
!486 = !{!487}
!487 = !DITemplateTypeParameter(name: "T", type: !470)
!488 = !DILocation(line: 254, column: 48, scope: !467)
!489 = !DILocation(line: 254, column: 59, scope: !467)
!490 = !DILocation(line: 254, column: 69, scope: !467)
!491 = !DILocation(line: 255, column: 29, scope: !467)
!492 = !DILocation(line: 255, column: 21, scope: !483)
!493 = !DILocation(line: 257, column: 25, scope: !483)
!494 = !DILocation(line: 257, column: 17, scope: !483)
!495 = !DILocation(line: 258, column: 25, scope: !483)
!496 = !DILocation(line: 258, column: 17, scope: !483)
!497 = !DILocation(line: 259, column: 25, scope: !483)
!498 = !DILocation(line: 259, column: 17, scope: !483)
!499 = !DILocation(line: 260, column: 54, scope: !483)
!500 = !DILocation(line: 260, column: 34, scope: !483)
!501 = !DILocation(line: 260, column: 25, scope: !483)
!502 = !DILocation(line: 261, column: 45, scope: !483)
!503 = !DILocation(line: 261, column: 25, scope: !483)
!504 = !DILocation(line: 260, column: 17, scope: !483)
!505 = !DILocation(line: 264, column: 45, scope: !483)
!506 = !DILocation(line: 264, column: 39, scope: !483)
!507 = !DILocation(line: 265, column: 37, scope: !483)
!508 = !DILocation(line: 264, column: 38, scope: !483)
!509 = !DILocation(line: 264, column: 37, scope: !483)
!510 = !DILocation(line: 264, column: 21, scope: !485)
!511 = !DILocation(line: 269, column: 26, scope: !485)
!512 = !DILocation(line: 269, column: 25, scope: !485)
!513 = !DILocation(line: 269, column: 45, scope: !485)
!514 = !DILocation(line: 269, column: 17, scope: !485)
!515 = !DILocation(line: 272, column: 14, scope: !467)
!516 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h6dfd52fd324fc697E", scope: !517, file: !372, line: 322, type: !583, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !588)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !351, file: !6, size: 384, align: 64, elements: !518, templateParams: !18, identifier: "84f4de322c722d4ecf7f26fdd881a12a")
!518 = !{!519, !525, !567}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !517, file: !6, baseType: !520, size: 128, align: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !521, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !520, file: !6, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !520, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !517, file: !6, baseType: !526, size: 128, align: 64, offset: 256)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !145, file: !6, size: 128, align: 64, elements: !527, templateParams: !18, identifier: "45e7676749e8833fc9f6788a752fa233")
!527 = !{!528}
!528 = !DICompositeType(tag: DW_TAG_variant_part, scope: !526, file: !6, size: 128, align: 64, elements: !529, templateParams: !18, identifier: "78fc5675d20b0b054937c9b243721b04", discriminator: !566)
!529 = !{!530, !562}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !528, file: !6, baseType: !531, size: 128, align: 64, extraData: i64 0)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !526, file: !6, size: 128, align: 64, elements: !18, templateParams: !532, identifier: "7d6e0642c5fd326d5dedec8db5f1b626")
!532 = !{!533}
!533 = !DITemplateTypeParameter(name: "T", type: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !6, size: 128, align: 64, elements: !535, templateParams: !18, identifier: "2bdd0a1d249b9615818490cbe02637d0")
!535 = !{!536, !561}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !534, file: !6, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !350, file: !6, size: 448, align: 64, elements: !539, templateParams: !18, identifier: "60d1cd8e27ed5e572e6b6b32ddcefdd4")
!539 = !{!540, !541, !542, !543, !544, !560}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !538, file: !6, baseType: !137, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !538, file: !6, baseType: !399, size: 32, align: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !538, file: !6, baseType: !349, size: 8, align: 8, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !538, file: !6, baseType: !95, size: 32, align: 32, offset: 352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !538, file: !6, baseType: !545, size: 128, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !350, file: !6, size: 128, align: 64, elements: !546, templateParams: !18, identifier: "8e436bf796d1bd1040afe66a54932e93")
!546 = !{!547}
!547 = !DICompositeType(tag: DW_TAG_variant_part, scope: !545, file: !6, size: 128, align: 64, elements: !548, templateParams: !18, identifier: "a16b1bf0ef6abe7338d550f54b3197c9", discriminator: !559)
!548 = !{!549, !553, !557}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !547, file: !6, baseType: !550, size: 128, align: 64, extraData: i64 0)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !545, file: !6, size: 128, align: 64, elements: !551, templateParams: !18, identifier: "bb2788de63ecf655614eae44833a9683")
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !550, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !547, file: !6, baseType: !554, size: 128, align: 64, extraData: i64 1)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !545, file: !6, size: 128, align: 64, elements: !555, templateParams: !18, identifier: "45b8dfec94a90db1ad28af7e19954195")
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !554, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !547, file: !6, baseType: !558, size: 128, align: 64, extraData: i64 2)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !545, file: !6, size: 128, align: 64, elements: !18, identifier: "b2dd58a70f39c2d6f76f6e2aef3afc0e")
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !545, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !538, file: !6, baseType: !545, size: 128, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !534, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !528, file: !6, baseType: !563, size: 128, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !526, file: !6, size: 128, align: 64, elements: !564, templateParams: !532, identifier: "17825c15133f27503bca321877d808b")
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !563, file: !6, baseType: !534, size: 128, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, scope: !526, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !517, file: !6, baseType: !568, size: 128, align: 64, offset: 128)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !6, size: 128, align: 64, elements: !569, templateParams: !18, identifier: "b8c00ffcd99aa185b2b067e76efe6873")
!569 = !{!570, !582}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !568, file: !6, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64, dwarfAddressSpace: 0)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !350, file: !6, size: 128, align: 64, elements: !573, templateParams: !18, identifier: "92df9959c1cdfbcdd7133c99bcf5419")
!573 = !{!574, !578}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !572, file: !6, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !576, size: 64, align: 64, dwarfAddressSpace: 0)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !577, file: !6, align: 8, elements: !18, identifier: "9b221ef387fa4c24dae3649531e7392e")
!577 = !DINamespace(name: "{extern#0}", scope: !350)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !572, file: !6, baseType: !579, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !580, size: 64, align: 64, dwarfAddressSpace: 0)
!580 = !DISubroutineType(types: !581)
!581 = !{!376, !575, !394}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !568, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!517, !520, !568, !534, !585}
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !350, file: !6, align: 8, elements: !586, templateParams: !18, identifier: "55fe6b511cd99a799fff4683a92f71be")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !585, file: !6, baseType: !67, align: 8)
!588 = !{!589, !590, !591, !592, !593}
!589 = !DILocalVariable(name: "pieces", arg: 1, scope: !516, file: !372, line: 323, type: !520)
!590 = !DILocalVariable(name: "args", arg: 2, scope: !516, file: !372, line: 324, type: !568)
!591 = !DILocalVariable(name: "fmt", arg: 3, scope: !516, file: !372, line: 325, type: !534)
!592 = !DILocalVariable(name: "_unsafe_arg", scope: !516, file: !372, line: 326, type: !585, align: 1)
!593 = !DILocalVariable(arg: 4, scope: !516, file: !372, line: 326, type: !585)
!594 = !DILocation(line: 326, column: 9, scope: !516)
!595 = !DILocation(line: 323, column: 9, scope: !516)
!596 = !DILocation(line: 324, column: 9, scope: !516)
!597 = !DILocation(line: 325, column: 9, scope: !516)
!598 = !DILocation(line: 328, column: 34, scope: !516)
!599 = !DILocation(line: 328, column: 9, scope: !516)
!600 = !{i64 8}
!601 = !DILocation(line: 329, column: 6, scope: !516)
!602 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h8bb0d7a95a864955E", scope: !517, file: !372, line: 297, type: !603, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!517, !520}
!605 = !{!606}
!606 = !DILocalVariable(name: "pieces", arg: 1, scope: !602, file: !372, line: 297, type: !520)
!607 = !DILocation(line: 297, column: 28, scope: !602)
!608 = !DILocation(line: 298, column: 12, scope: !602)
!609 = !DILocation(line: 301, column: 34, scope: !602)
!610 = !DILocation(line: 301, column: 9, scope: !602)
!611 = !DILocation(line: 302, column: 6, scope: !602)
!612 = !DILocation(line: 299, column: 13, scope: !602)
!613 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5f03c300065cb193E", scope: !615, file: !614, line: 250, type: !617, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !625, retainedNodes: !622)
!614 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfb73adf0f4bb6df3856d6eaf613e707")
!615 = !DINamespace(name: "FnOnce", scope: !616)
!616 = !DINamespace(name: "function", scope: !472)
!617 = !DISubroutineType(types: !618)
!618 = !{!153, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !620, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !DISubroutineType(types: !621)
!621 = !{!153}
!622 = !{!623, !624}
!623 = !DILocalVariable(arg: 1, scope: !613, file: !614, line: 250, type: !619)
!624 = !DILocalVariable(arg: 2, scope: !613, file: !614, line: 250, type: !67)
!625 = !{!626, !627}
!626 = !DITemplateTypeParameter(name: "Self", type: !619)
!627 = !DITemplateTypeParameter(name: "Args", type: !67)
!628 = !DILocation(line: 250, column: 5, scope: !613)
!629 = !DILocalVariable(name: "global_descriptor_table", scope: !630, file: !89, line: 26, type: !156, align: 8)
!630 = distinct !DILexicalBlock(scope: !631, file: !89, line: 26, column: 9)
!631 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17he8c0cfb909787e33E", scope: !87, file: !80, line: 137, type: !620, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !632)
!632 = !{!629, !633, !635, !637, !639}
!633 = !DILocalVariable(name: "stack_start", scope: !634, file: !89, line: 31, type: !98, align: 8)
!634 = distinct !DILexicalBlock(scope: !630, file: !89, line: 31, column: 17)
!635 = !DILocalVariable(name: "stack_end", scope: !636, file: !89, line: 32, type: !98, align: 8)
!636 = distinct !DILexicalBlock(scope: !634, file: !89, line: 32, column: 17)
!637 = !DILocalVariable(name: "tss_selector", scope: !638, file: !89, line: 38, type: !168, align: 2)
!638 = distinct !DILexicalBlock(scope: !630, file: !89, line: 38, column: 9)
!639 = !DILocalVariable(name: "code_selector", scope: !640, file: !89, line: 39, type: !168, align: 2)
!640 = distinct !DILexicalBlock(scope: !638, file: !89, line: 39, column: 9)
!641 = !DILocation(line: 26, column: 13, scope: !630, inlinedAt: !642)
!642 = distinct !DILocation(line: 250, column: 5, scope: !613)
!643 = !DILocation(line: 26, column: 43, scope: !644, inlinedAt: !642)
!644 = !DILexicalBlockFile(scope: !631, file: !89, discriminator: 0)
!645 = !DILocation(line: 31, column: 35, scope: !630, inlinedAt: !642)
!646 = !DILocation(line: 31, column: 21, scope: !634, inlinedAt: !642)
!647 = !DILocation(line: 32, column: 33, scope: !634, inlinedAt: !642)
!648 = !DILocation(line: 32, column: 21, scope: !636, inlinedAt: !642)
!649 = !DILocation(line: 29, column: 13, scope: !630, inlinedAt: !642)
!650 = !DILocation(line: 38, column: 62, scope: !630, inlinedAt: !642)
!651 = !DILocation(line: 38, column: 28, scope: !630, inlinedAt: !642)
!652 = !DILocation(line: 38, column: 13, scope: !638, inlinedAt: !642)
!653 = !DILocation(line: 39, column: 63, scope: !638, inlinedAt: !642)
!654 = !DILocation(line: 39, column: 29, scope: !638, inlinedAt: !642)
!655 = !DILocation(line: 39, column: 13, scope: !640, inlinedAt: !642)
!656 = !DILocation(line: 41, column: 20, scope: !640, inlinedAt: !642)
!657 = !DILocation(line: 42, column: 24, scope: !640, inlinedAt: !642)
!658 = !DILocation(line: 40, column: 9, scope: !640, inlinedAt: !642)
!659 = distinct !DISubprogram(name: "drop_in_place<bool>", linkageName: "_ZN4core3ptr25drop_in_place$LT$bool$GT$17h53fe24c7b9382d8fE", scope: !661, file: !660, line: 491, type: !662, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !667, retainedNodes: !665)
!660 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d71cbcc5c5af3689983c051fcd9aec72")
!661 = !DINamespace(name: "ptr", scope: !17)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bool", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!665 = !{!666}
!666 = !DILocalVariable(arg: 1, scope: !659, file: !660, line: 491, type: !664)
!667 = !{!668}
!668 = !DITemplateTypeParameter(name: "T", type: !333)
!669 = !DILocation(line: 491, column: 1, scope: !659)
!670 = distinct !DISubprogram(name: "drop_in_place<&bool>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$bool$GT$17h18a1561383922ab7E", scope: !661, file: !660, line: 491, type: !671, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !676, retainedNodes: !674)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &bool", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!674 = !{!675}
!675 = !DILocalVariable(arg: 1, scope: !670, file: !660, line: 491, type: !673)
!676 = !{!677}
!677 = !DITemplateTypeParameter(name: "T", type: !342)
!678 = !DILocation(line: 491, column: 1, scope: !670)
!679 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h7c1ce08ad12013a7E", scope: !661, file: !660, line: 491, type: !680, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !690, retainedNodes: !688)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !683, size: 64, align: 64, dwarfAddressSpace: 0)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !684, templateParams: !18, identifier: "2aae495052e71a6af790341801ada65b")
!684 = !{!685, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !683, file: !6, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !683, file: !6, baseType: !333, size: 8, align: 8, offset: 64)
!688 = !{!689}
!689 = !DILocalVariable(arg: 1, scope: !679, file: !660, line: 491, type: !682)
!690 = !{!691}
!691 = !DITemplateTypeParameter(name: "T", type: !683)
!692 = !DILocation(line: 491, column: 1, scope: !679)
!693 = distinct !DISubprogram(name: "drop_in_place<x86_64::structures::idt::InterruptDescriptorTable>", linkageName: "_ZN4core3ptr70drop_in_place$LT$x86_64..structures..idt..InterruptDescriptorTable$GT$17hb8fd878bd5ed67c0E", scope: !661, file: !660, line: 491, type: !694, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !699, retainedNodes: !697)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut x86_64::structures::idt::InterruptDescriptorTable", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!697 = !{!698}
!698 = !DILocalVariable(arg: 1, scope: !693, file: !660, line: 491, type: !696)
!699 = !{!700}
!700 = !DITemplateTypeParameter(name: "T", type: !190)
!701 = !DILocation(line: 491, column: 1, scope: !693)
!702 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17hf95058d496d084ddE", scope: !661, file: !660, line: 491, type: !703, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !717, retainedNodes: !715)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !706, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !707, templateParams: !73, identifier: "d7c602c7a23e2c1ddbcd08b74b317715")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !706, file: !6, baseType: !709, size: 128, align: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !710, templateParams: !73, identifier: "50a6c0939d56a216b017bcc30486fa10")
!710 = !{!711, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !6, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !709, file: !6, baseType: !714, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !{!716}
!716 = !DILocalVariable(arg: 1, scope: !702, file: !660, line: 491, type: !705)
!717 = !{!718}
!718 = !DITemplateTypeParameter(name: "T", type: !706)
!719 = !DILocation(line: 491, column: 1, scope: !702)
!720 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h792bb9d7ebecfd56E", scope: !661, file: !660, line: 491, type: !721, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !726, retainedNodes: !724)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !709, size: 64, align: 64, dwarfAddressSpace: 0)
!724 = !{!725}
!725 = !DILocalVariable(arg: 1, scope: !720, file: !660, line: 491, type: !723)
!726 = !{!727}
!727 = !DITemplateTypeParameter(name: "T", type: !709)
!728 = !DILocation(line: 491, column: 1, scope: !720)
!729 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17he471e1ecc6f444bbE", scope: !731, file: !730, line: 100, type: !732, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!730 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "abfb30215b829e2044a72c49db9551bc")
!731 = !DINamespace(name: "hint", scope: !17)
!732 = !DISubroutineType(types: !733)
!733 = !{null}
!734 = !DILocation(line: 104, column: 9, scope: !729)
!735 = !DILocation(line: 105, column: 9, scope: !729)
!736 = !DILocation(line: 2520, column: 21, scope: !737, inlinedAt: !740)
!737 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17hdb17e597162472c0E", scope: !739, file: !738, line: 2517, type: !732, scopeLine: 2517, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!738 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "828a1b4d689988a3236fbcb09678e111")
!739 = !DINamespace(name: "unreachable_unchecked", scope: !731)
!740 = distinct !DILocation(line: 104, column: 9, scope: !729)
!741 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17h01e2a82ac4868018E", scope: !24, file: !742, line: 715, type: !743, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !760)
!742 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "f10535d78bf61205f540f8fe0965908b")
!743 = !DISubroutineType(types: !744)
!744 = !{!745, !712, !333, !333, !357, !357}
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !377, file: !6, size: 16, align: 8, elements: !746, templateParams: !18, identifier: "243c16ee3549a77c495c12d4a45d42eb")
!746 = !{!747}
!747 = !DICompositeType(tag: DW_TAG_variant_part, scope: !745, file: !6, size: 16, align: 8, elements: !748, templateParams: !18, identifier: "fe7d689cdb74efde44bed42e1aec90d9", discriminator: !759)
!748 = !{!749, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !747, file: !6, baseType: !750, size: 16, align: 8, extraData: i64 0)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !745, file: !6, size: 16, align: 8, elements: !751, templateParams: !753, identifier: "7dd1c43f7ac93af65a618176918fbdac")
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !750, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!753 = !{!668, !754}
!754 = !DITemplateTypeParameter(name: "E", type: !333)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !747, file: !6, baseType: !756, size: 16, align: 8, extraData: i64 1)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !745, file: !6, size: 16, align: 8, elements: !757, templateParams: !753, identifier: "49652125230242b7fcef80691ca537e5")
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !756, file: !6, baseType: !333, size: 8, align: 8, offset: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, scope: !745, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!760 = !{!761, !762, !763, !764, !765, !766, !768}
!761 = !DILocalVariable(name: "self", arg: 1, scope: !741, file: !742, line: 716, type: !712)
!762 = !DILocalVariable(name: "current", arg: 2, scope: !741, file: !742, line: 717, type: !333)
!763 = !DILocalVariable(name: "new", arg: 3, scope: !741, file: !742, line: 718, type: !333)
!764 = !DILocalVariable(name: "success", arg: 4, scope: !741, file: !742, line: 719, type: !357)
!765 = !DILocalVariable(name: "failure", arg: 5, scope: !741, file: !742, line: 720, type: !357)
!766 = !DILocalVariable(name: "x", scope: !767, file: !742, line: 726, type: !33, align: 1)
!767 = distinct !DILexicalBlock(scope: !741, file: !742, line: 726, column: 13)
!768 = !DILocalVariable(name: "x", scope: !769, file: !742, line: 727, type: !33, align: 1)
!769 = distinct !DILexicalBlock(scope: !741, file: !742, line: 727, column: 13)
!770 = !DILocation(line: 716, column: 9, scope: !741)
!771 = !DILocation(line: 717, column: 9, scope: !741)
!772 = !DILocation(line: 718, column: 9, scope: !741)
!773 = !DILocation(line: 719, column: 9, scope: !741)
!774 = !DILocation(line: 720, column: 9, scope: !741)
!775 = !DILocalVariable(name: "self", arg: 1, scope: !776, file: !777, line: 2052, type: !781)
!776 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha89845a4c576e2dbE", scope: !29, file: !777, line: 2052, type: !778, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !782)
!777 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece7037919146d853ca689245947aa67")
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!782 = !{!775}
!783 = !DILocation(line: 2052, column: 22, scope: !776, inlinedAt: !784)
!784 = distinct !DILocation(line: 724, column: 42, scope: !741)
!785 = !DILocation(line: 724, column: 56, scope: !741)
!786 = !DILocation(line: 724, column: 71, scope: !741)
!787 = !DILocation(line: 724, column: 13, scope: !741)
!788 = !DILocation(line: 723, column: 15, scope: !741)
!789 = !{i8 0, i8 2}
!790 = !DILocation(line: 723, column: 9, scope: !741)
!791 = !DILocation(line: 726, column: 16, scope: !741)
!792 = !DILocation(line: 726, column: 16, scope: !767)
!793 = !DILocation(line: 726, column: 25, scope: !767)
!794 = !DILocation(line: 726, column: 22, scope: !767)
!795 = !DILocation(line: 726, column: 31, scope: !741)
!796 = !DILocation(line: 727, column: 17, scope: !741)
!797 = !DILocation(line: 727, column: 17, scope: !769)
!798 = !DILocation(line: 727, column: 27, scope: !769)
!799 = !DILocation(line: 727, column: 23, scope: !769)
!800 = !DILocation(line: 727, column: 33, scope: !741)
!801 = !DILocation(line: 729, column: 6, scope: !741)
!802 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17ha685bba0641fba9bE", scope: !24, file: !742, line: 495, type: !803, scopeLine: 495, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!333, !712, !357}
!805 = !{!806, !807}
!806 = !DILocalVariable(name: "self", arg: 1, scope: !802, file: !742, line: 495, type: !712)
!807 = !DILocalVariable(name: "order", arg: 2, scope: !802, file: !742, line: 495, type: !357)
!808 = !DILocation(line: 495, column: 17, scope: !802)
!809 = !DILocation(line: 495, column: 24, scope: !802)
!810 = !DILocation(line: 2052, column: 22, scope: !776, inlinedAt: !811)
!811 = distinct !DILocation(line: 498, column: 30, scope: !802)
!812 = !DILocation(line: 498, column: 18, scope: !802)
!813 = !DILocation(line: 499, column: 6, scope: !802)
!814 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h90f06990783af536E", scope: !24, file: !742, line: 523, type: !815, scopeLine: 523, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !712, !333, !357}
!817 = !{!818, !819, !820}
!818 = !DILocalVariable(name: "self", arg: 1, scope: !814, file: !742, line: 523, type: !712)
!819 = !DILocalVariable(name: "val", arg: 2, scope: !814, file: !742, line: 523, type: !333)
!820 = !DILocalVariable(name: "order", arg: 3, scope: !814, file: !742, line: 523, type: !357)
!821 = !DILocation(line: 523, column: 18, scope: !814)
!822 = !DILocation(line: 523, column: 25, scope: !814)
!823 = !DILocation(line: 523, column: 36, scope: !814)
!824 = !DILocation(line: 2052, column: 22, scope: !776, inlinedAt: !825)
!825 = distinct !DILocation(line: 527, column: 26, scope: !814)
!826 = !DILocation(line: 527, column: 40, scope: !814)
!827 = !DILocation(line: 527, column: 13, scope: !814)
!828 = !DILocation(line: 529, column: 6, scope: !814)
!829 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h5bf7d246cc4ffa4eE", scope: !131, file: !742, line: 2369, type: !830, scopeLine: 2369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!137, !686, !137, !137, !357}
!832 = !{!833, !834, !835, !836, !837, !839}
!833 = !DILocalVariable(name: "self", arg: 1, scope: !829, file: !742, line: 2369, type: !686)
!834 = !DILocalVariable(name: "current", arg: 2, scope: !829, file: !742, line: 2370, type: !137)
!835 = !DILocalVariable(name: "new", arg: 3, scope: !829, file: !742, line: 2371, type: !137)
!836 = !DILocalVariable(name: "order", arg: 4, scope: !829, file: !742, line: 2372, type: !357)
!837 = !DILocalVariable(name: "x", scope: !838, file: !742, line: 2377, type: !137, align: 8)
!838 = distinct !DILexicalBlock(scope: !829, file: !742, line: 2377, column: 21)
!839 = !DILocalVariable(name: "x", scope: !840, file: !742, line: 2378, type: !137, align: 8)
!840 = distinct !DILexicalBlock(scope: !829, file: !742, line: 2378, column: 21)
!841 = !DILocation(line: 2369, column: 37, scope: !829)
!842 = !DILocation(line: 2370, column: 37, scope: !829)
!843 = !DILocation(line: 2371, column: 37, scope: !829)
!844 = !DILocation(line: 2372, column: 37, scope: !829)
!845 = !DILocation(line: 2376, column: 45, scope: !829)
!846 = !{i8 0, i8 5}
!847 = !DILocation(line: 2373, column: 23, scope: !829)
!848 = !{i64 0, i64 2}
!849 = !DILocation(line: 2373, column: 17, scope: !829)
!850 = !DILocation(line: 2377, column: 24, scope: !829)
!851 = !DILocation(line: 2377, column: 24, scope: !838)
!852 = !DILocation(line: 2377, column: 30, scope: !838)
!853 = !DILocation(line: 2377, column: 30, scope: !829)
!854 = !DILocation(line: 2378, column: 25, scope: !829)
!855 = !DILocation(line: 2378, column: 25, scope: !840)
!856 = !DILocation(line: 2378, column: 31, scope: !840)
!857 = !DILocation(line: 2378, column: 31, scope: !829)
!858 = !DILocation(line: 2380, column: 14, scope: !829)
!859 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17h0dbbcc55305d2b89E", scope: !131, file: !742, line: 2423, type: !860, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !877)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !686, !137, !137, !357, !357}
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !377, file: !6, size: 128, align: 64, elements: !863, templateParams: !18, identifier: "dc40937eb7604fa8a57b55ee34a785aa")
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_variant_part, scope: !862, file: !6, size: 128, align: 64, elements: !865, templateParams: !18, identifier: "5be90c2a1f84b751d4e1278c6318028c", discriminator: !876)
!865 = !{!866, !872}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !864, file: !6, baseType: !867, size: 128, align: 64, extraData: i64 0)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !862, file: !6, size: 128, align: 64, elements: !868, templateParams: !870, identifier: "8ce7049e600fdbf9b9a4b3bb7fde012e")
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !867, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!870 = !{!139, !871}
!871 = !DITemplateTypeParameter(name: "E", type: !137)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !864, file: !6, baseType: !873, size: 128, align: 64, extraData: i64 1)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !862, file: !6, size: 128, align: 64, elements: !874, templateParams: !870, identifier: "7e5ba0d9012ef8eb6d31de213441728d")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !873, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DILocalVariable(name: "self", arg: 1, scope: !859, file: !742, line: 2423, type: !686)
!879 = !DILocalVariable(name: "current", arg: 2, scope: !859, file: !742, line: 2424, type: !137)
!880 = !DILocalVariable(name: "new", arg: 3, scope: !859, file: !742, line: 2425, type: !137)
!881 = !DILocalVariable(name: "success", arg: 4, scope: !859, file: !742, line: 2426, type: !357)
!882 = !DILocalVariable(name: "failure", arg: 5, scope: !859, file: !742, line: 2427, type: !357)
!883 = !DILocation(line: 2423, column: 37, scope: !859)
!884 = !DILocation(line: 2424, column: 37, scope: !859)
!885 = !DILocation(line: 2425, column: 37, scope: !859)
!886 = !DILocation(line: 2426, column: 37, scope: !859)
!887 = !DILocation(line: 2427, column: 37, scope: !859)
!888 = !DILocalVariable(name: "self", arg: 1, scope: !889, file: !777, line: 2052, type: !893)
!889 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h5e73a6faa470f33fE", scope: !134, file: !777, line: 2052, type: !890, scopeLine: 2052, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !894)
!890 = !DISubroutineType(types: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!894 = !{!888}
!895 = !DILocation(line: 2052, column: 22, scope: !889, inlinedAt: !896)
!896 = distinct !DILocation(line: 2429, column: 50, scope: !859)
!897 = !DILocation(line: 2429, column: 26, scope: !859)
!898 = !DILocation(line: 2430, column: 14, scope: !859)
!899 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hcdaacd5933adaba7E", scope: !131, file: !742, line: 2256, type: !900, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!137, !686, !357}
!902 = !{!903, !904}
!903 = !DILocalVariable(name: "self", arg: 1, scope: !899, file: !742, line: 2256, type: !686)
!904 = !DILocalVariable(name: "order", arg: 2, scope: !899, file: !742, line: 2256, type: !357)
!905 = !DILocation(line: 2256, column: 25, scope: !899)
!906 = !DILocation(line: 2256, column: 32, scope: !899)
!907 = !DILocation(line: 2052, column: 22, scope: !889, inlinedAt: !908)
!908 = distinct !DILocation(line: 2258, column: 38, scope: !899)
!909 = !DILocation(line: 2258, column: 26, scope: !899)
!910 = !DILocation(line: 2259, column: 14, scope: !899)
!911 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17hb4bc0b0a3cd83c63E", scope: !131, file: !742, line: 2283, type: !912, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !914)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !686, !137, !357}
!914 = !{!915, !916, !917}
!915 = !DILocalVariable(name: "self", arg: 1, scope: !911, file: !742, line: 2283, type: !686)
!916 = !DILocalVariable(name: "val", arg: 2, scope: !911, file: !742, line: 2283, type: !137)
!917 = !DILocalVariable(name: "order", arg: 3, scope: !911, file: !742, line: 2283, type: !357)
!918 = !DILocation(line: 2283, column: 26, scope: !911)
!919 = !DILocation(line: 2283, column: 33, scope: !911)
!920 = !DILocation(line: 2283, column: 49, scope: !911)
!921 = !DILocation(line: 2052, column: 22, scope: !889, inlinedAt: !922)
!922 = distinct !DILocation(line: 2285, column: 39, scope: !911)
!923 = !DILocation(line: 2285, column: 26, scope: !911)
!924 = !DILocation(line: 2286, column: 14, scope: !911)
!925 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17hb4083ccf624b5097E", scope: !25, file: !742, line: 3620, type: !732, scopeLine: 3620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!926 = !DILocation(line: 175, column: 18, scope: !927, inlinedAt: !928)
!927 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17hc0e2a9f594bad71dE", scope: !731, file: !730, line: 165, type: !732, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !18)
!928 = distinct !DILocation(line: 3621, column: 5, scope: !925)
!929 = !DILocation(line: 3622, column: 2, scope: !925)
!930 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h04671c1c1ba40b52E", scope: !25, file: !742, line: 3215, type: !931, scopeLine: 3215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !138, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!862, !892, !137, !137, !357, !357}
!933 = !{!934, !935, !936, !937, !938, !939, !941}
!934 = !DILocalVariable(name: "dst", arg: 1, scope: !930, file: !742, line: 3216, type: !892)
!935 = !DILocalVariable(name: "old", arg: 2, scope: !930, file: !742, line: 3217, type: !137)
!936 = !DILocalVariable(name: "new", arg: 3, scope: !930, file: !742, line: 3218, type: !137)
!937 = !DILocalVariable(name: "success", arg: 4, scope: !930, file: !742, line: 3219, type: !357)
!938 = !DILocalVariable(name: "failure", arg: 5, scope: !930, file: !742, line: 3220, type: !357)
!939 = !DILocalVariable(name: "val", scope: !940, file: !742, line: 3223, type: !137, align: 8)
!940 = distinct !DILexicalBlock(scope: !930, file: !742, line: 3223, column: 5)
!941 = !DILocalVariable(name: "ok", scope: !940, file: !742, line: 3223, type: !333, align: 1)
!942 = !DILocation(line: 3216, column: 5, scope: !930)
!943 = !DILocation(line: 3217, column: 5, scope: !930)
!944 = !DILocation(line: 3218, column: 5, scope: !930)
!945 = !DILocation(line: 3219, column: 5, scope: !930)
!946 = !DILocation(line: 3220, column: 5, scope: !930)
!947 = !DILocation(line: 3224, column: 15, scope: !930)
!948 = !DILocation(line: 3224, column: 9, scope: !930)
!949 = !DILocation(line: 3237, column: 34, scope: !930)
!950 = !DILocation(line: 3238, column: 34, scope: !930)
!951 = !DILocation(line: 3239, column: 33, scope: !930)
!952 = !DILocation(line: 3223, column: 10, scope: !930)
!953 = !DILocation(line: 3223, column: 10, scope: !940)
!954 = !DILocation(line: 3223, column: 15, scope: !930)
!955 = !DILocation(line: 3223, column: 15, scope: !940)
!956 = !DILocation(line: 3244, column: 8, scope: !940)
!957 = !DILocation(line: 3234, column: 34, scope: !930)
!958 = !DILocation(line: 3235, column: 34, scope: !930)
!959 = !DILocation(line: 3236, column: 33, scope: !930)
!960 = !DILocation(line: 3228, column: 35, scope: !930)
!961 = !DILocation(line: 3229, column: 35, scope: !930)
!962 = !DILocation(line: 3230, column: 34, scope: !930)
!963 = !DILocation(line: 3231, column: 35, scope: !930)
!964 = !DILocation(line: 3232, column: 35, scope: !930)
!965 = !DILocation(line: 3233, column: 34, scope: !930)
!966 = !DILocation(line: 3225, column: 35, scope: !930)
!967 = !DILocation(line: 3226, column: 35, scope: !930)
!968 = !DILocation(line: 3227, column: 34, scope: !930)
!969 = !DILocation(line: 3241, column: 29, scope: !930)
!970 = !DILocation(line: 3240, column: 28, scope: !930)
!971 = !DILocation(line: 3244, column: 30, scope: !940)
!972 = !DILocation(line: 3244, column: 5, scope: !940)
!973 = !DILocation(line: 3244, column: 13, scope: !940)
!974 = !DILocation(line: 3245, column: 2, scope: !930)
!975 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h3217dca694206238E", scope: !25, file: !742, line: 3122, type: !976, scopeLine: 3122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !18, retainedNodes: !978)
!976 = !DISubroutineType(types: !977)
!977 = !{!357, !357}
!978 = !{!979}
!979 = !DILocalVariable(name: "order", arg: 1, scope: !975, file: !742, line: 3122, type: !357)
!980 = !DILocation(line: 3122, column: 31, scope: !975)
!981 = !DILocation(line: 3123, column: 11, scope: !975)
!982 = !DILocation(line: 3123, column: 5, scope: !975)
!983 = !DILocation(line: 3125, column: 20, scope: !975)
!984 = !DILocation(line: 3124, column: 20, scope: !975)
!985 = !DILocation(line: 3127, column: 20, scope: !975)
!986 = !DILocation(line: 3128, column: 19, scope: !975)
!987 = !DILocation(line: 3126, column: 19, scope: !975)
!988 = !DILocation(line: 3130, column: 2, scope: !975)
!989 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17hd59bf70a22d08731E", scope: !25, file: !742, line: 3250, type: !990, scopeLine: 3250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !34, retainedNodes: !1007)
!990 = !DISubroutineType(types: !991)
!991 = !{!992, !780, !33, !33, !357, !357}
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !377, file: !6, size: 16, align: 8, elements: !993, templateParams: !18, identifier: "6454292fe76dcef0d3c7ac6f979fc3c4")
!993 = !{!994}
!994 = !DICompositeType(tag: DW_TAG_variant_part, scope: !992, file: !6, size: 16, align: 8, elements: !995, templateParams: !18, identifier: "74009d0f851463fb9a28525cc95da81c", discriminator: !1006)
!995 = !{!996, !1002}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !994, file: !6, baseType: !997, size: 16, align: 8, extraData: i64 0)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !992, file: !6, size: 16, align: 8, elements: !998, templateParams: !1000, identifier: "66afbc5e3aeff6763455f8c12cbb939d")
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !997, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!1000 = !{!35, !1001}
!1001 = !DITemplateTypeParameter(name: "E", type: !33)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !994, file: !6, baseType: !1003, size: 16, align: 8, extraData: i64 1)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !992, file: !6, size: 16, align: 8, elements: !1004, templateParams: !1000, identifier: "453532df0f24709676b2334af44ad65f")
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1003, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1015}
!1008 = !DILocalVariable(name: "dst", arg: 1, scope: !989, file: !742, line: 3251, type: !780)
!1009 = !DILocalVariable(name: "old", arg: 2, scope: !989, file: !742, line: 3252, type: !33)
!1010 = !DILocalVariable(name: "new", arg: 3, scope: !989, file: !742, line: 3253, type: !33)
!1011 = !DILocalVariable(name: "success", arg: 4, scope: !989, file: !742, line: 3254, type: !357)
!1012 = !DILocalVariable(name: "failure", arg: 5, scope: !989, file: !742, line: 3255, type: !357)
!1013 = !DILocalVariable(name: "val", scope: !1014, file: !742, line: 3258, type: !33, align: 1)
!1014 = distinct !DILexicalBlock(scope: !989, file: !742, line: 3258, column: 5)
!1015 = !DILocalVariable(name: "ok", scope: !1014, file: !742, line: 3258, type: !333, align: 1)
