; ModuleID = '24p5le0580rpefah'
source_filename = "24p5le0580rpefah"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>::Some" = type { [1 x i64], %"x86_64::structures::gdt::GlobalDescriptorTable" }
%"core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>" = type { i64, [9 x i64] }
%"spin::once::Once<x86_64::structures::gdt::GlobalDescriptorTable>" = type { %"core::cell::UnsafeCell<core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>>", %"core::sync::atomic::AtomicUsize" }
%"core::cell::UnsafeCell<core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>>" = type { %"core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }
%"x86_64::structures::gdt::Descriptor::UserSegment" = type { [1 x i64], i64 }
%"x86_64::structures::DescriptorTablePointer" = type <{ i16, i64 }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h5670e3375651762bE", scope: !2, file: !4, line: 161, type: !5, isLocal: false, isDefinition: true, align: 8)
!2 = !DINamespace(name: "global_descriptor_table", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !2, file: !6, align: 8, elements: !7, templateParams: !10, identifier: "a6bfb220c3f5e14b231f8a2b20bc7039")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !5, file: !6, baseType: !9, align: 8)
!9 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!10 = !{}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h45f0f58fa3dab0c4E", scope: !13, file: !16, line: 15, type: !17, isLocal: true, isDefinition: true, align: 32)
!13 = !DINamespace(name: "__static_ref_initialize", scope: !14)
!14 = !DINamespace(name: "deref", scope: !15)
!15 = !DINamespace(name: "{impl#0}", scope: !2)
!16 = !DIFile(filename: "src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "d1a2224a8c7a9368928f92b1d6216caa")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !18, file: !6, size: 832, align: 32, elements: !21, templateParams: !10, identifier: "764f7deba91fff934c581b06a6d861da")
!18 = !DINamespace(name: "tss", scope: !19)
!19 = !DINamespace(name: "structures", scope: !20)
!20 = !DINamespace(name: "x86_64", scope: null)
!21 = !{!22, !24, !33, !34, !38, !39, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !17, file: !6, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !17, file: !6, baseType: !25, size: 192, align: 64, offset: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 64, elements: !31)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !27, file: !6, size: 64, align: 64, elements: !28, templateParams: !10, identifier: "a9e60a6ef809823c96d1e92081687570")
!27 = !DINamespace(name: "addr", scope: !20)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !26, file: !6, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 3, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !17, file: !6, baseType: !35, size: 448, align: 64, offset: 288)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, align: 64, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 7, lowerBound: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 736)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 800)
!40 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 816)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h6a0554183380c5b5E", scope: !13, file: !16, line: 18, type: !44, isLocal: true, isDefinition: true, align: 8)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 163840, align: 8, elements: !46)
!45 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!46 = !{!47}
!47 = !DISubrange(count: 20480, lowerBound: 0)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17hff4e9c8836a9d7fdE", scope: !50, file: !51, line: 29, type: !52, isLocal: true, isDefinition: true, align: 64)
!50 = !DINamespace(name: "__stability", scope: !14)
!51 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<x86_64::structures::gdt::GlobalDescriptorTable>", scope: !53, file: !6, size: 704, align: 64, elements: !55, templateParams: !86, identifier: "d95f0cae49c88536db0a4e355851a72")
!53 = !DINamespace(name: "lazy", scope: !54)
!54 = !DINamespace(name: "lazy_static", scope: null)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !52, file: !6, baseType: !57, size: 704, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<x86_64::structures::gdt::GlobalDescriptorTable>", scope: !58, file: !6, size: 704, align: 64, elements: !60, templateParams: !86, identifier: "26f5170e3bf01bb420d291924344a229")
!58 = !DINamespace(name: "once", scope: !59)
!59 = !DINamespace(name: "spin", scope: null)
!60 = !{!61, !75}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !57, file: !6, baseType: !62, size: 64, align: 64, offset: 640)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !63, file: !6, size: 64, align: 64, elements: !66, templateParams: !10, identifier: "e00fd022714aa819cef83a74a4523c4")
!63 = !DINamespace(name: "atomic", scope: !64)
!64 = !DINamespace(name: "sync", scope: !65)
!65 = !DINamespace(name: "core", scope: null)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !62, file: !6, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !69, file: !6, size: 64, align: 64, elements: !70, templateParams: !73, identifier: "8f2b43c3fe89fd793c6f616cb378bdef")
!69 = !DINamespace(name: "cell", scope: !65)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !6, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !6, baseType: !76, size: 640, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>>", scope: !69, file: !6, size: 640, align: 64, elements: !77, templateParams: !101, identifier: "a50177d9e0ed35924028139bf65dc037")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !6, baseType: !79, size: 640, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<x86_64::structures::gdt::GlobalDescriptorTable>", scope: !80, file: !6, size: 640, align: 64, elements: !81, templateParams: !10, identifier: "352d40c0bb4bd9949b9e9c2eed371a5b")
!80 = !DINamespace(name: "option", scope: !65)
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_variant_part, scope: !79, file: !6, size: 640, align: 64, elements: !83, templateParams: !10, identifier: "d134c0682f30e7f5357b4d18ba47b1cd", discriminator: !100)
!83 = !{!84, !96}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !82, file: !6, baseType: !85, size: 640, align: 64, extraData: i64 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !79, file: !6, size: 640, align: 64, elements: !10, templateParams: !86, identifier: "81f9e04b1544a79148ea34cb29c001a8")
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "T", type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !89, file: !6, size: 576, align: 64, elements: !90, templateParams: !10, identifier: "400cf9006945780305b8eafb11470fc")
!89 = !DINamespace(name: "gdt", scope: !19)
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !88, file: !6, baseType: !92, size: 512, align: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 64, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 8, lowerBound: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !6, baseType: !72, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !82, file: !6, baseType: !97, size: 640, align: 64, extraData: i64 1)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !79, file: !6, size: 640, align: 64, elements: !98, templateParams: !86, identifier: "425b53f94c274cbc3191b83b2906d592")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !97, file: !6, baseType: !88, size: 576, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, scope: !79, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !79)
!103 = !{i32 7, !"PIC Level", i32 2}
!104 = !{i32 2, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !107, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !108, globals: !131, splitDebugInlining: false)
!107 = !DIFile(filename: "src/lib.rs/@/24p5le0580rpefah", directory: "/Users/yaw/self/theo/cpu_interrupts")
!108 = !{!109, !118, !125}
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !110, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !113)
!110 = !DINamespace(name: "v1", scope: !111)
!111 = !DINamespace(name: "rt", scope: !112)
!112 = !DINamespace(name: "fmt", scope: !65)
!113 = !{!114, !115, !116, !117}
!114 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!115 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !63, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !119)
!119 = !{!120, !121, !122, !123, !124}
!120 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!121 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!124 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !20, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!131 = !{!0, !11, !42, !48}
!132 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17hd5d27428fe93de1eE", scope: !134, file: !133, line: 240, type: !136, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !153)
!133 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f61be3e42d6221d30b5488a425dbc01")
!134 = !DINamespace(name: "{impl#2}", scope: !135)
!135 = !DINamespace(name: "bit_field", scope: null)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !138, !72, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !142, file: !6, size: 192, align: 64, elements: !144, templateParams: !10, identifier: "ce713e8941e9786f7cd6b9ed5cdf02a8")
!142 = !DINamespace(name: "location", scope: !143)
!143 = !DINamespace(name: "panic", scope: !65)
!144 = !{!145, !151, !152}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !141, file: !6, baseType: !146, size: 128, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !147, templateParams: !10, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !6, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !141, file: !6, baseType: !23, size: 32, align: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !141, file: !6, baseType: !23, size: 32, align: 32, offset: 160)
!153 = !{!154, !155, !156}
!154 = !DILocalVariable(name: "self", arg: 1, scope: !132, file: !133, line: 240, type: !138)
!155 = !DILocalVariable(name: "bit", arg: 2, scope: !132, file: !133, line: 240, type: !72)
!156 = !DILocalVariable(name: "value", arg: 3, scope: !132, file: !133, line: 240, type: !139)
!157 = !DILocation(line: 240, column: 24, scope: !132)
!158 = !DILocation(line: 240, column: 35, scope: !132)
!159 = !DILocation(line: 240, column: 47, scope: !132)
!160 = !DILocation(line: 241, column: 25, scope: !132)
!161 = !DILocation(line: 241, column: 17, scope: !132)
!162 = !DILocation(line: 243, column: 20, scope: !132)
!163 = !DILocation(line: 246, column: 31, scope: !132)
!164 = !DILocation(line: 244, column: 30, scope: !132)
!165 = !DILocation(line: 244, column: 21, scope: !132)
!166 = !DILocation(line: 243, column: 17, scope: !132)
!167 = !DILocation(line: 250, column: 14, scope: !132)
!168 = !DILocation(line: 246, column: 30, scope: !132)
!169 = !DILocation(line: 246, column: 21, scope: !132)
!170 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hb4a3d72ae1316b0bE", scope: !172, file: !171, line: 401, type: !288, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !290)
!171 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !112, file: !6, size: 384, align: 64, elements: !173, templateParams: !10, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!173 = !{!174, !180, !226}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !172, file: !6, baseType: !175, size: 128, align: 64, offset: 128)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !176, templateParams: !10, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!176 = !{!177, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !175, file: !6, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !175, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !172, file: !6, baseType: !181, size: 128, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !80, file: !6, size: 128, align: 64, elements: !182, templateParams: !10, identifier: "37e4e944ba32344d635147f54bf9f4df")
!182 = !{!183}
!183 = !DICompositeType(tag: DW_TAG_variant_part, scope: !181, file: !6, size: 128, align: 64, elements: !184, templateParams: !10, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !225)
!184 = !{!185, !221}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !183, file: !6, baseType: !186, size: 128, align: 64, extraData: i64 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !181, file: !6, size: 128, align: 64, elements: !10, templateParams: !187, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!187 = !{!188}
!188 = !DITemplateTypeParameter(name: "T", type: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !190, templateParams: !10, identifier: "2225a8a3217ca2e4230086a86939d931")
!190 = !{!191, !220}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !189, file: !6, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !110, file: !6, size: 448, align: 64, elements: !194, templateParams: !10, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !193, file: !6, baseType: !72, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !193, file: !6, baseType: !197, size: 384, align: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !110, file: !6, size: 384, align: 64, elements: !198, templateParams: !10, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!198 = !{!199, !201, !202, !203, !219}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !197, file: !6, baseType: !200, size: 32, align: 32, offset: 288)
!200 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !197, file: !6, baseType: !109, size: 8, align: 8, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !6, baseType: !23, size: 32, align: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !197, file: !6, baseType: !204, size: 128, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !110, file: !6, size: 128, align: 64, elements: !205, templateParams: !10, identifier: "32660758978696a09244873a5d6fbb61")
!205 = !{!206}
!206 = !DICompositeType(tag: DW_TAG_variant_part, scope: !204, file: !6, size: 128, align: 64, elements: !207, templateParams: !10, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !218)
!207 = !{!208, !212, !216}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !206, file: !6, baseType: !209, size: 128, align: 64, extraData: i64 0)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !204, file: !6, size: 128, align: 64, elements: !210, templateParams: !10, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !206, file: !6, baseType: !213, size: 128, align: 64, extraData: i64 1)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !204, file: !6, size: 128, align: 64, elements: !214, templateParams: !10, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !213, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !206, file: !6, baseType: !217, size: 128, align: 64, extraData: i64 2)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !204, file: !6, size: 128, align: 64, elements: !10, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !204, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !197, file: !6, baseType: !204, size: 128, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !189, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !183, file: !6, baseType: !222, size: 128, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !181, file: !6, size: 128, align: 64, elements: !223, templateParams: !187, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !222, file: !6, baseType: !189, size: 128, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !172, file: !6, baseType: !227, size: 128, align: 64, offset: 256)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !228, templateParams: !10, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!228 = !{!229, !287}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !227, file: !6, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64, dwarfAddressSpace: 0)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !112, file: !6, size: 128, align: 64, elements: !232, templateParams: !10, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!232 = !{!233, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !231, file: !6, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !235, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !236, file: !6, align: 8, elements: !10, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!236 = !DINamespace(name: "{extern#0}", scope: !112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !231, file: !6, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DISubroutineType(types: !240)
!240 = !{!241, !234, !259}
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !242, file: !6, size: 8, align: 8, elements: !243, templateParams: !10, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!242 = !DINamespace(name: "result", scope: !65)
!243 = !{!244}
!244 = !DICompositeType(tag: DW_TAG_variant_part, scope: !241, file: !6, size: 8, align: 8, elements: !245, templateParams: !10, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !258)
!245 = !{!246, !254}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !244, file: !6, baseType: !247, size: 8, align: 8, extraData: i64 0)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !241, file: !6, size: 8, align: 8, elements: !248, templateParams: !250, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !247, file: !6, baseType: !9, align: 8, offset: 8)
!250 = !{!251, !252}
!251 = !DITemplateTypeParameter(name: "T", type: !9)
!252 = !DITemplateTypeParameter(name: "E", type: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !112, file: !6, align: 8, elements: !10, identifier: "c2c8f2f945c37359aa57422093183824")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !244, file: !6, baseType: !255, size: 8, align: 8, extraData: i64 1)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !241, file: !6, size: 8, align: 8, elements: !256, templateParams: !250, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !255, file: !6, baseType: !253, align: 8, offset: 8)
!258 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagArtificial)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !260, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !112, file: !6, size: 512, align: 64, elements: !261, templateParams: !10, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!261 = !{!262, !263, !264, !265, !277, !278}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !260, file: !6, baseType: !23, size: 32, align: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !260, file: !6, baseType: !200, size: 32, align: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !260, file: !6, baseType: !109, size: 8, align: 8, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !260, file: !6, baseType: !266, size: 128, align: 64, offset: 128)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !80, file: !6, size: 128, align: 64, elements: !267, templateParams: !10, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!267 = !{!268}
!268 = !DICompositeType(tag: DW_TAG_variant_part, scope: !266, file: !6, size: 128, align: 64, elements: !269, templateParams: !10, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !276)
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !268, file: !6, baseType: !271, size: 128, align: 64, extraData: i64 0)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !266, file: !6, size: 128, align: 64, elements: !10, templateParams: !73, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !268, file: !6, baseType: !273, size: 128, align: 64, extraData: i64 1)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !266, file: !6, size: 128, align: 64, elements: !274, templateParams: !73, identifier: "eec942390a307d7c8c2162b2092f63f3")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !273, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !260, file: !6, baseType: !266, size: 128, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !260, file: !6, baseType: !279, size: 128, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !280, templateParams: !10, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!280 = !{!281, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !279, file: !6, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !10, identifier: "bb744bac75d5d19249a16512e8e296c")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !279, file: !6, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, align: 64, elements: !31)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !227, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!172, !175, !227}
!290 = !{!291, !292}
!291 = !DILocalVariable(name: "pieces", arg: 1, scope: !170, file: !171, line: 401, type: !175)
!292 = !DILocalVariable(name: "args", arg: 2, scope: !170, file: !171, line: 401, type: !227)
!293 = !DILocation(line: 401, column: 25, scope: !170)
!294 = !DILocation(line: 401, column: 53, scope: !170)
!295 = !DILocation(line: 402, column: 12, scope: !170)
!296 = !DILocation(line: 402, column: 56, scope: !170)
!297 = !{i8 0, i8 2}
!298 = !DILocation(line: 402, column: 41, scope: !170)
!299 = !DILocation(line: 405, column: 34, scope: !170)
!300 = !DILocation(line: 405, column: 9, scope: !170)
!301 = !{i64 8}
!302 = !DILocation(line: 406, column: 6, scope: !170)
!303 = !DILocation(line: 403, column: 13, scope: !170)
!304 = distinct !DISubprogram(name: "call_once<fn() -> x86_64::structures::gdt::GlobalDescriptorTable, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h342df781cf643e9bE", scope: !306, file: !305, line: 250, type: !309, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !317, retainedNodes: !314)
!305 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!306 = !DINamespace(name: "FnOnce", scope: !307)
!307 = !DINamespace(name: "function", scope: !308)
!308 = !DINamespace(name: "ops", scope: !65)
!309 = !DISubroutineType(types: !310)
!310 = !{!88, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> x86_64::structures::gdt::GlobalDescriptorTable", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DISubroutineType(types: !313)
!313 = !{!88}
!314 = !{!315, !316}
!315 = !DILocalVariable(arg: 1, scope: !304, file: !305, line: 250, type: !311)
!316 = !DILocalVariable(arg: 2, scope: !304, file: !305, line: 250, type: !9)
!317 = !{!318, !319}
!318 = !DITemplateTypeParameter(name: "Self", type: !311)
!319 = !DITemplateTypeParameter(name: "Args", type: !9)
!320 = !DILocation(line: 250, column: 5, scope: !304)
!321 = !DILocalVariable(name: "global_descriptor_table", scope: !322, file: !16, line: 25, type: !88, align: 8)
!322 = distinct !DILexicalBlock(scope: !323, file: !16, line: 25, column: 9)
!323 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hff7319f781aa003bE", scope: !14, file: !4, line: 137, type: !312, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !324)
!324 = !{!325, !327, !321}
!325 = !DILocalVariable(name: "stack_start", scope: !326, file: !16, line: 19, type: !26, align: 8)
!326 = distinct !DILexicalBlock(scope: !323, file: !16, line: 19, column: 17)
!327 = !DILocalVariable(name: "stack_end", scope: !328, file: !16, line: 20, type: !26, align: 8)
!328 = distinct !DILexicalBlock(scope: !326, file: !16, line: 20, column: 17)
!329 = !DILocation(line: 25, column: 13, scope: !322, inlinedAt: !330)
!330 = distinct !DILocation(line: 250, column: 5, scope: !304)
!331 = !DILocation(line: 19, column: 35, scope: !332, inlinedAt: !330)
!332 = !DILexicalBlockFile(scope: !323, file: !16, discriminator: 0)
!333 = !DILocation(line: 19, column: 21, scope: !326, inlinedAt: !330)
!334 = !DILocation(line: 20, column: 33, scope: !326, inlinedAt: !330)
!335 = !DILocation(line: 20, column: 21, scope: !328, inlinedAt: !330)
!336 = !DILocation(line: 17, column: 13, scope: !332, inlinedAt: !330)
!337 = !DILocation(line: 25, column: 43, scope: !332, inlinedAt: !330)
!338 = !DILocation(line: 26, column: 43, scope: !322, inlinedAt: !330)
!339 = !DILocation(line: 26, column: 9, scope: !322, inlinedAt: !330)
!340 = !DILocation(line: 27, column: 43, scope: !322, inlinedAt: !330)
!341 = !DILocation(line: 27, column: 9, scope: !322, inlinedAt: !330)
!342 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h87cc78681926b47cE", scope: !344, file: !343, line: 490, type: !345, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !355, retainedNodes: !353)
!343 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!344 = !DINamespace(name: "ptr", scope: !65)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !58, file: !6, size: 128, align: 64, elements: !349, templateParams: !10, identifier: "a17d8ec455a332a17e6befaff58558d")
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !6, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !348, file: !6, baseType: !139, size: 8, align: 8, offset: 64)
!353 = !{!354}
!354 = !DILocalVariable(arg: 1, scope: !342, file: !343, line: 490, type: !347)
!355 = !{!356}
!356 = !DITemplateTypeParameter(name: "T", type: !348)
!357 = !DILocation(line: 490, column: 1, scope: !342)
!358 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h399004266e2cb2e3E", scope: !360, file: !359, line: 100, type: !361, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!359 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c5ec66aac3b7b220f0974f6b880e36c")
!360 = !DINamespace(name: "hint", scope: !65)
!361 = !DISubroutineType(types: !362)
!362 = !{null}
!363 = !DILocation(line: 2244, column: 21, scope: !364, inlinedAt: !367)
!364 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h305e73259a5d2adcE", scope: !366, file: !365, line: 2241, type: !361, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!365 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!366 = !DINamespace(name: "unreachable_unchecked", scope: !360)
!367 = distinct !DILocation(line: 104, column: 9, scope: !358)
!368 = !DILocation(line: 105, column: 9, scope: !358)
!369 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17hdacd1bbb5506c097E", scope: !62, file: !370, line: 2374, type: !371, scopeLine: 2374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !373)
!370 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece39eca309c3b2a21b91ed3770bad24")
!371 = !DISubroutineType(types: !372)
!372 = !{!72, !351, !72, !72, !118}
!373 = !{!374, !375, !376, !377, !378, !380}
!374 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !370, line: 2374, type: !351)
!375 = !DILocalVariable(name: "current", arg: 2, scope: !369, file: !370, line: 2375, type: !72)
!376 = !DILocalVariable(name: "new", arg: 3, scope: !369, file: !370, line: 2376, type: !72)
!377 = !DILocalVariable(name: "order", arg: 4, scope: !369, file: !370, line: 2377, type: !118)
!378 = !DILocalVariable(name: "x", scope: !379, file: !370, line: 2382, type: !72, align: 8)
!379 = distinct !DILexicalBlock(scope: !369, file: !370, line: 2382, column: 21)
!380 = !DILocalVariable(name: "x", scope: !381, file: !370, line: 2383, type: !72, align: 8)
!381 = distinct !DILexicalBlock(scope: !369, file: !370, line: 2383, column: 21)
!382 = !DILocation(line: 2374, column: 37, scope: !369)
!383 = !DILocation(line: 2375, column: 37, scope: !369)
!384 = !DILocation(line: 2376, column: 37, scope: !369)
!385 = !DILocation(line: 2377, column: 37, scope: !369)
!386 = !DILocation(line: 2381, column: 45, scope: !369)
!387 = !{i8 0, i8 5}
!388 = !DILocation(line: 2378, column: 23, scope: !369)
!389 = !{i64 0, i64 2}
!390 = !DILocation(line: 2378, column: 17, scope: !369)
!391 = !DILocation(line: 2382, column: 24, scope: !369)
!392 = !DILocation(line: 2382, column: 24, scope: !379)
!393 = !DILocation(line: 2382, column: 30, scope: !379)
!394 = !DILocation(line: 2382, column: 30, scope: !369)
!395 = !DILocation(line: 2383, column: 25, scope: !369)
!396 = !DILocation(line: 2383, column: 25, scope: !381)
!397 = !DILocation(line: 2383, column: 31, scope: !381)
!398 = !DILocation(line: 2383, column: 31, scope: !369)
!399 = !DILocation(line: 2385, column: 14, scope: !369)
!400 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17h0eb551548ce1f8bdE", scope: !62, file: !370, line: 2428, type: !401, scopeLine: 2428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !418)
!401 = !DISubroutineType(types: !402)
!402 = !{!403, !351, !72, !72, !118, !118}
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !242, file: !6, size: 128, align: 64, elements: !404, templateParams: !10, identifier: "5579df6104a82f0c746794ad7f2aed62")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !403, file: !6, size: 128, align: 64, elements: !406, templateParams: !10, identifier: "7e508de376a90f54f3fcef7824c806a6", discriminator: !417)
!406 = !{!407, !413}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !405, file: !6, baseType: !408, size: 128, align: 64, extraData: i64 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !403, file: !6, size: 128, align: 64, elements: !409, templateParams: !411, identifier: "aca05aa4b9341eadc3e13899788bdf69")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !408, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!411 = !{!74, !412}
!412 = !DITemplateTypeParameter(name: "E", type: !72)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !405, file: !6, baseType: !414, size: 128, align: 64, extraData: i64 1)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !403, file: !6, size: 128, align: 64, elements: !415, templateParams: !411, identifier: "70e806ef3110231932692cff225e8728")
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !414, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!418 = !{!419, !420, !421, !422, !423}
!419 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !370, line: 2428, type: !351)
!420 = !DILocalVariable(name: "current", arg: 2, scope: !400, file: !370, line: 2429, type: !72)
!421 = !DILocalVariable(name: "new", arg: 3, scope: !400, file: !370, line: 2430, type: !72)
!422 = !DILocalVariable(name: "success", arg: 4, scope: !400, file: !370, line: 2431, type: !118)
!423 = !DILocalVariable(name: "failure", arg: 5, scope: !400, file: !370, line: 2432, type: !118)
!424 = !DILocation(line: 2428, column: 37, scope: !400)
!425 = !DILocation(line: 2429, column: 37, scope: !400)
!426 = !DILocation(line: 2430, column: 37, scope: !400)
!427 = !DILocation(line: 2431, column: 37, scope: !400)
!428 = !DILocation(line: 2432, column: 37, scope: !400)
!429 = !DILocalVariable(name: "self", arg: 1, scope: !430, file: !431, line: 2005, type: !435)
!430 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h512eaec59af943bdE", scope: !68, file: !431, line: 2005, type: !432, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !73, retainedNodes: !436)
!431 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "533ae9b9d5d15fd7608d43889fd78bf4")
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!436 = !{!429}
!437 = !DILocation(line: 2005, column: 22, scope: !430, inlinedAt: !438)
!438 = distinct !DILocation(line: 2434, column: 50, scope: !400)
!439 = !DILocation(line: 2434, column: 26, scope: !400)
!440 = !DILocation(line: 2435, column: 14, scope: !400)
!441 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h4b635db60ae05adcE", scope: !62, file: !370, line: 2261, type: !442, scopeLine: 2261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!72, !351, !118}
!444 = !{!445, !446}
!445 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !370, line: 2261, type: !351)
!446 = !DILocalVariable(name: "order", arg: 2, scope: !441, file: !370, line: 2261, type: !118)
!447 = !DILocation(line: 2261, column: 25, scope: !441)
!448 = !DILocation(line: 2261, column: 32, scope: !441)
!449 = !DILocation(line: 2005, column: 22, scope: !430, inlinedAt: !450)
!450 = distinct !DILocation(line: 2263, column: 38, scope: !441)
!451 = !DILocation(line: 2263, column: 26, scope: !441)
!452 = !DILocation(line: 2264, column: 14, scope: !441)
!453 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h8bdf71b33748d43cE", scope: !62, file: !370, line: 2288, type: !454, scopeLine: 2288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !351, !72, !118}
!456 = !{!457, !458, !459}
!457 = !DILocalVariable(name: "self", arg: 1, scope: !453, file: !370, line: 2288, type: !351)
!458 = !DILocalVariable(name: "val", arg: 2, scope: !453, file: !370, line: 2288, type: !72)
!459 = !DILocalVariable(name: "order", arg: 3, scope: !453, file: !370, line: 2288, type: !118)
!460 = !DILocation(line: 2288, column: 26, scope: !453)
!461 = !DILocation(line: 2288, column: 33, scope: !453)
!462 = !DILocation(line: 2288, column: 49, scope: !453)
!463 = !DILocation(line: 2005, column: 22, scope: !430, inlinedAt: !464)
!464 = distinct !DILocation(line: 2290, column: 39, scope: !453)
!465 = !DILocation(line: 2290, column: 26, scope: !453)
!466 = !DILocation(line: 2291, column: 14, scope: !453)
!467 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h3923869ea1fc9098E", scope: !63, file: !370, line: 3640, type: !361, scopeLine: 3640, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!468 = !DILocation(line: 175, column: 18, scope: !469, inlinedAt: !470)
!469 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17he5fd86094f85d608E", scope: !360, file: !359, line: 165, type: !361, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!470 = distinct !DILocation(line: 3641, column: 5, scope: !467)
!471 = !DILocation(line: 3642, column: 2, scope: !467)
!472 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17hbea107914624ad10E", scope: !63, file: !370, line: 3226, type: !473, scopeLine: 3226, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !73, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!403, !434, !72, !72, !118, !118}
!475 = !{!476, !477, !478, !479, !480, !481, !483}
!476 = !DILocalVariable(name: "dst", arg: 1, scope: !472, file: !370, line: 3227, type: !434)
!477 = !DILocalVariable(name: "old", arg: 2, scope: !472, file: !370, line: 3228, type: !72)
!478 = !DILocalVariable(name: "new", arg: 3, scope: !472, file: !370, line: 3229, type: !72)
!479 = !DILocalVariable(name: "success", arg: 4, scope: !472, file: !370, line: 3230, type: !118)
!480 = !DILocalVariable(name: "failure", arg: 5, scope: !472, file: !370, line: 3231, type: !118)
!481 = !DILocalVariable(name: "val", scope: !482, file: !370, line: 3234, type: !72, align: 8)
!482 = distinct !DILexicalBlock(scope: !472, file: !370, line: 3234, column: 5)
!483 = !DILocalVariable(name: "ok", scope: !482, file: !370, line: 3234, type: !139, align: 1)
!484 = !DILocation(line: 3227, column: 5, scope: !472)
!485 = !DILocation(line: 3228, column: 5, scope: !472)
!486 = !DILocation(line: 3229, column: 5, scope: !472)
!487 = !DILocation(line: 3230, column: 5, scope: !472)
!488 = !DILocation(line: 3231, column: 5, scope: !472)
!489 = !DILocation(line: 3235, column: 15, scope: !472)
!490 = !DILocation(line: 3235, column: 9, scope: !472)
!491 = !DILocation(line: 3248, column: 34, scope: !472)
!492 = !DILocation(line: 3249, column: 34, scope: !472)
!493 = !DILocation(line: 3250, column: 33, scope: !472)
!494 = !DILocation(line: 3234, column: 10, scope: !472)
!495 = !DILocation(line: 3234, column: 10, scope: !482)
!496 = !DILocation(line: 3234, column: 15, scope: !472)
!497 = !DILocation(line: 3234, column: 15, scope: !482)
!498 = !DILocation(line: 3255, column: 8, scope: !482)
!499 = !DILocation(line: 3245, column: 34, scope: !472)
!500 = !DILocation(line: 3246, column: 34, scope: !472)
!501 = !DILocation(line: 3247, column: 33, scope: !472)
!502 = !DILocation(line: 3239, column: 35, scope: !472)
!503 = !DILocation(line: 3240, column: 35, scope: !472)
!504 = !DILocation(line: 3241, column: 34, scope: !472)
!505 = !DILocation(line: 3242, column: 35, scope: !472)
!506 = !DILocation(line: 3243, column: 35, scope: !472)
!507 = !DILocation(line: 3244, column: 34, scope: !472)
!508 = !DILocation(line: 3236, column: 35, scope: !472)
!509 = !DILocation(line: 3237, column: 35, scope: !472)
!510 = !DILocation(line: 3238, column: 34, scope: !472)
!511 = !DILocation(line: 3252, column: 29, scope: !472)
!512 = !DILocation(line: 3251, column: 28, scope: !472)
!513 = !DILocation(line: 3255, column: 30, scope: !482)
!514 = !DILocation(line: 3255, column: 5, scope: !482)
!515 = !DILocation(line: 3255, column: 13, scope: !482)
!516 = !DILocation(line: 3256, column: 2, scope: !472)
!517 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h39ab29aaea046700E", scope: !63, file: !370, line: 3129, type: !518, scopeLine: 3129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!118, !118}
!520 = !{!521}
!521 = !DILocalVariable(name: "order", arg: 1, scope: !517, file: !370, line: 3129, type: !118)
!522 = !DILocation(line: 3129, column: 31, scope: !517)
!523 = !DILocation(line: 3130, column: 11, scope: !517)
!524 = !DILocation(line: 3130, column: 5, scope: !517)
!525 = !DILocation(line: 3132, column: 20, scope: !517)
!526 = !DILocation(line: 3131, column: 20, scope: !517)
!527 = !DILocation(line: 3134, column: 20, scope: !517)
!528 = !DILocation(line: 3135, column: 19, scope: !517)
!529 = !DILocation(line: 3133, column: 19, scope: !517)
!530 = !DILocation(line: 3137, column: 2, scope: !517)
!531 = distinct !DISubprogram(name: "as_ref<x86_64::structures::gdt::GlobalDescriptorTable>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17h8e7dac5833c58945E", scope: !79, file: !532, line: 675, type: !533, scopeLine: 675, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !86, retainedNodes: !550)
!532 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "d6f90b4fba5d6fbabc4ac99b183a8294")
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !549}
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&x86_64::structures::gdt::GlobalDescriptorTable>", scope: !80, file: !6, size: 64, align: 64, elements: !536, templateParams: !10, identifier: "2b30f5f1a1a02835a3a1dd4be7ecbf25")
!536 = !{!537}
!537 = !DICompositeType(tag: DW_TAG_variant_part, scope: !535, file: !6, size: 64, align: 64, elements: !538, templateParams: !10, identifier: "2e4ae06c7b7dc81e783cb60833a4aebc", discriminator: !548)
!538 = !{!539, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !537, file: !6, baseType: !540, size: 64, align: 64, extraData: i64 0)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !535, file: !6, size: 64, align: 64, elements: !10, templateParams: !541, identifier: "d219918d64a2e883c0b8ae29a7f7f3fe")
!541 = !{!542}
!542 = !DITemplateTypeParameter(name: "T", type: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::GlobalDescriptorTable", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !537, file: !6, baseType: !545, size: 64, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !535, file: !6, size: 64, align: 64, elements: !546, templateParams: !541, identifier: "918978906610a4c483907707d737e70c")
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !545, file: !6, baseType: !543, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !535, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !{!551, !552}
!551 = !DILocalVariable(name: "self", arg: 1, scope: !531, file: !532, line: 675, type: !549)
!552 = !DILocalVariable(name: "x", scope: !553, file: !532, line: 677, type: !543, align: 8)
!553 = distinct !DILexicalBlock(scope: !531, file: !532, line: 677, column: 13)
!554 = !DILocation(line: 675, column: 25, scope: !531)
!555 = !DILocation(line: 676, column: 15, scope: !531)
!556 = !DILocation(line: 676, column: 9, scope: !531)
!557 = !DILocation(line: 678, column: 21, scope: !531)
!558 = !DILocation(line: 677, column: 18, scope: !531)
!559 = !DILocation(line: 677, column: 18, scope: !553)
!560 = !DILocation(line: 677, column: 28, scope: !553)
!561 = !DILocation(line: 677, column: 34, scope: !531)
!562 = !DILocation(line: 680, column: 6, scope: !531)
!563 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17h7b59076829fee632E", scope: !565, file: !564, line: 22, type: !361, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!564 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "e9362aaa9be7b181a44e347703862012")
!565 = !DINamespace(name: "sse2", scope: !566)
!566 = !DINamespace(name: "x86", scope: !567)
!567 = !DINamespace(name: "core_arch", scope: !65)
!568 = !DILocation(line: 25, column: 5, scope: !563)
!569 = !DILocation(line: 26, column: 2, scope: !563)
!570 = distinct !DISubprogram(name: "call_once<x86_64::structures::gdt::GlobalDescriptorTable, fn() -> x86_64::structures::gdt::GlobalDescriptorTable>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9call_once17h2ce3412335b9068dE", scope: !57, file: !571, line: 98, type: !572, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !582, retainedNodes: !575)
!571 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.5.2/src/once.rs", directory: "", checksumkind: CSK_MD5, checksum: "69004968d2d982c22c33586bc6b4d134")
!572 = !DISubroutineType(types: !573)
!573 = !{!543, !574, !311}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&spin::once::Once<x86_64::structures::gdt::GlobalDescriptorTable>", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !{!576, !577, !578, !580}
!576 = !DILocalVariable(name: "self", arg: 1, scope: !570, file: !571, line: 98, type: !574)
!577 = !DILocalVariable(name: "builder", arg: 2, scope: !570, file: !571, line: 98, type: !311)
!578 = !DILocalVariable(name: "status", scope: !579, file: !571, line: 101, type: !72, align: 8)
!579 = distinct !DILexicalBlock(scope: !570, file: !571, line: 101, column: 9)
!580 = !DILocalVariable(name: "finish", scope: !581, file: !571, line: 109, type: !348, align: 8)
!581 = distinct !DILexicalBlock(scope: !579, file: !571, line: 109, column: 17)
!582 = !{!87, !583}
!583 = !DITemplateTypeParameter(name: "F", type: !311)
!584 = !DILocation(line: 98, column: 29, scope: !570)
!585 = !DILocation(line: 98, column: 39, scope: !570)
!586 = !DILocation(line: 101, column: 13, scope: !579)
!587 = !DILocation(line: 109, column: 21, scope: !581)
!588 = !DILocation(line: 121, column: 9, scope: !570)
!589 = !DILocation(line: 101, column: 26, scope: !570)
!590 = !DILocation(line: 103, column: 12, scope: !579)
!591 = !DILocation(line: 122, column: 13, scope: !579)
!592 = !DILocation(line: 104, column: 22, scope: !579)
!593 = !DILocation(line: 104, column: 13, scope: !579)
!594 = !DILocation(line: 107, column: 16, scope: !579)
!595 = !DILocation(line: 109, column: 50, scope: !579)
!596 = !DILocation(line: 109, column: 34, scope: !579)
!597 = !DILocation(line: 110, column: 50, scope: !581)
!598 = !DILocation(line: 110, column: 45, scope: !581)
!599 = !DILocalVariable(name: "self", arg: 1, scope: !600, file: !431, line: 2005, type: !604)
!600 = distinct !DISubprogram(name: "get<core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h44d079ba0f2e7b8cE", scope: !76, file: !431, line: 2005, type: !601, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !101, retainedNodes: !605)
!601 = !DISubroutineType(types: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<core::option::Option<x86_64::structures::gdt::GlobalDescriptorTable>>", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!605 = !{!599}
!606 = !DILocation(line: 2005, column: 22, scope: !600, inlinedAt: !607)
!607 = distinct !DILocation(line: 110, column: 27, scope: !581)
!608 = !DILocation(line: 110, column: 26, scope: !581)
!609 = !DILocation(line: 111, column: 17, scope: !581)
!610 = !DILocation(line: 113, column: 17, scope: !581)
!611 = !DILocation(line: 114, column: 17, scope: !581)
!612 = !DILocation(line: 117, column: 24, scope: !581)
!613 = !DILocation(line: 118, column: 13, scope: !579)
!614 = !DILocation(line: 133, column: 5, scope: !570)
!615 = !DILocation(line: 130, column: 31, scope: !579)
!616 = !DILocation(line: 123, column: 31, scope: !579)
!617 = !DILocation(line: 125, column: 21, scope: !579)
!618 = !DILocation(line: 126, column: 30, scope: !579)
!619 = !DILocation(line: 126, column: 21, scope: !579)
!620 = !DILocation(line: 126, column: 62, scope: !579)
!621 = !DILocation(line: 128, column: 29, scope: !579)
!622 = !DILocation(line: 129, column: 36, scope: !579)
!623 = !DILocation(line: 1, column: 1, scope: !624)
!624 = !DILexicalBlockFile(scope: !579, file: !625, discriminator: 0)
!625 = !DIFile(filename: "src/lib.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "60de3d9885684becbef2256abe9d41e5")
!626 = !DILocation(line: 133, column: 6, scope: !570)
!627 = distinct !DISubprogram(name: "force_get<x86_64::structures::gdt::GlobalDescriptorTable>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9force_get17h7bebe862dd03d4f4E", scope: !57, file: !571, line: 63, type: !628, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !86, retainedNodes: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{!543, !574}
!630 = !{!631, !632}
!631 = !DILocalVariable(name: "self", arg: 1, scope: !627, file: !571, line: 63, type: !574)
!632 = !DILocalVariable(name: "p", scope: !633, file: !571, line: 66, type: !543, align: 8)
!633 = distinct !DILexicalBlock(scope: !627, file: !571, line: 66, column: 13)
!634 = !DILocation(line: 63, column: 22, scope: !627)
!635 = !DILocation(line: 2005, column: 22, scope: !600, inlinedAt: !636)
!636 = distinct !DILocation(line: 64, column: 26, scope: !627)
!637 = !DILocation(line: 64, column: 15, scope: !627)
!638 = !DILocation(line: 64, column: 9, scope: !627)
!639 = !DILocation(line: 65, column: 33, scope: !627)
!640 = !DILocation(line: 66, column: 18, scope: !627)
!641 = !DILocation(line: 66, column: 18, scope: !633)
!642 = !DILocation(line: 68, column: 6, scope: !627)
!643 = distinct !DISubprogram(name: "tss_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor11tss_segment17h5ba0ff8d10286b01E", scope: !645, file: !644, line: 323, type: !659, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !662)
!644 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/gdt.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ab116ff7379e959850155eb85cfd2d8")
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", scope: !89, file: !6, size: 192, align: 64, elements: !646, templateParams: !10, identifier: "3821ed9a794ebcc2abb5755a867ae8d4")
!646 = !{!647}
!647 = !DICompositeType(tag: DW_TAG_variant_part, scope: !645, file: !6, size: 192, align: 64, elements: !648, templateParams: !10, identifier: "bf9e357229e67e3a42305e63f4527d5", discriminator: !658)
!648 = !{!649, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "UserSegment", scope: !647, file: !6, baseType: !650, size: 192, align: 64, extraData: i64 0)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserSegment", scope: !645, file: !6, size: 192, align: 64, elements: !651, templateParams: !10, identifier: "128c859ba23c386b9f1831197be83a06")
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !650, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "SystemSegment", scope: !647, file: !6, baseType: !654, size: 192, align: 64, extraData: i64 1)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "SystemSegment", scope: !645, file: !6, size: 192, align: 64, elements: !655, templateParams: !10, identifier: "a9cbe1001e0d800b89e212a8a2e976b3")
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !654, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !654, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, scope: !645, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!659 = !DISubroutineType(types: !660)
!660 = !{!645, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::tss::TaskStateSegment", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!662 = !{!663, !664, !666, !668}
!663 = !DILocalVariable(name: "tss", arg: 1, scope: !643, file: !644, line: 323, type: !661)
!664 = !DILocalVariable(name: "ptr", scope: !665, file: !644, line: 327, type: !30, align: 8)
!665 = distinct !DILexicalBlock(scope: !643, file: !644, line: 327, column: 9)
!666 = !DILocalVariable(name: "low", scope: !667, file: !644, line: 329, type: !30, align: 8)
!667 = distinct !DILexicalBlock(scope: !665, file: !644, line: 329, column: 9)
!668 = !DILocalVariable(name: "high", scope: !669, file: !644, line: 338, type: !30, align: 8)
!669 = distinct !DILexicalBlock(scope: !667, file: !644, line: 338, column: 9)
!670 = !DILocation(line: 323, column: 24, scope: !643)
!671 = !DILocation(line: 327, column: 13, scope: !665)
!672 = !DILocation(line: 329, column: 13, scope: !667)
!673 = !DILocation(line: 338, column: 13, scope: !669)
!674 = !DILocation(line: 327, column: 19, scope: !643)
!675 = !DILocation(line: 329, column: 23, scope: !665)
!676 = !DILocation(line: 331, column: 22, scope: !667)
!677 = !DILocation(line: 331, column: 43, scope: !667)
!678 = !DILocation(line: 331, column: 30, scope: !667)
!679 = !DILocation(line: 331, column: 9, scope: !667)
!680 = !DILocation(line: 332, column: 22, scope: !667)
!681 = !DILocation(line: 332, column: 43, scope: !667)
!682 = !DILocation(line: 332, column: 30, scope: !667)
!683 = !DILocation(line: 332, column: 9, scope: !667)
!684 = !DILocation(line: 334, column: 22, scope: !667)
!685 = !DILocation(line: 334, column: 29, scope: !667)
!686 = !DILocation(line: 334, column: 9, scope: !667)
!687 = !DILocation(line: 336, column: 22, scope: !667)
!688 = !DILocation(line: 336, column: 9, scope: !667)
!689 = !DILocation(line: 338, column: 24, scope: !667)
!690 = !DILocation(line: 339, column: 23, scope: !669)
!691 = !DILocation(line: 339, column: 43, scope: !669)
!692 = !DILocation(line: 339, column: 30, scope: !669)
!693 = !DILocation(line: 339, column: 9, scope: !669)
!694 = !DILocation(line: 341, column: 35, scope: !669)
!695 = !DILocation(line: 341, column: 40, scope: !669)
!696 = !DILocation(line: 341, column: 9, scope: !669)
!697 = !DILocation(line: 342, column: 6, scope: !643)
!698 = distinct !DISubprogram(name: "kernel_code_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor19kernel_code_segment17hdeafb4c06c2c97ccE", scope: !645, file: !644, line: 289, type: !699, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!699 = !DISubroutineType(types: !700)
!700 = !{!645}
!701 = !DILocation(line: 290, column: 33, scope: !698)
!702 = !DILocation(line: 290, column: 9, scope: !698)
!703 = !DILocation(line: 291, column: 6, scope: !698)
!704 = distinct !DISubprogram(name: "from_bits_truncate", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags18from_bits_truncate17hf8101777b00be10fE", scope: !706, file: !705, line: 563, type: !709, scopeLine: 563, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !711)
!705 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-1.3.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "a71177c4b92801136d960c3c8e5a0a3c")
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "DescriptorFlags", scope: !89, file: !6, size: 64, align: 64, elements: !707, templateParams: !10, identifier: "1fa00e20a246e60cc1fa01b9367a3873")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !706, file: !6, baseType: !30, size: 64, align: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!706, !30}
!711 = !{!712}
!712 = !DILocalVariable(name: "bits", arg: 1, scope: !704, file: !705, line: 563, type: !30)
!713 = !DILocation(line: 563, column: 45, scope: !704)
!714 = !DILocation(line: 564, column: 37, scope: !704)
!715 = !DILocation(line: 564, column: 30, scope: !704)
!716 = !DILocation(line: 564, column: 17, scope: !704)
!717 = !DILocation(line: 565, column: 14, scope: !704)
!718 = distinct !DISubprogram(name: "all", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags3all17h82661e122c20c355E", scope: !706, file: !705, line: 532, type: !719, scopeLine: 532, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!719 = !DISubroutineType(types: !720)
!720 = !{!706}
!721 = !DILocation(line: 541, column: 14, scope: !718)
!722 = distinct !DISubprogram(name: "bits", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags4bits17h2840bf05651a54dcE", scope: !706, file: !705, line: 545, type: !723, scopeLine: 545, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !726)
!723 = !DISubroutineType(types: !724)
!724 = !{!30, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::DescriptorFlags", baseType: !706, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !{!727}
!727 = !DILocalVariable(name: "self", arg: 1, scope: !722, file: !705, line: 545, type: !725)
!728 = !DILocation(line: 545, column: 31, scope: !722)
!729 = !DILocation(line: 546, column: 17, scope: !722)
!730 = !DILocation(line: 547, column: 14, scope: !722)
!731 = distinct !DISubprogram(name: "contains", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags8contains17h7e494332359c87d7E", scope: !706, file: !705, line: 603, type: !732, scopeLine: 603, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{!139, !725, !706}
!734 = !{!735, !736}
!735 = !DILocalVariable(name: "self", arg: 1, scope: !731, file: !705, line: 603, type: !725)
!736 = !DILocalVariable(name: "other", arg: 2, scope: !731, file: !705, line: 603, type: !706)
!737 = !DILocation(line: 603, column: 35, scope: !731)
!738 = !DILocation(line: 603, column: 42, scope: !731)
!739 = !DILocation(line: 604, column: 18, scope: !731)
!740 = !DILocation(line: 604, column: 17, scope: !731)
!741 = !DILocation(line: 605, column: 14, scope: !731)
!742 = distinct !DISubprogram(name: "load_unsafe", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable11load_unsafe17h72e6a27319f3d28cE", scope: !88, file: !644, line: 158, type: !743, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !543}
!745 = !{!746}
!746 = !DILocalVariable(name: "self", arg: 1, scope: !742, file: !644, line: 158, type: !543)
!747 = !DILocation(line: 158, column: 31, scope: !742)
!748 = !DILocation(line: 161, column: 19, scope: !742)
!749 = !DILocation(line: 161, column: 13, scope: !742)
!750 = !DILocation(line: 163, column: 6, scope: !742)
!751 = distinct !DISubprogram(name: "new", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable3new17h3fabb5503f64eff5E", scope: !88, file: !644, line: 56, type: !312, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!752 = !DILocation(line: 58, column: 20, scope: !751)
!753 = !DILocation(line: 57, column: 9, scope: !751)
!754 = !DILocation(line: 61, column: 6, scope: !751)
!755 = distinct !DISubprogram(name: "load", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4load17ha53b4ffc0c5c6229E", scope: !88, file: !644, line: 140, type: !743, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !756)
!756 = !{!757}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !755, file: !644, line: 140, type: !543)
!758 = !DILocation(line: 140, column: 17, scope: !755)
!759 = !DILocation(line: 142, column: 18, scope: !755)
!760 = !DILocation(line: 143, column: 6, scope: !755)
!761 = distinct !DISubprogram(name: "push", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4push17ha7ab3e8bd29702aeE", scope: !88, file: !644, line: 166, type: !762, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !765)
!762 = !DISubroutineType(types: !763)
!763 = !{!72, !764, !30}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::gdt::GlobalDescriptorTable", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !{!766, !767, !768}
!766 = !DILocalVariable(name: "self", arg: 1, scope: !761, file: !644, line: 167, type: !764)
!767 = !DILocalVariable(name: "value", arg: 2, scope: !761, file: !644, line: 167, type: !30)
!768 = !DILocalVariable(name: "index", scope: !769, file: !644, line: 168, type: !72, align: 8)
!769 = distinct !DILexicalBlock(scope: !761, file: !644, line: 168, column: 9)
!770 = !DILocation(line: 167, column: 13, scope: !761)
!771 = !DILocation(line: 167, column: 24, scope: !761)
!772 = !DILocation(line: 168, column: 21, scope: !761)
!773 = !DILocation(line: 168, column: 13, scope: !769)
!774 = !DILocation(line: 169, column: 9, scope: !769)
!775 = !DILocation(line: 170, column: 9, scope: !769)
!776 = !DILocation(line: 172, column: 6, scope: !761)
!777 = distinct !DISubprogram(name: "add_entry", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable9add_entry17hdac6bfc50bb8d073E", scope: !88, file: !644, line: 101, type: !778, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !785)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !764, !645}
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !781, file: !6, size: 16, align: 16, elements: !783, templateParams: !10, identifier: "3f1d556df4038a1ca295bb208a6e0a31")
!781 = !DINamespace(name: "segmentation", scope: !782)
!782 = !DINamespace(name: "registers", scope: !20)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !780, file: !6, baseType: !40, size: 16, align: 16)
!785 = !{!786, !787, !788, !790, !792, !794, !795, !797, !799}
!786 = !DILocalVariable(name: "self", arg: 1, scope: !777, file: !644, line: 101, type: !764)
!787 = !DILocalVariable(name: "entry", arg: 2, scope: !777, file: !644, line: 101, type: !645)
!788 = !DILocalVariable(name: "index", scope: !789, file: !644, line: 102, type: !72, align: 8)
!789 = distinct !DILexicalBlock(scope: !777, file: !644, line: 102, column: 9)
!790 = !DILocalVariable(name: "value", scope: !791, file: !644, line: 103, type: !30, align: 8)
!791 = distinct !DILexicalBlock(scope: !777, file: !644, line: 103, column: 13)
!792 = !DILocalVariable(name: "value_low", scope: !793, file: !644, line: 109, type: !30, align: 8)
!793 = distinct !DILexicalBlock(scope: !777, file: !644, line: 109, column: 13)
!794 = !DILocalVariable(name: "value_high", scope: !793, file: !644, line: 109, type: !30, align: 8)
!795 = !DILocalVariable(name: "index", scope: !796, file: !644, line: 113, type: !72, align: 8)
!796 = distinct !DILexicalBlock(scope: !793, file: !644, line: 113, column: 17)
!797 = !DILocalVariable(name: "rpl", scope: !798, file: !644, line: 119, type: !125, align: 1)
!798 = distinct !DILexicalBlock(scope: !789, file: !644, line: 119, column: 9)
!799 = !DILocalVariable(name: "value", scope: !800, file: !644, line: 120, type: !30, align: 8)
!800 = distinct !DILexicalBlock(scope: !789, file: !644, line: 120, column: 13)
!801 = !DILocation(line: 101, column: 22, scope: !777)
!802 = !DILocation(line: 101, column: 33, scope: !777)
!803 = !DILocation(line: 102, column: 13, scope: !789)
!804 = !DILocation(line: 119, column: 13, scope: !798)
!805 = !DILocation(line: 102, column: 27, scope: !777)
!806 = !DILocation(line: 102, column: 21, scope: !777)
!807 = !DILocation(line: 103, column: 37, scope: !777)
!808 = !DILocation(line: 103, column: 37, scope: !791)
!809 = !DILocation(line: 104, column: 20, scope: !791)
!810 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !812, line: 1096, type: !72)
!811 = distinct !DISubprogram(name: "saturating_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$14saturating_sub17hc80a096e699f98d2E", scope: !813, file: !812, line: 1096, type: !815, scopeLine: 1096, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !817)
!812 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "3eed1b8baad53fb1e7d6811c678f60f8")
!813 = !DINamespace(name: "{impl#11}", scope: !814)
!814 = !DINamespace(name: "num", scope: !65)
!815 = !DISubroutineType(types: !816)
!816 = !{!72, !72, !72}
!817 = !{!810, !818}
!818 = !DILocalVariable(name: "rhs", arg: 2, scope: !811, file: !812, line: 1096, type: !72)
!819 = !DILocation(line: 1096, column: 37, scope: !811, inlinedAt: !820)
!820 = distinct !DILocation(line: 104, column: 31, scope: !791)
!821 = !DILocation(line: 1096, column: 43, scope: !811, inlinedAt: !820)
!822 = !DILocation(line: 1097, column: 13, scope: !811, inlinedAt: !820)
!823 = !DILocation(line: 109, column: 39, scope: !777)
!824 = !DILocation(line: 109, column: 39, scope: !793)
!825 = !DILocation(line: 109, column: 50, scope: !777)
!826 = !DILocation(line: 109, column: 50, scope: !793)
!827 = !DILocation(line: 110, column: 20, scope: !793)
!828 = !DILocation(line: 1096, column: 37, scope: !811, inlinedAt: !829)
!829 = distinct !DILocation(line: 110, column: 31, scope: !793)
!830 = !DILocation(line: 1096, column: 43, scope: !811, inlinedAt: !829)
!831 = !DILocation(line: 1097, column: 13, scope: !811, inlinedAt: !829)
!832 = !DILocation(line: 113, column: 29, scope: !793)
!833 = !DILocation(line: 113, column: 21, scope: !796)
!834 = !DILocation(line: 114, column: 17, scope: !796)
!835 = !DILocation(line: 115, column: 17, scope: !796)
!836 = !DILocation(line: 116, column: 13, scope: !777)
!837 = !DILocation(line: 111, column: 21, scope: !793)
!838 = !DILocation(line: 119, column: 25, scope: !789)
!839 = !DILocation(line: 119, column: 19, scope: !789)
!840 = !DILocation(line: 107, column: 17, scope: !791)
!841 = !DILocation(line: 105, column: 21, scope: !791)
!842 = !DILocation(line: 120, column: 37, scope: !789)
!843 = !DILocation(line: 120, column: 37, scope: !800)
!844 = !DILocation(line: 121, column: 20, scope: !800)
!845 = !DILocation(line: 128, column: 48, scope: !789)
!846 = !DILocation(line: 131, column: 30, scope: !798)
!847 = !DILocation(line: 131, column: 44, scope: !798)
!848 = !{i8 0, i8 4}
!849 = !DILocation(line: 131, column: 9, scope: !798)
!850 = !DILocation(line: 132, column: 6, scope: !777)
!851 = !DILocation(line: 125, column: 21, scope: !800)
!852 = !DILocation(line: 121, column: 17, scope: !800)
!853 = !DILocation(line: 123, column: 21, scope: !800)
!854 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt106Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$RP$$GT$14set_handler_fn17h9600845a7273d675E", scope: !856, file: !855, line: 763, type: !888, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !892)
!855 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !857, file: !6, size: 128, align: 32, elements: !858, templateParams: !886, identifier: "b0aa6f0b647bcf277be32487779a0183")
!857 = !DINamespace(name: "idt", scope: !19)
!858 = !{!859, !860, !861, !865, !866, !867, !868}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !856, file: !6, baseType: !40, size: 16, align: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !856, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !856, file: !6, baseType: !862, size: 16, align: 16, offset: 32)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !857, file: !6, size: 16, align: 16, elements: !863, templateParams: !10, identifier: "3dee63e0f88e11b81cd5b19b726b4da4")
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !862, file: !6, baseType: !40, size: 16, align: 16)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !856, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !856, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !856, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !856, file: !6, baseType: !869, align: 8, offset: 128)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !870, file: !6, align: 8, elements: !10, templateParams: !871, identifier: "8d59689c36a032e3e17ffd5b4ab7982c")
!870 = !DINamespace(name: "marker", scope: !65)
!871 = !{!872}
!872 = !DITemplateTypeParameter(name: "T", type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !874, size: 64, align: 64, dwarfAddressSpace: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !876}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !857, file: !6, size: 320, align: 64, elements: !877, templateParams: !10, identifier: "13f3d00c4471dda7d917a5d356019963")
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !876, file: !6, baseType: !879, size: 320, align: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !857, file: !6, size: 320, align: 64, elements: !880, templateParams: !10, identifier: "1989ed2ebc979b15f103a052265bfaa")
!880 = !{!881, !882, !883, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !879, file: !6, baseType: !26, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !879, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !879, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !879, file: !6, baseType: !26, size: 64, align: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !879, file: !6, baseType: !30, size: 64, align: 64, offset: 256)
!886 = !{!887}
!887 = !DITemplateTypeParameter(name: "F", type: !873)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !891, !873}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::EntryOptions", baseType: !862, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !856, size: 64, align: 64, dwarfAddressSpace: 0)
!892 = !{!893, !894, !895}
!893 = !DILocalVariable(name: "self", arg: 1, scope: !854, file: !855, line: 763, type: !891)
!894 = !DILocalVariable(name: "handler", arg: 2, scope: !854, file: !855, line: 763, type: !873)
!895 = !DILocalVariable(name: "handler", scope: !896, file: !855, line: 764, type: !26, align: 8)
!896 = distinct !DILexicalBlock(scope: !854, file: !855, line: 764, column: 17)
!897 = !DILocation(line: 763, column: 35, scope: !854)
!898 = !DILocation(line: 763, column: 46, scope: !854)
!899 = !DILocation(line: 764, column: 45, scope: !854)
!900 = !DILocation(line: 764, column: 31, scope: !854)
!901 = !DILocation(line: 764, column: 21, scope: !896)
!902 = !DILocation(line: 765, column: 26, scope: !896)
!903 = !DILocation(line: 766, column: 14, scope: !854)
!904 = distinct !DISubprogram(name: "set_present", linkageName: "_ZN6x86_6410structures3idt12EntryOptions11set_present17h452231bcc73c35f9E", scope: !862, file: !855, line: 799, type: !905, scopeLine: 799, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !907)
!905 = !DISubroutineType(types: !906)
!906 = !{!890, !890, !139}
!907 = !{!908, !909}
!908 = !DILocalVariable(name: "self", arg: 1, scope: !904, file: !855, line: 799, type: !890)
!909 = !DILocalVariable(name: "present", arg: 2, scope: !904, file: !855, line: 799, type: !139)
!910 = !DILocation(line: 799, column: 24, scope: !904)
!911 = !DILocation(line: 799, column: 35, scope: !904)
!912 = !DILocation(line: 800, column: 9, scope: !904)
!913 = !DILocation(line: 802, column: 6, scope: !904)
!914 = distinct !DISubprogram(name: "minimal", linkageName: "_ZN6x86_6410structures3idt12EntryOptions7minimal17hfa189a70561063e2E", scope: !862, file: !855, line: 793, type: !915, scopeLine: 793, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !10)
!915 = !DISubroutineType(types: !916)
!916 = !{!862}
!917 = !DILocation(line: 795, column: 6, scope: !914)
!918 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt132Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$C$u64$RP$$u20$.$GT$$u20$$u21$$GT$14set_handler_fn17h417c7ce6801353beE", scope: !919, file: !855, line: 763, type: !937, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !10, retainedNodes: !940)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !857, file: !6, size: 128, align: 32, elements: !920, templateParams: !935, identifier: "5bc32bc07e848f843b38e4dbb1f9aa73")
!920 = !{!921, !922, !923, !924, !925, !926, !927}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !919, file: !6, baseType: !40, size: 16, align: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !919, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !919, file: !6, baseType: !862, size: 16, align: 16, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !919, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !919, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !919, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !919, file: !6, baseType: !928, align: 8, offset: 128)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !870, file: !6, align: 8, elements: !10, templateParams: !929, identifier: "e16daaf8bd643b2667252e693e775d23")
!929 = !{!930}
!930 = !DITemplateTypeParameter(name: "T", type: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !932, size: 64, align: 64, dwarfAddressSpace: 0)
!932 = !DISubroutineType(types: !933)
!933 = !{!934, !876, !30}
!934 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!935 = !{!936}
!936 = !DITemplateTypeParameter(name: "F", type: !931)
!937 = !DISubroutineType(types: !938)
!938 = !{!890, !939, !931}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", baseType: !919, size: 64, align: 64, dwarfAddressSpace: 0)
!940 = !{!941, !942, !943}
!941 = !DILocalVariable(name: "self", arg: 1, scope: !918, file: !855, line: 763, type: !939)
!942 = !DILocalVariable(name: "handler", arg: 2, scope: !918, file: !855, line: 763, type: !931)
!943 = !DILocalVariable(name: "handler", scope: !944, file: !855, line: 764, type: !26, align: 8)
!944 = distinct !DILexicalBlock(scope: !918, file: !855, line: 764, column: 17)
!945 = !DILocation(line: 763, column: 35, scope: !918)
!946 = !DILocation(line: 763, column: 46, scope: !918)
!947 = !DILocation(line: 764, column: 45, scope: !918)
!948 = !DILocation(line: 764, column: 31, scope: !918)
!949 = !DILocation(line: 764, column: 21, scope: !944)
!950 = !DILocation(line: 765, column: 26, scope: !944)
!951 = !DILocation(line: 766, column: 14, scope: !918)
!952 = distinct !DISubprogram(name: "set_handler_addr<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$16set_handler_addr17h75c07185c8164da2E", scope: !919, file: !855, line: 721, type: !953, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !935, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!890, !939, !26}
!955 = !{!956, !957, !958}
!956 = !DILocalVariable(name: "self", arg: 1, scope: !952, file: !855, line: 721, type: !939)
!957 = !DILocalVariable(name: "addr", arg: 2, scope: !952, file: !855, line: 721, type: !26)
!958 = !DILocalVariable(name: "addr", scope: !959, file: !855, line: 724, type: !30, align: 8)
!959 = distinct !DILexicalBlock(scope: !952, file: !855, line: 724, column: 9)
!960 = !DILocation(line: 721, column: 36, scope: !952)
!961 = !DILocation(line: 721, column: 47, scope: !952)
!962 = !DILocation(line: 724, column: 20, scope: !952)
!963 = !DILocation(line: 724, column: 13, scope: !959)
!964 = !DILocation(line: 726, column: 9, scope: !959)
!965 = !DILocation(line: 727, column: 31, scope: !959)
!966 = !DILocation(line: 727, column: 9, scope: !959)
!967 = !DILocation(line: 728, column: 29, scope: !959)
!968 = !DILocation(line: 728, column: 9, scope: !959)
!969 = !DILocation(line: 730, column: 29, scope: !959)
!970 = !DILocation(line: 730, column: 9, scope: !959)
!971 = !DILocation(line: 732, column: 9, scope: !959)
!972 = !DILocation(line: 733, column: 9, scope: !959)
!973 = !DILocation(line: 734, column: 6, scope: !952)
!974 = distinct !DISubprogram(name: "set_handler_addr<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$16set_handler_addr17hd21545b6b59bbbb8E", scope: !856, file: !855, line: 721, type: !975, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !886, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{!890, !891, !26}
!977 = !{!978, !979, !980}
!978 = !DILocalVariable(name: "self", arg: 1, scope: !974, file: !855, line: 721, type: !891)
!979 = !DILocalVariable(name: "addr", arg: 2, scope: !974, file: !855, line: 721, type: !26)
!980 = !DILocalVariable(name: "addr", scope: !981, file: !855, line: 724, type: !30, align: 8)
!981 = distinct !DILexicalBlock(scope: !974, file: !855, line: 724, column: 9)
!982 = !DILocation(line: 721, column: 36, scope: !974)
!983 = !DILocation(line: 721, column: 47, scope: !974)
!984 = !DILocation(line: 724, column: 20, scope: !974)
!985 = !DILocation(line: 724, column: 13, scope: !981)
!986 = !DILocation(line: 726, column: 9, scope: !981)
!987 = !DILocation(line: 727, column: 31, scope: !981)
!988 = !DILocation(line: 727, column: 9, scope: !981)
!989 = !DILocation(line: 728, column: 29, scope: !981)
!990 = !DILocation(line: 728, column: 9, scope: !981)
!991 = !DILocation(line: 730, column: 29, scope: !981)
!992 = !DILocation(line: 730, column: 9, scope: !981)
!993 = !DILocation(line: 732, column: 9, scope: !981)
!994 = !DILocation(line: 733, column: 9, scope: !981)
!995 = !DILocation(line: 734, column: 6, scope: !974)
!996 = distinct !DISubprogram(name: "missing<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$7missing17h0480061533b038d6E", scope: !997, file: !855, line: 695, type: !1014, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !1012, retainedNodes: !10)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !857, file: !6, size: 128, align: 32, elements: !998, templateParams: !1012, identifier: "f51d3eec7168b89a76931efa61b62c69")
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !997, file: !6, baseType: !40, size: 16, align: 16)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !997, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !997, file: !6, baseType: !862, size: 16, align: 16, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !997, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !997, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !997, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !997, file: !6, baseType: !1006, align: 8, offset: 128)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !870, file: !6, align: 8, elements: !10, templateParams: !1007, identifier: "d76abbd3218ef986e00d3d2f755412d6")
!1007 = !{!1008}
!1008 = !DITemplateTypeParameter(name: "T", type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !1010, size: 64, align: 64, dwarfAddressSpace: 0)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !876, !30}
!1012 = !{!1013}
!1013 = !DITemplateTypeParameter(name: "F", type: !1009)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!997}
!1016 = !DILocation(line: 701, column: 22, scope: !996)
!1017 = !DILocation(line: 696, column: 9, scope: !996)
!1018 = !DILocation(line: 705, column: 6, scope: !996)
!1019 = distinct !DISubprogram(name: "missing<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$7missing17h054dd5e84d89355aE", scope: !919, file: !855, line: 695, type: !1020, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !935, retainedNodes: !10)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!919}
!1022 = !DILocation(line: 701, column: 22, scope: !1019)
!1023 = !DILocation(line: 696, column: 9, scope: !1019)
!1024 = !DILocation(line: 705, column: 6, scope: !1019)
!1025 = distinct !DISubprogram(name: "missing<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$7missing17h4f3f5dbe2595a6a3E", scope: !1026, file: !855, line: 695, type: !1046, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !1044, retainedNodes: !10)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !857, file: !6, size: 128, align: 32, elements: !1027, templateParams: !1044, identifier: "c81608d961a5c06e20b98eb608f5528c")
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !1026, file: !6, baseType: !40, size: 16, align: 16)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !1026, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1026, file: !6, baseType: !862, size: 16, align: 16, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !1026, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !1026, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1026, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !1026, file: !6, baseType: !1035, align: 8, offset: 128)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !870, file: !6, align: 8, elements: !10, templateParams: !1036, identifier: "b3ac0588713fe09e12042923e1295d")
!1036 = !{!1037}
!1037 = !DITemplateTypeParameter(name: "T", type: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !1039, size: 64, align: 64, dwarfAddressSpace: 0)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !876, !1041}
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !857, file: !6, size: 64, align: 64, elements: !1042, templateParams: !10, identifier: "f476a9f551a63e532e824c85dec4569")
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1041, file: !6, baseType: !30, size: 64, align: 64)
!1044 = !{!1045}
!1045 = !DITemplateTypeParameter(name: "F", type: !1038)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1026}
!1048 = !DILocation(line: 701, column: 22, scope: !1025)
!1049 = !DILocation(line: 696, column: 9, scope: !1025)
!1050 = !DILocation(line: 705, column: 6, scope: !1025)
!1051 = distinct !DISubprogram(name: "missing<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$7missing17h77e3f902f8eb701cE", scope: !1052, file: !855, line: 695, type: !1069, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !106, templateParams: !1067, retainedNodes: !10)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !857, file: !6, size: 128, align: 32, elements: !1053, templateParams: !1067, identifier: "c4ae7cf25a4059a88950a7e0508d6fac")
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !1052, file: !6, baseType: !40, size: 16, align: 16)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !1052, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1052, file: !6, baseType: !862, size: 16, align: 16, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !1052, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
