; ModuleID = '8k7ou945ooh24pl'
source_filename = "8k7ou945ooh24pl"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CHAINED_PICS", linkageName: "_ZN14cpu_interrupts33programmable_interface_controller12CHAINED_PICS17h87853fc5aa313e31E", scope: !2, file: !4, line: 5, type: !5, isLocal: false, isDefinition: true, align: 16)
!2 = !DINamespace(name: "programmable_interface_controller", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "src/programmable_interface_controller.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "00b9e4e0bae32cc34f3cf3b92f8991f5")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !7, file: !6, size: 112, align: 16, elements: !9, templateParams: !75, identifier: "7d7c84273a711558ae9279cb1192b7c7")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !DINamespace(name: "mutex", scope: !8)
!8 = !DINamespace(name: "spin", scope: null)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !5, file: !6, baseType: !11, size: 112, align: 16)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<pic8259::ChainedPics, spin::relax::Spin>", scope: !12, file: !6, size: 112, align: 16, elements: !13, templateParams: !75, identifier: "f3610f0e614a310f383dc615caebeed4")
!12 = !DINamespace(name: "spin", scope: !7)
!13 = !{!14, !23, !36}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !11, file: !6, baseType: !15, align: 8)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !19, identifier: "79f81c459de6dca4d9657eb000118ae2")
!16 = !DINamespace(name: "marker", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{}
!19 = !{!20}
!20 = !DITemplateTypeParameter(name: "T", type: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !22, file: !6, align: 8, elements: !18, identifier: "739be00bff07a22810bf86daf420515a")
!22 = !DINamespace(name: "relax", scope: !8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !11, file: !6, baseType: !24, size: 8, align: 8)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !25, file: !6, size: 8, align: 8, elements: !27, templateParams: !18, identifier: "e2364d2a6ff719de740e5eb5e910ee4d")
!25 = !DINamespace(name: "atomic", scope: !26)
!26 = !DINamespace(name: "sync", scope: !17)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !24, file: !6, baseType: !29, size: 8, align: 8)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !30, file: !6, size: 8, align: 8, elements: !31, templateParams: !34, identifier: "e5c1894a60a57e2d6018f7e1849f9cfb")
!30 = !DINamespace(name: "cell", scope: !17)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !6, baseType: !33, size: 8, align: 8)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !33)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, baseType: !37, size: 96, align: 16, offset: 16)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<pic8259::ChainedPics>", scope: !30, file: !6, size: 96, align: 16, elements: !38, templateParams: !73, identifier: "b1718e942d43f7eba45f4cc9a2133d7c")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !6, baseType: !40, size: 96, align: 16)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChainedPics", scope: !41, file: !6, size: 96, align: 16, elements: !42, templateParams: !18, identifier: "e5c9952709bb18eb81d3bdc36691dbf")
!41 = !DINamespace(name: "pic8259", scope: null)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pics", scope: !40, file: !6, baseType: !44, size: 96, align: 16)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 16, elements: !71)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pic", scope: !41, file: !6, size: 48, align: 16, elements: !46, templateParams: !18, identifier: "9d5eb9944eefc7b09e34a394a78ec1c6")
!46 = !{!47, !48, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !45, file: !6, baseType: !33, size: 8, align: 8, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !45, file: !6, baseType: !49, size: 16, align: 16)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PortGeneric<u8, x86_64::instructions::port::ReadWriteAccess>", scope: !50, file: !6, size: 16, align: 16, elements: !53, templateParams: !68, identifier: "c5f2ceb38590d33fc67bf20227318765")
!50 = !DINamespace(name: "port", scope: !51)
!51 = !DINamespace(name: "instructions", scope: !52)
!52 = !DINamespace(name: "x86_64", scope: null)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !49, file: !6, baseType: !55, size: 16, align: 16)
!55 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !49, file: !6, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(u8, x86_64::instructions::port::ReadWriteAccess)>", scope: !16, file: !6, align: 8, elements: !18, templateParams: !58, identifier: "210d3735fec8551789e15c1cccbd8de")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, x86_64::instructions::port::ReadWriteAccess)", file: !6, size: 8, align: 8, elements: !61, templateParams: !18, identifier: "5a8918b16c469ef6a7ce6a41fb5b96e3")
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !6, baseType: !33, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !6, baseType: !64, align: 8, offset: 8)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadWriteAccess", scope: !50, file: !6, align: 8, elements: !65, templateParams: !18, identifier: "ee6f7d7022f94f6d4360306d282d5f80")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !6, baseType: !67, align: 8)
!67 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!68 = !{!35, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !6, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = !DISubrange(count: 2, lowerBound: 0)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !40)
!75 = !{!74, !76}
!76 = !DITemplateTypeParameter(name: "R", type: !21)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h8d8b396847acbda7E", scope: !79, file: !80, line: 161, type: !81, isLocal: false, isDefinition: true, align: 8)
!79 = !DINamespace(name: "global_descriptor_table", scope: !3)
!80 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !79, file: !6, align: 8, elements: !82, templateParams: !18, identifier: "64fcb8704b8a440b257778a0c3b28932")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !81, file: !6, baseType: !67, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17h50766dddc9aea43eE", scope: !86, file: !89, line: 27, type: !90, isLocal: true, isDefinition: true, align: 32)
!86 = !DINamespace(name: "__static_ref_initialize", scope: !87)
!87 = !DINamespace(name: "deref", scope: !88)
!88 = !DINamespace(name: "{impl#0}", scope: !79)
!89 = !DIFile(filename: "src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !91, file: !6, size: 832, align: 32, elements: !93, templateParams: !18, identifier: "d4bde8dad75e7fea5f3aab8b4396eae7")
!91 = !DINamespace(name: "tss", scope: !92)
!92 = !DINamespace(name: "structures", scope: !52)
!93 = !{!94, !96, !105, !106, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !90, file: !6, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !90, file: !6, baseType: !97, size: 192, align: 64, offset: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, align: 64, elements: !103)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !99, file: !6, size: 64, align: 64, elements: !100, templateParams: !18, identifier: "2ebe7f49813a6c6be467aacc61facd72")
!99 = !DINamespace(name: "addr", scope: !52)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !6, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DISubrange(count: 3, lowerBound: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !90, file: !6, baseType: !107, size: 448, align: 64, offset: 288)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, align: 64, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7, lowerBound: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !90, file: !6, baseType: !102, size: 64, align: 64, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !90, file: !6, baseType: !55, size: 16, align: 16, offset: 816)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17hd5489e8aed80399bE", scope: !86, file: !89, line: 30, type: !115, isLocal: true, isDefinition: true, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 163840, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20480, lowerBound: 0)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h8186f6baba806a2fE", scope: !120, file: !121, line: 29, type: !122, isLocal: true, isDefinition: true, align: 64)
!120 = !DINamespace(name: "__stability", scope: !87)
!121 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !123, file: !6, size: 768, align: 64, elements: !125, templateParams: !151, identifier: "a0f0f436abb2471fb7b83327a04e0cd9")
!123 = !DINamespace(name: "lazy", scope: !124)
!124 = !DINamespace(name: "lazy_static", scope: null)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !6, baseType: !127, size: 768, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !128, file: !6, size: 768, align: 64, elements: !129, templateParams: !151, identifier: "824449e6af89129684ea9642ecd67eef")
!128 = !DINamespace(name: "once", scope: !8)
!129 = !{!130, !140}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !6, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !25, file: !6, size: 64, align: 64, elements: !132, templateParams: !18, identifier: "2430928ce830a626955c329833891eda")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !6, baseType: !134, size: 64, align: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !30, file: !6, size: 64, align: 64, elements: !135, templateParams: !138, identifier: "d8ddfc9344a00bdf32bf210691c75ecb")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !137)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !6, baseType: !141, size: 704, align: 64, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !30, file: !6, size: 704, align: 64, elements: !142, templateParams: !179, identifier: "6ba13140d4bbf2c5f3a8d6939c4924ce")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !141, file: !6, baseType: !144, size: 704, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 704, align: 64, elements: !146, templateParams: !18, identifier: "cd8a2773709553b9d00841a58175e64f")
!145 = !DINamespace(name: "option", scope: !17)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !6, size: 704, align: 64, elements: !148, templateParams: !18, identifier: "ee317bf23f157daedcc1773c28a2c800", discriminator: !178)
!148 = !{!149, !174}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !6, baseType: !150, size: 704, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !6, size: 704, align: 64, elements: !18, templateParams: !151, identifier: "48425edaa7ce7268ee72ad5b97de2c54")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !79, file: !6, size: 640, align: 64, elements: !154, templateParams: !18, identifier: "a05f9731e4cd9bfa66dcae109d1f85c0")
!154 = !{!155, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !153, file: !6, baseType: !156, size: 576, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !157, file: !6, size: 576, align: 64, elements: !158, templateParams: !18, identifier: "70df3c12e7899283a47394b16fe3bad")
!157 = !DINamespace(name: "gdt", scope: !92)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !6, baseType: !160, size: 512, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8, lowerBound: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !6, baseType: !137, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !153, file: !6, baseType: !165, size: 32, align: 16, offset: 576)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !79, file: !6, size: 32, align: 16, elements: !166, templateParams: !18, identifier: "20dfe821e271770b6bd2378bc4b95011")
!166 = !{!167, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !165, file: !6, baseType: !168, size: 16, align: 16)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !169, file: !6, size: 16, align: 16, elements: !171, templateParams: !18, identifier: "728263ebd1636f5cb3ce99c41c9e8e0")
!169 = !DINamespace(name: "segmentation", scope: !170)
!170 = !DINamespace(name: "registers", scope: !52)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !6, baseType: !55, size: 16, align: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !165, file: !6, baseType: !168, size: 16, align: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !6, baseType: !175, size: 704, align: 64, extraData: i64 1)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !6, size: 704, align: 64, elements: !176, templateParams: !151, identifier: "8ed8934cfa9c1d1ce8936ddb150bb3db")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !6, baseType: !153, size: 640, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !144)
!181 = !{i32 8, !"PIC Level", i32 2}
!182 = !{i32 2, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !185, producer: "clang LLVM (rustc version 1.71.0-nightly (d0f204e4d 2023-04-16))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !186, globals: !209, splitDebugInlining: false)
!185 = !DIFile(filename: "src/lib.rs/@/8k7ou945ooh24pl", directory: "/Users/yaw/self/theo/cpu_interrupts")
!186 = !{!187, !196, !203}
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !188, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !191)
!188 = !DINamespace(name: "v1", scope: !189)
!189 = !DINamespace(name: "rt", scope: !190)
!190 = !DINamespace(name: "fmt", scope: !17)
!191 = !{!192, !193, !194, !195}
!192 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!193 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!194 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!195 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !25, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !197)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!199 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!201 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!202 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !52, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!209 = !{!0, !77, !84, !113, !118}
!210 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h48bd35ae6b30d7d7E", scope: !212, file: !211, line: 240, type: !214, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !231)
!211 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f61be3e42d6221d30b5488a425dbc01")
!212 = !DINamespace(name: "{impl#2}", scope: !213)
!213 = !DINamespace(name: "bit_field", scope: null)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !216, !137, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!217 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !6, size: 192, align: 64, elements: !222, templateParams: !18, identifier: "24a132ec608676bf484e0b39817cad59")
!220 = !DINamespace(name: "location", scope: !221)
!221 = !DINamespace(name: "panic", scope: !17)
!222 = !{!223, !229, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !219, file: !6, baseType: !224, size: 128, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !225, templateParams: !18, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!225 = !{!226, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !224, file: !6, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !224, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !6, baseType: !95, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !6, baseType: !95, size: 32, align: 32, offset: 160)
!231 = !{!232, !233, !234}
!232 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !211, line: 240, type: !216)
!233 = !DILocalVariable(name: "bit", arg: 2, scope: !210, file: !211, line: 240, type: !137)
!234 = !DILocalVariable(name: "value", arg: 3, scope: !210, file: !211, line: 240, type: !217)
!235 = !DILocation(line: 240, column: 24, scope: !210)
!236 = !DILocation(line: 240, column: 35, scope: !210)
!237 = !DILocation(line: 240, column: 47, scope: !210)
!238 = !DILocation(line: 241, column: 25, scope: !210)
!239 = !DILocation(line: 241, column: 17, scope: !210)
!240 = !DILocation(line: 243, column: 20, scope: !210)
!241 = !DILocation(line: 246, column: 31, scope: !210)
!242 = !DILocation(line: 244, column: 30, scope: !210)
!243 = !DILocation(line: 244, column: 21, scope: !210)
!244 = !DILocation(line: 243, column: 17, scope: !210)
!245 = !DILocation(line: 250, column: 14, scope: !210)
!246 = !DILocation(line: 246, column: 30, scope: !210)
!247 = !DILocation(line: 246, column: 21, scope: !210)
!248 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17h907ff0c82138f99eE", scope: !212, file: !211, line: 254, type: !249, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !267, retainedNodes: !259)
!249 = !DISubroutineType(types: !250)
!250 = !{!216, !216, !251, !55, !218}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !252, file: !6, size: 128, align: 64, elements: !254, templateParams: !257, identifier: "affb821d2ef067ad9b92b5e9467b6ff1")
!252 = !DINamespace(name: "range", scope: !253)
!253 = !DINamespace(name: "ops", scope: !17)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !251, file: !6, baseType: !137, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !251, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "Idx", type: !137)
!259 = !{!260, !261, !262, !263, !265}
!260 = !DILocalVariable(name: "self", arg: 1, scope: !248, file: !211, line: 254, type: !216)
!261 = !DILocalVariable(name: "range", arg: 2, scope: !248, file: !211, line: 254, type: !251)
!262 = !DILocalVariable(name: "value", arg: 3, scope: !248, file: !211, line: 254, type: !55)
!263 = !DILocalVariable(name: "range", scope: !264, file: !211, line: 255, type: !251, align: 8)
!264 = distinct !DILexicalBlock(scope: !248, file: !211, line: 255, column: 17)
!265 = !DILocalVariable(name: "bitmask", scope: !266, file: !211, line: 264, type: !55, align: 2)
!266 = distinct !DILexicalBlock(scope: !264, file: !211, line: 264, column: 17)
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "T", type: !251)
!269 = !DILocation(line: 254, column: 48, scope: !248)
!270 = !DILocation(line: 254, column: 59, scope: !248)
!271 = !DILocation(line: 254, column: 69, scope: !248)
!272 = !DILocation(line: 255, column: 29, scope: !248)
!273 = !DILocation(line: 255, column: 21, scope: !264)
!274 = !DILocation(line: 257, column: 25, scope: !264)
!275 = !DILocation(line: 257, column: 17, scope: !264)
!276 = !DILocation(line: 258, column: 25, scope: !264)
!277 = !DILocation(line: 258, column: 17, scope: !264)
!278 = !DILocation(line: 259, column: 25, scope: !264)
!279 = !DILocation(line: 259, column: 17, scope: !264)
!280 = !DILocation(line: 260, column: 54, scope: !264)
!281 = !DILocation(line: 260, column: 34, scope: !264)
!282 = !DILocation(line: 260, column: 25, scope: !264)
!283 = !DILocation(line: 261, column: 45, scope: !264)
!284 = !DILocation(line: 261, column: 25, scope: !264)
!285 = !DILocation(line: 260, column: 17, scope: !264)
!286 = !DILocation(line: 264, column: 45, scope: !264)
!287 = !DILocation(line: 264, column: 39, scope: !264)
!288 = !DILocation(line: 265, column: 37, scope: !264)
!289 = !DILocation(line: 264, column: 38, scope: !264)
!290 = !DILocation(line: 264, column: 37, scope: !264)
!291 = !DILocation(line: 264, column: 21, scope: !266)
!292 = !DILocation(line: 269, column: 26, scope: !266)
!293 = !DILocation(line: 269, column: 25, scope: !266)
!294 = !DILocation(line: 269, column: 45, scope: !266)
!295 = !DILocation(line: 269, column: 17, scope: !266)
!296 = !DILocation(line: 272, column: 14, scope: !248)
!297 = distinct !DISubprogram(name: "new<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV13new17he5cb93d1981fd897E", scope: !299, file: !298, line: 340, type: !356, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !376, retainedNodes: !373)
!298 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "182f86c33f08a6043ea29a144b857881")
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !190, file: !6, size: 128, align: 64, elements: !300, templateParams: !18, identifier: "3c2ef6ebf262caba6e43777d9c298823")
!300 = !{!301, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !299, file: !6, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !304, file: !6, align: 8, elements: !18, identifier: "43185ab61ba6b0b799bd1bef1620bc0b")
!304 = !DINamespace(name: "{extern#0}", scope: !190)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !299, file: !6, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !307, size: 64, align: 64, dwarfAddressSpace: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !302, !327}
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !310, file: !6, size: 8, align: 8, elements: !311, templateParams: !18, identifier: "1c6ce168e24238e83c13ec35dde7d382")
!310 = !DINamespace(name: "result", scope: !17)
!311 = !{!312}
!312 = !DICompositeType(tag: DW_TAG_variant_part, scope: !309, file: !6, size: 8, align: 8, elements: !313, templateParams: !18, identifier: "42dfca7da53f7734270db51480dbcc24", discriminator: !326)
!313 = !{!314, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !312, file: !6, baseType: !315, size: 8, align: 8, extraData: i64 0)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !309, file: !6, size: 8, align: 8, elements: !316, templateParams: !318, identifier: "4d011f8c16a13f53ec25b197c7b1903")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !315, file: !6, baseType: !67, align: 8, offset: 8)
!318 = !{!319, !320}
!319 = !DITemplateTypeParameter(name: "T", type: !67)
!320 = !DITemplateTypeParameter(name: "E", type: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !190, file: !6, align: 8, elements: !18, identifier: "d361babf030d8dcc5fc2146a5e622473")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !312, file: !6, baseType: !323, size: 8, align: 8, extraData: i64 1)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !309, file: !6, size: 8, align: 8, elements: !324, templateParams: !318, identifier: "c5af1e4fa5907b7a524a9ebbd4a5ec10")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !323, file: !6, baseType: !321, align: 8, offset: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, scope: !309, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !190, file: !6, size: 512, align: 64, elements: !329, templateParams: !18, identifier: "a3b888d0a58016a3ad42c934cf971ea3")
!329 = !{!330, !331, !333, !334, !346, !347}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !6, baseType: !95, size: 32, align: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !328, file: !6, baseType: !332, size: 32, align: 32, offset: 416)
!332 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !328, file: !6, baseType: !187, size: 8, align: 8, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !328, file: !6, baseType: !335, size: 128, align: 64, offset: 128)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !6, size: 128, align: 64, elements: !336, templateParams: !18, identifier: "8d57b0310dad0e81a52a7e1f827929d")
!336 = !{!337}
!337 = !DICompositeType(tag: DW_TAG_variant_part, scope: !335, file: !6, size: 128, align: 64, elements: !338, templateParams: !18, identifier: "1503e6327b896c262eca127cbc35ec74", discriminator: !345)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !337, file: !6, baseType: !340, size: 128, align: 64, extraData: i64 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !335, file: !6, size: 128, align: 64, elements: !18, templateParams: !138, identifier: "b9a11c756332445b5e317b2b2625f528")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !337, file: !6, baseType: !342, size: 128, align: 64, extraData: i64 1)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !335, file: !6, size: 128, align: 64, elements: !343, templateParams: !138, identifier: "87159a1745a522a36bc4a0700aab6dc3")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !342, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, scope: !335, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !328, file: !6, baseType: !335, size: 128, align: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !328, file: !6, baseType: !348, size: 128, align: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !349, templateParams: !18, identifier: "b58efcb3df0f0beb9aa098f750459fd2")
!349 = !{!350, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !348, file: !6, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !18, identifier: "bcfe988c4f0dd1d50291e24ffc6447")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !348, file: !6, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, align: 64, elements: !103)
!356 = !DISubroutineType(types: !357)
!357 = !{!299, !358, !370}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::InterruptStackFrame", baseType: !359, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !360, file: !6, size: 320, align: 64, elements: !361, templateParams: !18, identifier: "2abee48d77ea6a929a2fa58f87e88639")
!360 = !DINamespace(name: "idt", scope: !92)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !359, file: !6, baseType: !363, size: 320, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !360, file: !6, size: 320, align: 64, elements: !364, templateParams: !18, identifier: "c483cf0b7e4806c836efac66426d56e4")
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !363, file: !6, baseType: !98, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !363, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !363, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !363, file: !6, baseType: !98, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !363, file: !6, baseType: !102, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&x86_64::structures::idt::InterruptStackFrame, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !371, size: 64, align: 64, dwarfAddressSpace: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!309, !358, !327}
!373 = !{!374, !375}
!374 = !DILocalVariable(name: "x", arg: 1, scope: !297, file: !298, line: 340, type: !358)
!375 = !DILocalVariable(name: "f", arg: 2, scope: !297, file: !298, line: 340, type: !370)
!376 = !{!377}
!377 = !DITemplateTypeParameter(name: "T", type: !359)
!378 = !DILocation(line: 340, column: 23, scope: !297)
!379 = !DILocation(line: 340, column: 33, scope: !297)
!380 = !DILocation(line: 349, column: 18, scope: !297)
!381 = !DILocation(line: 350, column: 6, scope: !297)
!382 = !{i64 1}
!383 = distinct !DISubprogram(name: "new_debug<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h0d5af5b32407ad6dE", scope: !299, file: !298, line: 329, type: !384, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !376, retainedNodes: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{!299, !358}
!386 = !{!387}
!387 = !DILocalVariable(name: "x", arg: 1, scope: !383, file: !298, line: 329, type: !358)
!388 = !DILocation(line: 329, column: 30, scope: !383)
!389 = !DILocation(line: 330, column: 13, scope: !383)
!390 = !DILocation(line: 331, column: 10, scope: !383)
!391 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h811eeb463561ca95E", scope: !392, file: !298, line: 443, type: !451, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !456)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !190, file: !6, size: 384, align: 64, elements: !393, templateParams: !18, identifier: "dc49042afee2f796a8fa4685389c4b18")
!393 = !{!394, !400, !445}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !392, file: !6, baseType: !395, size: 128, align: 64, offset: 128)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !396, templateParams: !18, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !395, file: !6, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !395, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !392, file: !6, baseType: !401, size: 128, align: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !145, file: !6, size: 128, align: 64, elements: !402, templateParams: !18, identifier: "62d362416a1eb41bf984638792a73145")
!402 = !{!403}
!403 = !DICompositeType(tag: DW_TAG_variant_part, scope: !401, file: !6, size: 128, align: 64, elements: !404, templateParams: !18, identifier: "51527d667cbd19b863d93073f3cc474", discriminator: !444)
!404 = !{!405, !440}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !403, file: !6, baseType: !406, size: 128, align: 64, extraData: i64 0)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !401, file: !6, size: 128, align: 64, elements: !18, templateParams: !407, identifier: "66a59c7143972a6588bd1a9c8246e60f")
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "T", type: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !410, templateParams: !18, identifier: "66b60dbaad43783577fb935928e2ac56")
!410 = !{!411, !439}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !409, file: !6, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !188, file: !6, size: 448, align: 64, elements: !414, templateParams: !18, identifier: "1b0f53c51c2a0850dc27a4ea7530e9b2")
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !413, file: !6, baseType: !137, size: 64, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !413, file: !6, baseType: !417, size: 384, align: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !188, file: !6, size: 384, align: 64, elements: !418, templateParams: !18, identifier: "4ceb8823bbeb709d93b7ffb6ddd40132")
!418 = !{!419, !420, !421, !422, !438}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !417, file: !6, baseType: !332, size: 32, align: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !417, file: !6, baseType: !187, size: 8, align: 8, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !6, baseType: !95, size: 32, align: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !417, file: !6, baseType: !423, size: 128, align: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !188, file: !6, size: 128, align: 64, elements: !424, templateParams: !18, identifier: "beb49147a723c973b15fc19c2245c821")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_variant_part, scope: !423, file: !6, size: 128, align: 64, elements: !426, templateParams: !18, identifier: "c9db73f716fc865c39b9a87ace47fe10", discriminator: !437)
!426 = !{!427, !431, !435}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !425, file: !6, baseType: !428, size: 128, align: 64, extraData: i64 0)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !423, file: !6, size: 128, align: 64, elements: !429, templateParams: !18, identifier: "db0b97f002b1fae3dbc4ebdd853ff355")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !428, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !425, file: !6, baseType: !432, size: 128, align: 64, extraData: i64 1)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !423, file: !6, size: 128, align: 64, elements: !433, templateParams: !18, identifier: "49d2632f301eeedc951f3431bb382902")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !432, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !425, file: !6, baseType: !436, size: 128, align: 64, extraData: i64 2)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !423, file: !6, size: 128, align: 64, elements: !18, identifier: "afc023622f1fd60e7b29fd0e4f997a04")
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !417, file: !6, baseType: !423, size: 128, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !409, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !403, file: !6, baseType: !441, size: 128, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !401, file: !6, size: 128, align: 64, elements: !442, templateParams: !407, identifier: "45eaeac90b0c2cad515177aa4ad012c0")
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !441, file: !6, baseType: !409, size: 128, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !392, file: !6, baseType: !446, size: 128, align: 64, offset: 256)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !447, templateParams: !18, identifier: "83fd9dd078f03ba333a6c21d9c3331b7")
!447 = !{!448, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !446, file: !6, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !446, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!392, !395, !446, !409, !453}
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !190, file: !6, align: 8, elements: !454, templateParams: !18, identifier: "4faa2d0373bebf10eea7ffc10aef50")
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !453, file: !6, baseType: !67, align: 8)
!456 = !{!457, !458, !459, !460, !461}
!457 = !DILocalVariable(name: "pieces", arg: 1, scope: !391, file: !298, line: 444, type: !395)
!458 = !DILocalVariable(name: "args", arg: 2, scope: !391, file: !298, line: 445, type: !446)
!459 = !DILocalVariable(name: "fmt", arg: 3, scope: !391, file: !298, line: 446, type: !409)
!460 = !DILocalVariable(name: "_unsafe_arg", scope: !391, file: !298, line: 447, type: !453, align: 1)
!461 = !DILocalVariable(arg: 4, scope: !391, file: !298, line: 447, type: !453)
!462 = !DILocation(line: 447, column: 9, scope: !391)
!463 = !DILocation(line: 444, column: 9, scope: !391)
!464 = !DILocation(line: 445, column: 9, scope: !391)
!465 = !DILocation(line: 446, column: 9, scope: !391)
!466 = !DILocation(line: 449, column: 34, scope: !391)
!467 = !DILocation(line: 449, column: 9, scope: !391)
!468 = !{i64 8}
!469 = !DILocation(line: 450, column: 6, scope: !391)
!470 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h1dbd5c8aef8c9069E", scope: !392, file: !298, line: 399, type: !471, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!392, !395}
!473 = !{!474}
!474 = !DILocalVariable(name: "pieces", arg: 1, scope: !470, file: !298, line: 399, type: !395)
!475 = !DILocation(line: 399, column: 28, scope: !470)
!476 = !DILocation(line: 400, column: 12, scope: !470)
!477 = !DILocation(line: 403, column: 34, scope: !470)
!478 = !DILocation(line: 403, column: 9, scope: !470)
!479 = !DILocation(line: 404, column: 6, scope: !470)
!480 = !DILocation(line: 401, column: 13, scope: !470)
!481 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd4998817709ddb54E", scope: !483, file: !482, line: 250, type: !485, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !493, retainedNodes: !490)
!482 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!483 = !DINamespace(name: "FnOnce", scope: !484)
!484 = !DINamespace(name: "function", scope: !253)
!485 = !DISubroutineType(types: !486)
!486 = !{!153, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !488, size: 64, align: 64, dwarfAddressSpace: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!153}
!490 = !{!491, !492}
!491 = !DILocalVariable(arg: 1, scope: !481, file: !482, line: 250, type: !487)
!492 = !DILocalVariable(arg: 2, scope: !481, file: !482, line: 250, type: !67)
!493 = !{!494, !495}
!494 = !DITemplateTypeParameter(name: "Self", type: !487)
!495 = !DITemplateTypeParameter(name: "Args", type: !67)
!496 = !DILocation(line: 250, column: 5, scope: !481)
!497 = !DILocalVariable(name: "global_descriptor_table", scope: !498, file: !89, line: 26, type: !156, align: 8)
!498 = distinct !DILexicalBlock(scope: !499, file: !89, line: 26, column: 9)
!499 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h2d3a827c5a997596E", scope: !87, file: !80, line: 137, type: !488, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !500)
!500 = !{!497, !501, !503, !505, !507}
!501 = !DILocalVariable(name: "stack_start", scope: !502, file: !89, line: 31, type: !98, align: 8)
!502 = distinct !DILexicalBlock(scope: !498, file: !89, line: 31, column: 17)
!503 = !DILocalVariable(name: "stack_end", scope: !504, file: !89, line: 32, type: !98, align: 8)
!504 = distinct !DILexicalBlock(scope: !502, file: !89, line: 32, column: 17)
!505 = !DILocalVariable(name: "tss_selector", scope: !506, file: !89, line: 38, type: !168, align: 2)
!506 = distinct !DILexicalBlock(scope: !498, file: !89, line: 38, column: 9)
!507 = !DILocalVariable(name: "code_selector", scope: !508, file: !89, line: 39, type: !168, align: 2)
!508 = distinct !DILexicalBlock(scope: !506, file: !89, line: 39, column: 9)
!509 = !DILocation(line: 26, column: 13, scope: !498, inlinedAt: !510)
!510 = distinct !DILocation(line: 250, column: 5, scope: !481)
!511 = !DILocation(line: 26, column: 43, scope: !512, inlinedAt: !510)
!512 = !DILexicalBlockFile(scope: !499, file: !89, discriminator: 0)
!513 = !DILocation(line: 31, column: 35, scope: !498, inlinedAt: !510)
!514 = !DILocation(line: 31, column: 21, scope: !502, inlinedAt: !510)
!515 = !DILocation(line: 32, column: 33, scope: !502, inlinedAt: !510)
!516 = !DILocation(line: 32, column: 21, scope: !504, inlinedAt: !510)
!517 = !DILocation(line: 29, column: 13, scope: !498, inlinedAt: !510)
!518 = !DILocation(line: 38, column: 62, scope: !498, inlinedAt: !510)
!519 = !DILocation(line: 38, column: 28, scope: !498, inlinedAt: !510)
!520 = !DILocation(line: 38, column: 13, scope: !506, inlinedAt: !510)
!521 = !DILocation(line: 39, column: 63, scope: !506, inlinedAt: !510)
!522 = !DILocation(line: 39, column: 29, scope: !506, inlinedAt: !510)
!523 = !DILocation(line: 39, column: 13, scope: !508, inlinedAt: !510)
!524 = !DILocation(line: 41, column: 20, scope: !508, inlinedAt: !510)
!525 = !DILocation(line: 42, column: 24, scope: !508, inlinedAt: !510)
!526 = !DILocation(line: 40, column: 9, scope: !508, inlinedAt: !510)
!527 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h09fe717b155e6b53E", scope: !529, file: !528, line: 490, type: !530, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !540, retainedNodes: !538)
!528 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "4b0ac29df94a7dc1bf2bc7efca5e253a")
!529 = !DINamespace(name: "ptr", scope: !17)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !533, size: 64, align: 64, dwarfAddressSpace: 0)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !128, file: !6, size: 128, align: 64, elements: !534, templateParams: !18, identifier: "7a3d61ea348a2d26893c5fd74b61a8f6")
!534 = !{!535, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !533, file: !6, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !533, file: !6, baseType: !217, size: 8, align: 8, offset: 64)
!538 = !{!539}
!539 = !DILocalVariable(arg: 1, scope: !527, file: !528, line: 490, type: !532)
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "T", type: !533)
!542 = !DILocation(line: 490, column: 1, scope: !527)
!543 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$spin..mutex..MutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h9afaac5289a72708E", scope: !529, file: !528, line: 490, type: !544, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !558, retainedNodes: !556)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<pic8259::ChainedPics>", baseType: !547, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<pic8259::ChainedPics>", scope: !7, file: !6, size: 128, align: 64, elements: !548, templateParams: !73, identifier: "66c44b49cc85414db4db111b156d89f1")
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !547, file: !6, baseType: !550, size: 128, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<pic8259::ChainedPics>", scope: !12, file: !6, size: 128, align: 64, elements: !551, templateParams: !73, identifier: "b2a44671d64955bb2d25ba980b14006e")
!551 = !{!552, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !550, file: !6, baseType: !553, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !6, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut pic8259::ChainedPics", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!556 = !{!557}
!557 = !DILocalVariable(arg: 1, scope: !543, file: !528, line: 490, type: !546)
!558 = !{!559}
!559 = !DITemplateTypeParameter(name: "T", type: !547)
!560 = !DILocation(line: 490, column: 1, scope: !543)
!561 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>>", linkageName: "_ZN4core3ptr82drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$pic8259..ChainedPics$GT$$GT$17h22174d07528b24a1E", scope: !529, file: !528, line: 490, type: !562, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !567, retainedNodes: !565)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<pic8259::ChainedPics>", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !{!566}
!566 = !DILocalVariable(arg: 1, scope: !561, file: !528, line: 490, type: !564)
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !550)
!569 = !DILocation(line: 490, column: 1, scope: !561)
!570 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h68aaab60720e7d7dE", scope: !572, file: !571, line: 100, type: !573, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !18)
!571 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdccd67e2121209a433721fb94464813")
!572 = !DINamespace(name: "hint", scope: !17)
!573 = !DISubroutineType(types: !574)
!574 = !{null}
!575 = !DILocation(line: 104, column: 9, scope: !570)
!576 = !DILocation(line: 105, column: 9, scope: !570)
!577 = !DILocation(line: 2487, column: 21, scope: !578, inlinedAt: !581)
!578 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h37f6a194ad8174bbE", scope: !580, file: !579, line: 2484, type: !573, scopeLine: 2484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !18)
!579 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a443bdaf0a09f89f5b2fb75aa981800")
!580 = !DINamespace(name: "unreachable_unchecked", scope: !572)
!581 = distinct !DILocation(line: 104, column: 9, scope: !570)
!582 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17hffa38ea168d70f70E", scope: !24, file: !583, line: 717, type: !584, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !602)
!583 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "cd92f8d8b05e6b3d85c324633916e8b5")
!584 = !DISubroutineType(types: !585)
!585 = !{!586, !553, !217, !217, !196, !196}
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !310, file: !6, size: 16, align: 8, elements: !587, templateParams: !18, identifier: "d14742e3cdfbc45b2312623460910a60")
!587 = !{!588}
!588 = !DICompositeType(tag: DW_TAG_variant_part, scope: !586, file: !6, size: 16, align: 8, elements: !589, templateParams: !18, identifier: "2d16ff72bb19628f42a39c72eb930f", discriminator: !601)
!589 = !{!590, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !588, file: !6, baseType: !591, size: 16, align: 8, extraData: i64 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !586, file: !6, size: 16, align: 8, elements: !592, templateParams: !594, identifier: "e5915f6eed895eabe7f46af7d3b6ce96")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !591, file: !6, baseType: !217, size: 8, align: 8, offset: 8)
!594 = !{!595, !596}
!595 = !DITemplateTypeParameter(name: "T", type: !217)
!596 = !DITemplateTypeParameter(name: "E", type: !217)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !588, file: !6, baseType: !598, size: 16, align: 8, extraData: i64 1)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !586, file: !6, size: 16, align: 8, elements: !599, templateParams: !594, identifier: "d9a4a300ea44b15355740d22673dbe8")
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !598, file: !6, baseType: !217, size: 8, align: 8, offset: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!602 = !{!603, !604, !605, !606, !607, !608, !610}
!603 = !DILocalVariable(name: "self", arg: 1, scope: !582, file: !583, line: 718, type: !553)
!604 = !DILocalVariable(name: "current", arg: 2, scope: !582, file: !583, line: 719, type: !217)
!605 = !DILocalVariable(name: "new", arg: 3, scope: !582, file: !583, line: 720, type: !217)
!606 = !DILocalVariable(name: "success", arg: 4, scope: !582, file: !583, line: 721, type: !196)
!607 = !DILocalVariable(name: "failure", arg: 5, scope: !582, file: !583, line: 722, type: !196)
!608 = !DILocalVariable(name: "x", scope: !609, file: !583, line: 728, type: !33, align: 1)
!609 = distinct !DILexicalBlock(scope: !582, file: !583, line: 728, column: 13)
!610 = !DILocalVariable(name: "x", scope: !611, file: !583, line: 729, type: !33, align: 1)
!611 = distinct !DILexicalBlock(scope: !582, file: !583, line: 729, column: 13)
!612 = !DILocation(line: 718, column: 9, scope: !582)
!613 = !DILocation(line: 719, column: 9, scope: !582)
!614 = !DILocation(line: 720, column: 9, scope: !582)
!615 = !DILocation(line: 721, column: 9, scope: !582)
!616 = !DILocation(line: 722, column: 9, scope: !582)
!617 = !DILocalVariable(name: "self", arg: 1, scope: !618, file: !619, line: 2054, type: !623)
!618 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h27853df6f4207287E", scope: !29, file: !619, line: 2054, type: !620, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !34, retainedNodes: !624)
!619 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a756604d5b8adc8c373a79367d25e51")
!620 = !DISubroutineType(types: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!624 = !{!617}
!625 = !DILocation(line: 2054, column: 22, scope: !618, inlinedAt: !626)
!626 = distinct !DILocation(line: 726, column: 42, scope: !582)
!627 = !DILocation(line: 726, column: 56, scope: !582)
!628 = !DILocation(line: 726, column: 71, scope: !582)
!629 = !DILocation(line: 726, column: 13, scope: !582)
!630 = !DILocation(line: 725, column: 15, scope: !582)
!631 = !{i8 0, i8 2}
!632 = !DILocation(line: 725, column: 9, scope: !582)
!633 = !DILocation(line: 728, column: 16, scope: !582)
!634 = !DILocation(line: 728, column: 16, scope: !609)
!635 = !DILocation(line: 728, column: 25, scope: !609)
!636 = !DILocation(line: 728, column: 22, scope: !609)
!637 = !DILocation(line: 728, column: 31, scope: !582)
!638 = !DILocation(line: 729, column: 17, scope: !582)
!639 = !DILocation(line: 729, column: 17, scope: !611)
!640 = !DILocation(line: 729, column: 27, scope: !611)
!641 = !DILocation(line: 729, column: 23, scope: !611)
!642 = !DILocation(line: 729, column: 33, scope: !582)
!643 = !DILocation(line: 731, column: 6, scope: !582)
!644 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17h0e6e267b4d6c520cE", scope: !24, file: !583, line: 497, type: !645, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!217, !553, !196}
!647 = !{!648, !649}
!648 = !DILocalVariable(name: "self", arg: 1, scope: !644, file: !583, line: 497, type: !553)
!649 = !DILocalVariable(name: "order", arg: 2, scope: !644, file: !583, line: 497, type: !196)
!650 = !DILocation(line: 497, column: 17, scope: !644)
!651 = !DILocation(line: 497, column: 24, scope: !644)
!652 = !DILocation(line: 2054, column: 22, scope: !618, inlinedAt: !653)
!653 = distinct !DILocation(line: 500, column: 30, scope: !644)
!654 = !DILocation(line: 500, column: 18, scope: !644)
!655 = !DILocation(line: 501, column: 6, scope: !644)
!656 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h928dcf2ffbedbfacE", scope: !24, file: !583, line: 525, type: !657, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !553, !217, !196}
!659 = !{!660, !661, !662}
!660 = !DILocalVariable(name: "self", arg: 1, scope: !656, file: !583, line: 525, type: !553)
!661 = !DILocalVariable(name: "val", arg: 2, scope: !656, file: !583, line: 525, type: !217)
!662 = !DILocalVariable(name: "order", arg: 3, scope: !656, file: !583, line: 525, type: !196)
!663 = !DILocation(line: 525, column: 18, scope: !656)
!664 = !DILocation(line: 525, column: 25, scope: !656)
!665 = !DILocation(line: 525, column: 36, scope: !656)
!666 = !DILocation(line: 2054, column: 22, scope: !618, inlinedAt: !667)
!667 = distinct !DILocation(line: 529, column: 26, scope: !656)
!668 = !DILocation(line: 529, column: 40, scope: !656)
!669 = !DILocation(line: 529, column: 13, scope: !656)
!670 = !DILocation(line: 531, column: 6, scope: !656)
!671 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17he503be0d3bd80128E", scope: !131, file: !583, line: 2375, type: !672, scopeLine: 2375, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!137, !536, !137, !137, !196}
!674 = !{!675, !676, !677, !678, !679, !681}
!675 = !DILocalVariable(name: "self", arg: 1, scope: !671, file: !583, line: 2375, type: !536)
!676 = !DILocalVariable(name: "current", arg: 2, scope: !671, file: !583, line: 2376, type: !137)
!677 = !DILocalVariable(name: "new", arg: 3, scope: !671, file: !583, line: 2377, type: !137)
!678 = !DILocalVariable(name: "order", arg: 4, scope: !671, file: !583, line: 2378, type: !196)
!679 = !DILocalVariable(name: "x", scope: !680, file: !583, line: 2383, type: !137, align: 8)
!680 = distinct !DILexicalBlock(scope: !671, file: !583, line: 2383, column: 21)
!681 = !DILocalVariable(name: "x", scope: !682, file: !583, line: 2384, type: !137, align: 8)
!682 = distinct !DILexicalBlock(scope: !671, file: !583, line: 2384, column: 21)
!683 = !DILocation(line: 2375, column: 37, scope: !671)
!684 = !DILocation(line: 2376, column: 37, scope: !671)
!685 = !DILocation(line: 2377, column: 37, scope: !671)
!686 = !DILocation(line: 2378, column: 37, scope: !671)
!687 = !DILocation(line: 2382, column: 45, scope: !671)
!688 = !{i8 0, i8 5}
!689 = !DILocation(line: 2379, column: 23, scope: !671)
!690 = !{i64 0, i64 2}
!691 = !DILocation(line: 2379, column: 17, scope: !671)
!692 = !DILocation(line: 2383, column: 24, scope: !671)
!693 = !DILocation(line: 2383, column: 24, scope: !680)
!694 = !DILocation(line: 2383, column: 30, scope: !680)
!695 = !DILocation(line: 2383, column: 30, scope: !671)
!696 = !DILocation(line: 2384, column: 25, scope: !671)
!697 = !DILocation(line: 2384, column: 25, scope: !682)
!698 = !DILocation(line: 2384, column: 31, scope: !682)
!699 = !DILocation(line: 2384, column: 31, scope: !671)
!700 = !DILocation(line: 2386, column: 14, scope: !671)
!701 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17hd1e10b0700d727e4E", scope: !131, file: !583, line: 2429, type: !702, scopeLine: 2429, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !719)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !536, !137, !137, !196, !196}
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !310, file: !6, size: 128, align: 64, elements: !705, templateParams: !18, identifier: "565c6d9cdf8700eaf3f223f92f649dec")
!705 = !{!706}
!706 = !DICompositeType(tag: DW_TAG_variant_part, scope: !704, file: !6, size: 128, align: 64, elements: !707, templateParams: !18, identifier: "7184d1df8210091c7c039bdb64aedb2a", discriminator: !718)
!707 = !{!708, !714}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !706, file: !6, baseType: !709, size: 128, align: 64, extraData: i64 0)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !704, file: !6, size: 128, align: 64, elements: !710, templateParams: !712, identifier: "a0b77fff8010b746fe863a8fc42bcc7a")
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !709, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!712 = !{!139, !713}
!713 = !DITemplateTypeParameter(name: "E", type: !137)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !706, file: !6, baseType: !715, size: 128, align: 64, extraData: i64 1)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !704, file: !6, size: 128, align: 64, elements: !716, templateParams: !712, identifier: "847c9cf2064844b16232bca7c7d2a4e")
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !715, file: !6, baseType: !137, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !583, line: 2429, type: !536)
!721 = !DILocalVariable(name: "current", arg: 2, scope: !701, file: !583, line: 2430, type: !137)
!722 = !DILocalVariable(name: "new", arg: 3, scope: !701, file: !583, line: 2431, type: !137)
!723 = !DILocalVariable(name: "success", arg: 4, scope: !701, file: !583, line: 2432, type: !196)
!724 = !DILocalVariable(name: "failure", arg: 5, scope: !701, file: !583, line: 2433, type: !196)
!725 = !DILocation(line: 2429, column: 37, scope: !701)
!726 = !DILocation(line: 2430, column: 37, scope: !701)
!727 = !DILocation(line: 2431, column: 37, scope: !701)
!728 = !DILocation(line: 2432, column: 37, scope: !701)
!729 = !DILocation(line: 2433, column: 37, scope: !701)
!730 = !DILocalVariable(name: "self", arg: 1, scope: !731, file: !619, line: 2054, type: !735)
!731 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hdc0e19699319179aE", scope: !134, file: !619, line: 2054, type: !732, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !138, retainedNodes: !736)
!732 = !DISubroutineType(types: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!736 = !{!730}
!737 = !DILocation(line: 2054, column: 22, scope: !731, inlinedAt: !738)
!738 = distinct !DILocation(line: 2435, column: 50, scope: !701)
!739 = !DILocation(line: 2435, column: 26, scope: !701)
!740 = !DILocation(line: 2436, column: 14, scope: !701)
!741 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h2ceb2300599027e9E", scope: !131, file: !583, line: 2262, type: !742, scopeLine: 2262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{!137, !536, !196}
!744 = !{!745, !746}
!745 = !DILocalVariable(name: "self", arg: 1, scope: !741, file: !583, line: 2262, type: !536)
!746 = !DILocalVariable(name: "order", arg: 2, scope: !741, file: !583, line: 2262, type: !196)
!747 = !DILocation(line: 2262, column: 25, scope: !741)
!748 = !DILocation(line: 2262, column: 32, scope: !741)
!749 = !DILocation(line: 2054, column: 22, scope: !731, inlinedAt: !750)
!750 = distinct !DILocation(line: 2264, column: 38, scope: !741)
!751 = !DILocation(line: 2264, column: 26, scope: !741)
!752 = !DILocation(line: 2265, column: 14, scope: !741)
!753 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h69973cac761de0a5E", scope: !131, file: !583, line: 2289, type: !754, scopeLine: 2289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !536, !137, !196}
!756 = !{!757, !758, !759}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !753, file: !583, line: 2289, type: !536)
!758 = !DILocalVariable(name: "val", arg: 2, scope: !753, file: !583, line: 2289, type: !137)
!759 = !DILocalVariable(name: "order", arg: 3, scope: !753, file: !583, line: 2289, type: !196)
!760 = !DILocation(line: 2289, column: 26, scope: !753)
!761 = !DILocation(line: 2289, column: 33, scope: !753)
!762 = !DILocation(line: 2289, column: 49, scope: !753)
!763 = !DILocation(line: 2054, column: 22, scope: !731, inlinedAt: !764)
!764 = distinct !DILocation(line: 2291, column: 39, scope: !753)
!765 = !DILocation(line: 2291, column: 26, scope: !753)
!766 = !DILocation(line: 2292, column: 14, scope: !753)
!767 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17h6ccf1840edd0bb56E", scope: !25, file: !583, line: 3626, type: !573, scopeLine: 3626, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !18)
!768 = !DILocation(line: 175, column: 18, scope: !769, inlinedAt: !770)
!769 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h3071c5bbd432a2dbE", scope: !572, file: !571, line: 165, type: !573, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !18)
!770 = distinct !DILocation(line: 3627, column: 5, scope: !767)
!771 = !DILocation(line: 3628, column: 2, scope: !767)
!772 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h34ee6cef686d3901E", scope: !25, file: !583, line: 3221, type: !773, scopeLine: 3221, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !138, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!704, !734, !137, !137, !196, !196}
!775 = !{!776, !777, !778, !779, !780, !781, !783}
!776 = !DILocalVariable(name: "dst", arg: 1, scope: !772, file: !583, line: 3222, type: !734)
!777 = !DILocalVariable(name: "old", arg: 2, scope: !772, file: !583, line: 3223, type: !137)
!778 = !DILocalVariable(name: "new", arg: 3, scope: !772, file: !583, line: 3224, type: !137)
!779 = !DILocalVariable(name: "success", arg: 4, scope: !772, file: !583, line: 3225, type: !196)
!780 = !DILocalVariable(name: "failure", arg: 5, scope: !772, file: !583, line: 3226, type: !196)
!781 = !DILocalVariable(name: "val", scope: !782, file: !583, line: 3229, type: !137, align: 8)
!782 = distinct !DILexicalBlock(scope: !772, file: !583, line: 3229, column: 5)
!783 = !DILocalVariable(name: "ok", scope: !782, file: !583, line: 3229, type: !217, align: 1)
!784 = !DILocation(line: 3222, column: 5, scope: !772)
!785 = !DILocation(line: 3223, column: 5, scope: !772)
!786 = !DILocation(line: 3224, column: 5, scope: !772)
!787 = !DILocation(line: 3225, column: 5, scope: !772)
!788 = !DILocation(line: 3226, column: 5, scope: !772)
!789 = !DILocation(line: 3230, column: 15, scope: !772)
!790 = !DILocation(line: 3230, column: 9, scope: !772)
!791 = !DILocation(line: 3243, column: 34, scope: !772)
!792 = !DILocation(line: 3244, column: 34, scope: !772)
!793 = !DILocation(line: 3245, column: 33, scope: !772)
!794 = !DILocation(line: 3229, column: 10, scope: !772)
!795 = !DILocation(line: 3229, column: 10, scope: !782)
!796 = !DILocation(line: 3229, column: 15, scope: !772)
!797 = !DILocation(line: 3229, column: 15, scope: !782)
!798 = !DILocation(line: 3250, column: 8, scope: !782)
!799 = !DILocation(line: 3240, column: 34, scope: !772)
!800 = !DILocation(line: 3241, column: 34, scope: !772)
!801 = !DILocation(line: 3242, column: 33, scope: !772)
!802 = !DILocation(line: 3234, column: 35, scope: !772)
!803 = !DILocation(line: 3235, column: 35, scope: !772)
!804 = !DILocation(line: 3236, column: 34, scope: !772)
!805 = !DILocation(line: 3237, column: 35, scope: !772)
!806 = !DILocation(line: 3238, column: 35, scope: !772)
!807 = !DILocation(line: 3239, column: 34, scope: !772)
!808 = !DILocation(line: 3231, column: 35, scope: !772)
!809 = !DILocation(line: 3232, column: 35, scope: !772)
!810 = !DILocation(line: 3233, column: 34, scope: !772)
!811 = !DILocation(line: 3247, column: 29, scope: !772)
!812 = !DILocation(line: 3246, column: 28, scope: !772)
!813 = !DILocation(line: 3250, column: 30, scope: !782)
!814 = !DILocation(line: 3250, column: 5, scope: !782)
!815 = !DILocation(line: 3250, column: 13, scope: !782)
!816 = !DILocation(line: 3251, column: 2, scope: !772)
!817 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h912df7a4831edcc2E", scope: !25, file: !583, line: 3128, type: !818, scopeLine: 3128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{!196, !196}
!820 = !{!821}
!821 = !DILocalVariable(name: "order", arg: 1, scope: !817, file: !583, line: 3128, type: !196)
!822 = !DILocation(line: 3128, column: 31, scope: !817)
!823 = !DILocation(line: 3129, column: 11, scope: !817)
!824 = !DILocation(line: 3129, column: 5, scope: !817)
!825 = !DILocation(line: 3131, column: 20, scope: !817)
!826 = !DILocation(line: 3130, column: 20, scope: !817)
!827 = !DILocation(line: 3133, column: 20, scope: !817)
!828 = !DILocation(line: 3134, column: 19, scope: !817)
!829 = !DILocation(line: 3132, column: 19, scope: !817)
!830 = !DILocation(line: 3136, column: 2, scope: !817)
!831 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17ha82d5d44d0ccee40E", scope: !25, file: !583, line: 3256, type: !832, scopeLine: 3256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !34, retainedNodes: !849)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !622, !33, !33, !196, !196}
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !310, file: !6, size: 16, align: 8, elements: !835, templateParams: !18, identifier: "ae4cf7aa557f9f218fcc885c973c6c6e")
!835 = !{!836}
!836 = !DICompositeType(tag: DW_TAG_variant_part, scope: !834, file: !6, size: 16, align: 8, elements: !837, templateParams: !18, identifier: "654017a428148ef5c2198bc9634aa127", discriminator: !848)
!837 = !{!838, !844}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !836, file: !6, baseType: !839, size: 16, align: 8, extraData: i64 0)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !834, file: !6, size: 16, align: 8, elements: !840, templateParams: !842, identifier: "9f456b00bd188f849133b2646e479328")
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!842 = !{!35, !843}
!843 = !DITemplateTypeParameter(name: "E", type: !33)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !836, file: !6, baseType: !845, size: 16, align: 8, extraData: i64 1)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !834, file: !6, size: 16, align: 8, elements: !846, templateParams: !842, identifier: "31132c258d88d25854eb68189fbb0e59")
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !845, file: !6, baseType: !33, size: 8, align: 8, offset: 8)
!848 = !DIDerivedType(tag: DW_TAG_member, scope: !834, file: !6, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!849 = !{!850, !851, !852, !853, !854, !855, !857}
!850 = !DILocalVariable(name: "dst", arg: 1, scope: !831, file: !583, line: 3257, type: !622)
!851 = !DILocalVariable(name: "old", arg: 2, scope: !831, file: !583, line: 3258, type: !33)
!852 = !DILocalVariable(name: "new", arg: 3, scope: !831, file: !583, line: 3259, type: !33)
!853 = !DILocalVariable(name: "success", arg: 4, scope: !831, file: !583, line: 3260, type: !196)
!854 = !DILocalVariable(name: "failure", arg: 5, scope: !831, file: !583, line: 3261, type: !196)
!855 = !DILocalVariable(name: "val", scope: !856, file: !583, line: 3264, type: !33, align: 1)
!856 = distinct !DILexicalBlock(scope: !831, file: !583, line: 3264, column: 5)
!857 = !DILocalVariable(name: "ok", scope: !856, file: !583, line: 3264, type: !217, align: 1)
!858 = !DILocation(line: 3257, column: 5, scope: !831)
!859 = !DILocation(line: 3258, column: 5, scope: !831)
!860 = !DILocation(line: 3259, column: 5, scope: !831)
!861 = !DILocation(line: 3260, column: 5, scope: !831)
!862 = !DILocation(line: 3261, column: 5, scope: !831)
!863 = !DILocation(line: 3265, column: 15, scope: !831)
!864 = !DILocation(line: 3265, column: 9, scope: !831)
!865 = !DILocation(line: 3278, column: 34, scope: !831)
!866 = !DILocation(line: 3279, column: 34, scope: !831)
!867 = !DILocation(line: 3280, column: 33, scope: !831)
!868 = !DILocation(line: 3264, column: 10, scope: !831)
!869 = !DILocation(line: 3264, column: 10, scope: !856)
!870 = !DILocation(line: 3264, column: 15, scope: !831)
!871 = !DILocation(line: 3264, column: 15, scope: !856)
!872 = !DILocation(line: 3285, column: 8, scope: !856)
!873 = !DILocation(line: 3275, column: 34, scope: !831)
!874 = !DILocation(line: 3276, column: 34, scope: !831)
!875 = !DILocation(line: 3277, column: 33, scope: !831)
!876 = !DILocation(line: 3269, column: 35, scope: !831)
!877 = !DILocation(line: 3270, column: 35, scope: !831)
!878 = !DILocation(line: 3271, column: 34, scope: !831)
!879 = !DILocation(line: 3272, column: 35, scope: !831)
!880 = !DILocation(line: 3273, column: 35, scope: !831)
!881 = !DILocation(line: 3274, column: 34, scope: !831)
!882 = !DILocation(line: 3266, column: 35, scope: !831)
!883 = !DILocation(line: 3267, column: 35, scope: !831)
!884 = !DILocation(line: 3268, column: 34, scope: !831)
!885 = !DILocation(line: 3282, column: 29, scope: !831)
!886 = !DILocation(line: 3281, column: 28, scope: !831)
!887 = !DILocation(line: 3285, column: 30, scope: !856)
!888 = !DILocation(line: 3285, column: 5, scope: !856)
!889 = !DILocation(line: 3285, column: 13, scope: !856)
!890 = !DILocation(line: 3286, column: 2, scope: !831)
!891 = distinct !DISubprogram(name: "as_ref<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17h0667dd1945e9f219E", scope: !144, file: !892, line: 674, type: !893, scopeLine: 674, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !151, retainedNodes: !910)
!892 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "57ab105cef20f1dc79a065da4ca5bc2f")
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !909}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !145, file: !6, size: 64, align: 64, elements: !896, templateParams: !18, identifier: "ea5aa5dd9d84d03371a74ed0b0b84647")
!896 = !{!897}
!897 = !DICompositeType(tag: DW_TAG_variant_part, scope: !895, file: !6, size: 64, align: 64, elements: !898, templateParams: !18, identifier: "8e311f9531b0ff8ba63f652fb2750202", discriminator: !908)
!898 = !{!899, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !897, file: !6, baseType: !900, size: 64, align: 64, extraData: i64 0)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !895, file: !6, size: 64, align: 64, elements: !18, templateParams: !901, identifier: "aed8f0c3e902f711f9f76e07ba7b07a6")
!901 = !{!902}
!902 = !DITemplateTypeParameter(name: "T", type: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !897, file: !6, baseType: !905, size: 64, align: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !895, file: !6, size: 64, align: 64, elements: !906, templateParams: !901, identifier: "c0c9421741626d0fa2ab42a66ff5647")
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !905, file: !6, baseType: !903, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, scope: !895, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!910 = !{!911, !912}
!911 = !DILocalVariable(name: "self", arg: 1, scope: !891, file: !892, line: 674, type: !909)
!912 = !DILocalVariable(name: "x", scope: !913, file: !892, line: 676, type: !903, align: 8)
!913 = distinct !DILexicalBlock(scope: !891, file: !892, line: 676, column: 13)
!914 = !DILocation(line: 674, column: 25, scope: !891)
!915 = !DILocation(line: 675, column: 15, scope: !891)
!916 = !DILocation(line: 675, column: 9, scope: !891)
!917 = !DILocation(line: 677, column: 21, scope: !891)
!918 = !DILocation(line: 676, column: 18, scope: !891)
!919 = !DILocation(line: 676, column: 18, scope: !913)
!920 = !DILocation(line: 676, column: 28, scope: !913)
!921 = !DILocation(line: 676, column: 34, scope: !891)
!922 = !DILocation(line: 679, column: 6, scope: !891)
!923 = distinct !DISubprogram(name: "is_ok<bool, bool>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$5is_ok17h2293e759df2c8f5aE", scope: !586, file: !924, line: 539, type: !925, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !594, retainedNodes: !928)
!924 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "412c1de3c960203252045b1306698fcf")
!925 = !DISubroutineType(types: !926)
!926 = !{!217, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::result::Result<bool, bool>", baseType: !586, size: 64, align: 64, dwarfAddressSpace: 0)
!928 = !{!929}
!929 = !DILocalVariable(name: "self", arg: 1, scope: !923, file: !924, line: 539, type: !927)
!930 = !DILocation(line: 539, column: 24, scope: !923)
!931 = !DILocation(line: 540, column: 18, scope: !923)
!932 = !DILocation(line: 540, column: 9, scope: !923)
!933 = !DILocation(line: 541, column: 6, scope: !923)
!934 = distinct !DISubprogram(name: "is_err<bool, bool>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$6is_err17hfc7e605ec691582dE", scope: !586, file: !924, line: 582, type: !925, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !594, retainedNodes: !935)
!935 = !{!936}
!936 = !DILocalVariable(name: "self", arg: 1, scope: !934, file: !924, line: 582, type: !927)
!937 = !DILocation(line: 582, column: 25, scope: !934)
!938 = !DILocation(line: 583, column: 10, scope: !934)
!939 = !DILocation(line: 583, column: 9, scope: !934)
!940 = !DILocation(line: 584, column: 6, scope: !934)
!941 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17h8a684f267c2d78b1E", scope: !943, file: !942, line: 22, type: !573, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !18)
!942 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "af15c06b8fe0c45637e9a1b14f5b1c62")
!943 = !DINamespace(name: "sse2", scope: !944)
!944 = !DINamespace(name: "x86", scope: !945)
!945 = !DINamespace(name: "core_arch", scope: !17)
!946 = !DILocation(line: 25, column: 5, scope: !941)
!947 = !DILocation(line: 26, column: 2, scope: !941)
!948 = distinct !DISubprogram(name: "call_once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9call_once17h543ac54295b35a7fE", scope: !127, file: !949, line: 98, type: !950, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !960, retainedNodes: !953)
!949 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.5.2/src/once.rs", directory: "", checksumkind: CSK_MD5, checksum: "69004968d2d982c22c33586bc6b4d134")
!950 = !DISubroutineType(types: !951)
!951 = !{!903, !952, !487}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&spin::once::Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!953 = !{!954, !955, !956, !958}
!954 = !DILocalVariable(name: "self", arg: 1, scope: !948, file: !949, line: 98, type: !952)
!955 = !DILocalVariable(name: "builder", arg: 2, scope: !948, file: !949, line: 98, type: !487)
!956 = !DILocalVariable(name: "status", scope: !957, file: !949, line: 101, type: !137, align: 8)
!957 = distinct !DILexicalBlock(scope: !948, file: !949, line: 101, column: 9)
!958 = !DILocalVariable(name: "finish", scope: !959, file: !949, line: 109, type: !533, align: 8)
!959 = distinct !DILexicalBlock(scope: !957, file: !949, line: 109, column: 17)
!960 = !{!152, !961}
!961 = !DITemplateTypeParameter(name: "F", type: !487)
!962 = !DILocation(line: 98, column: 29, scope: !948)
!963 = !DILocation(line: 98, column: 39, scope: !948)
!964 = !DILocation(line: 101, column: 13, scope: !957)
!965 = !DILocation(line: 109, column: 21, scope: !959)
!966 = !DILocation(line: 121, column: 9, scope: !948)
!967 = !DILocation(line: 101, column: 42, scope: !948)
!968 = !DILocation(line: 101, column: 26, scope: !948)
!969 = !DILocation(line: 103, column: 12, scope: !957)
!970 = !DILocation(line: 122, column: 13, scope: !957)
!971 = !DILocation(line: 106, column: 50, scope: !957)
!972 = !DILocation(line: 104, column: 22, scope: !957)
!973 = !DILocation(line: 104, column: 13, scope: !957)
!974 = !DILocation(line: 107, column: 16, scope: !957)
!975 = !DILocation(line: 109, column: 34, scope: !957)
!976 = !DILocation(line: 110, column: 50, scope: !959)
!977 = !DILocation(line: 110, column: 45, scope: !959)
!978 = !DILocation(line: 110, column: 27, scope: !959)
!979 = !DILocalVariable(name: "self", arg: 1, scope: !980, file: !619, line: 2054, type: !984)
!980 = distinct !DISubprogram(name: "get<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h46ef17f23f994635E", scope: !141, file: !619, line: 2054, type: !981, scopeLine: 2054, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !179, retainedNodes: !985)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!985 = !{!979}
!986 = !DILocation(line: 2054, column: 22, scope: !980, inlinedAt: !987)
!987 = distinct !DILocation(line: 110, column: 27, scope: !959)
!988 = !DILocation(line: 110, column: 26, scope: !959)
!989 = !DILocation(line: 111, column: 17, scope: !959)
!990 = !DILocation(line: 113, column: 17, scope: !959)
!991 = !DILocation(line: 114, column: 34, scope: !959)
!992 = !DILocation(line: 114, column: 42, scope: !959)
!993 = !DILocation(line: 114, column: 17, scope: !959)
!994 = !DILocation(line: 117, column: 24, scope: !959)
!995 = !DILocation(line: 118, column: 13, scope: !957)
!996 = !DILocation(line: 133, column: 5, scope: !948)
!997 = !DILocation(line: 130, column: 31, scope: !957)
!998 = !DILocation(line: 123, column: 31, scope: !957)
!999 = !DILocation(line: 125, column: 21, scope: !957)
!1000 = !DILocation(line: 126, column: 46, scope: !957)
!1001 = !DILocation(line: 126, column: 30, scope: !957)
!1002 = !DILocation(line: 126, column: 21, scope: !957)
!1003 = !DILocation(line: 126, column: 62, scope: !957)
!1004 = !DILocation(line: 128, column: 29, scope: !957)
!1005 = !DILocation(line: 129, column: 36, scope: !957)
!1006 = !DILocation(line: 1, column: 1, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !957, file: !1008, discriminator: 0)
!1008 = !DIFile(filename: "src/lib.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "98fa4ed9a8b344e7a19ee81bdfeda577")
!1009 = !DILocation(line: 133, column: 6, scope: !948)
!1010 = distinct !DISubprogram(name: "force_get<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9force_get17h75e02669e6284d92E", scope: !127, file: !949, line: 63, type: !1011, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !151, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!903, !952}
!1013 = !{!1014, !1015}
!1014 = !DILocalVariable(name: "self", arg: 1, scope: !1010, file: !949, line: 63, type: !952)
!1015 = !DILocalVariable(name: "p", scope: !1016, file: !949, line: 66, type: !903, align: 8)
!1016 = distinct !DILexicalBlock(scope: !1010, file: !949, line: 66, column: 13)
!1017 = !DILocation(line: 63, column: 22, scope: !1010)
!1018 = !DILocation(line: 64, column: 26, scope: !1010)
!1019 = !DILocation(line: 2054, column: 22, scope: !980, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 64, column: 26, scope: !1010)
!1021 = !DILocation(line: 64, column: 15, scope: !1010)
!1022 = !DILocation(line: 64, column: 9, scope: !1010)
!1023 = !DILocation(line: 65, column: 33, scope: !1010)
!1024 = !DILocation(line: 66, column: 18, scope: !1010)
!1025 = !DILocation(line: 66, column: 18, scope: !1016)
!1026 = !DILocation(line: 68, column: 6, scope: !1010)
!1027 = distinct !DISubprogram(name: "tss_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor11tss_segment17hc54e8c61da165413E", scope: !1029, file: !1028, line: 323, type: !1043, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !184, templateParams: !18, retainedNodes: !1046)
!1028 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/gdt.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ab116ff7379e959850155eb85cfd2d8")
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", scope: !157, file: !6, size: 192, align: 64, elements: !1030, templateParams: !18, identifier: "9a5242d1368052b1f6bc500e38f3849c")
!1030 = !{!1031}
!1031 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1029, file: !6, size: 192, align: 64, elements: !1032, templateParams: !18, identifier: "2eb438b096c39c38464ec00790ff6819", discriminator: !1042)
!1032 = !{!1033, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "UserSegment", scope: !1031, file: !6, baseType: !1034, size: 192, align: 64, extraData: i64 0)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserSegment", scope: !1029, file: !6, size: 192, align: 64, elements: !1035, templateParams: !18, identifier: "2dfcf3baaa8136777377f88c7113eddd")
!1035 = !{!1036}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1034, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "SystemSegment", scope: !1031, file: !6, baseType: !1038, size: 192, align: 64, extraData: i64 1)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "SystemSegment", scope: !1029, file: !6, size: 192, align: 64, elements: !1039, templateParams: !18, identifier: "9c1cc4b1269c80f29d45a5244f57e41")
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1038, file: !6, baseType: !102, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1038, file: !6, baseType: !102, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, scope: !1029, file: !6, baseType: !102, size: 64, align: 64, flags: DIFlagArtificial)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1029, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::tss::TaskStateSegment", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!1046 = !{!1047, !1048, !1050, !1052}
!1047 = !DILocalVariable(name: "tss", arg: 1, scope: !1027, file: !1028, line: 323, type: !1045)
!1048 = !DILocalVariable(name: "ptr", scope: !1049, file: !1028, line: 327, type: !102, align: 8)
!1049 = distinct !DILexicalBlock(scope: !1027, file: !1028, line: 327, column: 9)
!1050 = !DILocalVariable(name: "low", scope: !1051, file: !1028, line: 329, type: !102, align: 8)
!1051 = distinct !DILexicalBlock(scope: !1049, file: !1028, line: 329, column: 9)
!1052 = !DILocalVariable(name: "high", scope: !1053, file: !1028, line: 338, type: !102, align: 8)
!1053 = distinct !DILexicalBlock(scope: !1051, file: !1028, line: 338, column: 9)
!1054 = !DILocation(line: 323, column: 24, scope: !1027)
!1055 = !DILocation(line: 327, column: 13, scope: !1049)
!1056 = !DILocation(line: 329, column: 13, scope: !1051)
!1057 = !DILocation(line: 338, column: 13, scope: !1053)
!1058 = !DILocation(line: 327, column: 19, scope: !1027)
!1059 = !DILocation(line: 329, column: 23, scope: !1049)
!1060 = !DILocation(line: 331, column: 22, scope: !1051)
!1061 = !DILocation(line: 331, column: 43, scope: !1051)
!1062 = !DILocation(line: 331, column: 30, scope: !1051)
!1063 = !DILocation(line: 331, column: 9, scope: !1051)
!1064 = !DILocation(line: 332, column: 22, scope: !1051)
!1065 = !DILocation(line: 332, column: 43, scope: !1051)
!1066 = !DILocation(line: 332, column: 30, scope: !1051)
!1067 = !DILocation(line: 332, column: 9, scope: !1051)
!1068 = !DILocation(line: 334, column: 22, scope: !1051)
!1069 = !DILocation(line: 334, column: 29, scope: !1051)
!1070 = !DILocation(line: 334, column: 9, scope: !1051)
!1071 = !DILocation(line: 336, column: 22, scope: !1051)
!1072 = !DILocation(line: 336, column: 9, scope: !1051)
!1073 = !DILocation(line: 338, column: 24, scope: !1051)
!1074 = !DILocation(line: 339, column: 23, scope: !1053)
!1075 = !DILocation(line: 339, column: 43, scope: !1053)
!1076 = !DILocation(line: 339, column: 30, scope: !1053)
!1077 = !DILocation(line: 339, column: 9, scope: !1053)
!1078 = !DILocation(line: 341, column: 35, scope: !1053)
!1079 = !DILocation(line: 341, column: 40, scope: !1053)
!1080 = !DILocation(line: 341, column: 9, scope: !1053)
!1081 = !DILocation(line: 342, column: 6, scope: !1027)
