; ModuleID = '4pzu98zysf1pkcpl'
source_filename = "4pzu98zysf1pkcpl"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"global_descriptor_table::GlobalDescriptorTableSetup" = type { %"x86_64::structures::gdt::GlobalDescriptorTable", { i16, i16 }, [2 x i16] }
%"x86_64::structures::gdt::GlobalDescriptorTable" = type { [8 x i64], i64 }
%"x86_64::structures::gdt::Descriptor" = type { i64, [2 x i64] }
%"x86_64::structures::tss::TaskStateSegment" = type <{ i32, [3 x i64], i64, [7 x i64], i64, i16, i16 }>
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>::Some" = type { [1 x i64], %"global_descriptor_table::GlobalDescriptorTableSetup" }
%"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" = type { i64, [10 x i64] }
%"spin::once::Once<global_descriptor_table::GlobalDescriptorTableSetup>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>>" = type { %"core::option::Option<global_descriptor_table::GlobalDescriptorTableSetup>" }
%"x86_64::structures::gdt::Descriptor::SystemSegment" = type { [1 x i64], i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_DESCRIPTOR_TABLE", linkageName: "_ZN14cpu_interrupts23global_descriptor_table23GLOBAL_DESCRIPTOR_TABLE17h237e878cf68aa30fE", scope: !2, file: !4, line: 161, type: !5, isLocal: false, isDefinition: true, align: 8)
!2 = !DINamespace(name: "global_descriptor_table", scope: !3)
!3 = !DINamespace(name: "cpu_interrupts", scope: null)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "GLOBAL_DESCRIPTOR_TABLE", scope: !2, file: !6, align: 8, elements: !7, templateParams: !10, identifier: "521b251548d54864f957ae4012a46619")
!6 = !DIFile(filename: "<unknown>", directory: "")
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !5, file: !6, baseType: !9, align: 8)
!9 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!10 = !{}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "TASK_STATE_SEGMENT", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize18TASK_STATE_SEGMENT17hcea422e8f53ad7b0E", scope: !13, file: !16, line: 27, type: !17, isLocal: true, isDefinition: true, align: 32)
!13 = !DINamespace(name: "__static_ref_initialize", scope: !14)
!14 = !DINamespace(name: "deref", scope: !15)
!15 = !DINamespace(name: "{impl#0}", scope: !2)
!16 = !DIFile(filename: "src/global_descriptor_table.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "a2e7351e681b7ba875772878a57f519c")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskStateSegment", scope: !18, file: !6, size: 832, align: 32, elements: !21, templateParams: !10, identifier: "25ce3a393fb0c51de507830dbaabcafb")
!18 = !DINamespace(name: "tss", scope: !19)
!19 = !DINamespace(name: "structures", scope: !20)
!20 = !DINamespace(name: "x86_64", scope: null)
!21 = !{!22, !24, !33, !34, !38, !39, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !17, file: !6, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "privilege_stack_table", scope: !17, file: !6, baseType: !25, size: 192, align: 64, offset: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 64, elements: !31)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !27, file: !6, size: 64, align: 64, elements: !28, templateParams: !10, identifier: "cc40109294dcf2da1252ddef3dca61d9")
!27 = !DINamespace(name: "addr", scope: !20)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !26, file: !6, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 3, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_stack_table", scope: !17, file: !6, baseType: !35, size: 448, align: 64, offset: 288)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 448, align: 64, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 7, lowerBound: 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !17, file: !6, baseType: !30, size: 64, align: 64, offset: 736)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_4", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 800)
!40 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iomap_base", scope: !17, file: !6, baseType: !40, size: 16, align: 16, offset: 816)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "STACK", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize5STACK17h24803fc7b5d6ea88E", scope: !13, file: !16, line: 30, type: !44, isLocal: true, isDefinition: true, align: 8)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 163840, align: 8, elements: !46)
!45 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!46 = !{!47}
!47 = !DISubrange(count: 20480, lowerBound: 0)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h49a442ee5aee970eE", scope: !50, file: !51, line: 29, type: !52, isLocal: true, isDefinition: true, align: 64)
!50 = !DINamespace(name: "__stability", scope: !14)
!51 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !53, file: !6, size: 768, align: 64, elements: !55, templateParams: !86, identifier: "e14a57c66aef1f4dca509a6116cda15")
!53 = !DINamespace(name: "lazy", scope: !54)
!54 = !DINamespace(name: "lazy_static", scope: null)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !52, file: !6, baseType: !57, size: 768, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !58, file: !6, size: 768, align: 64, elements: !60, templateParams: !86, identifier: "13c2e1d21a8064c94b41c1414397ea5")
!58 = !DINamespace(name: "once", scope: !59)
!59 = !DINamespace(name: "spin", scope: null)
!60 = !{!61, !75}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !57, file: !6, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !63, file: !6, size: 64, align: 64, elements: !66, templateParams: !10, identifier: "e00fd022714aa819cef83a74a4523c4")
!63 = !DINamespace(name: "atomic", scope: !64)
!64 = !DINamespace(name: "sync", scope: !65)
!65 = !DINamespace(name: "core", scope: null)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !62, file: !6, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !69, file: !6, size: 64, align: 64, elements: !70, templateParams: !73, identifier: "8f2b43c3fe89fd793c6f616cb378bdef")
!69 = !DINamespace(name: "cell", scope: !65)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !6, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "T", type: !72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !6, baseType: !76, size: 704, align: 64, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", scope: !69, file: !6, size: 704, align: 64, elements: !77, templateParams: !114, identifier: "80313891fef746d4aef094aeff80e387")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !6, baseType: !79, size: 704, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !80, file: !6, size: 704, align: 64, elements: !81, templateParams: !10, identifier: "7e483a571de3e48f1bc6d4ba62616a75")
!80 = !DINamespace(name: "option", scope: !65)
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_variant_part, scope: !79, file: !6, size: 704, align: 64, elements: !83, templateParams: !10, identifier: "700e156745e29c68c785cd9c9cfb02e", discriminator: !113)
!83 = !{!84, !109}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !82, file: !6, baseType: !85, size: 704, align: 64, extraData: i64 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !79, file: !6, size: 704, align: 64, elements: !10, templateParams: !86, identifier: "231e51d51e6a4a2b6e1845f19ecac8d0")
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "T", type: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTableSetup", scope: !2, file: !6, size: 640, align: 64, elements: !89, templateParams: !10, identifier: "c99ee0405501f4a52cc168ce396af670")
!89 = !{!90, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !88, file: !6, baseType: !91, size: 576, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalDescriptorTable", scope: !92, file: !6, size: 576, align: 64, elements: !93, templateParams: !10, identifier: "99a8d49bdf361c8f32ac58d09b05980e")
!92 = !DINamespace(name: "gdt", scope: !19)
!93 = !{!94, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !91, file: !6, baseType: !95, size: 512, align: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 64, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 8, lowerBound: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, file: !6, baseType: !72, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !88, file: !6, baseType: !100, size: 32, align: 16, offset: 576)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Selectors", scope: !2, file: !6, size: 32, align: 16, elements: !101, templateParams: !10, identifier: "5b1646342d7c7987cb20ce58213a4d25")
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !100, file: !6, baseType: !103, size: 16, align: 16)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentSelector", scope: !104, file: !6, size: 16, align: 16, elements: !106, templateParams: !10, identifier: "9ee42058d7abce8fad97c21d55c83a2a")
!104 = !DINamespace(name: "segmentation", scope: !105)
!105 = !DINamespace(name: "registers", scope: !20)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !103, file: !6, baseType: !40, size: 16, align: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "task_state_segment", scope: !100, file: !6, baseType: !103, size: 16, align: 16, offset: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !82, file: !6, baseType: !110, size: 704, align: 64, extraData: i64 1)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !79, file: !6, size: 704, align: 64, elements: !111, templateParams: !86, identifier: "d16bc893790a1a575d9b7b5633fb1da0")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !110, file: !6, baseType: !88, size: 640, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, scope: !79, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !79)
!116 = !{i32 7, !"PIC Level", i32 2}
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !120, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !144, splitDebugInlining: false)
!120 = !DIFile(filename: "src/lib.rs/@/4pzu98zysf1pkcpl", directory: "/Users/yaw/self/theo/cpu_interrupts")
!121 = !{!122, !131, !138}
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !123, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !126)
!123 = !DINamespace(name: "v1", scope: !124)
!124 = !DINamespace(name: "rt", scope: !125)
!125 = !DINamespace(name: "fmt", scope: !65)
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !63, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!137 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !20, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !139)
!139 = !{!140, !141, !142, !143}
!140 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!141 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!142 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!143 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!144 = !{!0, !11, !42, !48}
!145 = distinct !DISubprogram(name: "set_bit", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$7set_bit17h74b55cbd11a8e3e3E", scope: !147, file: !146, line: 240, type: !149, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !166)
!146 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bit_field-0.10.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "2f61be3e42d6221d30b5488a425dbc01")
!147 = !DINamespace(name: "{impl#2}", scope: !148)
!148 = !DINamespace(name: "bit_field", scope: null)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !151, !72, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u16", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !155, file: !6, size: 192, align: 64, elements: !157, templateParams: !10, identifier: "ce713e8941e9786f7cd6b9ed5cdf02a8")
!155 = !DINamespace(name: "location", scope: !156)
!156 = !DINamespace(name: "panic", scope: !65)
!157 = !{!158, !164, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !154, file: !6, baseType: !159, size: 128, align: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !160, templateParams: !10, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !159, file: !6, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !159, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !154, file: !6, baseType: !23, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !154, file: !6, baseType: !23, size: 32, align: 32, offset: 160)
!166 = !{!167, !168, !169}
!167 = !DILocalVariable(name: "self", arg: 1, scope: !145, file: !146, line: 240, type: !151)
!168 = !DILocalVariable(name: "bit", arg: 2, scope: !145, file: !146, line: 240, type: !72)
!169 = !DILocalVariable(name: "value", arg: 3, scope: !145, file: !146, line: 240, type: !152)
!170 = !DILocation(line: 240, column: 24, scope: !145)
!171 = !DILocation(line: 240, column: 35, scope: !145)
!172 = !DILocation(line: 240, column: 47, scope: !145)
!173 = !DILocation(line: 241, column: 25, scope: !145)
!174 = !DILocation(line: 241, column: 17, scope: !145)
!175 = !DILocation(line: 243, column: 20, scope: !145)
!176 = !DILocation(line: 246, column: 31, scope: !145)
!177 = !DILocation(line: 244, column: 30, scope: !145)
!178 = !DILocation(line: 244, column: 21, scope: !145)
!179 = !DILocation(line: 243, column: 17, scope: !145)
!180 = !DILocation(line: 250, column: 14, scope: !145)
!181 = !DILocation(line: 246, column: 30, scope: !145)
!182 = !DILocation(line: 246, column: 21, scope: !145)
!183 = distinct !DISubprogram(name: "set_bits<core::ops::range::Range<usize>>", linkageName: "_ZN43_$LT$u16$u20$as$u20$bit_field..BitField$GT$8set_bits17h422b5507d2295033E", scope: !147, file: !146, line: 254, type: !184, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !202, retainedNodes: !194)
!184 = !DISubroutineType(types: !185)
!185 = !{!151, !151, !186, !40, !153}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !187, file: !6, size: 128, align: 64, elements: !189, templateParams: !192, identifier: "a38539fb613303b2a542584743e0908e")
!187 = !DINamespace(name: "range", scope: !188)
!188 = !DINamespace(name: "ops", scope: !65)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !186, file: !6, baseType: !72, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !186, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "Idx", type: !72)
!194 = !{!195, !196, !197, !198, !200}
!195 = !DILocalVariable(name: "self", arg: 1, scope: !183, file: !146, line: 254, type: !151)
!196 = !DILocalVariable(name: "range", arg: 2, scope: !183, file: !146, line: 254, type: !186)
!197 = !DILocalVariable(name: "value", arg: 3, scope: !183, file: !146, line: 254, type: !40)
!198 = !DILocalVariable(name: "range", scope: !199, file: !146, line: 255, type: !186, align: 8)
!199 = distinct !DILexicalBlock(scope: !183, file: !146, line: 255, column: 17)
!200 = !DILocalVariable(name: "bitmask", scope: !201, file: !146, line: 264, type: !40, align: 2)
!201 = distinct !DILexicalBlock(scope: !199, file: !146, line: 264, column: 17)
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !186)
!204 = !DILocation(line: 254, column: 48, scope: !183)
!205 = !DILocation(line: 254, column: 59, scope: !183)
!206 = !DILocation(line: 254, column: 69, scope: !183)
!207 = !DILocation(line: 255, column: 29, scope: !183)
!208 = !DILocation(line: 255, column: 21, scope: !199)
!209 = !DILocation(line: 257, column: 25, scope: !199)
!210 = !DILocation(line: 257, column: 17, scope: !199)
!211 = !DILocation(line: 258, column: 25, scope: !199)
!212 = !DILocation(line: 258, column: 17, scope: !199)
!213 = !DILocation(line: 259, column: 25, scope: !199)
!214 = !DILocation(line: 259, column: 17, scope: !199)
!215 = !DILocation(line: 260, column: 54, scope: !199)
!216 = !DILocation(line: 260, column: 34, scope: !199)
!217 = !DILocation(line: 260, column: 25, scope: !199)
!218 = !DILocation(line: 261, column: 45, scope: !199)
!219 = !DILocation(line: 261, column: 25, scope: !199)
!220 = !DILocation(line: 260, column: 17, scope: !199)
!221 = !DILocation(line: 264, column: 45, scope: !199)
!222 = !DILocation(line: 264, column: 39, scope: !199)
!223 = !DILocation(line: 265, column: 37, scope: !199)
!224 = !DILocation(line: 264, column: 38, scope: !199)
!225 = !DILocation(line: 264, column: 37, scope: !199)
!226 = !DILocation(line: 264, column: 21, scope: !201)
!227 = !DILocation(line: 269, column: 26, scope: !201)
!228 = !DILocation(line: 269, column: 25, scope: !201)
!229 = !DILocation(line: 269, column: 45, scope: !201)
!230 = !DILocation(line: 269, column: 17, scope: !201)
!231 = !DILocation(line: 272, column: 14, scope: !183)
!232 = distinct !DISubprogram(name: "new<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV13new17h97a8db9701d7ddd0E", scope: !234, file: !233, line: 340, type: !291, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !311, retainedNodes: !308)
!233 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !125, file: !6, size: 128, align: 64, elements: !235, templateParams: !10, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!235 = !{!236, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !6, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !239, file: !6, align: 8, elements: !10, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!239 = !DINamespace(name: "{extern#0}", scope: !125)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !234, file: !6, baseType: !241, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !242, size: 64, align: 64, dwarfAddressSpace: 0)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !237, !262}
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !245, file: !6, size: 8, align: 8, elements: !246, templateParams: !10, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!245 = !DINamespace(name: "result", scope: !65)
!246 = !{!247}
!247 = !DICompositeType(tag: DW_TAG_variant_part, scope: !244, file: !6, size: 8, align: 8, elements: !248, templateParams: !10, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !261)
!248 = !{!249, !257}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !247, file: !6, baseType: !250, size: 8, align: 8, extraData: i64 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !244, file: !6, size: 8, align: 8, elements: !251, templateParams: !253, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !250, file: !6, baseType: !9, align: 8, offset: 8)
!253 = !{!254, !255}
!254 = !DITemplateTypeParameter(name: "T", type: !9)
!255 = !DITemplateTypeParameter(name: "E", type: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !125, file: !6, align: 8, elements: !10, identifier: "c2c8f2f945c37359aa57422093183824")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !247, file: !6, baseType: !258, size: 8, align: 8, extraData: i64 1)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !244, file: !6, size: 8, align: 8, elements: !259, templateParams: !253, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !258, file: !6, baseType: !256, align: 8, offset: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !6, baseType: !45, size: 8, align: 8, flags: DIFlagArtificial)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !263, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !125, file: !6, size: 512, align: 64, elements: !264, templateParams: !10, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!264 = !{!265, !266, !268, !269, !281, !282}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !263, file: !6, baseType: !23, size: 32, align: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !263, file: !6, baseType: !267, size: 32, align: 32, offset: 416)
!267 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !263, file: !6, baseType: !122, size: 8, align: 8, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !263, file: !6, baseType: !270, size: 128, align: 64, offset: 128)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !80, file: !6, size: 128, align: 64, elements: !271, templateParams: !10, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!271 = !{!272}
!272 = !DICompositeType(tag: DW_TAG_variant_part, scope: !270, file: !6, size: 128, align: 64, elements: !273, templateParams: !10, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !280)
!273 = !{!274, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !272, file: !6, baseType: !275, size: 128, align: 64, extraData: i64 0)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !270, file: !6, size: 128, align: 64, elements: !10, templateParams: !73, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !272, file: !6, baseType: !277, size: 128, align: 64, extraData: i64 1)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !270, file: !6, size: 128, align: 64, elements: !278, templateParams: !73, identifier: "eec942390a307d7c8c2162b2092f63f3")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !277, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !270, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !263, file: !6, baseType: !270, size: 128, align: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !263, file: !6, baseType: !283, size: 128, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !284, templateParams: !10, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!284 = !{!285, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !283, file: !6, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !10, identifier: "bb744bac75d5d19249a16512e8e296c")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !283, file: !6, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !290, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, align: 64, elements: !31)
!291 = !DISubroutineType(types: !292)
!292 = !{!234, !293, !305}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::InterruptStackFrame", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !295, file: !6, size: 320, align: 64, elements: !296, templateParams: !10, identifier: "251ec6199b2b5dfc698b7b2a43057ca3")
!295 = !DINamespace(name: "idt", scope: !19)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !294, file: !6, baseType: !298, size: 320, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !295, file: !6, size: 320, align: 64, elements: !299, templateParams: !10, identifier: "2f3986ba3cf845f01f371090e3379365")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !298, file: !6, baseType: !26, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !298, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !298, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !298, file: !6, baseType: !26, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !298, file: !6, baseType: !30, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&x86_64::structures::idt::InterruptStackFrame, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !306, size: 64, align: 64, dwarfAddressSpace: 0)
!306 = !DISubroutineType(types: !307)
!307 = !{!244, !293, !262}
!308 = !{!309, !310}
!309 = !DILocalVariable(name: "x", arg: 1, scope: !232, file: !233, line: 340, type: !293)
!310 = !DILocalVariable(name: "f", arg: 2, scope: !232, file: !233, line: 340, type: !305)
!311 = !{!312}
!312 = !DITemplateTypeParameter(name: "T", type: !294)
!313 = !DILocation(line: 340, column: 23, scope: !232)
!314 = !DILocation(line: 340, column: 33, scope: !232)
!315 = !DILocation(line: 349, column: 42, scope: !232)
!316 = !DILocation(line: 349, column: 68, scope: !232)
!317 = !{i64 1}
!318 = !DILocation(line: 349, column: 18, scope: !232)
!319 = !DILocation(line: 350, column: 6, scope: !232)
!320 = distinct !DISubprogram(name: "new_debug<x86_64::structures::idt::InterruptStackFrame>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17ha03d16029664df88E", scope: !234, file: !233, line: 329, type: !321, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !311, retainedNodes: !323)
!321 = !DISubroutineType(types: !322)
!322 = !{!234, !293}
!323 = !{!324}
!324 = !DILocalVariable(name: "x", arg: 1, scope: !320, file: !233, line: 329, type: !293)
!325 = !DILocation(line: 329, column: 30, scope: !320)
!326 = !DILocation(line: 330, column: 13, scope: !320)
!327 = !DILocation(line: 331, column: 10, scope: !320)
!328 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17hb8a120e39250bb7eE", scope: !329, file: !233, line: 421, type: !388, scopeLine: 421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !393)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !125, file: !6, size: 384, align: 64, elements: !330, templateParams: !10, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!330 = !{!331, !337, !382}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !329, file: !6, baseType: !332, size: 128, align: 64, offset: 128)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !333, templateParams: !10, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !332, file: !6, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !332, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !329, file: !6, baseType: !338, size: 128, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !80, file: !6, size: 128, align: 64, elements: !339, templateParams: !10, identifier: "37e4e944ba32344d635147f54bf9f4df")
!339 = !{!340}
!340 = !DICompositeType(tag: DW_TAG_variant_part, scope: !338, file: !6, size: 128, align: 64, elements: !341, templateParams: !10, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !381)
!341 = !{!342, !377}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !340, file: !6, baseType: !343, size: 128, align: 64, extraData: i64 0)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !338, file: !6, size: 128, align: 64, elements: !10, templateParams: !344, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!344 = !{!345}
!345 = !DITemplateTypeParameter(name: "T", type: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !6, size: 128, align: 64, elements: !347, templateParams: !10, identifier: "2225a8a3217ca2e4230086a86939d931")
!347 = !{!348, !376}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !346, file: !6, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64, dwarfAddressSpace: 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !123, file: !6, size: 448, align: 64, elements: !351, templateParams: !10, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !350, file: !6, baseType: !72, size: 64, align: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !350, file: !6, baseType: !354, size: 384, align: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !123, file: !6, size: 384, align: 64, elements: !355, templateParams: !10, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!355 = !{!356, !357, !358, !359, !375}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !354, file: !6, baseType: !267, size: 32, align: 32, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !354, file: !6, baseType: !122, size: 8, align: 8, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !6, baseType: !23, size: 32, align: 32, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !354, file: !6, baseType: !360, size: 128, align: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !123, file: !6, size: 128, align: 64, elements: !361, templateParams: !10, identifier: "32660758978696a09244873a5d6fbb61")
!361 = !{!362}
!362 = !DICompositeType(tag: DW_TAG_variant_part, scope: !360, file: !6, size: 128, align: 64, elements: !363, templateParams: !10, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !374)
!363 = !{!364, !368, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !362, file: !6, baseType: !365, size: 128, align: 64, extraData: i64 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !360, file: !6, size: 128, align: 64, elements: !366, templateParams: !10, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !365, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !362, file: !6, baseType: !369, size: 128, align: 64, extraData: i64 1)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !360, file: !6, size: 128, align: 64, elements: !370, templateParams: !10, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !369, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !362, file: !6, baseType: !373, size: 128, align: 64, extraData: i64 2)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !360, file: !6, size: 128, align: 64, elements: !10, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!374 = !DIDerivedType(tag: DW_TAG_member, scope: !360, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !354, file: !6, baseType: !360, size: 128, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !346, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !340, file: !6, baseType: !378, size: 128, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !338, file: !6, size: 128, align: 64, elements: !379, templateParams: !344, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !378, file: !6, baseType: !346, size: 128, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !338, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !329, file: !6, baseType: !383, size: 128, align: 64, offset: 256)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !6, size: 128, align: 64, elements: !384, templateParams: !10, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !383, file: !6, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !383, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!329, !332, !383, !346, !390}
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !125, file: !6, align: 8, elements: !391, templateParams: !10, identifier: "9da388efda58098f3ebab1da42679df")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !390, file: !6, baseType: !9, align: 8)
!393 = !{!394, !395, !396, !397}
!394 = !DILocalVariable(name: "pieces", arg: 1, scope: !328, file: !233, line: 422, type: !332)
!395 = !DILocalVariable(name: "args", arg: 2, scope: !328, file: !233, line: 423, type: !383)
!396 = !DILocalVariable(name: "fmt", arg: 3, scope: !328, file: !233, line: 424, type: !346)
!397 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !328, file: !233, line: 425, type: !390)
!398 = !DILocation(line: 422, column: 9, scope: !328)
!399 = !DILocation(line: 423, column: 9, scope: !328)
!400 = !DILocation(line: 424, column: 9, scope: !328)
!401 = !DILocation(line: 425, column: 9, scope: !328)
!402 = !DILocation(line: 427, column: 34, scope: !328)
!403 = !DILocation(line: 427, column: 9, scope: !328)
!404 = !{i64 8}
!405 = !DILocation(line: 428, column: 6, scope: !328)
!406 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hfb33de2e352ee9d0E", scope: !329, file: !233, line: 401, type: !407, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !409)
!407 = !DISubroutineType(types: !408)
!408 = !{!329, !332, !383}
!409 = !{!410, !411}
!410 = !DILocalVariable(name: "pieces", arg: 1, scope: !406, file: !233, line: 401, type: !332)
!411 = !DILocalVariable(name: "args", arg: 2, scope: !406, file: !233, line: 401, type: !383)
!412 = !DILocation(line: 401, column: 25, scope: !406)
!413 = !DILocation(line: 401, column: 53, scope: !406)
!414 = !DILocation(line: 402, column: 12, scope: !406)
!415 = !DILocation(line: 402, column: 56, scope: !406)
!416 = !{i8 0, i8 2}
!417 = !DILocation(line: 402, column: 41, scope: !406)
!418 = !DILocation(line: 405, column: 34, scope: !406)
!419 = !DILocation(line: 405, column: 9, scope: !406)
!420 = !DILocation(line: 406, column: 6, scope: !406)
!421 = !DILocation(line: 403, column: 13, scope: !406)
!422 = distinct !DISubprogram(name: "call_once<fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17ha96b9677d1e1523fE", scope: !424, file: !423, line: 250, type: !426, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !434, retainedNodes: !431)
!423 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!424 = !DINamespace(name: "FnOnce", scope: !425)
!425 = !DINamespace(name: "function", scope: !188)
!426 = !DISubroutineType(types: !427)
!427 = !{!88, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{!88}
!431 = !{!432, !433}
!432 = !DILocalVariable(arg: 1, scope: !422, file: !423, line: 250, type: !428)
!433 = !DILocalVariable(arg: 2, scope: !422, file: !423, line: 250, type: !9)
!434 = !{!435, !436}
!435 = !DITemplateTypeParameter(name: "Self", type: !428)
!436 = !DITemplateTypeParameter(name: "Args", type: !9)
!437 = !DILocation(line: 250, column: 5, scope: !422)
!438 = !DILocalVariable(name: "global_descriptor_table", scope: !439, file: !16, line: 26, type: !91, align: 8)
!439 = distinct !DILexicalBlock(scope: !440, file: !16, line: 26, column: 9)
!440 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN108_$LT$cpu_interrupts..global_descriptor_table..GLOBAL_DESCRIPTOR_TABLE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17hc648587739f60cc3E", scope: !14, file: !4, line: 137, type: !429, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !441)
!441 = !{!438, !442, !444, !446, !448}
!442 = !DILocalVariable(name: "stack_start", scope: !443, file: !16, line: 31, type: !26, align: 8)
!443 = distinct !DILexicalBlock(scope: !439, file: !16, line: 31, column: 17)
!444 = !DILocalVariable(name: "stack_end", scope: !445, file: !16, line: 32, type: !26, align: 8)
!445 = distinct !DILexicalBlock(scope: !443, file: !16, line: 32, column: 17)
!446 = !DILocalVariable(name: "tss_selector", scope: !447, file: !16, line: 38, type: !103, align: 2)
!447 = distinct !DILexicalBlock(scope: !439, file: !16, line: 38, column: 9)
!448 = !DILocalVariable(name: "code_selector", scope: !449, file: !16, line: 39, type: !103, align: 2)
!449 = distinct !DILexicalBlock(scope: !447, file: !16, line: 39, column: 9)
!450 = !DILocation(line: 26, column: 13, scope: !439, inlinedAt: !451)
!451 = distinct !DILocation(line: 250, column: 5, scope: !422)
!452 = !DILocation(line: 26, column: 43, scope: !453, inlinedAt: !451)
!453 = !DILexicalBlockFile(scope: !440, file: !16, discriminator: 0)
!454 = !DILocation(line: 31, column: 35, scope: !439, inlinedAt: !451)
!455 = !DILocation(line: 31, column: 21, scope: !443, inlinedAt: !451)
!456 = !DILocation(line: 32, column: 33, scope: !443, inlinedAt: !451)
!457 = !DILocation(line: 32, column: 21, scope: !445, inlinedAt: !451)
!458 = !DILocation(line: 29, column: 13, scope: !439, inlinedAt: !451)
!459 = !DILocation(line: 38, column: 62, scope: !439, inlinedAt: !451)
!460 = !DILocation(line: 38, column: 28, scope: !439, inlinedAt: !451)
!461 = !DILocation(line: 38, column: 13, scope: !447, inlinedAt: !451)
!462 = !DILocation(line: 39, column: 63, scope: !447, inlinedAt: !451)
!463 = !DILocation(line: 39, column: 29, scope: !447, inlinedAt: !451)
!464 = !DILocation(line: 39, column: 13, scope: !449, inlinedAt: !451)
!465 = !DILocation(line: 41, column: 20, scope: !449, inlinedAt: !451)
!466 = !DILocation(line: 42, column: 24, scope: !449, inlinedAt: !451)
!467 = !DILocation(line: 40, column: 9, scope: !449, inlinedAt: !451)
!468 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17hc37e9d43b6aea03dE", scope: !470, file: !469, line: 490, type: !471, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !481, retainedNodes: !479)
!469 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!470 = !DINamespace(name: "ptr", scope: !65)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !58, file: !6, size: 128, align: 64, elements: !475, templateParams: !10, identifier: "a416b89de55d44d62da3644dba97a7fc")
!475 = !{!476, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !474, file: !6, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !474, file: !6, baseType: !152, size: 8, align: 8, offset: 64)
!479 = !{!480}
!480 = !DILocalVariable(arg: 1, scope: !468, file: !469, line: 490, type: !473)
!481 = !{!482}
!482 = !DITemplateTypeParameter(name: "T", type: !474)
!483 = !DILocation(line: 490, column: 1, scope: !468)
!484 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17he5efe1afc4724b66E", scope: !486, file: !485, line: 100, type: !487, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!485 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9c5ec66aac3b7b220f0974f6b880e36c")
!486 = !DINamespace(name: "hint", scope: !65)
!487 = !DISubroutineType(types: !488)
!488 = !{null}
!489 = !DILocation(line: 2244, column: 21, scope: !490, inlinedAt: !493)
!490 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h305e73259a5d2adcE", scope: !492, file: !491, line: 2241, type: !487, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!491 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!492 = !DINamespace(name: "unreachable_unchecked", scope: !486)
!493 = distinct !DILocation(line: 104, column: 9, scope: !484)
!494 = !DILocation(line: 105, column: 9, scope: !484)
!495 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h2b73482983055141E", scope: !62, file: !496, line: 2374, type: !497, scopeLine: 2374, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !499)
!496 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "ece39eca309c3b2a21b91ed3770bad24")
!497 = !DISubroutineType(types: !498)
!498 = !{!72, !477, !72, !72, !131}
!499 = !{!500, !501, !502, !503, !504, !506}
!500 = !DILocalVariable(name: "self", arg: 1, scope: !495, file: !496, line: 2374, type: !477)
!501 = !DILocalVariable(name: "current", arg: 2, scope: !495, file: !496, line: 2375, type: !72)
!502 = !DILocalVariable(name: "new", arg: 3, scope: !495, file: !496, line: 2376, type: !72)
!503 = !DILocalVariable(name: "order", arg: 4, scope: !495, file: !496, line: 2377, type: !131)
!504 = !DILocalVariable(name: "x", scope: !505, file: !496, line: 2382, type: !72, align: 8)
!505 = distinct !DILexicalBlock(scope: !495, file: !496, line: 2382, column: 21)
!506 = !DILocalVariable(name: "x", scope: !507, file: !496, line: 2383, type: !72, align: 8)
!507 = distinct !DILexicalBlock(scope: !495, file: !496, line: 2383, column: 21)
!508 = !DILocation(line: 2374, column: 37, scope: !495)
!509 = !DILocation(line: 2375, column: 37, scope: !495)
!510 = !DILocation(line: 2376, column: 37, scope: !495)
!511 = !DILocation(line: 2377, column: 37, scope: !495)
!512 = !DILocation(line: 2381, column: 45, scope: !495)
!513 = !{i8 0, i8 5}
!514 = !DILocation(line: 2378, column: 23, scope: !495)
!515 = !{i64 0, i64 2}
!516 = !DILocation(line: 2378, column: 17, scope: !495)
!517 = !DILocation(line: 2382, column: 24, scope: !495)
!518 = !DILocation(line: 2382, column: 24, scope: !505)
!519 = !DILocation(line: 2382, column: 30, scope: !505)
!520 = !DILocation(line: 2382, column: 30, scope: !495)
!521 = !DILocation(line: 2383, column: 25, scope: !495)
!522 = !DILocation(line: 2383, column: 25, scope: !507)
!523 = !DILocation(line: 2383, column: 31, scope: !507)
!524 = !DILocation(line: 2383, column: 31, scope: !495)
!525 = !DILocation(line: 2385, column: 14, scope: !495)
!526 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17h885934b2f5b7ae7fE", scope: !62, file: !496, line: 2428, type: !527, scopeLine: 2428, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !544)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !477, !72, !72, !131, !131}
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !245, file: !6, size: 128, align: 64, elements: !530, templateParams: !10, identifier: "5579df6104a82f0c746794ad7f2aed62")
!530 = !{!531}
!531 = !DICompositeType(tag: DW_TAG_variant_part, scope: !529, file: !6, size: 128, align: 64, elements: !532, templateParams: !10, identifier: "7e508de376a90f54f3fcef7824c806a6", discriminator: !543)
!532 = !{!533, !539}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !531, file: !6, baseType: !534, size: 128, align: 64, extraData: i64 0)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !529, file: !6, size: 128, align: 64, elements: !535, templateParams: !537, identifier: "aca05aa4b9341eadc3e13899788bdf69")
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !534, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!537 = !{!74, !538}
!538 = !DITemplateTypeParameter(name: "E", type: !72)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !531, file: !6, baseType: !540, size: 128, align: 64, extraData: i64 1)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !529, file: !6, size: 128, align: 64, elements: !541, templateParams: !537, identifier: "70e806ef3110231932692cff225e8728")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !540, file: !6, baseType: !72, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!544 = !{!545, !546, !547, !548, !549}
!545 = !DILocalVariable(name: "self", arg: 1, scope: !526, file: !496, line: 2428, type: !477)
!546 = !DILocalVariable(name: "current", arg: 2, scope: !526, file: !496, line: 2429, type: !72)
!547 = !DILocalVariable(name: "new", arg: 3, scope: !526, file: !496, line: 2430, type: !72)
!548 = !DILocalVariable(name: "success", arg: 4, scope: !526, file: !496, line: 2431, type: !131)
!549 = !DILocalVariable(name: "failure", arg: 5, scope: !526, file: !496, line: 2432, type: !131)
!550 = !DILocation(line: 2428, column: 37, scope: !526)
!551 = !DILocation(line: 2429, column: 37, scope: !526)
!552 = !DILocation(line: 2430, column: 37, scope: !526)
!553 = !DILocation(line: 2431, column: 37, scope: !526)
!554 = !DILocation(line: 2432, column: 37, scope: !526)
!555 = !DILocalVariable(name: "self", arg: 1, scope: !556, file: !557, line: 2005, type: !561)
!556 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hcb3f78411f5f7834E", scope: !68, file: !557, line: 2005, type: !558, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !73, retainedNodes: !562)
!557 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "533ae9b9d5d15fd7608d43889fd78bf4")
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!562 = !{!555}
!563 = !DILocation(line: 2005, column: 22, scope: !556, inlinedAt: !564)
!564 = distinct !DILocation(line: 2434, column: 50, scope: !526)
!565 = !DILocation(line: 2434, column: 26, scope: !526)
!566 = !DILocation(line: 2435, column: 14, scope: !526)
!567 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17h7b5996d285680904E", scope: !62, file: !496, line: 2261, type: !568, scopeLine: 2261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!72, !477, !131}
!570 = !{!571, !572}
!571 = !DILocalVariable(name: "self", arg: 1, scope: !567, file: !496, line: 2261, type: !477)
!572 = !DILocalVariable(name: "order", arg: 2, scope: !567, file: !496, line: 2261, type: !131)
!573 = !DILocation(line: 2261, column: 25, scope: !567)
!574 = !DILocation(line: 2261, column: 32, scope: !567)
!575 = !DILocation(line: 2005, column: 22, scope: !556, inlinedAt: !576)
!576 = distinct !DILocation(line: 2263, column: 38, scope: !567)
!577 = !DILocation(line: 2263, column: 26, scope: !567)
!578 = !DILocation(line: 2264, column: 14, scope: !567)
!579 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h15938d034dc37d09E", scope: !62, file: !496, line: 2288, type: !580, scopeLine: 2288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !477, !72, !131}
!582 = !{!583, !584, !585}
!583 = !DILocalVariable(name: "self", arg: 1, scope: !579, file: !496, line: 2288, type: !477)
!584 = !DILocalVariable(name: "val", arg: 2, scope: !579, file: !496, line: 2288, type: !72)
!585 = !DILocalVariable(name: "order", arg: 3, scope: !579, file: !496, line: 2288, type: !131)
!586 = !DILocation(line: 2288, column: 26, scope: !579)
!587 = !DILocation(line: 2288, column: 33, scope: !579)
!588 = !DILocation(line: 2288, column: 49, scope: !579)
!589 = !DILocation(line: 2005, column: 22, scope: !556, inlinedAt: !590)
!590 = distinct !DILocation(line: 2290, column: 39, scope: !579)
!591 = !DILocation(line: 2290, column: 26, scope: !579)
!592 = !DILocation(line: 2291, column: 14, scope: !579)
!593 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17hca725a410aa94a69E", scope: !63, file: !496, line: 3640, type: !487, scopeLine: 3640, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!594 = !DILocation(line: 175, column: 18, scope: !595, inlinedAt: !596)
!595 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17he5fd86094f85d608E", scope: !486, file: !485, line: 165, type: !487, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!596 = distinct !DILocation(line: 3641, column: 5, scope: !593)
!597 = !DILocation(line: 3642, column: 2, scope: !593)
!598 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h17125dfc8b0eb369E", scope: !63, file: !496, line: 3226, type: !599, scopeLine: 3226, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !73, retainedNodes: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!529, !560, !72, !72, !131, !131}
!601 = !{!602, !603, !604, !605, !606, !607, !609}
!602 = !DILocalVariable(name: "dst", arg: 1, scope: !598, file: !496, line: 3227, type: !560)
!603 = !DILocalVariable(name: "old", arg: 2, scope: !598, file: !496, line: 3228, type: !72)
!604 = !DILocalVariable(name: "new", arg: 3, scope: !598, file: !496, line: 3229, type: !72)
!605 = !DILocalVariable(name: "success", arg: 4, scope: !598, file: !496, line: 3230, type: !131)
!606 = !DILocalVariable(name: "failure", arg: 5, scope: !598, file: !496, line: 3231, type: !131)
!607 = !DILocalVariable(name: "val", scope: !608, file: !496, line: 3234, type: !72, align: 8)
!608 = distinct !DILexicalBlock(scope: !598, file: !496, line: 3234, column: 5)
!609 = !DILocalVariable(name: "ok", scope: !608, file: !496, line: 3234, type: !152, align: 1)
!610 = !DILocation(line: 3227, column: 5, scope: !598)
!611 = !DILocation(line: 3228, column: 5, scope: !598)
!612 = !DILocation(line: 3229, column: 5, scope: !598)
!613 = !DILocation(line: 3230, column: 5, scope: !598)
!614 = !DILocation(line: 3231, column: 5, scope: !598)
!615 = !DILocation(line: 3235, column: 15, scope: !598)
!616 = !DILocation(line: 3235, column: 9, scope: !598)
!617 = !DILocation(line: 3248, column: 34, scope: !598)
!618 = !DILocation(line: 3249, column: 34, scope: !598)
!619 = !DILocation(line: 3250, column: 33, scope: !598)
!620 = !DILocation(line: 3234, column: 10, scope: !598)
!621 = !DILocation(line: 3234, column: 10, scope: !608)
!622 = !DILocation(line: 3234, column: 15, scope: !598)
!623 = !DILocation(line: 3234, column: 15, scope: !608)
!624 = !DILocation(line: 3255, column: 8, scope: !608)
!625 = !DILocation(line: 3245, column: 34, scope: !598)
!626 = !DILocation(line: 3246, column: 34, scope: !598)
!627 = !DILocation(line: 3247, column: 33, scope: !598)
!628 = !DILocation(line: 3239, column: 35, scope: !598)
!629 = !DILocation(line: 3240, column: 35, scope: !598)
!630 = !DILocation(line: 3241, column: 34, scope: !598)
!631 = !DILocation(line: 3242, column: 35, scope: !598)
!632 = !DILocation(line: 3243, column: 35, scope: !598)
!633 = !DILocation(line: 3244, column: 34, scope: !598)
!634 = !DILocation(line: 3236, column: 35, scope: !598)
!635 = !DILocation(line: 3237, column: 35, scope: !598)
!636 = !DILocation(line: 3238, column: 34, scope: !598)
!637 = !DILocation(line: 3252, column: 29, scope: !598)
!638 = !DILocation(line: 3251, column: 28, scope: !598)
!639 = !DILocation(line: 3255, column: 30, scope: !608)
!640 = !DILocation(line: 3255, column: 5, scope: !608)
!641 = !DILocation(line: 3255, column: 13, scope: !608)
!642 = !DILocation(line: 3256, column: 2, scope: !598)
!643 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h73e88f317b594074E", scope: !63, file: !496, line: 3129, type: !644, scopeLine: 3129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !646)
!644 = !DISubroutineType(types: !645)
!645 = !{!131, !131}
!646 = !{!647}
!647 = !DILocalVariable(name: "order", arg: 1, scope: !643, file: !496, line: 3129, type: !131)
!648 = !DILocation(line: 3129, column: 31, scope: !643)
!649 = !DILocation(line: 3130, column: 11, scope: !643)
!650 = !DILocation(line: 3130, column: 5, scope: !643)
!651 = !DILocation(line: 3132, column: 20, scope: !643)
!652 = !DILocation(line: 3131, column: 20, scope: !643)
!653 = !DILocation(line: 3134, column: 20, scope: !643)
!654 = !DILocation(line: 3135, column: 19, scope: !643)
!655 = !DILocation(line: 3133, column: 19, scope: !643)
!656 = !DILocation(line: 3137, column: 2, scope: !643)
!657 = distinct !DISubprogram(name: "as_ref<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17h4d9df05bec1717e3E", scope: !79, file: !658, line: 675, type: !659, scopeLine: 675, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !86, retainedNodes: !676)
!658 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "d6f90b4fba5d6fbabc4ac99b183a8294")
!659 = !DISubroutineType(types: !660)
!660 = !{!661, !675}
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", scope: !80, file: !6, size: 64, align: 64, elements: !662, templateParams: !10, identifier: "da9a21e752db333459643576c116f6ac")
!662 = !{!663}
!663 = !DICompositeType(tag: DW_TAG_variant_part, scope: !661, file: !6, size: 64, align: 64, elements: !664, templateParams: !10, identifier: "241c3cf6df7e0ed4255aa37eeaf7099b", discriminator: !674)
!664 = !{!665, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !663, file: !6, baseType: !666, size: 64, align: 64, extraData: i64 0)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !661, file: !6, size: 64, align: 64, elements: !10, templateParams: !667, identifier: "4117cd70a1af3d4c18790c64000e6b42")
!667 = !{!668}
!668 = !DITemplateTypeParameter(name: "T", type: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !663, file: !6, baseType: !671, size: 64, align: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !661, file: !6, size: 64, align: 64, elements: !672, templateParams: !667, identifier: "31071eb722eb980c433f096fe515344a")
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !671, file: !6, baseType: !669, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "self", arg: 1, scope: !657, file: !658, line: 675, type: !675)
!678 = !DILocalVariable(name: "x", scope: !679, file: !658, line: 677, type: !669, align: 8)
!679 = distinct !DILexicalBlock(scope: !657, file: !658, line: 677, column: 13)
!680 = !DILocation(line: 675, column: 25, scope: !657)
!681 = !DILocation(line: 676, column: 15, scope: !657)
!682 = !DILocation(line: 676, column: 9, scope: !657)
!683 = !DILocation(line: 678, column: 21, scope: !657)
!684 = !DILocation(line: 677, column: 18, scope: !657)
!685 = !DILocation(line: 677, column: 18, scope: !679)
!686 = !DILocation(line: 677, column: 28, scope: !679)
!687 = !DILocation(line: 677, column: 34, scope: !657)
!688 = !DILocation(line: 680, column: 6, scope: !657)
!689 = distinct !DISubprogram(name: "_mm_pause", linkageName: "_ZN4core9core_arch3x864sse29_mm_pause17heb6df638f080ef98E", scope: !691, file: !690, line: 22, type: !487, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!690 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/../../stdarch/crates/core_arch/src/x86/sse2.rs", directory: "", checksumkind: CSK_MD5, checksum: "e9362aaa9be7b181a44e347703862012")
!691 = !DINamespace(name: "sse2", scope: !692)
!692 = !DINamespace(name: "x86", scope: !693)
!693 = !DINamespace(name: "core_arch", scope: !65)
!694 = !DILocation(line: 25, column: 5, scope: !689)
!695 = !DILocation(line: 26, column: 2, scope: !689)
!696 = distinct !DISubprogram(name: "call_once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup, fn() -> cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9call_once17hf953e7614391e264E", scope: !57, file: !697, line: 98, type: !698, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !708, retainedNodes: !701)
!697 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.5.2/src/once.rs", directory: "", checksumkind: CSK_MD5, checksum: "69004968d2d982c22c33586bc6b4d134")
!698 = !DISubroutineType(types: !699)
!699 = !{!669, !700, !428}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&spin::once::Once<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!701 = !{!702, !703, !704, !706}
!702 = !DILocalVariable(name: "self", arg: 1, scope: !696, file: !697, line: 98, type: !700)
!703 = !DILocalVariable(name: "builder", arg: 2, scope: !696, file: !697, line: 98, type: !428)
!704 = !DILocalVariable(name: "status", scope: !705, file: !697, line: 101, type: !72, align: 8)
!705 = distinct !DILexicalBlock(scope: !696, file: !697, line: 101, column: 9)
!706 = !DILocalVariable(name: "finish", scope: !707, file: !697, line: 109, type: !474, align: 8)
!707 = distinct !DILexicalBlock(scope: !705, file: !697, line: 109, column: 17)
!708 = !{!87, !709}
!709 = !DITemplateTypeParameter(name: "F", type: !428)
!710 = !DILocation(line: 98, column: 29, scope: !696)
!711 = !DILocation(line: 98, column: 39, scope: !696)
!712 = !DILocation(line: 101, column: 13, scope: !705)
!713 = !DILocation(line: 109, column: 21, scope: !707)
!714 = !DILocation(line: 121, column: 9, scope: !696)
!715 = !DILocation(line: 101, column: 26, scope: !696)
!716 = !DILocation(line: 103, column: 12, scope: !705)
!717 = !DILocation(line: 122, column: 13, scope: !705)
!718 = !DILocation(line: 104, column: 22, scope: !705)
!719 = !DILocation(line: 104, column: 13, scope: !705)
!720 = !DILocation(line: 107, column: 16, scope: !705)
!721 = !DILocation(line: 109, column: 34, scope: !705)
!722 = !DILocation(line: 110, column: 50, scope: !707)
!723 = !DILocation(line: 110, column: 45, scope: !707)
!724 = !DILocation(line: 110, column: 27, scope: !707)
!725 = !DILocalVariable(name: "self", arg: 1, scope: !726, file: !557, line: 2005, type: !730)
!726 = distinct !DISubprogram(name: "get<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17hb8a8710d47718c4eE", scope: !76, file: !557, line: 2005, type: !727, scopeLine: 2005, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !114, retainedNodes: !731)
!727 = !DISubroutineType(types: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<core::option::Option<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>>", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!731 = !{!725}
!732 = !DILocation(line: 2005, column: 22, scope: !726, inlinedAt: !733)
!733 = distinct !DILocation(line: 110, column: 27, scope: !707)
!734 = !DILocation(line: 110, column: 26, scope: !707)
!735 = !DILocation(line: 111, column: 17, scope: !707)
!736 = !DILocation(line: 113, column: 17, scope: !707)
!737 = !DILocation(line: 114, column: 17, scope: !707)
!738 = !DILocation(line: 117, column: 24, scope: !707)
!739 = !DILocation(line: 118, column: 13, scope: !705)
!740 = !DILocation(line: 133, column: 5, scope: !696)
!741 = !DILocation(line: 130, column: 31, scope: !705)
!742 = !DILocation(line: 123, column: 31, scope: !705)
!743 = !DILocation(line: 125, column: 21, scope: !705)
!744 = !DILocation(line: 126, column: 30, scope: !705)
!745 = !DILocation(line: 126, column: 21, scope: !705)
!746 = !DILocation(line: 126, column: 62, scope: !705)
!747 = !DILocation(line: 128, column: 29, scope: !705)
!748 = !DILocation(line: 129, column: 36, scope: !705)
!749 = !DILocation(line: 1, column: 1, scope: !750)
!750 = !DILexicalBlockFile(scope: !705, file: !751, discriminator: 0)
!751 = !DIFile(filename: "src/lib.rs", directory: "/Users/yaw/self/theo/cpu_interrupts", checksumkind: CSK_MD5, checksum: "7dc9c02a7f4e542b5c3995d104240d2c")
!752 = !DILocation(line: 133, column: 6, scope: !696)
!753 = distinct !DISubprogram(name: "force_get<cpu_interrupts::global_descriptor_table::GlobalDescriptorTableSetup>", linkageName: "_ZN4spin4once13Once$LT$T$GT$9force_get17h425c115e9f64d9f0E", scope: !57, file: !697, line: 63, type: !754, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !86, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!669, !700}
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !753, file: !697, line: 63, type: !700)
!758 = !DILocalVariable(name: "p", scope: !759, file: !697, line: 66, type: !669, align: 8)
!759 = distinct !DILexicalBlock(scope: !753, file: !697, line: 66, column: 13)
!760 = !DILocation(line: 63, column: 22, scope: !753)
!761 = !DILocation(line: 64, column: 26, scope: !753)
!762 = !DILocation(line: 2005, column: 22, scope: !726, inlinedAt: !763)
!763 = distinct !DILocation(line: 64, column: 26, scope: !753)
!764 = !DILocation(line: 64, column: 15, scope: !753)
!765 = !DILocation(line: 64, column: 9, scope: !753)
!766 = !DILocation(line: 65, column: 33, scope: !753)
!767 = !DILocation(line: 66, column: 18, scope: !753)
!768 = !DILocation(line: 66, column: 18, scope: !759)
!769 = !DILocation(line: 68, column: 6, scope: !753)
!770 = distinct !DISubprogram(name: "tss_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor11tss_segment17hba32df8104c4c417E", scope: !772, file: !771, line: 323, type: !786, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !789)
!771 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/gdt.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ab116ff7379e959850155eb85cfd2d8")
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Descriptor", scope: !92, file: !6, size: 192, align: 64, elements: !773, templateParams: !10, identifier: "3b7295460118d9ea34d7aca2c30d3111")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_variant_part, scope: !772, file: !6, size: 192, align: 64, elements: !775, templateParams: !10, identifier: "c49b3e032fa4dbb564ce50972d116b31", discriminator: !785)
!775 = !{!776, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "UserSegment", scope: !774, file: !6, baseType: !777, size: 192, align: 64, extraData: i64 0)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserSegment", scope: !772, file: !6, size: 192, align: 64, elements: !778, templateParams: !10, identifier: "35c6f37cf5cdc3ddde646feda405623c")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !777, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "SystemSegment", scope: !774, file: !6, baseType: !781, size: 192, align: 64, extraData: i64 1)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "SystemSegment", scope: !772, file: !6, size: 192, align: 64, elements: !782, templateParams: !10, identifier: "5f8d6bb25e29df3278e3090e4b465b42")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !781, file: !6, baseType: !30, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !781, file: !6, baseType: !30, size: 64, align: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !6, baseType: !30, size: 64, align: 64, flags: DIFlagArtificial)
!786 = !DISubroutineType(types: !787)
!787 = !{!772, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::tss::TaskStateSegment", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!789 = !{!790, !791, !793, !795}
!790 = !DILocalVariable(name: "tss", arg: 1, scope: !770, file: !771, line: 323, type: !788)
!791 = !DILocalVariable(name: "ptr", scope: !792, file: !771, line: 327, type: !30, align: 8)
!792 = distinct !DILexicalBlock(scope: !770, file: !771, line: 327, column: 9)
!793 = !DILocalVariable(name: "low", scope: !794, file: !771, line: 329, type: !30, align: 8)
!794 = distinct !DILexicalBlock(scope: !792, file: !771, line: 329, column: 9)
!795 = !DILocalVariable(name: "high", scope: !796, file: !771, line: 338, type: !30, align: 8)
!796 = distinct !DILexicalBlock(scope: !794, file: !771, line: 338, column: 9)
!797 = !DILocation(line: 323, column: 24, scope: !770)
!798 = !DILocation(line: 327, column: 13, scope: !792)
!799 = !DILocation(line: 329, column: 13, scope: !794)
!800 = !DILocation(line: 338, column: 13, scope: !796)
!801 = !DILocation(line: 327, column: 19, scope: !770)
!802 = !DILocation(line: 329, column: 23, scope: !792)
!803 = !DILocation(line: 331, column: 22, scope: !794)
!804 = !DILocation(line: 331, column: 43, scope: !794)
!805 = !DILocation(line: 331, column: 30, scope: !794)
!806 = !DILocation(line: 331, column: 9, scope: !794)
!807 = !DILocation(line: 332, column: 22, scope: !794)
!808 = !DILocation(line: 332, column: 43, scope: !794)
!809 = !DILocation(line: 332, column: 30, scope: !794)
!810 = !DILocation(line: 332, column: 9, scope: !794)
!811 = !DILocation(line: 334, column: 22, scope: !794)
!812 = !DILocation(line: 334, column: 29, scope: !794)
!813 = !DILocation(line: 334, column: 9, scope: !794)
!814 = !DILocation(line: 336, column: 22, scope: !794)
!815 = !DILocation(line: 336, column: 9, scope: !794)
!816 = !DILocation(line: 338, column: 24, scope: !794)
!817 = !DILocation(line: 339, column: 23, scope: !796)
!818 = !DILocation(line: 339, column: 43, scope: !796)
!819 = !DILocation(line: 339, column: 30, scope: !796)
!820 = !DILocation(line: 339, column: 9, scope: !796)
!821 = !DILocation(line: 341, column: 35, scope: !796)
!822 = !DILocation(line: 341, column: 40, scope: !796)
!823 = !DILocation(line: 341, column: 9, scope: !796)
!824 = !DILocation(line: 342, column: 6, scope: !770)
!825 = distinct !DISubprogram(name: "kernel_code_segment", linkageName: "_ZN6x86_6410structures3gdt10Descriptor19kernel_code_segment17he1e52b91234ecf3eE", scope: !772, file: !771, line: 289, type: !826, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!826 = !DISubroutineType(types: !827)
!827 = !{!772}
!828 = !DILocation(line: 290, column: 33, scope: !825)
!829 = !DILocation(line: 290, column: 9, scope: !825)
!830 = !DILocation(line: 291, column: 6, scope: !825)
!831 = distinct !DISubprogram(name: "from_bits_truncate", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags18from_bits_truncate17hbe504aaecd616010E", scope: !833, file: !832, line: 563, type: !836, scopeLine: 563, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !838)
!832 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/bitflags-1.3.2/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "a71177c4b92801136d960c3c8e5a0a3c")
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "DescriptorFlags", scope: !92, file: !6, size: 64, align: 64, elements: !834, templateParams: !10, identifier: "de796d2f482a0e9eaadb5b6bde363b88")
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !833, file: !6, baseType: !30, size: 64, align: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!833, !30}
!838 = !{!839}
!839 = !DILocalVariable(name: "bits", arg: 1, scope: !831, file: !832, line: 563, type: !30)
!840 = !DILocation(line: 563, column: 45, scope: !831)
!841 = !DILocation(line: 564, column: 37, scope: !831)
!842 = !DILocation(line: 564, column: 30, scope: !831)
!843 = !DILocation(line: 564, column: 17, scope: !831)
!844 = !DILocation(line: 565, column: 14, scope: !831)
!845 = distinct !DISubprogram(name: "all", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags3all17h02c25de08c8747b5E", scope: !833, file: !832, line: 532, type: !846, scopeLine: 532, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!846 = !DISubroutineType(types: !847)
!847 = !{!833}
!848 = !DILocation(line: 541, column: 14, scope: !845)
!849 = distinct !DISubprogram(name: "bits", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags4bits17h34d259906ff89e30E", scope: !833, file: !832, line: 545, type: !850, scopeLine: 545, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !853)
!850 = !DISubroutineType(types: !851)
!851 = !{!30, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::DescriptorFlags", baseType: !833, size: 64, align: 64, dwarfAddressSpace: 0)
!853 = !{!854}
!854 = !DILocalVariable(name: "self", arg: 1, scope: !849, file: !832, line: 545, type: !852)
!855 = !DILocation(line: 545, column: 31, scope: !849)
!856 = !DILocation(line: 546, column: 17, scope: !849)
!857 = !DILocation(line: 547, column: 14, scope: !849)
!858 = distinct !DISubprogram(name: "contains", linkageName: "_ZN6x86_6410structures3gdt15DescriptorFlags8contains17hf79263d5efced29cE", scope: !833, file: !832, line: 603, type: !859, scopeLine: 603, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!152, !852, !833}
!861 = !{!862, !863}
!862 = !DILocalVariable(name: "self", arg: 1, scope: !858, file: !832, line: 603, type: !852)
!863 = !DILocalVariable(name: "other", arg: 2, scope: !858, file: !832, line: 603, type: !833)
!864 = !DILocation(line: 603, column: 35, scope: !858)
!865 = !DILocation(line: 603, column: 42, scope: !858)
!866 = !DILocation(line: 604, column: 18, scope: !858)
!867 = !DILocation(line: 604, column: 17, scope: !858)
!868 = !DILocation(line: 605, column: 14, scope: !858)
!869 = distinct !DISubprogram(name: "load_unsafe", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable11load_unsafe17h7fbfe7c50f39d9ffE", scope: !91, file: !771, line: 158, type: !870, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !873)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::gdt::GlobalDescriptorTable", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!873 = !{!874}
!874 = !DILocalVariable(name: "self", arg: 1, scope: !869, file: !771, line: 158, type: !872)
!875 = !DILocation(line: 158, column: 31, scope: !869)
!876 = !DILocation(line: 161, column: 19, scope: !869)
!877 = !DILocation(line: 161, column: 13, scope: !869)
!878 = !DILocation(line: 163, column: 6, scope: !869)
!879 = distinct !DISubprogram(name: "new", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable3new17h6ffc4b1b207686fcE", scope: !91, file: !771, line: 56, type: !880, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!880 = !DISubroutineType(types: !881)
!881 = !{!91}
!882 = !DILocation(line: 58, column: 20, scope: !879)
!883 = !DILocation(line: 57, column: 9, scope: !879)
!884 = !DILocation(line: 61, column: 6, scope: !879)
!885 = distinct !DISubprogram(name: "load", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4load17hbadc4bbd893e8242E", scope: !91, file: !771, line: 140, type: !870, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !886)
!886 = !{!887}
!887 = !DILocalVariable(name: "self", arg: 1, scope: !885, file: !771, line: 140, type: !872)
!888 = !DILocation(line: 140, column: 17, scope: !885)
!889 = !DILocation(line: 142, column: 18, scope: !885)
!890 = !DILocation(line: 143, column: 6, scope: !885)
!891 = distinct !DISubprogram(name: "push", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable4push17h8a4e1a4625ec2affE", scope: !91, file: !771, line: 166, type: !892, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !895)
!892 = !DISubroutineType(types: !893)
!893 = !{!72, !894, !30}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::gdt::GlobalDescriptorTable", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!895 = !{!896, !897, !898}
!896 = !DILocalVariable(name: "self", arg: 1, scope: !891, file: !771, line: 167, type: !894)
!897 = !DILocalVariable(name: "value", arg: 2, scope: !891, file: !771, line: 167, type: !30)
!898 = !DILocalVariable(name: "index", scope: !899, file: !771, line: 168, type: !72, align: 8)
!899 = distinct !DILexicalBlock(scope: !891, file: !771, line: 168, column: 9)
!900 = !DILocation(line: 167, column: 13, scope: !891)
!901 = !DILocation(line: 167, column: 24, scope: !891)
!902 = !DILocation(line: 168, column: 21, scope: !891)
!903 = !DILocation(line: 168, column: 13, scope: !899)
!904 = !DILocation(line: 169, column: 9, scope: !899)
!905 = !DILocation(line: 170, column: 9, scope: !899)
!906 = !DILocation(line: 172, column: 6, scope: !891)
!907 = distinct !DISubprogram(name: "add_entry", linkageName: "_ZN6x86_6410structures3gdt21GlobalDescriptorTable9add_entry17h4b91a0f837dbe4c8E", scope: !91, file: !771, line: 101, type: !908, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !894, !772}
!910 = !{!911, !912, !913, !915, !917, !919, !920, !922, !924}
!911 = !DILocalVariable(name: "self", arg: 1, scope: !907, file: !771, line: 101, type: !894)
!912 = !DILocalVariable(name: "entry", arg: 2, scope: !907, file: !771, line: 101, type: !772)
!913 = !DILocalVariable(name: "index", scope: !914, file: !771, line: 102, type: !72, align: 8)
!914 = distinct !DILexicalBlock(scope: !907, file: !771, line: 102, column: 9)
!915 = !DILocalVariable(name: "value", scope: !916, file: !771, line: 103, type: !30, align: 8)
!916 = distinct !DILexicalBlock(scope: !907, file: !771, line: 103, column: 13)
!917 = !DILocalVariable(name: "value_low", scope: !918, file: !771, line: 109, type: !30, align: 8)
!918 = distinct !DILexicalBlock(scope: !907, file: !771, line: 109, column: 13)
!919 = !DILocalVariable(name: "value_high", scope: !918, file: !771, line: 109, type: !30, align: 8)
!920 = !DILocalVariable(name: "index", scope: !921, file: !771, line: 113, type: !72, align: 8)
!921 = distinct !DILexicalBlock(scope: !918, file: !771, line: 113, column: 17)
!922 = !DILocalVariable(name: "rpl", scope: !923, file: !771, line: 119, type: !138, align: 1)
!923 = distinct !DILexicalBlock(scope: !914, file: !771, line: 119, column: 9)
!924 = !DILocalVariable(name: "value", scope: !925, file: !771, line: 120, type: !30, align: 8)
!925 = distinct !DILexicalBlock(scope: !914, file: !771, line: 120, column: 13)
!926 = !DILocation(line: 101, column: 22, scope: !907)
!927 = !DILocation(line: 101, column: 33, scope: !907)
!928 = !DILocation(line: 102, column: 13, scope: !914)
!929 = !DILocation(line: 119, column: 13, scope: !923)
!930 = !DILocation(line: 102, column: 27, scope: !907)
!931 = !DILocation(line: 102, column: 21, scope: !907)
!932 = !DILocation(line: 103, column: 37, scope: !907)
!933 = !DILocation(line: 103, column: 37, scope: !916)
!934 = !DILocation(line: 104, column: 20, scope: !916)
!935 = !DILocalVariable(name: "self", arg: 1, scope: !936, file: !937, line: 1096, type: !72)
!936 = distinct !DISubprogram(name: "saturating_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$14saturating_sub17hc80a096e699f98d2E", scope: !938, file: !937, line: 1096, type: !940, scopeLine: 1096, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !942)
!937 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "3eed1b8baad53fb1e7d6811c678f60f8")
!938 = !DINamespace(name: "{impl#11}", scope: !939)
!939 = !DINamespace(name: "num", scope: !65)
!940 = !DISubroutineType(types: !941)
!941 = !{!72, !72, !72}
!942 = !{!935, !943}
!943 = !DILocalVariable(name: "rhs", arg: 2, scope: !936, file: !937, line: 1096, type: !72)
!944 = !DILocation(line: 1096, column: 37, scope: !936, inlinedAt: !945)
!945 = distinct !DILocation(line: 104, column: 31, scope: !916)
!946 = !DILocation(line: 1096, column: 43, scope: !936, inlinedAt: !945)
!947 = !DILocation(line: 1097, column: 13, scope: !936, inlinedAt: !945)
!948 = !DILocation(line: 109, column: 39, scope: !907)
!949 = !DILocation(line: 109, column: 39, scope: !918)
!950 = !DILocation(line: 109, column: 50, scope: !907)
!951 = !DILocation(line: 109, column: 50, scope: !918)
!952 = !DILocation(line: 110, column: 20, scope: !918)
!953 = !DILocation(line: 1096, column: 37, scope: !936, inlinedAt: !954)
!954 = distinct !DILocation(line: 110, column: 31, scope: !918)
!955 = !DILocation(line: 1096, column: 43, scope: !936, inlinedAt: !954)
!956 = !DILocation(line: 1097, column: 13, scope: !936, inlinedAt: !954)
!957 = !DILocation(line: 113, column: 29, scope: !918)
!958 = !DILocation(line: 113, column: 21, scope: !921)
!959 = !DILocation(line: 114, column: 17, scope: !921)
!960 = !DILocation(line: 115, column: 17, scope: !921)
!961 = !DILocation(line: 116, column: 13, scope: !907)
!962 = !DILocation(line: 111, column: 21, scope: !918)
!963 = !DILocation(line: 119, column: 25, scope: !914)
!964 = !DILocation(line: 119, column: 19, scope: !914)
!965 = !DILocation(line: 107, column: 17, scope: !916)
!966 = !DILocation(line: 105, column: 21, scope: !916)
!967 = !DILocation(line: 120, column: 37, scope: !914)
!968 = !DILocation(line: 120, column: 37, scope: !925)
!969 = !DILocation(line: 121, column: 20, scope: !925)
!970 = !DILocation(line: 128, column: 48, scope: !914)
!971 = !DILocation(line: 131, column: 30, scope: !923)
!972 = !DILocation(line: 131, column: 44, scope: !923)
!973 = !{i8 0, i8 4}
!974 = !DILocation(line: 131, column: 9, scope: !923)
!975 = !DILocation(line: 132, column: 6, scope: !907)
!976 = !DILocation(line: 125, column: 21, scope: !925)
!977 = !DILocation(line: 121, column: 17, scope: !925)
!978 = !DILocation(line: 123, column: 21, scope: !925)
!979 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt106Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$RP$$GT$14set_handler_fn17hbbf881e2426a834bE", scope: !981, file: !980, line: 763, type: !1002, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1006)
!980 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/structures/idt.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd33b3a09efb11eebbdb8ae5950ac11d")
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !295, file: !6, size: 128, align: 32, elements: !982, templateParams: !1000, identifier: "849e105cb06b59407cbf84a764d5060")
!982 = !{!983, !984, !985, !989, !990, !991, !992}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !981, file: !6, baseType: !40, size: 16, align: 16)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !981, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !981, file: !6, baseType: !986, size: 16, align: 16, offset: 32)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !295, file: !6, size: 16, align: 16, elements: !987, templateParams: !10, identifier: "1f1a4090263fca4d54a0be94d5181606")
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !986, file: !6, baseType: !40, size: 16, align: 16)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !981, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !981, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !981, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !981, file: !6, baseType: !993, align: 8, offset: 128)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !994, file: !6, align: 8, elements: !10, templateParams: !995, identifier: "37ec8aaafbdf3b87802b629ef2177e12")
!994 = !DINamespace(name: "marker", scope: !65)
!995 = !{!996}
!996 = !DITemplateTypeParameter(name: "T", type: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !998, size: 64, align: 64, dwarfAddressSpace: 0)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !294}
!1000 = !{!1001}
!1001 = !DITemplateTypeParameter(name: "F", type: !997)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !1005, !997}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::EntryOptions", baseType: !986, size: 64, align: 64, dwarfAddressSpace: 0)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !981, size: 64, align: 64, dwarfAddressSpace: 0)
!1006 = !{!1007, !1008, !1009}
!1007 = !DILocalVariable(name: "self", arg: 1, scope: !979, file: !980, line: 763, type: !1005)
!1008 = !DILocalVariable(name: "handler", arg: 2, scope: !979, file: !980, line: 763, type: !997)
!1009 = !DILocalVariable(name: "handler", scope: !1010, file: !980, line: 764, type: !26, align: 8)
!1010 = distinct !DILexicalBlock(scope: !979, file: !980, line: 764, column: 17)
!1011 = !DILocation(line: 763, column: 35, scope: !979)
!1012 = !DILocation(line: 763, column: 46, scope: !979)
!1013 = !DILocation(line: 764, column: 45, scope: !979)
!1014 = !DILocation(line: 764, column: 31, scope: !979)
!1015 = !DILocation(line: 764, column: 21, scope: !1010)
!1016 = !DILocation(line: 765, column: 26, scope: !1010)
!1017 = !DILocation(line: 766, column: 14, scope: !979)
!1018 = distinct !DISubprogram(name: "set_present", linkageName: "_ZN6x86_6410structures3idt12EntryOptions11set_present17hb5b7149c68b0dd8cE", scope: !986, file: !980, line: 799, type: !1019, scopeLine: 799, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1021)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!1004, !1004, !152}
!1021 = !{!1022, !1023}
!1022 = !DILocalVariable(name: "self", arg: 1, scope: !1018, file: !980, line: 799, type: !1004)
!1023 = !DILocalVariable(name: "present", arg: 2, scope: !1018, file: !980, line: 799, type: !152)
!1024 = !DILocation(line: 799, column: 24, scope: !1018)
!1025 = !DILocation(line: 799, column: 35, scope: !1018)
!1026 = !DILocation(line: 800, column: 9, scope: !1018)
!1027 = !DILocation(line: 802, column: 6, scope: !1018)
!1028 = distinct !DISubprogram(name: "set_stack_index", linkageName: "_ZN6x86_6410structures3idt12EntryOptions15set_stack_index17h3dcb11bd681796d3E", scope: !986, file: !980, line: 834, type: !1029, scopeLine: 834, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1004, !1004, !40}
!1031 = !{!1032, !1033}
!1032 = !DILocalVariable(name: "self", arg: 1, scope: !1028, file: !980, line: 834, type: !1004)
!1033 = !DILocalVariable(name: "index", arg: 2, scope: !1028, file: !980, line: 834, type: !40)
!1034 = !DILocation(line: 834, column: 35, scope: !1028)
!1035 = !DILocation(line: 834, column: 46, scope: !1028)
!1036 = !DILocation(line: 837, column: 25, scope: !1028)
!1037 = !DILocation(line: 837, column: 31, scope: !1028)
!1038 = !DILocation(line: 837, column: 9, scope: !1028)
!1039 = !DILocation(line: 839, column: 6, scope: !1028)
!1040 = distinct !DISubprogram(name: "minimal", linkageName: "_ZN6x86_6410structures3idt12EntryOptions7minimal17h55c8fa58882c1abaE", scope: !986, file: !980, line: 793, type: !1041, scopeLine: 793, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !10)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!986}
!1043 = !DILocation(line: 795, column: 6, scope: !1040)
!1044 = distinct !DISubprogram(name: "set_handler_fn", linkageName: "_ZN6x86_6410structures3idt132Entry$LT$extern$u20$$u22$x86.interrupt$u22$$u20$fn$LP$x86_64..structures..idt..InterruptStackFrame$C$u64$RP$$u20$.$GT$$u20$$u21$$GT$14set_handler_fn17he95f063006203431E", scope: !1045, file: !980, line: 763, type: !1063, scopeLine: 763, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !10, retainedNodes: !1066)
!1045 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !295, file: !6, size: 128, align: 32, elements: !1046, templateParams: !1061, identifier: "5ef8cbda6a1ef8dcb50149fd733e8f77")
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !1045, file: !6, baseType: !40, size: 16, align: 16)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !1045, file: !6, baseType: !40, size: 16, align: 16, offset: 16)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1045, file: !6, baseType: !986, size: 16, align: 16, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !1045, file: !6, baseType: !40, size: 16, align: 16, offset: 48)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !1045, file: !6, baseType: !23, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1045, file: !6, baseType: !23, size: 32, align: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !1045, file: !6, baseType: !1054, align: 8, offset: 128)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !994, file: !6, align: 8, elements: !10, templateParams: !1055, identifier: "8c88f3b97f8b5e8685a5c000c66db255")
!1055 = !{!1056}
!1056 = !DITemplateTypeParameter(name: "T", type: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !1058, size: 64, align: 64, dwarfAddressSpace: 0)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !294, !30}
!1060 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!1061 = !{!1062}
!1062 = !DITemplateTypeParameter(name: "F", type: !1057)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1004, !1065, !1057}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", baseType: !1045, size: 64, align: 64, dwarfAddressSpace: 0)
!1066 = !{!1067, !1068, !1069}
!1067 = !DILocalVariable(name: "self", arg: 1, scope: !1044, file: !980, line: 763, type: !1065)
!1068 = !DILocalVariable(name: "handler", arg: 2, scope: !1044, file: !980, line: 763, type: !1057)
!1069 = !DILocalVariable(name: "handler", scope: !1070, file: !980, line: 764, type: !26, align: 8)
!1070 = distinct !DILexicalBlock(scope: !1044, file: !980, line: 764, column: 17)
!1071 = !DILocation(line: 763, column: 35, scope: !1044)
!1072 = !DILocation(line: 763, column: 46, scope: !1044)
!1073 = !DILocation(line: 764, column: 45, scope: !1044)
!1074 = !DILocation(line: 764, column: 31, scope: !1044)
!1075 = !DILocation(line: 764, column: 21, scope: !1070)
!1076 = !DILocation(line: 765, column: 26, scope: !1070)
!1077 = !DILocation(line: 766, column: 14, scope: !1044)
!1078 = distinct !DISubprogram(name: "set_handler_addr<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", linkageName: "_ZN6x86_6410structures3idt14Entry$LT$F$GT$16set_handler_addr17h9896bbcb023d00b1E", scope: !981, file: !980, line: 721, type: !1079, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, templateParams: !1000, retainedNodes: !1081)
