; ModuleID = 'log.e429cccc-cgu.0'
source_filename = "log.e429cccc-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::option::Option<(u8, u8)>" = type { i8, [2 x i8] }
%"core::ops::control_flow::ControlFlow<(), core::convert::Infallible>::Break" = type { {} }
%"core::iter::adapters::zip::Zip<core::str::iter::Bytes<'_>, core::str::iter::Bytes<'_>>" = type { { ptr, ptr }, { ptr, ptr }, i64, i64, i64 }
%"core::option::Option<(u8, u8)>::Some" = type { [1 x i8], { i8, i8 } }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"MaybeStaticStr<'_>" = type { i64, [2 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs:553:18: 553:26]" = type {}
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs:568:22: 568:27]" = type {}
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs:627:20: 627:23]" = type {}
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs:808:20: 808:23]" = type {}
%"[closure@/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs:567:25: 567:31]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !14, identifier: "76a36f92706138bc96068bd075a152f1")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!14 = !{}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "<&log::MaybeStaticStr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&log::MaybeStaticStr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !18, vtableHolder: !23, templateParams: !14, identifier: "3a5f228f3b66e609ddd2e57a0bc8f919")
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !17, file: !2, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !17, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&log::MaybeStaticStr", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeStaticStr", scope: !25, file: !2, size: 192, align: 64, elements: !26, templateParams: !14, identifier: "d60f8cb8859b8e7836c319a6ee88ae31")
!25 = !DINamespace(name: "log", scope: null)
!26 = !{!27}
!27 = !DICompositeType(tag: DW_TAG_variant_part, scope: !24, file: !2, size: 192, align: 64, elements: !28, templateParams: !14, identifier: "18a491a7761f19aadf738fb6f1a6270e", discriminator: !43)
!28 = !{!29, !39}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Static", scope: !27, file: !2, baseType: !30, size: 192, align: 64, extraData: i64 0)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Static", scope: !24, file: !2, size: 192, align: 64, elements: !31, templateParams: !14, identifier: "4360a1d93541f8926c26d7836dfd610e")
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !30, file: !2, baseType: !33, size: 128, align: 64, offset: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !34, templateParams: !14, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!34 = !{!35, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !33, file: !2, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!37 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !33, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Borrowed", scope: !27, file: !2, baseType: !40, size: 192, align: 64, extraData: i64 1)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Borrowed", scope: !24, file: !2, size: 192, align: 64, elements: !41, templateParams: !14, identifier: "b47d4e9c58a7e83c2b32b9faa55ffc5")
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !40, file: !2, baseType: !33, size: 128, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!44 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "<log::NopLogger as log::Log>::{vtable}", scope: null, file: !2, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "<log::NopLogger as log::Log>::{vtable_type}", file: !2, size: 448, align: 64, flags: DIFlagArtificial, elements: !48, vtableHolder: !56, templateParams: !14, identifier: "b4887e58a5f07bfed35cf09a9aa78cec")
!48 = !{!49, !50, !51, !52, !53, !54, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !47, file: !2, baseType: !6, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !47, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr3", scope: !47, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !47, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !47, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !47, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "NopLogger", scope: !25, file: !2, align: 8, elements: !14, identifier: "b0818b1936ceb4b35d23aaa5b0b86344")
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "LOGGER", linkageName: "_ZN3log6LOGGER17h52e93529d6070b35E", scope: !25, file: !59, line: 397, type: !60, isLocal: true, isDefinition: true, align: 64)
!59 = !DIFile(filename: "src/lib.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17", checksumkind: CSK_MD5, checksum: "7345a14a35944ad543c7347a7433ea5a")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn log::Log", file: !2, size: 128, align: 64, elements: !61, templateParams: !14, identifier: "af5a7a1290e68e61a3b977fd51573c97")
!61 = !{!62, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !60, file: !2, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn log::Log", file: !2, align: 8, elements: !14, identifier: "78d8930008053ef8cc6d5c32ceef6cb8")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !60, file: !2, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 3, lowerBound: 0)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "STATE", linkageName: "_ZN3log5STATE17hb545eb2a82d5d472E", scope: !25, file: !59, line: 399, type: !72, isLocal: true, isDefinition: true, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !73, file: !2, size: 64, align: 64, elements: !76, templateParams: !14, identifier: "e00fd022714aa819cef83a74a4523c4")
!73 = !DINamespace(name: "atomic", scope: !74)
!74 = !DINamespace(name: "sync", scope: !75)
!75 = !DINamespace(name: "core", scope: null)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !72, file: !2, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !79, file: !2, size: 64, align: 64, elements: !80, templateParams: !82, identifier: "8f2b43c3fe89fd793c6f616cb378bdef")
!79 = !DINamespace(name: "cell", scope: !75)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !2, baseType: !9, size: 64, align: 64)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !9)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "MAX_LOG_LEVEL_FILTER", linkageName: "_ZN3log20MAX_LOG_LEVEL_FILTER17h7d510a885c3f0293E", scope: !25, file: !59, line: 408, type: !72, isLocal: false, isDefinition: true, align: 64)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "LOG_LEVEL_NAMES", linkageName: "_ZN3log15LOG_LEVEL_NAMES17hda45566d864a56aaE", scope: !25, file: !59, line: 410, type: !88, isLocal: true, isDefinition: true, align: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 768, align: 64, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 6, lowerBound: 0)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "SET_LOGGER_ERROR", linkageName: "_ZN3log16SET_LOGGER_ERROR17h5a15a627145786beE", scope: !25, file: !59, line: 412, type: !33, isLocal: true, isDefinition: true, align: 64)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "LEVEL_PARSE_ERROR", linkageName: "_ZN3log17LEVEL_PARSE_ERROR17h1758e15c9a23dd29E", scope: !25, file: !59, line: 414, type: !33, isLocal: true, isDefinition: true, align: 64)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "NOP", linkageName: "_ZN3log6logger3NOP17h39fea5493f8bb8f8E", scope: !97, file: !59, line: 1575, type: !56, isLocal: true, isDefinition: true, align: 8)
!97 = !DINamespace(name: "logger", scope: !25)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "<&&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !101, vtableHolder: !106, templateParams: !14, identifier: "b959603094aee95b9e44d00f5d61439b")
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !100, file: !2, baseType: !6, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !100, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !100, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "<log::Metadata as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "<log::Metadata as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !110, vtableHolder: !115, templateParams: !14, identifier: "924023db7b0343802ea55fbaab10bedf")
!110 = !{!111, !112, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !109, file: !2, baseType: !6, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !109, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !109, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !109, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metadata", scope: !25, file: !2, size: 192, align: 64, elements: !116, templateParams: !14, identifier: "3bd26084ee546aef10a66a29bdd27347")
!116 = !{!117, !125}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !115, file: !2, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Level", scope: !25, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagEnumClass, elements: !119)
!119 = !{!120, !121, !122, !123, !124}
!120 = !DIEnumerator(name: "Error", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "Warn", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "Info", value: 3, isUnsigned: true)
!123 = !DIEnumerator(name: "Debug", value: 4, isUnsigned: true)
!124 = !DIEnumerator(name: "Trace", value: 5, isUnsigned: true)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !115, file: !2, baseType: !33, size: 128, align: 64)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !129, vtableHolder: !134, templateParams: !14, identifier: "633d2d47ef108da23fcea5fe13f92807")
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !128, file: !2, baseType: !6, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !128, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !128, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !135, file: !2, size: 384, align: 64, elements: !136, templateParams: !14, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!135 = !DINamespace(name: "fmt", scope: !75)
!136 = !{!137, !143, !198}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !134, file: !2, baseType: !138, size: 128, align: 64, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !139, templateParams: !14, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !138, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !134, file: !2, baseType: !144, size: 128, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !145, file: !2, size: 128, align: 64, elements: !146, templateParams: !14, identifier: "37e4e944ba32344d635147f54bf9f4df")
!145 = !DINamespace(name: "option", scope: !75)
!146 = !{!147}
!147 = !DICompositeType(tag: DW_TAG_variant_part, scope: !144, file: !2, size: 128, align: 64, elements: !148, templateParams: !14, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !197)
!148 = !{!149, !193}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !147, file: !2, baseType: !150, size: 128, align: 64, extraData: i64 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !144, file: !2, size: 128, align: 64, elements: !14, templateParams: !151, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !154, templateParams: !14, identifier: "2225a8a3217ca2e4230086a86939d931")
!154 = !{!155, !192}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !153, file: !2, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !158, file: !2, size: 448, align: 64, elements: !160, templateParams: !14, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!158 = !DINamespace(name: "v1", scope: !159)
!159 = !DINamespace(name: "rt", scope: !135)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !157, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !157, file: !2, baseType: !163, size: 384, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !158, file: !2, size: 384, align: 64, elements: !164, templateParams: !14, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!164 = !{!165, !167, !174, !175, !191}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !163, file: !2, baseType: !166, size: 32, align: 32, offset: 288)
!166 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !163, file: !2, baseType: !168, size: 8, align: 8, offset: 320)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !158, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagEnumClass, elements: !169)
!169 = !{!170, !171, !172, !173}
!170 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!171 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!172 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!173 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !2, baseType: !13, size: 32, align: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !163, file: !2, baseType: !176, size: 128, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !158, file: !2, size: 128, align: 64, elements: !177, templateParams: !14, identifier: "32660758978696a09244873a5d6fbb61")
!177 = !{!178}
!178 = !DICompositeType(tag: DW_TAG_variant_part, scope: !176, file: !2, size: 128, align: 64, elements: !179, templateParams: !14, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !190)
!179 = !{!180, !184, !188}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !178, file: !2, baseType: !181, size: 128, align: 64, extraData: i64 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !176, file: !2, size: 128, align: 64, elements: !182, templateParams: !14, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !178, file: !2, baseType: !185, size: 128, align: 64, extraData: i64 1)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !176, file: !2, size: 128, align: 64, elements: !186, templateParams: !14, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !185, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !178, file: !2, baseType: !189, size: 128, align: 64, extraData: i64 2)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !176, file: !2, size: 128, align: 64, elements: !14, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !176, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !163, file: !2, baseType: !176, size: 128, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !153, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !147, file: !2, baseType: !194, size: 128, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !144, file: !2, size: 128, align: 64, elements: !195, templateParams: !151, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !2, baseType: !153, size: 128, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !134, file: !2, baseType: !199, size: 128, align: 64, offset: 256)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !200, templateParams: !14, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!200 = !{!201, !257}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !199, file: !2, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !135, file: !2, size: 128, align: 64, elements: !204, templateParams: !14, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!204 = !{!205, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !2, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !208, file: !2, align: 8, elements: !14, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!208 = !DINamespace(name: "{extern#0}", scope: !135)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !203, file: !2, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !206, !231}
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !214, file: !2, size: 8, align: 8, elements: !215, templateParams: !14, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!214 = !DINamespace(name: "result", scope: !75)
!215 = !{!216}
!216 = !DICompositeType(tag: DW_TAG_variant_part, scope: !213, file: !2, size: 8, align: 8, elements: !217, templateParams: !14, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !230)
!217 = !{!218, !226}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !216, file: !2, baseType: !219, size: 8, align: 8, extraData: i64 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !213, file: !2, size: 8, align: 8, elements: !220, templateParams: !222, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !219, file: !2, baseType: !7, align: 8, offset: 8)
!222 = !{!223, !224}
!223 = !DITemplateTypeParameter(name: "T", type: !7)
!224 = !DITemplateTypeParameter(name: "E", type: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !135, file: !2, align: 8, elements: !14, identifier: "c2c8f2f945c37359aa57422093183824")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !216, file: !2, baseType: !227, size: 8, align: 8, extraData: i64 1)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !213, file: !2, size: 8, align: 8, elements: !228, templateParams: !222, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !227, file: !2, baseType: !225, align: 8, offset: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !213, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagArtificial)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !232, size: 64, align: 64, dwarfAddressSpace: 0)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !135, file: !2, size: 512, align: 64, elements: !233, templateParams: !14, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!233 = !{!234, !235, !236, !237, !249, !250}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !2, baseType: !13, size: 32, align: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !232, file: !2, baseType: !166, size: 32, align: 32, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !232, file: !2, baseType: !168, size: 8, align: 8, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !232, file: !2, baseType: !238, size: 128, align: 64, offset: 128)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !145, file: !2, size: 128, align: 64, elements: !239, templateParams: !14, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!239 = !{!240}
!240 = !DICompositeType(tag: DW_TAG_variant_part, scope: !238, file: !2, size: 128, align: 64, elements: !241, templateParams: !14, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !248)
!241 = !{!242, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !240, file: !2, baseType: !243, size: 128, align: 64, extraData: i64 0)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !238, file: !2, size: 128, align: 64, elements: !14, templateParams: !82, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !240, file: !2, baseType: !245, size: 128, align: 64, extraData: i64 1)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !238, file: !2, size: 128, align: 64, elements: !246, templateParams: !82, identifier: "eec942390a307d7c8c2162b2092f63f3")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !232, file: !2, baseType: !238, size: 128, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !232, file: !2, baseType: !251, size: 128, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !252, templateParams: !14, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!252 = !{!253, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !251, file: !2, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64, dwarfAddressSpace: 0)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !14, identifier: "bb744bac75d5d19249a16512e8e296c")
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !251, file: !2, baseType: !66, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !199, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "<core::option::Option<log::MaybeStaticStr> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<log::MaybeStaticStr> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !261, vtableHolder: !266, templateParams: !14, identifier: "43c38be6d06af2cff28dbbf96979dd85")
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !260, file: !2, baseType: !6, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !260, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !260, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<log::MaybeStaticStr>", scope: !145, file: !2, size: 192, align: 64, elements: !267, templateParams: !14, identifier: "5df768884a45bd4fbc2d60754949240d")
!267 = !{!268}
!268 = !DICompositeType(tag: DW_TAG_variant_part, scope: !266, file: !2, size: 192, align: 64, elements: !269, templateParams: !14, identifier: "610b4f3ab0e3bcee208ac8654f06b2b", discriminator: !278)
!269 = !{!270, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !268, file: !2, baseType: !271, size: 192, align: 64, extraData: i64 2)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !266, file: !2, size: 192, align: 64, elements: !14, templateParams: !272, identifier: "45d5d7d697eace0f1c3e22864b29c41")
!272 = !{!273}
!273 = !DITemplateTypeParameter(name: "T", type: !24)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !268, file: !2, baseType: !275, size: 192, align: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !266, file: !2, size: 192, align: 64, elements: !276, templateParams: !272, identifier: "d27618434038654de9e22dde744ba2a1")
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !275, file: !2, baseType: !24, size: 192, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "<&core::option::Option<u32> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u32> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !282, vtableHolder: !287, templateParams: !14, identifier: "4304484454ba249b6dc0d07e38e525b9")
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !281, file: !2, baseType: !6, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !281, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !281, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !281, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u32>", baseType: !288, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !145, file: !2, size: 64, align: 32, elements: !289, templateParams: !14, identifier: "ee0be0a99874a719f6035c262e95e378")
!289 = !{!290}
!290 = !DICompositeType(tag: DW_TAG_variant_part, scope: !288, file: !2, size: 64, align: 32, elements: !291, templateParams: !14, identifier: "c76489018d1649ea81bd9e90dc2b064f", discriminator: !300)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !290, file: !2, baseType: !293, size: 64, align: 32, extraData: i64 0)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !288, file: !2, size: 64, align: 32, elements: !14, templateParams: !294, identifier: "e3201174044a01d045990e4f182824eb")
!294 = !{!295}
!295 = !DITemplateTypeParameter(name: "T", type: !13)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !290, file: !2, baseType: !297, size: 64, align: 32, extraData: i64 1)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !288, file: !2, size: 64, align: 32, elements: !298, templateParams: !294, identifier: "6f95dbb6c41f90b5fb145dcdc8a8b66b")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !13, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !288, file: !2, baseType: !13, size: 32, align: 32, flags: DIFlagArtificial)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "<&log::Record as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&log::Record as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !304, vtableHolder: !309, templateParams: !14, identifier: "29cb3797623c8e3477fbca9419fd9dc")
!304 = !{!305, !306, !307, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !303, file: !2, baseType: !6, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !303, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !303, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !303, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&log::Record", baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Record", scope: !25, file: !2, size: 1024, align: 64, elements: !311, templateParams: !14, identifier: "ac575120a422ce023ba46e9a0d3f2627")
!311 = !{!312, !313, !314, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !310, file: !2, baseType: !115, size: 192, align: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !310, file: !2, baseType: !134, size: 384, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "module_path", scope: !310, file: !2, baseType: !266, size: 192, align: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !310, file: !2, baseType: !266, size: 192, align: 64, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !310, file: !2, baseType: !288, size: 64, align: 32, offset: 384)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "<log::Level as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "<log::Level as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !320, vtableHolder: !118, templateParams: !14, identifier: "e8276496b1d30a3b211561c4eaa6dce")
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !319, file: !2, baseType: !6, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !319, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !319, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !319, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "<&log::Metadata as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&log::Metadata as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !328, vtableHolder: !333, templateParams: !14, identifier: "221ba83b884058f41c863d2730e24714")
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !327, file: !2, baseType: !6, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !327, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !327, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&log::Metadata", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !337, vtableHolder: !342, templateParams: !14, identifier: "a9f38c2ed237b51291b57ada18f179ad")
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !336, file: !2, baseType: !6, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !336, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !336, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !{i32 7, !"PIC Level", i32 2}
!344 = !{i32 2, !"Dwarf Version", i32 4}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !347, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !348, globals: !359, splitDebugInlining: false)
!347 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17/src/lib.rs/@/log.e429cccc-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/log-0.4.17")
!348 = !{!118, !168, !349, !352}
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelFilter", scope: !25, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagEnumClass, elements: !350)
!350 = !{!351, !120, !121, !122, !123, !124}
!351 = !DIEnumerator(name: "Off", value: 0, isUnsigned: true)
!352 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !73, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagEnumClass, elements: !353)
!353 = !{!354, !355, !356, !357, !358}
!354 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!358 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!359 = !{!0, !15, !57, !70, !84, !86, !91, !93, !45, !95, !98, !107, !126, !258, !279, !301, !317, !325, !334}
!360 = distinct !DISubprogram(name: "next<log::Level, core::iter::adapters::filter::Filter<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>, log::{impl#6}::from_str::{closure_env#2}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h1bf1b8634b4c43c1E", scope: !362, file: !361, line: 102, type: !366, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !411, retainedNodes: !409)
!361 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "97b07ff42844decce9ce91a8c0ee38b9")
!362 = !DINamespace(name: "{impl#2}", scope: !363)
!363 = !DINamespace(name: "map", scope: !364)
!364 = !DINamespace(name: "adapters", scope: !365)
!365 = !DINamespace(name: "iter", scope: !75)
!366 = !DISubroutineType(types: !367)
!367 = !{!368, !381}
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<log::Level>", scope: !145, file: !2, size: 64, align: 64, elements: !369, templateParams: !14, identifier: "fe2c2b0a359b7ecfea3f0d949d27119c")
!369 = !{!370}
!370 = !DICompositeType(tag: DW_TAG_variant_part, scope: !368, file: !2, size: 64, align: 64, elements: !371, templateParams: !14, identifier: "f79ec0c450e0742ff49ce7f2777046a4", discriminator: !380)
!371 = !{!372, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !370, file: !2, baseType: !373, size: 64, align: 64, extraData: i64 0)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !368, file: !2, size: 64, align: 64, elements: !14, templateParams: !374, identifier: "b95a57f5ff51d9b0ba92480ac8417720")
!374 = !{!375}
!375 = !DITemplateTypeParameter(name: "T", type: !118)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !370, file: !2, baseType: !377, size: 64, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !368, file: !2, size: 64, align: 64, elements: !378, templateParams: !374, identifier: "1a22388b8c4c21a09a2de3349abb0814")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !377, file: !2, baseType: !118, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::filter::Filter<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>, log::{impl#6}::from_str::{closure_env#2}>", baseType: !382, size: 64, align: 64, dwarfAddressSpace: 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::filter::Filter<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>, log::{impl#6}::from_str::{closure_env#2}>", scope: !363, file: !2, size: 128, align: 64, elements: !383, templateParams: !406, identifier: "46929a5102b7a07db256ca12ef97e415")
!383 = !{!384, !404}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !382, file: !2, baseType: !385, size: 128, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filter<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>", scope: !386, file: !2, size: 128, align: 64, elements: !387, templateParams: !401, identifier: "797ecbb43785958f8dc19885c1b6b3c2")
!386 = !DINamespace(name: "filter", scope: !364)
!387 = !{!388, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !385, file: !2, baseType: !389, size: 128, align: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<usize>", scope: !145, file: !2, size: 128, align: 64, elements: !390, templateParams: !395, identifier: "3bf70808999d61a5bd3d8576407785b")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !389, file: !2, baseType: !392, size: 128, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Item<usize>", scope: !145, file: !2, size: 128, align: 64, elements: !393, templateParams: !395, identifier: "c08b5f811d03a5b8a553a7940f4f63db")
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !392, file: !2, baseType: !238, size: 128, align: 64)
!395 = !{!396}
!396 = !DITemplateTypeParameter(name: "A", type: !9)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !385, file: !2, baseType: !398, align: 8)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}", scope: !399, file: !2, align: 8, elements: !14, identifier: "a2d7a525fd9d28ed298a7cdd8999d771")
!399 = !DINamespace(name: "from_str", scope: !400)
!400 = !DINamespace(name: "{impl#6}", scope: !25)
!401 = !{!402, !403}
!402 = !DITemplateTypeParameter(name: "I", type: !389)
!403 = !DITemplateTypeParameter(name: "P", type: !398)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !382, file: !2, baseType: !405, align: 8)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#2}", scope: !399, file: !2, align: 8, elements: !14, identifier: "527a1c7f1cc516fb63a8409d9eebcc32")
!406 = !{!407, !408}
!407 = !DITemplateTypeParameter(name: "I", type: !385)
!408 = !DITemplateTypeParameter(name: "F", type: !405)
!409 = !{!410}
!410 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !361, line: 102, type: !381)
!411 = !{!412, !407, !408}
!412 = !DITemplateTypeParameter(name: "B", type: !118)
!413 = !DILocation(line: 102, column: 13, scope: !360)
!414 = !DILocation(line: 103, column: 9, scope: !360)
!415 = !{i64 0, i64 6}
!416 = !DILocation(line: 104, column: 6, scope: !360)
!417 = distinct !DISubprogram(name: "next<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17he12b8c741586b1a2E", scope: !419, file: !418, line: 83, type: !421, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !479, retainedNodes: !482)
!418 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c509a824e4a7135eeada70952dc2dd9")
!419 = !DINamespace(name: "{impl#1}", scope: !420)
!420 = !DINamespace(name: "zip", scope: !364)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !440}
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(u8, u8)>", scope: !145, file: !2, size: 24, align: 8, elements: !424, templateParams: !14, identifier: "db5dc9ddd3fa01dc29dbdf330f94bb0b")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_variant_part, scope: !423, file: !2, size: 24, align: 8, elements: !426, templateParams: !14, identifier: "fae4ef51b70fdceb587c42266cb3f81", discriminator: !439)
!426 = !{!427, !435}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !425, file: !2, baseType: !428, size: 24, align: 8, extraData: i64 0)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !423, file: !2, size: 24, align: 8, elements: !14, templateParams: !429, identifier: "f70ec7cecb1e838737e47a560d7fc41")
!429 = !{!430}
!430 = !DITemplateTypeParameter(name: "T", type: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, u8)", file: !2, size: 16, align: 8, elements: !432, templateParams: !14, identifier: "a8f7b9d207a8550c66fd9290cfb9300b")
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !431, file: !2, baseType: !37, size: 8, align: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !431, file: !2, baseType: !37, size: 8, align: 8, offset: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !425, file: !2, baseType: !436, size: 24, align: 8, extraData: i64 1)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !423, file: !2, size: 24, align: 8, elements: !437, templateParams: !429, identifier: "f379be696d54b55826e7f98ef4c79c04")
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !436, file: !2, baseType: !431, size: 16, align: 8, offset: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagArtificial)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::str::iter::Bytes, core::str::iter::Bytes>", baseType: !441, size: 64, align: 64, dwarfAddressSpace: 0)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::str::iter::Bytes, core::str::iter::Bytes>", scope: !420, file: !2, size: 448, align: 64, elements: !442, templateParams: !479, identifier: "b9402c9c487316af6c5b1d2cf1cf595c")
!442 = !{!443, !475, !476, !477, !478}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !441, file: !2, baseType: !444, size: 128, align: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !445, file: !2, size: 128, align: 64, elements: !447, templateParams: !14, identifier: "2ee9809e02a776836c60f8fcc261067")
!445 = !DINamespace(name: "iter", scope: !446)
!446 = !DINamespace(name: "str", scope: !75)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !444, file: !2, baseType: !449, size: 128, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !450, file: !2, size: 128, align: 64, elements: !451, templateParams: !473, identifier: "317e1a74244282bbb3e696972af9242")
!450 = !DINamespace(name: "copied", scope: !364)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !449, file: !2, baseType: !453, size: 128, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !454, file: !2, size: 128, align: 64, elements: !456, templateParams: !464, identifier: "49f2839d0cd9fb05fd95863bd53ba425")
!454 = !DINamespace(name: "iter", scope: !455)
!455 = !DINamespace(name: "slice", scope: !75)
!456 = !{!457, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !453, file: !2, baseType: !458, size: 64, align: 64, offset: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !459, file: !2, size: 64, align: 64, elements: !461, templateParams: !464, identifier: "1dbb83832a28bb2882fc75217f980e7b")
!459 = !DINamespace(name: "non_null", scope: !460)
!460 = !DINamespace(name: "ptr", scope: !75)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !458, file: !2, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!464 = !{!465}
!465 = !DITemplateTypeParameter(name: "T", type: !37)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !453, file: !2, baseType: !463, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !453, file: !2, baseType: !468, align: 8)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !469, file: !2, align: 8, elements: !14, templateParams: !470, identifier: "6b78a19adc8500268cf33f83184ddd9a")
!469 = !DINamespace(name: "marker", scope: !75)
!470 = !{!471}
!471 = !DITemplateTypeParameter(name: "T", type: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "I", type: !453)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !441, file: !2, baseType: !444, size: 128, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !441, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !441, file: !2, baseType: !9, size: 64, align: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !441, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!479 = !{!480, !481}
!480 = !DITemplateTypeParameter(name: "A", type: !444)
!481 = !DITemplateTypeParameter(name: "B", type: !444)
!482 = !{!483}
!483 = !DILocalVariable(name: "self", arg: 1, scope: !417, file: !418, line: 83, type: !440)
!484 = !DILocation(line: 83, column: 13, scope: !417)
!485 = !DILocation(line: 84, column: 9, scope: !417)
!486 = !DILocation(line: 85, column: 6, scope: !417)
!487 = distinct !DISubprogram(name: "__iterator_get_unchecked<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$24__iterator_get_unchecked17h3180f89438cface0E", scope: !489, file: !488, line: 96, type: !490, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !496, retainedNodes: !493)
!488 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "7ceb660251058cd474b170c1984cef9f")
!489 = !DINamespace(name: "{impl#1}", scope: !450)
!490 = !DISubroutineType(types: !491)
!491 = !{!37, !492, !9}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !449, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !{!494, !495}
!494 = !DILocalVariable(name: "self", arg: 1, scope: !487, file: !488, line: 96, type: !492)
!495 = !DILocalVariable(name: "idx", arg: 2, scope: !487, file: !488, line: 96, type: !9)
!496 = !{!474, !465}
!497 = !DILocation(line: 96, column: 40, scope: !487)
!498 = !DILocation(line: 96, column: 51, scope: !487)
!499 = !DILocation(line: 102, column: 19, scope: !487)
!500 = !DILocation(line: 102, column: 9, scope: !487)
!501 = !DILocation(line: 103, column: 6, scope: !487)
!502 = distinct !DISubprogram(name: "size_hint<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h3752014c1b479e15E", scope: !489, file: !488, line: 59, type: !503, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !496, retainedNodes: !510)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !509}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !506, templateParams: !14, identifier: "988e31921c642937d59bd81e5ff97ea9")
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !2, baseType: !9, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !505, file: !2, baseType: !238, size: 128, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !449, size: 64, align: 64, dwarfAddressSpace: 0)
!510 = !{!511}
!511 = !DILocalVariable(name: "self", arg: 1, scope: !502, file: !488, line: 59, type: !509)
!512 = !DILocation(line: 59, column: 18, scope: !502)
!513 = !DILocation(line: 60, column: 9, scope: !502)
!514 = !DILocation(line: 61, column: 6, scope: !502)
!515 = distinct !DISubprogram(name: "from_residual<usize, ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h0b94a9f2116db405E", scope: !517, file: !516, line: 123, type: !520, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !530, retainedNodes: !556)
!516 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "18814020abf99e8db034f7354ec821c9")
!517 = !DINamespace(name: "{impl#1}", scope: !518)
!518 = !DINamespace(name: "control_flow", scope: !519)
!519 = !DINamespace(name: "ops", scope: !75)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !538}
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<usize, ()>", scope: !518, file: !2, size: 128, align: 64, elements: !523, templateParams: !14, identifier: "8bc5a5b304682c7e9fb6044d3144433b")
!523 = !{!524}
!524 = !DICompositeType(tag: DW_TAG_variant_part, scope: !522, file: !2, size: 128, align: 64, elements: !525, templateParams: !14, identifier: "a52cd5631d633b35a701fb50c91db7db", discriminator: !537)
!525 = !{!526, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !524, file: !2, baseType: !527, size: 128, align: 64, extraData: i64 0)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !522, file: !2, size: 128, align: 64, elements: !528, templateParams: !530, identifier: "665f0fcb3ba2c97b851d179ad09f2f60")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !527, file: !2, baseType: !7, align: 8, offset: 64)
!530 = !{!531, !532}
!531 = !DITemplateTypeParameter(name: "B", type: !9)
!532 = !DITemplateTypeParameter(name: "C", type: !7)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !524, file: !2, baseType: !534, size: 128, align: 64, extraData: i64 1)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !522, file: !2, size: 128, align: 64, elements: !535, templateParams: !530, identifier: "30f21c2c16e8977e42a2a193de2195ae")
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !534, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, scope: !522, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagArtificial)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<usize, core::convert::Infallible>", scope: !518, file: !2, size: 64, align: 64, elements: !539, templateParams: !14, identifier: "5d2e2bf2ddd76565ce995de702da23e8")
!539 = !{!540}
!540 = !DICompositeType(tag: DW_TAG_variant_part, scope: !538, file: !2, size: 64, align: 64, elements: !541, templateParams: !14, identifier: "ed9d404ce01f44a6bc971d3c22198a13")
!541 = !{!542, !552}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !540, file: !2, baseType: !543, size: 64, align: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !538, file: !2, size: 64, align: 64, elements: !544, templateParams: !550, identifier: "51ce49c2db645d85535db834bd81ae9")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !543, file: !2, baseType: !546, align: 8)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !547, file: !2, align: 8, elements: !548, templateParams: !14, identifier: "8a2a5bae2fcbafab106f83f211f89369")
!547 = !DINamespace(name: "convert", scope: !75)
!548 = !{!549}
!549 = !DICompositeType(tag: DW_TAG_variant_part, scope: !546, file: !2, align: 8, elements: !14, identifier: "1019b8bdfb9e2631aa941b08872a2da")
!550 = !{!531, !551}
!551 = !DITemplateTypeParameter(name: "C", type: !546)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !540, file: !2, baseType: !553, size: 64, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !538, file: !2, size: 64, align: 64, elements: !554, templateParams: !550, identifier: "848932da9de6480b35ff75967fafe034")
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !553, file: !2, baseType: !9, size: 64, align: 64)
!556 = !{!557, !558}
!557 = !DILocalVariable(name: "residual", arg: 1, scope: !515, file: !516, line: 123, type: !538)
!558 = !DILocalVariable(name: "b", scope: !559, file: !516, line: 125, type: !9, align: 8)
!559 = distinct !DILexicalBlock(scope: !515, file: !516, line: 125, column: 13)
!560 = !DILocation(line: 123, column: 22, scope: !515)
!561 = !DILocation(line: 125, column: 32, scope: !515)
!562 = !DILocation(line: 125, column: 32, scope: !559)
!563 = !DILocation(line: 125, column: 38, scope: !559)
!564 = !DILocation(line: 127, column: 6, scope: !515)
!565 = !{i64 0, i64 2}
!566 = distinct !DISubprogram(name: "from_residual<(), ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h44bb0efecb0294f1E", scope: !517, file: !516, line: 123, type: !567, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !577, retainedNodes: !597)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !584}
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), ()>", scope: !518, file: !2, size: 8, align: 8, elements: !570, templateParams: !14, identifier: "ebc634b0ad145d455952302efbded19a")
!570 = !{!571}
!571 = !DICompositeType(tag: DW_TAG_variant_part, scope: !569, file: !2, size: 8, align: 8, elements: !572, templateParams: !14, identifier: "6a401816270acb3384778651f610362", discriminator: !583)
!572 = !{!573, !579}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !571, file: !2, baseType: !574, size: 8, align: 8, extraData: i64 0)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !569, file: !2, size: 8, align: 8, elements: !575, templateParams: !577, identifier: "145ce3bd25f0a0af849f67ac239c2413")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !7, align: 8, offset: 8)
!577 = !{!578, !532}
!578 = !DITemplateTypeParameter(name: "B", type: !7)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !571, file: !2, baseType: !580, size: 8, align: 8, extraData: i64 1)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !569, file: !2, size: 8, align: 8, elements: !581, templateParams: !577, identifier: "7d5ad8dbd6395834ad40f06d2479f912")
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !580, file: !2, baseType: !7, align: 8, offset: 8)
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagArtificial)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), core::convert::Infallible>", scope: !518, file: !2, align: 8, elements: !585, templateParams: !14, identifier: "aa540ba5c56e8f79b48888b62abc2301")
!585 = !{!586}
!586 = !DICompositeType(tag: DW_TAG_variant_part, scope: !584, file: !2, align: 8, elements: !587, templateParams: !14, identifier: "b8d36018e1a6c4b757d79674be50424d")
!587 = !{!588, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !586, file: !2, baseType: !589, align: 8)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !584, file: !2, align: 8, elements: !590, templateParams: !592, identifier: "ab1bf809082f864e46f8e9f62602b63d")
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !589, file: !2, baseType: !546, align: 8)
!592 = !{!578, !551}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !586, file: !2, baseType: !594, align: 8)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !584, file: !2, align: 8, elements: !595, templateParams: !592, identifier: "87c23c8616c24947bf8399738ad6f60")
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !594, file: !2, baseType: !7, align: 8)
!597 = !{!598, !599}
!598 = !DILocalVariable(name: "residual", arg: 1, scope: !566, file: !516, line: 123, type: !584)
!599 = !DILocalVariable(name: "b", scope: !600, file: !516, line: 125, type: !7, align: 1)
!600 = distinct !DILexicalBlock(scope: !566, file: !516, line: 125, column: 13)
!601 = !DILocation(line: 123, column: 22, scope: !566)
!602 = !DILocation(line: 125, column: 32, scope: !600)
!603 = !DILocation(line: 125, column: 38, scope: !600)
!604 = !DILocation(line: 127, column: 6, scope: !566)
!605 = !{i8 0, i8 2}
!606 = distinct !DISubprogram(name: "next<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>", linkageName: "_ZN108_$LT$core..iter..adapters..filter..Filter$LT$I$C$P$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hca3511a088a74789E", scope: !608, file: !607, line: 55, type: !609, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !401, retainedNodes: !612)
!607 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/filter.rs", directory: "", checksumkind: CSK_MD5, checksum: "c40e38a82bfcb5502309bb1c105aea0b")
!608 = !DINamespace(name: "{impl#2}", scope: !386)
!609 = !DISubroutineType(types: !610)
!610 = !{!238, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::filter::Filter<core::option::IntoIter<usize>, log::{impl#6}::from_str::{closure_env#1}>", baseType: !385, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !{!613}
!613 = !DILocalVariable(name: "self", arg: 1, scope: !606, file: !607, line: 55, type: !611)
!614 = !DILocation(line: 55, column: 13, scope: !606)
!615 = !DILocation(line: 56, column: 9, scope: !606)
!616 = !DILocation(line: 57, column: 6, scope: !606)
!617 = distinct !DISubprogram(name: "new<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17hab95df9a8bda88acE", scope: !618, file: !418, line: 262, type: !619, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !479, retainedNodes: !621)
!618 = !DINamespace(name: "{impl#5}", scope: !420)
!619 = !DISubroutineType(types: !620)
!620 = !{!441, !444, !444}
!621 = !{!622, !623, !624, !626}
!622 = !DILocalVariable(name: "a", arg: 1, scope: !617, file: !418, line: 262, type: !444)
!623 = !DILocalVariable(name: "b", arg: 2, scope: !617, file: !418, line: 262, type: !444)
!624 = !DILocalVariable(name: "a_len", scope: !625, file: !418, line: 263, type: !9, align: 8)
!625 = distinct !DILexicalBlock(scope: !617, file: !418, line: 263, column: 9)
!626 = !DILocalVariable(name: "len", scope: !627, file: !418, line: 264, type: !9, align: 8)
!627 = distinct !DILexicalBlock(scope: !625, file: !418, line: 264, column: 9)
!628 = !DILocation(line: 262, column: 12, scope: !617)
!629 = !DILocation(line: 262, column: 18, scope: !617)
!630 = !DILocation(line: 263, column: 21, scope: !617)
!631 = !DILocation(line: 263, column: 13, scope: !625)
!632 = !DILocation(line: 264, column: 35, scope: !625)
!633 = !DILocation(line: 264, column: 19, scope: !625)
!634 = !DILocation(line: 264, column: 13, scope: !627)
!635 = !DILocation(line: 265, column: 15, scope: !627)
!636 = !DILocation(line: 265, column: 18, scope: !627)
!637 = !DILocation(line: 265, column: 9, scope: !627)
!638 = !DILocation(line: 266, column: 6, scope: !617)
!639 = distinct !DISubprogram(name: "next<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17he2a708251dbbfff0E", scope: !618, file: !418, line: 269, type: !421, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !479, retainedNodes: !640)
!640 = !{!641, !642, !644}
!641 = !DILocalVariable(name: "self", arg: 1, scope: !639, file: !418, line: 269, type: !440)
!642 = !DILocalVariable(name: "i", scope: !643, file: !418, line: 271, type: !9, align: 8)
!643 = distinct !DILexicalBlock(scope: !639, file: !418, line: 271, column: 13)
!644 = !DILocalVariable(name: "i", scope: !645, file: !418, line: 280, type: !9, align: 8)
!645 = distinct !DILexicalBlock(scope: !639, file: !418, line: 280, column: 13)
!646 = !DILocation(line: 269, column: 13, scope: !639)
!647 = !DILocation(line: 270, column: 12, scope: !639)
!648 = !DILocation(line: 270, column: 25, scope: !639)
!649 = !DILocation(line: 279, column: 19, scope: !639)
!650 = !DILocation(line: 271, column: 21, scope: !639)
!651 = !DILocation(line: 271, column: 17, scope: !643)
!652 = !DILocation(line: 274, column: 13, scope: !643)
!653 = !DILocation(line: 277, column: 23, scope: !643)
!654 = !DILocation(line: 277, column: 59, scope: !643)
!655 = !DILocation(line: 277, column: 22, scope: !643)
!656 = !DILocation(line: 277, column: 17, scope: !643)
!657 = !DILocation(line: 270, column: 9, scope: !639)
!658 = !DILocation(line: 293, column: 6, scope: !639)
!659 = !DILocation(line: 279, column: 46, scope: !639)
!660 = !DILocation(line: 279, column: 59, scope: !639)
!661 = !DILocation(line: 291, column: 13, scope: !639)
!662 = !DILocation(line: 279, column: 16, scope: !639)
!663 = !DILocation(line: 280, column: 21, scope: !639)
!664 = !DILocation(line: 280, column: 17, scope: !645)
!665 = !DILocation(line: 282, column: 13, scope: !645)
!666 = !DILocation(line: 283, column: 13, scope: !645)
!667 = !DILocation(line: 287, column: 17, scope: !645)
!668 = !DILocation(line: 289, column: 13, scope: !645)
!669 = distinct !DISubprogram(name: "fmt<log::Record>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h101fbe48dae3c8dbE", scope: !671, file: !670, line: 2396, type: !672, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !678, retainedNodes: !675)
!670 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3da37f0da8b4e2a4936cc4d503a5a432")
!671 = !DINamespace(name: "{impl#59}", scope: !135)
!672 = !DISubroutineType(types: !673)
!673 = !{!213, !674, !231}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&log::Record", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!675 = !{!676, !677}
!676 = !DILocalVariable(name: "self", arg: 1, scope: !669, file: !670, line: 2396, type: !674)
!677 = !DILocalVariable(name: "f", arg: 2, scope: !669, file: !670, line: 2396, type: !231)
!678 = !{!679}
!679 = !DITemplateTypeParameter(name: "T", type: !310)
!680 = !DILocation(line: 2396, column: 20, scope: !669)
!681 = !DILocation(line: 2396, column: 27, scope: !669)
!682 = !DILocation(line: 2396, column: 71, scope: !669)
!683 = !{i64 8}
!684 = !DILocation(line: 2396, column: 62, scope: !669)
!685 = !DILocation(line: 2396, column: 84, scope: !669)
!686 = distinct !DISubprogram(name: "fmt<core::option::Option<u32>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h518d703f07902d36E", scope: !671, file: !670, line: 2396, type: !687, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !693, retainedNodes: !690)
!687 = !DISubroutineType(types: !688)
!688 = !{!213, !689, !231}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::option::Option<u32>", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!690 = !{!691, !692}
!691 = !DILocalVariable(name: "self", arg: 1, scope: !686, file: !670, line: 2396, type: !689)
!692 = !DILocalVariable(name: "f", arg: 2, scope: !686, file: !670, line: 2396, type: !231)
!693 = !{!694}
!694 = !DITemplateTypeParameter(name: "T", type: !288)
!695 = !DILocation(line: 2396, column: 20, scope: !686)
!696 = !DILocation(line: 2396, column: 27, scope: !686)
!697 = !DILocation(line: 2396, column: 71, scope: !686)
!698 = !{i64 4}
!699 = !DILocation(line: 2396, column: 62, scope: !686)
!700 = !DILocation(line: 2396, column: 84, scope: !686)
!701 = distinct !DISubprogram(name: "fmt<&str>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h94d341b54aade895E", scope: !671, file: !670, line: 2396, type: !702, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !708, retainedNodes: !705)
!702 = !DISubroutineType(types: !703)
!703 = !{!213, !704, !231}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&&str", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!705 = !{!706, !707}
!706 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !670, line: 2396, type: !704)
!707 = !DILocalVariable(name: "f", arg: 2, scope: !701, file: !670, line: 2396, type: !231)
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "T", type: !33)
!710 = !DILocation(line: 2396, column: 20, scope: !701)
!711 = !DILocation(line: 2396, column: 27, scope: !701)
!712 = !DILocation(line: 2396, column: 71, scope: !701)
!713 = !DILocation(line: 2396, column: 62, scope: !701)
!714 = !DILocation(line: 2396, column: 84, scope: !701)
!715 = distinct !DISubprogram(name: "fmt<log::Metadata>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hcf37a660f7ff6eb9E", scope: !671, file: !670, line: 2396, type: !716, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !722, retainedNodes: !719)
!716 = !DISubroutineType(types: !717)
!717 = !{!213, !718, !231}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&log::Metadata", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !{!720, !721}
!720 = !DILocalVariable(name: "self", arg: 1, scope: !715, file: !670, line: 2396, type: !718)
!721 = !DILocalVariable(name: "f", arg: 2, scope: !715, file: !670, line: 2396, type: !231)
!722 = !{!723}
!723 = !DITemplateTypeParameter(name: "T", type: !115)
!724 = !DILocation(line: 2396, column: 20, scope: !715)
!725 = !DILocation(line: 2396, column: 27, scope: !715)
!726 = !DILocation(line: 2396, column: 71, scope: !715)
!727 = !DILocation(line: 2396, column: 62, scope: !715)
!728 = !DILocation(line: 2396, column: 84, scope: !715)
!729 = distinct !DISubprogram(name: "fmt<log::MaybeStaticStr>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hee374390c2bcce5aE", scope: !671, file: !670, line: 2396, type: !730, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !272, retainedNodes: !733)
!730 = !DISubroutineType(types: !731)
!731 = !{!213, !732, !231}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&log::MaybeStaticStr", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!733 = !{!734, !735}
!734 = !DILocalVariable(name: "self", arg: 1, scope: !729, file: !670, line: 2396, type: !732)
!735 = !DILocalVariable(name: "f", arg: 2, scope: !729, file: !670, line: 2396, type: !231)
!736 = !DILocation(line: 2396, column: 20, scope: !729)
!737 = !DILocation(line: 2396, column: 27, scope: !729)
!738 = !DILocation(line: 2396, column: 71, scope: !729)
!739 = !DILocation(line: 2396, column: 62, scope: !729)
!740 = !DILocation(line: 2396, column: 84, scope: !729)
!741 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::option::Option<usize>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h067aa759158809c2E", scope: !743, file: !742, line: 2260, type: !744, scopeLine: 2260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !750, retainedNodes: !748)
!742 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "890eee47c720221d7463b825943ce452")
!743 = !DINamespace(name: "intrinsics", scope: !75)
!744 = !DISubroutineType(types: !745)
!745 = !{!746, !747}
!746 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::option::Option<usize>", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !{!749}
!749 = !DILocalVariable(name: "ptr", arg: 1, scope: !741, file: !742, line: 2260, type: !747)
!750 = !{!751}
!751 = !DITemplateTypeParameter(name: "T", type: !238)
!752 = !DILocation(line: 2260, column: 42, scope: !741)
!753 = !DILocation(line: 2261, column: 6, scope: !741)
!754 = !DILocation(line: 2261, column: 5, scope: !741)
!755 = !DILocation(line: 2261, column: 23, scope: !741)
!756 = !DILocation(line: 2262, column: 2, scope: !741)
!757 = distinct !DISubprogram(name: "eq", linkageName: "_ZN4core3cmp5impls59_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$$RP$$GT$2eq17h7e353ebcaba6a421E", scope: !759, file: !758, line: 1321, type: !762, scopeLine: 1321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !14, retainedNodes: !764)
!758 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "b91f20a51804d5cdbda7bdba75d392d5")
!759 = !DINamespace(name: "{impl#0}", scope: !760)
!760 = !DINamespace(name: "impls", scope: !761)
!761 = !DINamespace(name: "cmp", scope: !75)
!762 = !DISubroutineType(types: !763)
!763 = !{!746, !342, !342}
!764 = !{!765, !766}
!765 = !DILocalVariable(name: "self", arg: 1, scope: !757, file: !758, line: 1321, type: !342)
!766 = !DILocalVariable(name: "_other", arg: 2, scope: !757, file: !758, line: 1321, type: !342)
!767 = !DILocation(line: 1321, column: 15, scope: !757)
!768 = !DILocation(line: 1321, column: 22, scope: !757)
!769 = !DILocation(line: 1323, column: 10, scope: !757)
!770 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h8007b4f7caea7c1bE", scope: !134, file: !670, line: 401, type: !771, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !14, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!134, !138, !199}
!773 = !{!774, !775}
!774 = !DILocalVariable(name: "pieces", arg: 1, scope: !770, file: !670, line: 401, type: !138)
!775 = !DILocalVariable(name: "args", arg: 2, scope: !770, file: !670, line: 401, type: !199)
!776 = !DILocation(line: 401, column: 25, scope: !770)
!777 = !DILocation(line: 401, column: 53, scope: !770)
!778 = !DILocation(line: 402, column: 12, scope: !770)
!779 = !DILocation(line: 402, column: 56, scope: !770)
!780 = !DILocation(line: 402, column: 41, scope: !770)
!781 = !DILocation(line: 405, column: 34, scope: !770)
!782 = !DILocation(line: 405, column: 9, scope: !770)
!783 = !DILocation(line: 406, column: 6, scope: !770)
!784 = !DILocation(line: 403, column: 13, scope: !770)
!785 = distinct !DISubprogram(name: "replace<core::option::Option<usize>>", linkageName: "_ZN4core3mem7replace17h583b4ef5931a4420E", scope: !787, file: !786, line: 904, type: !788, scopeLine: 904, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !750, retainedNodes: !791)
!786 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2818803a2f5479a3883c65b3bb9963fd")
!787 = !DINamespace(name: "mem", scope: !75)
!788 = !DISubroutineType(types: !789)
!789 = !{!238, !790, !238}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<usize>", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!791 = !{!792, !793, !794}
!792 = !DILocalVariable(name: "dest", arg: 1, scope: !785, file: !786, line: 904, type: !790)
!793 = !DILocalVariable(name: "src", arg: 2, scope: !785, file: !786, line: 904, type: !238)
!794 = !DILocalVariable(name: "result", scope: !795, file: !786, line: 909, type: !238, align: 8)
!795 = distinct !DILexicalBlock(scope: !785, file: !786, line: 909, column: 9)
!796 = !DILocation(line: 904, column: 25, scope: !785)
!797 = !DILocation(line: 904, column: 39, scope: !785)
!798 = !DILocation(line: 909, column: 22, scope: !785)
!799 = !DILocation(line: 909, column: 13, scope: !795)
!800 = !DILocation(line: 910, column: 9, scope: !795)
!801 = !DILocation(line: 913, column: 2, scope: !785)
!802 = distinct !DISubprogram(name: "break_value<usize, ()>", linkageName: "_ZN4core3ops12control_flow24ControlFlow$LT$B$C$C$GT$11break_value17h2b3d237b88d7c9f9E", scope: !522, file: !516, line: 183, type: !803, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !530, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!238, !522}
!805 = !{!806, !807}
!806 = !DILocalVariable(name: "self", arg: 1, scope: !802, file: !516, line: 183, type: !522)
!807 = !DILocalVariable(name: "x", scope: !808, file: !516, line: 186, type: !9, align: 8)
!808 = distinct !DILexicalBlock(scope: !802, file: !516, line: 186, column: 13)
!809 = !DILocation(line: 183, column: 24, scope: !802)
!810 = !DILocation(line: 184, column: 15, scope: !802)
!811 = !DILocation(line: 184, column: 9, scope: !802)
!812 = !DILocation(line: 185, column: 42, scope: !802)
!813 = !DILocation(line: 186, column: 32, scope: !802)
!814 = !DILocation(line: 186, column: 32, scope: !808)
!815 = !DILocation(line: 186, column: 38, scope: !808)
!816 = !DILocation(line: 186, column: 44, scope: !802)
!817 = !DILocation(line: 188, column: 5, scope: !802)
!818 = !DILocation(line: 188, column: 6, scope: !802)
!819 = distinct !DISubprogram(name: "call_mut<(&usize), log::{impl#6}::from_str::{closure_env#1}>", linkageName: "_ZN4core3ops8function5impls79_$LT$impl$u20$core..ops..function..FnMut$LT$A$GT$$u20$for$u20$$RF$mut$u20$F$GT$8call_mut17haaf06788149b3a41E", scope: !821, file: !820, line: 297, type: !824, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !835, retainedNodes: !829)
!820 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!821 = !DINamespace(name: "{impl#3}", scope: !822)
!822 = !DINamespace(name: "impls", scope: !823)
!823 = !DINamespace(name: "function", scope: !519)
!824 = !DISubroutineType(types: !825)
!825 = !{!746, !826, !828}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &mut log::{impl#6}::from_str::{closure_env#1}", baseType: !827, size: 64, align: 64, dwarfAddressSpace: 0)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut log::{impl#6}::from_str::{closure_env#1}", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!829 = !{!830, !831}
!830 = !DILocalVariable(name: "self", arg: 1, scope: !819, file: !820, line: 297, type: !826)
!831 = !DILocalVariable(name: "args", arg: 2, scope: !819, file: !820, line: 297, type: !832)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&usize)", file: !2, size: 64, align: 64, elements: !833, templateParams: !14, identifier: "c702f2dcdc5943c2dfbcf35b84838552")
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !2, baseType: !828, size: 64, align: 64)
!835 = !{!836, !837}
!836 = !DITemplateTypeParameter(name: "A", type: !832)
!837 = !DITemplateTypeParameter(name: "F", type: !398)
!838 = !DILocation(line: 297, column: 40, scope: !819)
!839 = !DILocation(line: 297, column: 51, scope: !819)
!840 = !DILocation(line: 298, column: 13, scope: !819)
!841 = !{i64 1}
!842 = !DILocation(line: 299, column: 10, scope: !819)
!843 = distinct !DISubprogram(name: "call_once<(usize), log::{impl#6}::from_str::{closure_env#2}>", linkageName: "_ZN4core3ops8function5impls80_$LT$impl$u20$core..ops..function..FnOnce$LT$A$GT$$u20$for$u20$$RF$mut$u20$F$GT$9call_once17h9820d7a768e5f307E", scope: !844, file: !820, line: 309, type: !845, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !854, retainedNodes: !848)
!844 = !DINamespace(name: "{impl#4}", scope: !822)
!845 = !DISubroutineType(types: !846)
!846 = !{!118, !847, !9}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut log::{impl#6}::from_str::{closure_env#2}", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!848 = !{!849, !850}
!849 = !DILocalVariable(name: "self", arg: 1, scope: !843, file: !820, line: 309, type: !847)
!850 = !DILocalVariable(name: "args", arg: 2, scope: !843, file: !820, line: 309, type: !851)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize)", file: !2, size: 64, align: 64, elements: !852, templateParams: !14, identifier: "be5a0343bf46ea0f95c493ffbfefbbfb")
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !851, file: !2, baseType: !9, size: 64, align: 64)
!854 = !{!855, !408}
!855 = !DITemplateTypeParameter(name: "A", type: !851)
!856 = !DILocation(line: 309, column: 41, scope: !843)
!857 = !DILocation(line: 309, column: 47, scope: !843)
!858 = !DILocation(line: 310, column: 13, scope: !843)
!859 = !{i64 1, i64 6}
!860 = !DILocation(line: 311, column: 10, scope: !843)
!861 = distinct !DISubprogram(name: "call_once<fn(&str) -> log::MaybeStaticStr, (&str)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hfe487bee6c358a64E", scope: !862, file: !820, line: 250, type: !863, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !874, retainedNodes: !868)
!862 = !DINamespace(name: "FnOnce", scope: !823)
!863 = !DISubroutineType(types: !864)
!864 = !{!24, !865, !33}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&str) -> log::MaybeStaticStr", baseType: !866, size: 64, align: 64, dwarfAddressSpace: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!24, !33}
!868 = !{!869, !870}
!869 = !DILocalVariable(arg: 1, scope: !861, file: !820, line: 250, type: !865)
!870 = !DILocalVariable(arg: 2, scope: !861, file: !820, line: 250, type: !871)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&str)", file: !2, size: 128, align: 64, elements: !872, templateParams: !14, identifier: "9cd1d1ce9d7a7ab2e4d175dd528b8ea3")
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !871, file: !2, baseType: !33, size: 128, align: 64)
!874 = !{!875, !876}
!875 = !DITemplateTypeParameter(name: "Self", type: !865)
!876 = !DITemplateTypeParameter(name: "Args", type: !871)
!877 = !DILocation(line: 250, column: 5, scope: !861)
!878 = distinct !DISubprogram(name: "drop_in_place<&u32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$u32$GT$17h779bb67fb27e6bbeE", scope: !460, file: !879, line: 490, type: !880, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !885, retainedNodes: !883)
!879 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bdd6b96186b52f0612a564cb734428a7")
!880 = !DISubroutineType(types: !881)
!881 = !{null, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &u32", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!883 = !{!884}
!884 = !DILocalVariable(arg: 1, scope: !878, file: !879, line: 490, type: !882)
!885 = !{!886}
!886 = !DITemplateTypeParameter(name: "T", type: !12)
!887 = !DILocation(line: 490, column: 1, scope: !878)
!888 = distinct !DISubprogram(name: "drop_in_place<log::Level>", linkageName: "_ZN4core3ptr31drop_in_place$LT$log..Level$GT$17h7db871d329ae4589E", scope: !460, file: !879, line: 490, type: !889, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !374, retainedNodes: !892)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut log::Level", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!892 = !{!893}
!893 = !DILocalVariable(arg: 1, scope: !888, file: !879, line: 490, type: !891)
!894 = !DILocation(line: 490, column: 1, scope: !888)
!895 = distinct !DISubprogram(name: "drop_in_place<&&str>", linkageName: "_ZN4core3ptr32drop_in_place$LT$$RF$$RF$str$GT$17h52ee0201e730aa7cE", scope: !460, file: !879, line: 490, type: !896, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !901, retainedNodes: !899)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &&str", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!899 = !{!900}
!900 = !DILocalVariable(arg: 1, scope: !895, file: !879, line: 490, type: !898)
!901 = !{!902}
!902 = !DITemplateTypeParameter(name: "T", type: !106)
!903 = !DILocation(line: 490, column: 1, scope: !895)
!904 = distinct !DISubprogram(name: "drop_in_place<&()>", linkageName: "_ZN4core3ptr33drop_in_place$LT$$RF$$LP$$RP$$GT$17h130b4d02678e8186E", scope: !460, file: !879, line: 490, type: !905, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !910, retainedNodes: !908)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &()", baseType: !342, size: 64, align: 64, dwarfAddressSpace: 0)
!908 = !{!909}
!909 = !DILocalVariable(arg: 1, scope: !904, file: !879, line: 490, type: !907)
!910 = !{!911}
!911 = !DITemplateTypeParameter(name: "T", type: !342)
!912 = !DILocation(line: 490, column: 1, scope: !904)
!913 = distinct !DISubprogram(name: "drop_in_place<log::Metadata>", linkageName: "_ZN4core3ptr34drop_in_place$LT$log..Metadata$GT$17heedda8a5fed347abE", scope: !460, file: !879, line: 490, type: !914, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !722, retainedNodes: !917)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut log::Metadata", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!917 = !{!918}
!918 = !DILocalVariable(arg: 1, scope: !913, file: !879, line: 490, type: !916)
!919 = !DILocation(line: 490, column: 1, scope: !913)
!920 = distinct !DISubprogram(name: "drop_in_place<log::NopLogger>", linkageName: "_ZN4core3ptr35drop_in_place$LT$log..NopLogger$GT$17hffdf7f7d0bdeef15E", scope: !460, file: !879, line: 490, type: !921, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !926, retainedNodes: !924)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut log::NopLogger", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!924 = !{!925}
!925 = !DILocalVariable(arg: 1, scope: !920, file: !879, line: 490, type: !923)
!926 = !{!927}
!927 = !DITemplateTypeParameter(name: "T", type: !56)
!928 = !DILocation(line: 490, column: 1, scope: !920)
!929 = distinct !DISubprogram(name: "drop_in_place<&log::Record>", linkageName: "_ZN4core3ptr36drop_in_place$LT$$RF$log..Record$GT$17hd59df48b4b72e15eE", scope: !460, file: !879, line: 490, type: !930, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !935, retainedNodes: !933)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &log::Record", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!933 = !{!934}
!934 = !DILocalVariable(arg: 1, scope: !929, file: !879, line: 490, type: !932)
!935 = !{!936}
!936 = !DITemplateTypeParameter(name: "T", type: !309)
!937 = !DILocation(line: 490, column: 1, scope: !929)
!938 = distinct !DISubprogram(name: "drop_in_place<&log::Metadata>", linkageName: "_ZN4core3ptr38drop_in_place$LT$$RF$log..Metadata$GT$17h23bd71c54180675eE", scope: !460, file: !879, line: 490, type: !939, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !944, retainedNodes: !942)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &log::Metadata", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!942 = !{!943}
!943 = !DILocalVariable(arg: 1, scope: !938, file: !879, line: 490, type: !941)
!944 = !{!945}
!945 = !DITemplateTypeParameter(name: "T", type: !333)
!946 = !DILocation(line: 490, column: 1, scope: !938)
!947 = distinct !DISubprogram(name: "drop_in_place<core::fmt::Arguments>", linkageName: "_ZN4core3ptr41drop_in_place$LT$core..fmt..Arguments$GT$17h71738dbeaf000511E", scope: !460, file: !879, line: 490, type: !948, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !953, retainedNodes: !951)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::fmt::Arguments", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!951 = !{!952}
!952 = !DILocalVariable(arg: 1, scope: !947, file: !879, line: 490, type: !950)
!953 = !{!954}
!954 = !DITemplateTypeParameter(name: "T", type: !134)
!955 = !DILocation(line: 490, column: 1, scope: !947)
!956 = distinct !DISubprogram(name: "drop_in_place<&log::MaybeStaticStr>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$log..MaybeStaticStr$GT$17h17ec5cc2934785efE", scope: !460, file: !879, line: 490, type: !957, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !962, retainedNodes: !960)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &log::MaybeStaticStr", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!960 = !{!961}
!961 = !DILocalVariable(arg: 1, scope: !956, file: !879, line: 490, type: !959)
!962 = !{!963}
!963 = !DITemplateTypeParameter(name: "T", type: !23)
!964 = !DILocation(line: 490, column: 1, scope: !956)
!965 = distinct !DISubprogram(name: "read<core::option::Option<usize>>", linkageName: "_ZN4core3ptr4read17h7cb62f6eba435156E", scope: !460, file: !879, line: 1137, type: !966, scopeLine: 1137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !750, retainedNodes: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{!238, !747}
!968 = !{!969, !970}
!969 = !DILocalVariable(name: "src", arg: 1, scope: !965, file: !879, line: 1137, type: !747)
!970 = !DILocalVariable(name: "tmp", scope: !971, file: !879, line: 1145, type: !972, align: 8)
!971 = distinct !DILexicalBlock(scope: !965, file: !879, line: 1145, column: 5)
!972 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<core::option::Option<usize>>", scope: !973, file: !2, size: 128, align: 64, elements: !974, templateParams: !750, identifier: "1092b597b30ad3a66e870055e987d0df")
!973 = !DINamespace(name: "maybe_uninit", scope: !787)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !972, file: !2, baseType: !7, align: 8)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !972, file: !2, baseType: !977, size: 128, align: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<core::option::Option<usize>>", scope: !978, file: !2, size: 128, align: 64, elements: !979, templateParams: !750, identifier: "e0d0f02445278d6f19f94179def6fb3e")
!978 = !DINamespace(name: "manually_drop", scope: !787)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !977, file: !2, baseType: !238, size: 128, align: 64)
!981 = !DILocation(line: 1137, column: 29, scope: !965)
!982 = !DILocation(line: 1145, column: 9, scope: !971)
!983 = !DILocation(line: 315, column: 6, scope: !984, inlinedAt: !988)
!984 = distinct !DISubprogram(name: "uninit<core::option::Option<usize>>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17h60ede9645058962cE", scope: !972, file: !985, line: 313, type: !986, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !750, retainedNodes: !14)
!985 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "1414c0f1ab8ce712ce2deada2fd51b28")
!986 = !DISubroutineType(types: !987)
!987 = !{!972}
!988 = distinct !DILocation(line: 1145, column: 19, scope: !965)
!989 = !DILocation(line: 1145, column: 19, scope: !965)
!990 = !DILocation(line: 1153, column: 9, scope: !971)
!991 = !DILocalVariable(name: "src", arg: 1, scope: !992, file: !742, line: 2241, type: !747)
!992 = distinct !DISubprogram(name: "runtime<core::option::Option<usize>>", linkageName: "_ZN4core3ptr4read7runtime17hafc647173ab7e22cE", scope: !993, file: !742, line: 2241, type: !994, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !346, templateParams: !750, retainedNodes: !996)
!993 = !DINamespace(name: "read", scope: !460)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !747}
!996 = !{!991}
!997 = !DILocation(line: 2241, column: 39, scope: !992, inlinedAt: !998)
!998 = distinct !DILocation(line: 1153, column: 9, scope: !971)
!999 = !DILocation(line: 1155, column: 35, scope: !1000, inlinedAt: !998)
