; ModuleID = 'spin.3123ca65b42497d7-cgu.0'
source_filename = "spin.3123ca65b42497d7-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }

@alloc_91c7fa63c3cfeaa3c795652d5cf060e4 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc_560206a49c61adca6f3f0639a12632eb = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_91c7fa63c3cfeaa3c795652d5cf060e4, [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc_c2ea93c90919bb7b1e482f917e413fa1 = private unnamed_addr constant <{ [107 x i8] }> <{ [107 x i8] c"/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs" }>, align 1
@alloc_5eca5fde541bf3444e5a23d5419b88a4 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_c2ea93c90919bb7b1e482f917e413fa1, [16 x i8] c"k\00\00\00\00\00\00\00+\01\00\00\0D\00\00\00" }>, align 8
@alloc_513570631223a12912d85da2bec3b15a = private unnamed_addr constant <{}> zeroinitializer, align 8
@alloc_00c0bce0fa6327f8ec8e69d6d765d508 = private unnamed_addr constant <{ [50 x i8] }> <{ [50 x i8] c"there is no such thing as an acquire-release store" }>, align 1
@alloc_e8a173a411485b7e37220624c537a890 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_00c0bce0fa6327f8ec8e69d6d765d508, [8 x i8] c"2\00\00\00\00\00\00\00" }>, align 8

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, splitDebugInlining: false)
!4 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8/src/lib.rs/@/spin.3123ca65b42497d7-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/spin-0.9.8")
!5 = !{!6, !17, !26}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !12)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "rt", scope: !9)
!9 = !DINamespace(name: "fmt", scope: !10)
!10 = !DINamespace(name: "core", scope: null)
!11 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !18, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!18 = !DINamespace(name: "atomic", scope: !19)
!19 = !DINamespace(name: "sync", scope: !10)
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", scope: !27, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !30)
!27 = !DINamespace(name: "status", scope: !28)
!28 = !DINamespace(name: "once", scope: !29)
!29 = !DINamespace(name: "spin", scope: null)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "Incomplete", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "Running", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "Complete", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "Panicked", value: 3, isUnsigned: true)
!35 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17hf41e33fe3e101ca2E", scope: !37, file: !36, line: 297, type: !165, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !50, retainedNodes: !167)
!36 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ef87442911d64d819773d1c3d54b7ba2")
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !9, file: !7, size: 384, align: 64, elements: !38, templateParams: !50, identifier: "84f4de322c722d4ecf7f26fdd881a12a")
!38 = !{!39, !52, !98}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !37, file: !7, baseType: !40, size: 128, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !41, templateParams: !50, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!41 = !{!42, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !40, file: !7, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !45, templateParams: !50, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !44, file: !7, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!50 = !{}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !40, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !37, file: !7, baseType: !53, size: 128, align: 64, offset: 256)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !54, file: !7, size: 128, align: 64, elements: !55, templateParams: !50, identifier: "45e7676749e8833fc9f6788a752fa233")
!54 = !DINamespace(name: "option", scope: !10)
!55 = !{!56}
!56 = !DICompositeType(tag: DW_TAG_variant_part, scope: !53, file: !7, size: 128, align: 64, elements: !57, templateParams: !50, identifier: "78fc5675d20b0b054937c9b243721b04", discriminator: !97)
!57 = !{!58, !93}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !56, file: !7, baseType: !59, size: 128, align: 64, extraData: i64 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !53, file: !7, size: 128, align: 64, elements: !50, templateParams: !60, identifier: "7d6e0642c5fd326d5dedec8db5f1b626")
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !7, size: 128, align: 64, elements: !63, templateParams: !50, identifier: "2bdd0a1d249b9615818490cbe02637d0")
!63 = !{!64, !92}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !62, file: !7, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !8, file: !7, size: 448, align: 64, elements: !67, templateParams: !50, identifier: "60d1cd8e27ed5e572e6b6b32ddcefdd4")
!67 = !{!68, !69, !71, !72, !74, !91}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !66, file: !7, baseType: !49, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !66, file: !7, baseType: !70, size: 32, align: 32, offset: 320)
!70 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !66, file: !7, baseType: !6, size: 8, align: 8, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !7, baseType: !73, size: 32, align: 32, offset: 352)
!73 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !66, file: !7, baseType: !75, size: 128, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !76, templateParams: !50, identifier: "8e436bf796d1bd1040afe66a54932e93")
!76 = !{!77}
!77 = !DICompositeType(tag: DW_TAG_variant_part, scope: !75, file: !7, size: 128, align: 64, elements: !78, templateParams: !50, identifier: "a16b1bf0ef6abe7338d550f54b3197c9", discriminator: !89)
!78 = !{!79, !83, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !77, file: !7, baseType: !80, size: 128, align: 64, extraData: i64 0)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !75, file: !7, size: 128, align: 64, elements: !81, templateParams: !50, identifier: "bb2788de63ecf655614eae44833a9683")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !77, file: !7, baseType: !84, size: 128, align: 64, extraData: i64 1)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !75, file: !7, size: 128, align: 64, elements: !85, templateParams: !50, identifier: "45b8dfec94a90db1ad28af7e19954195")
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !84, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !77, file: !7, baseType: !88, size: 128, align: 64, extraData: i64 2)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !75, file: !7, size: 128, align: 64, elements: !50, identifier: "b2dd58a70f39c2d6f76f6e2aef3afc0e")
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !75, file: !7, baseType: !90, size: 64, align: 64, flags: DIFlagArtificial)
!90 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !66, file: !7, baseType: !75, size: 128, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !62, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !56, file: !7, baseType: !94, size: 128, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !53, file: !7, size: 128, align: 64, elements: !95, templateParams: !60, identifier: "17825c15133f27503bca321877d808b")
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !94, file: !7, baseType: !62, size: 128, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !53, file: !7, baseType: !90, size: 64, align: 64, flags: DIFlagArtificial)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !37, file: !7, baseType: !99, size: 128, align: 64, offset: 128)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !7, size: 128, align: 64, elements: !100, templateParams: !50, identifier: "b8c00ffcd99aa185b2b067e76efe6873")
!100 = !{!101, !164}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !99, file: !7, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 128, align: 64, elements: !104, templateParams: !50, identifier: "92df9959c1cdfbcdd7133c99bcf5419")
!104 = !{!105, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !103, file: !7, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !108, file: !7, align: 8, elements: !50, identifier: "9b221ef387fa4c24dae3649531e7392e")
!108 = !DINamespace(name: "{extern#0}", scope: !8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !103, file: !7, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !106, !132}
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !114, file: !7, size: 8, align: 8, elements: !115, templateParams: !50, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!114 = !DINamespace(name: "result", scope: !10)
!115 = !{!116}
!116 = !DICompositeType(tag: DW_TAG_variant_part, scope: !113, file: !7, size: 8, align: 8, elements: !117, templateParams: !50, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !131)
!117 = !{!118, !127}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !116, file: !7, baseType: !119, size: 8, align: 8, extraData: i64 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !113, file: !7, size: 8, align: 8, elements: !120, templateParams: !123, identifier: "d91e207f895b5ed21304fa16506e0f28")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !119, file: !7, baseType: !122, align: 8, offset: 8)
!122 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!123 = !{!124, !125}
!124 = !DITemplateTypeParameter(name: "T", type: !122)
!125 = !DITemplateTypeParameter(name: "E", type: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !9, file: !7, align: 8, elements: !50, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !116, file: !7, baseType: !128, size: 8, align: 8, extraData: i64 1)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !113, file: !7, size: 8, align: 8, elements: !129, templateParams: !123, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !128, file: !7, baseType: !126, align: 8, offset: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !7, baseType: !11, size: 8, align: 8, flags: DIFlagArtificial)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !9, file: !7, size: 512, align: 64, elements: !134, templateParams: !50, identifier: "bc7f0caae71140a04b17743f5a695b51")
!134 = !{!135, !136, !137, !138, !152, !153}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !7, baseType: !73, size: 32, align: 32, offset: 416)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !133, file: !7, baseType: !70, size: 32, align: 32, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !133, file: !7, baseType: !6, size: 8, align: 8, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !133, file: !7, baseType: !139, size: 128, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !54, file: !7, size: 128, align: 64, elements: !140, templateParams: !50, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!140 = !{!141}
!141 = !DICompositeType(tag: DW_TAG_variant_part, scope: !139, file: !7, size: 128, align: 64, elements: !142, templateParams: !50, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !151)
!142 = !{!143, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !141, file: !7, baseType: !144, size: 128, align: 64, extraData: i64 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !139, file: !7, size: 128, align: 64, elements: !50, templateParams: !145, identifier: "728f4cb196695ca2ab2ce43263435122")
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "T", type: !49)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !141, file: !7, baseType: !148, size: 128, align: 64, extraData: i64 1)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !139, file: !7, size: 128, align: 64, elements: !149, templateParams: !145, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !148, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, scope: !139, file: !7, baseType: !90, size: 64, align: 64, flags: DIFlagArtificial)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !133, file: !7, baseType: !139, size: 128, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !133, file: !7, baseType: !154, size: 128, align: 64, offset: 256)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !7, size: 128, align: 64, elements: !155, templateParams: !50, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!155 = !{!156, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !154, file: !7, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !7, align: 8, elements: !50, identifier: "a80c365aa420df7c35abe384a2fa122f")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !154, file: !7, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, align: 64, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3, lowerBound: 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !99, file: !7, baseType: !49, size: 64, align: 64, offset: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!37, !40}
!167 = !{!168}
!168 = !DILocalVariable(name: "pieces", arg: 1, scope: !35, file: !36, line: 297, type: !40)
!169 = !DILocation(line: 297, column: 28, scope: !35)
!170 = !DILocation(line: 298, column: 12, scope: !35)
!171 = !DILocation(line: 301, column: 34, scope: !35)
!172 = !DILocation(line: 301, column: 9, scope: !35)
!173 = !{i64 8}
!174 = !DILocation(line: 302, column: 6, scope: !35)
!175 = !DILocation(line: 299, column: 13, scope: !35)
!176 = distinct !DISubprogram(name: "atomic_store<u8>", linkageName: "_ZN4core4sync6atomic12atomic_store17hc32cd5c31aaa23f5E", scope: !18, file: !177, line: 3134, type: !178, scopeLine: 3134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !185, retainedNodes: !181)
!177 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "f10535d78bf61205f540f8fe0965908b")
!178 = !DISubroutineType(types: !179)
!179 = !{null, !180, !11, !17}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !{!182, !183, !184}
!182 = !DILocalVariable(name: "dst", arg: 1, scope: !176, file: !177, line: 3134, type: !180)
!183 = !DILocalVariable(name: "val", arg: 2, scope: !176, file: !177, line: 3134, type: !11)
!184 = !DILocalVariable(name: "order", arg: 3, scope: !176, file: !177, line: 3134, type: !17)
!185 = !{!186}
!186 = !DITemplateTypeParameter(name: "T", type: !11)
!187 = !DILocation(line: 3134, column: 33, scope: !176)
!188 = !DILocation(line: 3134, column: 46, scope: !176)
!189 = !DILocation(line: 3134, column: 54, scope: !176)
!190 = !DILocation(line: 3137, column: 15, scope: !176)
!191 = !{i8 0, i8 5}
!192 = !DILocation(line: 3137, column: 9, scope: !176)
!193 = !DILocation(line: 3138, column: 24, scope: !176)
!194 = !DILocation(line: 3139, column: 24, scope: !176)
!195 = !DILocation(line: 3141, column: 24, scope: !176)
!196 = !DILocation(line: 3142, column: 23, scope: !176)
!197 = !DILocation(line: 3140, column: 23, scope: !176)
!198 = !DILocation(line: 3145, column: 2, scope: !176)
!199 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic8AtomicU85store17ha48c0b60646c00d8E", scope: !200, file: !177, line: 2283, type: !207, scopeLine: 2283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, templateParams: !50, retainedNodes: !210)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU8", scope: !18, file: !7, size: 8, align: 8, elements: !201, templateParams: !50, identifier: "e0f06ad41d89f7fdd06477f9594a8328")
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !200, file: !7, baseType: !203, size: 8, align: 8)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !204, file: !7, size: 8, align: 8, elements: !205, templateParams: !185, identifier: "941eba023f5e0fd5b22a454bf3b2360d")
!204 = !DINamespace(name: "cell", scope: !10)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !7, baseType: !11, size: 8, align: 8)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209, !11, !17}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicU8", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !{!211, !212, !213}
!211 = !DILocalVariable(name: "self", arg: 1, scope: !199, file: !177, line: 2283, type: !209)
!212 = !DILocalVariable(name: "val", arg: 2, scope: !199, file: !177, line: 2283, type: !11)
!213 = !DILocalVariable(name: "order", arg: 3, scope: !199, file: !177, line: 2283, type: !17)
!214 = !DILocation(line: 2283, column: 26, scope: !199)
