; ModuleID = 'x86_64.a83750df-cgu.0'
source_filename = "x86_64.a83750df-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !19, identifier: "3fc755e08424ec488b9875bbb795e7f1")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::VirtAddr", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !14, file: !2, size: 64, align: 64, elements: !16, templateParams: !19, identifier: "1a30bea9ca14bb876bebbdbdff5ed468")
!14 = !DINamespace(name: "addr", scope: !15)
!15 = !DINamespace(name: "x86_64", scope: null)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !13, file: !2, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!19 = !{}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !22, isLocal: true, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !23, vtableHolder: !28, templateParams: !19, identifier: "70647e3b853d5fbc78a98226bf104528")
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !22, file: !2, baseType: !6, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !22, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !22, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !32, vtableHolder: !37, templateParams: !19, identifier: "64439bc0cedd7fca9296a2319e9cc6d0")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !31, file: !2, baseType: !6, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !31, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !31, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableEntry", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableEntry", scope: !39, file: !2, size: 64, align: 64, elements: !42, templateParams: !19, identifier: "a8489d2779d8c4cbebd16c6dadbe908")
!39 = !DINamespace(name: "page_table", scope: !40)
!40 = !DINamespace(name: "paging", scope: !41)
!41 = !DINamespace(name: "structures", scope: !15)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !38, file: !2, baseType: !18, size: 64, align: 64)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !52, templateParams: !19, identifier: "3b4ba73450ee95e217cb04436c8da180")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !54, file: !2, size: 128, align: 32, elements: !55, templateParams: !86, identifier: "afccbb51fda441bdac86ad3537a0fde8")
!54 = !DINamespace(name: "idt", scope: !41)
!55 = !{!56, !58, !59, !63, !64, !66, !67}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !53, file: !2, baseType: !57, size: 16, align: 16)
!57 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !53, file: !2, baseType: !57, size: 16, align: 16, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !53, file: !2, baseType: !60, size: 16, align: 16, offset: 32)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !54, file: !2, size: 16, align: 16, elements: !61, templateParams: !19, identifier: "858c6acbebdbffbabd2fc900932269e4")
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !2, baseType: !57, size: 16, align: 16)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !53, file: !2, baseType: !57, size: 16, align: 16, offset: 48)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !53, file: !2, baseType: !65, size: 32, align: 32, offset: 64)
!65 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !53, file: !2, baseType: !65, size: 32, align: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !53, file: !2, baseType: !68, align: 8, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !71, identifier: "6325bc5faa7868b9d9e875ff4654bf0")
!69 = !DINamespace(name: "marker", scope: !70)
!70 = !DINamespace(name: "core", scope: null)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "T", type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !54, file: !2, size: 320, align: 64, elements: !77, templateParams: !19, identifier: "5c4b1691fe7b273c10a996debae1ef87")
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !2, baseType: !79, size: 320, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !54, file: !2, size: 320, align: 64, elements: !80, templateParams: !19, identifier: "cb821aa33c4d041a7de57ee0453fcfcd")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !79, file: !2, baseType: !13, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !79, file: !2, baseType: !18, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !79, file: !2, baseType: !18, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !79, file: !2, baseType: !13, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !79, file: !2, baseType: !18, size: 64, align: 64, offset: 256)
!86 = !{!87}
!87 = !DITemplateTypeParameter(name: "F", type: !73)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !91, vtableHolder: !96, templateParams: !19, identifier: "af13b79b18affe0479753bdf8bdf0f9c")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !90, file: !2, baseType: !6, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !90, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddrNotValid", scope: !14, file: !2, size: 64, align: 64, elements: !97, templateParams: !19, identifier: "46595bf07e33ba931c8b0f0cf9dd7e6f")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !2, baseType: !18, size: 64, align: 64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !102, vtableHolder: !107, templateParams: !19, identifier: "633d2d47ef108da23fcea5fe13f92807")
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !101, file: !2, baseType: !6, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !101, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !108, file: !2, size: 384, align: 64, elements: !109, templateParams: !19, identifier: "e0fec765575fe1c67e1965cae9eb37c")
!108 = !DINamespace(name: "fmt", scope: !70)
!109 = !{!110, !122, !177}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !107, file: !2, baseType: !111, size: 128, align: 64, offset: 128)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !112, templateParams: !19, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!112 = !{!113, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !111, file: !2, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !116, templateParams: !19, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !115, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !107, file: !2, baseType: !123, size: 128, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !124, file: !2, size: 128, align: 64, elements: !125, templateParams: !19, identifier: "37e4e944ba32344d635147f54bf9f4df")
!124 = !DINamespace(name: "option", scope: !70)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !127, templateParams: !19, identifier: "eff75c39088f38f57b6ca1fc85a0229a", discriminator: !176)
!127 = !{!128, !172}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !123, file: !2, size: 128, align: 64, elements: !19, templateParams: !130, identifier: "caff66e7c4f3d2646e85b521ac86f85a")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !133, templateParams: !19, identifier: "2225a8a3217ca2e4230086a86939d931")
!133 = !{!134, !171}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !132, file: !2, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !137, file: !2, size: 448, align: 64, elements: !139, templateParams: !19, identifier: "bd6e29dcdd1c85099e937af3adb84f39")
!137 = !DINamespace(name: "v1", scope: !138)
!138 = !DINamespace(name: "rt", scope: !108)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !136, file: !2, baseType: !142, size: 384, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !137, file: !2, size: 384, align: 64, elements: !143, templateParams: !19, identifier: "6cc4f16dc004a368eb7a2afb2c6178c")
!143 = !{!144, !146, !153, !154, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !142, file: !2, baseType: !145, size: 32, align: 32, offset: 288)
!145 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !142, file: !2, baseType: !147, size: 8, align: 8, offset: 320)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !2, baseType: !65, size: 32, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !142, file: !2, baseType: !155, size: 128, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !137, file: !2, size: 128, align: 64, elements: !156, templateParams: !19, identifier: "32660758978696a09244873a5d6fbb61")
!156 = !{!157}
!157 = !DICompositeType(tag: DW_TAG_variant_part, scope: !155, file: !2, size: 128, align: 64, elements: !158, templateParams: !19, identifier: "28e5bb3a090c14f2cd182db549a068a6", discriminator: !169)
!158 = !{!159, !163, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !157, file: !2, baseType: !160, size: 128, align: 64, extraData: i64 0)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !155, file: !2, size: 128, align: 64, elements: !161, templateParams: !19, identifier: "341e2e1a54680fcd4e0a11a9f090ffaa")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !157, file: !2, baseType: !164, size: 128, align: 64, extraData: i64 1)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !155, file: !2, size: 128, align: 64, elements: !165, templateParams: !19, identifier: "4a82d78f7563c7ad8c72200904d871bb")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !157, file: !2, baseType: !168, size: 128, align: 64, extraData: i64 2)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !155, file: !2, size: 128, align: 64, elements: !19, identifier: "4f9ef5bac5220bb9412e1e0f55484c15")
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !142, file: !2, baseType: !155, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !173, size: 128, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !123, file: !2, size: 128, align: 64, elements: !174, templateParams: !130, identifier: "f64c0c4a3e31ce946976d4995d49649a")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !173, file: !2, baseType: !132, size: 128, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !107, file: !2, baseType: !178, size: 128, align: 64, offset: 256)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !179, templateParams: !19, identifier: "5e6975564bb19db54eba15ca2ba01c7")
!179 = !{!180, !242}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !2, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !108, file: !2, size: 128, align: 64, elements: !183, templateParams: !19, identifier: "ea6cf7b811e43b9e7b4d363768d4d9d6")
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !2, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !187, file: !2, align: 8, elements: !19, identifier: "309a12208c9a77154ceb9b2c501d7d92")
!187 = !DINamespace(name: "{extern#0}", scope: !108)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !182, file: !2, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !185, !210}
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !193, file: !2, size: 8, align: 8, elements: !194, templateParams: !19, identifier: "ab4fdd4ae7b9c0609a3e563b345100af")
!193 = !DINamespace(name: "result", scope: !70)
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !192, file: !2, size: 8, align: 8, elements: !196, templateParams: !19, identifier: "b1509727e34e792adf97c998c8b09839", discriminator: !209)
!196 = !{!197, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !2, baseType: !198, size: 8, align: 8, extraData: i64 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !192, file: !2, size: 8, align: 8, elements: !199, templateParams: !201, identifier: "7b72f9a6c523523a3efe2fa3bc75af66")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !2, baseType: !7, align: 8, offset: 8)
!201 = !{!202, !203}
!202 = !DITemplateTypeParameter(name: "T", type: !7)
!203 = !DITemplateTypeParameter(name: "E", type: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !108, file: !2, align: 8, elements: !19, identifier: "c2c8f2f945c37359aa57422093183824")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !2, baseType: !206, size: 8, align: 8, extraData: i64 1)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !192, file: !2, size: 8, align: 8, elements: !207, templateParams: !201, identifier: "7e7f93e4d1c31285722aa9db6f824275")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !204, align: 8, offset: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagArtificial)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !108, file: !2, size: 512, align: 64, elements: !212, templateParams: !19, identifier: "f926d77f60c5c9d319d3b7845f5fe267")
!212 = !{!213, !214, !215, !216, !230, !231}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !211, file: !2, baseType: !65, size: 32, align: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !211, file: !2, baseType: !145, size: 32, align: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !211, file: !2, baseType: !147, size: 8, align: 8, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !124, file: !2, size: 128, align: 64, elements: !218, templateParams: !19, identifier: "cb26f181a711fbe83b3afb348d7c01cb")
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_variant_part, scope: !217, file: !2, size: 128, align: 64, elements: !220, templateParams: !19, identifier: "8d3067b891c8f12a45e965020aca888f", discriminator: !229)
!220 = !{!221, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !219, file: !2, baseType: !222, size: 128, align: 64, extraData: i64 0)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !217, file: !2, size: 128, align: 64, elements: !19, templateParams: !223, identifier: "c8b9aa2632d7f877a99d298efe41260c")
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !9)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !219, file: !2, baseType: !226, size: 128, align: 64, extraData: i64 1)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !217, file: !2, size: 128, align: 64, elements: !227, templateParams: !223, identifier: "eec942390a307d7c8c2162b2092f63f3")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !226, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !217, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !211, file: !2, baseType: !232, size: 128, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !233, templateParams: !19, identifier: "21e2737f9b3dccde2bd3f02defa8704f")
!233 = !{!234, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !232, file: !2, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !19, identifier: "bb744bac75d5d19249a16512e8e296c")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !232, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 3, lowerBound: 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !246, vtableHolder: !57, templateParams: !19, identifier: "f1947af1b77a569d68f1b8c18e249c21")
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !245, file: !2, baseType: !6, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !245, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !254, vtableHolder: !259, templateParams: !19, identifier: "e0c671b7df482123da121ff66979e6d4")
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !253, file: !2, baseType: !6, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !253, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !15, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !268, vtableHolder: !60, templateParams: !19, identifier: "169a0137403cb32efc86e0bbd60f8c5e")
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !267, file: !2, baseType: !6, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !267, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !276, vtableHolder: !13, templateParams: !19, identifier: "943369746d4047076597bb8f6033f083")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !275, file: !2, baseType: !6, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !275, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !284, vtableHolder: !18, templateParams: !19, identifier: "66ff2dcbfb38c216c91c93b33c8afb87")
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !283, file: !2, baseType: !6, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !283, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !292, vtableHolder: !297, templateParams: !19, identifier: "2b311fdea234d70d2642c53b37fead96")
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !291, file: !2, baseType: !6, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !291, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hex", scope: !298, file: !2, size: 64, align: 64, elements: !300, templateParams: !19, identifier: "e0aaad1dec5dfca78b7b0d7c8c93800c")
!298 = !DINamespace(name: "fmt", scope: !299)
!299 = !DINamespace(name: "{impl#11}", scope: !54)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !18, size: 64, align: 64)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !305, vtableHolder: !310, templateParams: !19, identifier: "5f08d0f6d065326824a9f2075a246e9f")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !304, file: !2, baseType: !6, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !304, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!310 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !314, vtableHolder: !319, templateParams: !19, identifier: "d7b525046efe7886b5a5470c066203f9")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !313, file: !2, baseType: !6, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !313, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DescriptorTable", scope: !54, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIEnumerator(name: "Gdt", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "Idt", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "Ldt", value: 2, isUnsigned: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_ASSERT_OBJECT_SAFE", linkageName: "_ZN6x86_6410structures6paging6mapper19_ASSERT_OBJECT_SAFE17hfb5170f678515da5E", scope: !326, file: !327, line: 486, type: !328, isLocal: true, isDefinition: true, align: 64)
!326 = !DINamespace(name: "mapper", scope: !40)
!327 = !DIFile(filename: "src/structures/paging/mapper/mod.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10", checksumkind: CSK_MD5, checksum: "0dd5f33c2cee14124470d88449502bc1")
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)>", scope: !124, file: !2, size: 128, align: 64, elements: !329, templateParams: !19, identifier: "602ad6b9c37d10ef7cc8589a0997a2d7")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !2, size: 128, align: 64, elements: !331, templateParams: !19, identifier: "994653562af8eaaad7a5b018a7dbc0ba", discriminator: !346)
!331 = !{!332, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !330, file: !2, baseType: !333, size: 128, align: 64, extraData: i64 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !328, file: !2, size: 128, align: 64, elements: !19, templateParams: !334, identifier: "e44b2a21b95101a4f25adf6166ec0ab6")
!334 = !{!335}
!335 = !DITemplateTypeParameter(name: "T", type: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !337, templateParams: !19, identifier: "e5ecd48056ee8def9bd284871f9240")
!337 = !{!338, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !2, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, align: 8, elements: !19, identifier: "4f948b677292c344d660ba361e65ec21")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !336, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !330, file: !2, baseType: !343, size: 128, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !328, file: !2, size: 128, align: 64, elements: !344, templateParams: !334, identifier: "d4d8c69a2ee35e86caa4f40fc3c6da58")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !336, size: 128, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !350, vtableHolder: !355, templateParams: !19, identifier: "8d4ea0f191096309d4cace3214ca89c6")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !349, file: !2, baseType: !6, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !349, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysAddr", scope: !14, file: !2, size: 64, align: 64, elements: !356, templateParams: !19, identifier: "9bea1acd05360596673f82fef5efb498")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !2, baseType: !18, size: 64, align: 64)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !361, vtableHolder: !366, templateParams: !19, identifier: "103ee83541754b1310b47ef90a25c030")
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !360, file: !2, baseType: !6, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !360, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableFlags", scope: !39, file: !2, size: 64, align: 64, elements: !367, templateParams: !19, identifier: "6efbe0bc77394968fed7c631ac64ad57")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !366, file: !2, baseType: !18, size: 64, align: 64)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !372, vtableHolder: !377, templateParams: !19, identifier: "a9f38c2ed237b51291b57ada18f179ad")
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !371, file: !2, baseType: !6, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !371, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !381, vtableHolder: !386, templateParams: !19, identifier: "98bdaab75ee8d8e7cd3c1a33b5110ecb")
!381 = !{!382, !383, !384, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !380, file: !2, baseType: !6, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !380, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::instructions::tlb::Pcid", baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pcid", scope: !388, file: !2, size: 16, align: 16, elements: !390, templateParams: !19, identifier: "6c40a9a29958427547ebb41d72edbd2c")
!388 = !DINamespace(name: "tlb", scope: !389)
!389 = !DINamespace(name: "instructions", scope: !15)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !387, file: !2, baseType: !57, size: 16, align: 16)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "<&u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !395, vtableHolder: !400, templateParams: !19, identifier: "183d33f69409017d78c0878c342bc89f")
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !394, file: !2, baseType: !6, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !394, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !404, vtableHolder: !409, templateParams: !19, identifier: "76a36f92706138bc96068bd075a152f1")
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !403, file: !2, baseType: !6, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !403, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "<[u64; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[u64; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !413, vtableHolder: !418, templateParams: !19, identifier: "6d3e51ab40ad0156385561c7e2acfb91")
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !412, file: !2, baseType: !6, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !412, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, align: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 8, lowerBound: 0)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !424, vtableHolder: !429, templateParams: !19, identifier: "859d9c451b8060d4f0e9133cc45ec238")
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !423, file: !2, baseType: !6, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !423, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !433, vtableHolder: !53, templateParams: !19, identifier: "76b213caac0b96ba28a614c86984401a")
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !432, file: !2, baseType: !6, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !432, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !441, vtableHolder: !446, templateParams: !19, identifier: "83a1b87c2e235352b7522bcaaa765944")
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !440, file: !2, baseType: !6, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !440, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !54, file: !2, size: 128, align: 32, elements: !447, templateParams: !462, identifier: "4c406a743b48f90f0681e19f9c591f8")
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !446, file: !2, baseType: !57, size: 16, align: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !446, file: !2, baseType: !57, size: 16, align: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !446, file: !2, baseType: !60, size: 16, align: 16, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !446, file: !2, baseType: !57, size: 16, align: 16, offset: 48)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !446, file: !2, baseType: !65, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !446, file: !2, baseType: !65, size: 32, align: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !446, file: !2, baseType: !455, align: 8, offset: 128)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !456, identifier: "a2f27e4e4632d0fd84afd097de76aa76")
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !76, !18}
!461 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "F", type: !458)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !467, vtableHolder: !472, templateParams: !19, identifier: "cd4e8c10eb601f35322fb4fb710b8775")
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !466, file: !2, baseType: !6, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !466, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !54, file: !2, size: 128, align: 32, elements: !473, templateParams: !487, identifier: "a973badfde6ea7f7cebd5f68371ce6cf")
!473 = !{!474, !475, !476, !477, !478, !479, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !472, file: !2, baseType: !57, size: 16, align: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !472, file: !2, baseType: !57, size: 16, align: 16, offset: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !472, file: !2, baseType: !60, size: 16, align: 16, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !472, file: !2, baseType: !57, size: 16, align: 16, offset: 48)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !472, file: !2, baseType: !65, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !472, file: !2, baseType: !65, size: 32, align: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !472, file: !2, baseType: !481, align: 8, offset: 128)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !482, identifier: "180cc743fe9dbfa81a031aca005d251d")
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "T", type: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !76, !18}
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "F", type: !484)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !492, vtableHolder: !497, templateParams: !19, identifier: "9b115ba190558a588649c3b76088f986")
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !491, file: !2, baseType: !6, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !491, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !54, file: !2, size: 128, align: 32, elements: !498, templateParams: !515, identifier: "2c267f8134fa2b6521815b23f4a5c6c6")
!498 = !{!499, !500, !501, !502, !503, !504, !505}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !497, file: !2, baseType: !57, size: 16, align: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !497, file: !2, baseType: !57, size: 16, align: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !497, file: !2, baseType: !60, size: 16, align: 16, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !497, file: !2, baseType: !57, size: 16, align: 16, offset: 48)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !497, file: !2, baseType: !65, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !497, file: !2, baseType: !65, size: 32, align: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !497, file: !2, baseType: !506, align: 8, offset: 128)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !507, identifier: "f98ad49cc96612b2cc8ba6fa450a6a53")
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !76, !512}
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !54, file: !2, size: 64, align: 64, elements: !513, templateParams: !19, identifier: "447cbacb19fbc9ce2b503196d042877d")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !512, file: !2, baseType: !18, size: 64, align: 64)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "F", type: !509)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !520, vtableHolder: !525, templateParams: !19, identifier: "4d6a0b3e5a9793cafa05e3555cfa9133")
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !519, file: !2, baseType: !6, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !519, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !54, file: !2, size: 128, align: 32, elements: !526, templateParams: !540, identifier: "741b33299b66698dee340039aaf81ce5")
!526 = !{!527, !528, !529, !530, !531, !532, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !525, file: !2, baseType: !57, size: 16, align: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !525, file: !2, baseType: !57, size: 16, align: 16, offset: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !525, file: !2, baseType: !60, size: 16, align: 16, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !525, file: !2, baseType: !57, size: 16, align: 16, offset: 48)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !525, file: !2, baseType: !65, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !525, file: !2, baseType: !65, size: 32, align: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !525, file: !2, baseType: !534, align: 8, offset: 128)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !535, identifier: "2f61539d499cd260f1aa91cdd8e0b86c")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !538, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!461, !76}
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "F", type: !537)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !545, vtableHolder: !550, templateParams: !19, identifier: "822d4641790a90e939a375c270a9d8e7")
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !544, file: !2, baseType: !6, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !544, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1024, align: 32, elements: !419)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !554, vtableHolder: !559, templateParams: !19, identifier: "f01bea6938b57b248c3be8712f6547ba")
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !553, file: !2, baseType: !6, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224]", baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 28672, align: 32, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 224, lowerBound: 0)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !566, vtableHolder: !571, templateParams: !19, identifier: "965568fdcd8951d3ff7f8b6412cef767")
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !565, file: !2, baseType: !6, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !565, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 64, align: 64, elements: !573, templateParams: !579, identifier: "587e918da625136687674bc2bf748b63")
!572 = !DINamespace(name: "mapped_page_table", scope: !326)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_frame_mapping", scope: !571, file: !2, baseType: !575, size: 64, align: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysOffset", scope: !576, file: !2, size: 64, align: 64, elements: !577, templateParams: !19, identifier: "109e57cc66ad729d33236b685730fc4b")
!576 = !DINamespace(name: "offset_page_table", scope: !326)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !575, file: !2, baseType: !13, size: 64, align: 64)
!579 = !{!580}
!580 = !DITemplateTypeParameter(name: "P", type: !575)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !584, vtableHolder: !589, templateParams: !19, identifier: "2e9c1d0bd7ecb56dd09e63d1b41752ae")
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !583, file: !2, baseType: !6, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !583, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut x86_64::structures::paging::page_table::PageTable", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::paging::page_table::PageTable", baseType: !591, size: 64, align: 64, dwarfAddressSpace: 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTable", scope: !39, file: !2, size: 32768, align: 32768, elements: !592, templateParams: !19, identifier: "b8c9a9b405ed72bf33b00962b5ccc142")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !591, file: !2, baseType: !594, size: 32768, align: 64)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32768, align: 64, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 512, lowerBound: 0)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !600, vtableHolder: !605, templateParams: !19, identifier: "d33d9b5051f5c8d1753dc851f180c870")
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !599, file: !2, baseType: !6, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !599, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::offset_page_table::PhysOffset", baseType: !575, size: 64, align: 64, dwarfAddressSpace: 0)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !609, vtableHolder: !614, templateParams: !19, identifier: "14c0b24d97c20d39bb05ae87652a16c8")
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !608, file: !2, baseType: !6, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !608, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 128, align: 64, elements: !616, templateParams: !579, identifier: "4dceb2517ecc1fd04ed106275953c8d9")
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_walker", scope: !615, file: !2, baseType: !571, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "level_4_table", scope: !615, file: !2, baseType: !590, size: 64, align: 64, offset: 64)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !622, vtableHolder: !590, templateParams: !19, identifier: "56bf6b2c19a0c596455e0f4333ce6112")
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !621, file: !2, baseType: !6, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !621, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !630, vtableHolder: !635, templateParams: !19, identifier: "311b733a929c4217585037e7cd674a68")
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !629, file: !2, baseType: !6, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !629, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableIndex", baseType: !636, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableIndex", scope: !39, file: !2, size: 16, align: 16, elements: !637, templateParams: !19, identifier: "1173f68c399da7cca5ca9d9680b92b75")
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !57, size: 16, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !642, vtableHolder: !647, templateParams: !19, identifier: "5febba4f9c3a3cb917c0100dec2599e7")
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !641, file: !2, baseType: !6, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !641, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::PhysAddr", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !651, vtableHolder: !656, templateParams: !19, identifier: "df310c62b31c62a2f4114888695f9fce")
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !650, file: !2, baseType: !6, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !650, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedFrame", scope: !326, file: !2, size: 128, align: 64, elements: !657, templateParams: !19, identifier: "20500189be2662d4251fffc07402b85a")
!657 = !{!658}
!658 = !DICompositeType(tag: DW_TAG_variant_part, scope: !656, file: !2, size: 128, align: 64, elements: !659, templateParams: !19, identifier: "2a9816ba290a8ca2fff12aac73a32da2", discriminator: !710)
!659 = !{!660, !678, !694}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Size4KiB", scope: !658, file: !2, baseType: !661, size: 128, align: 64, extraData: i64 0)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !656, file: !2, size: 128, align: 64, elements: !662, templateParams: !19, identifier: "d9060c4b098f4a9d692e9d4238d69e6")
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !661, file: !2, baseType: !664, size: 64, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size4KiB>", scope: !665, file: !2, size: 64, align: 64, elements: !666, templateParams: !676, identifier: "d9d61fabb56efdd74955a9b633e4f77")
!665 = !DINamespace(name: "frame", scope: !40)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !664, file: !2, baseType: !355, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !2, baseType: !669, align: 8, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size4KiB>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !670, identifier: "b09ed845f47b459cb61550e762e5c4f")
!670 = !{!671}
!671 = !DITemplateTypeParameter(name: "T", type: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !673, file: !2, align: 8, elements: !674, templateParams: !19, identifier: "1a8673a546977275ce5ce485c2f2fcf9")
!673 = !DINamespace(name: "page", scope: !40)
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_variant_part, scope: !672, file: !2, align: 8, elements: !19, identifier: "923f3a90f4126fb7b23cd18b699bfa84")
!676 = !{!677}
!677 = !DITemplateTypeParameter(name: "S", type: !672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Size2MiB", scope: !658, file: !2, baseType: !679, size: 128, align: 64, extraData: i64 1)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !656, file: !2, size: 128, align: 64, elements: !680, templateParams: !19, identifier: "382974405ad971de224e78549a305fa9")
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !682, size: 64, align: 64, offset: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size2MiB>", scope: !665, file: !2, size: 64, align: 64, elements: !683, templateParams: !692, identifier: "9bc22491e7c9b5358c4172f6a321a649")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !682, file: !2, baseType: !355, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !682, file: !2, baseType: !686, align: 8, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size2MiB>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !687, identifier: "c8b818e67ce5e80de659967dad4567f4")
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !673, file: !2, align: 8, elements: !690, templateParams: !19, identifier: "11d190685ac1b630c0b0208c222f632")
!690 = !{!691}
!691 = !DICompositeType(tag: DW_TAG_variant_part, scope: !689, file: !2, align: 8, elements: !19, identifier: "cd7ec1ddb55ea5cc80ed859b3138c2a8")
!692 = !{!693}
!693 = !DITemplateTypeParameter(name: "S", type: !689)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Size1GiB", scope: !658, file: !2, baseType: !695, size: 128, align: 64, extraData: i64 2)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !656, file: !2, size: 128, align: 64, elements: !696, templateParams: !19, identifier: "c389eae388e5b03ec735169286f82806")
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !695, file: !2, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size1GiB>", scope: !665, file: !2, size: 64, align: 64, elements: !699, templateParams: !708, identifier: "b2a6bcc1613ce0008766d63f877a41fd")
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !698, file: !2, baseType: !355, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !2, baseType: !702, align: 8, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size1GiB>", scope: !69, file: !2, align: 8, elements: !19, templateParams: !703, identifier: "96d32caee793efb9ba773fa34b9c4fc7")
!703 = !{!704}
!704 = !DITemplateTypeParameter(name: "T", type: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !673, file: !2, align: 8, elements: !706, templateParams: !19, identifier: "c54f936e56cef61acbf20f448f1d132b")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_variant_part, scope: !705, file: !2, align: 8, elements: !19, identifier: "496636fa6c70bd99808b87cdca40a4e4")
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "S", type: !705)
!710 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !714, vtableHolder: !719, templateParams: !19, identifier: "dfc3ff629b045a72564ae9462b4b783")
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !713, file: !2, baseType: !6, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableFlags", baseType: !366, size: 64, align: 64, dwarfAddressSpace: 0)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !723, vtableHolder: !728, templateParams: !19, identifier: "e47916b5960631e1ed7791f3af2fa1e0")
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !722, file: !2, baseType: !6, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !722, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !732, vtableHolder: !737, templateParams: !19, identifier: "faf5a4b95045e51cc1dc24c5910a2f92")
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !731, file: !2, baseType: !6, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !731, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>", baseType: !682, size: 64, align: 64, dwarfAddressSpace: 0)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !741, vtableHolder: !746, templateParams: !19, identifier: "54ad686e758866fced2ebc31286ade2")
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !740, file: !2, baseType: !6, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>", baseType: !664, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !750, vtableHolder: !65, templateParams: !19, identifier: "1fe14ef0b638e6ac439cbcdfc6c4b85a")
!750 = !{!751, !752, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !749, file: !2, baseType: !6, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !749, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !758, vtableHolder: !763, templateParams: !19, identifier: "5ccc59ab4c166812875970e7f2a463cd")
!758 = !{!759, !760, !761, !762}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !757, file: !2, baseType: !6, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !757, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, align: 64, elements: !240)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !767, vtableHolder: !772, templateParams: !19, identifier: "1d7b7ee70e50ab4be8ed960b4de6f2c5")
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !766, file: !2, baseType: !6, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !766, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 448, align: 64, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 7, lowerBound: 0)
!775 = !{i32 7, !"PIC Level", i32 2}
!776 = !{i32 2, !"Dwarf Version", i32 4}
!777 = !{i32 2, !"Debug Info Version", i32 3}
!778 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !779, producer: "clang LLVM (rustc version 1.70.0-nightly (900c35403 2023-03-08))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, globals: !853, splitDebugInlining: false)
!779 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/lib.rs/@/x86_64.a83750df-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10")
!780 = !{!147, !259, !319, !781, !789, !795, !799, !805, !809, !814, !820, !845, !849}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointCondition", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !784)
!782 = !DINamespace(name: "debug", scope: !783)
!783 = !DINamespace(name: "registers", scope: !15)
!784 = !{!785, !786, !787, !788}
!785 = !DIEnumerator(name: "InstructionExecution", value: 0, isUnsigned: true)
!786 = !DIEnumerator(name: "DataWrites", value: 1, isUnsigned: true)
!787 = !DIEnumerator(name: "IoReadsWrites", value: 2, isUnsigned: true)
!788 = !DIEnumerator(name: "DataReadsWrites", value: 3, isUnsigned: true)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointSize", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIEnumerator(name: "Length1B", value: 0, isUnsigned: true)
!792 = !DIEnumerator(name: "Length2B", value: 1, isUnsigned: true)
!793 = !DIEnumerator(name: "Length8B", value: 2, isUnsigned: true)
!794 = !DIEnumerator(name: "Length4B", value: 3, isUnsigned: true)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameError", scope: !39, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !796)
!796 = !{!797, !798}
!797 = !DIEnumerator(name: "FrameNotPresent", value: 0, isUnsigned: true)
!798 = !DIEnumerator(name: "HugeFrame", value: 1, isUnsigned: true)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAddressRegisterNumber", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIEnumerator(name: "Dr0", value: 0, isUnsigned: true)
!802 = !DIEnumerator(name: "Dr1", value: 1, isUnsigned: true)
!803 = !DIEnumerator(name: "Dr2", value: 2, isUnsigned: true)
!804 = !DIEnumerator(name: "Dr3", value: 3, isUnsigned: true)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlagUpdateError", scope: !326, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !806)
!806 = !{!807, !808}
!807 = !DIEnumerator(name: "PageNotMapped", value: 0, isUnsigned: true)
!808 = !DIEnumerator(name: "ParentEntryHugePage", value: 1, isUnsigned: true)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InvalidPageTable", scope: !810, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !811)
!810 = !DINamespace(name: "recursive_page_table", scope: !326)
!811 = !{!812, !813}
!812 = !DIEnumerator(name: "NotRecursive", value: 0, isUnsigned: true)
!813 = !DIEnumerator(name: "NotActive", value: 1, isUnsigned: true)
