; ModuleID = 'x86_64.154f1444927f86fa-cgu.0'
source_filename = "x86_64.154f1444927f86fa-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !19, identifier: "bad5f78cbfc0a134df12ccf9410afc58")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::VirtAddr", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !14, file: !2, size: 64, align: 64, elements: !16, templateParams: !19, identifier: "239117bd6487b76a366cccdd564e5727")
!14 = !DINamespace(name: "addr", scope: !15)
!15 = !DINamespace(name: "x86_64", scope: null)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !13, file: !2, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!19 = !{}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !22, isLocal: true, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !23, vtableHolder: !28, templateParams: !19, identifier: "3cf80bf3f05e83e79c482de05b82f69a")
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !22, file: !2, baseType: !6, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !22, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !22, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !30, file: !2, size: 128, align: 32, elements: !32, templateParams: !63, identifier: "70a931648e60bf3ef3c563f9d9f17148")
!30 = !DINamespace(name: "idt", scope: !31)
!31 = !DINamespace(name: "structures", scope: !15)
!32 = !{!33, !35, !36, !40, !41, !43, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !29, file: !2, baseType: !34, size: 16, align: 16)
!34 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !29, file: !2, baseType: !34, size: 16, align: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !29, file: !2, baseType: !37, size: 16, align: 16, offset: 32)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !30, file: !2, size: 16, align: 16, elements: !38, templateParams: !19, identifier: "f08f0d89c88887a250d1d1a8b88a591")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !34, size: 16, align: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !29, file: !2, baseType: !34, size: 16, align: 16, offset: 48)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !29, file: !2, baseType: !42, size: 32, align: 32, offset: 64)
!42 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !29, file: !2, baseType: !42, size: 32, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !29, file: !2, baseType: !45, align: 8, offset: 128)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !48, identifier: "478274c50e622797dab82b651135faa8")
!46 = !DINamespace(name: "marker", scope: !47)
!47 = !DINamespace(name: "core", scope: null)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "T", type: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53}
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !30, file: !2, size: 320, align: 64, elements: !54, templateParams: !19, identifier: "d9a876ab5f9bf679c1acbdf8c0e90304")
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !53, file: !2, baseType: !56, size: 320, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !30, file: !2, size: 320, align: 64, elements: !57, templateParams: !19, identifier: "b395fc8a40cf495f85001eb594e0064a")
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !56, file: !2, baseType: !13, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !56, file: !2, baseType: !18, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !56, file: !2, baseType: !18, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !56, file: !2, baseType: !13, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !56, file: !2, baseType: !18, size: 64, align: 64, offset: 256)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "F", type: !50)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !68, vtableHolder: !73, templateParams: !19, identifier: "1b08b7a4e7385b895c167827c053e0d5")
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !67, file: !2, baseType: !6, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !67, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !67, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !67, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !77, vtableHolder: !82, templateParams: !19, identifier: "d0a81cb29ad72e11e8a12466ad9557b8")
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !76, file: !2, baseType: !6, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !76, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableEntry", baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableEntry", scope: !84, file: !2, size: 64, align: 64, elements: !86, templateParams: !19, identifier: "34338a3d0ef8da705b45824ce95e61fd")
!84 = !DINamespace(name: "page_table", scope: !85)
!85 = !DINamespace(name: "paging", scope: !31)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !83, file: !2, baseType: !18, size: 64, align: 64)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !91, vtableHolder: !96, templateParams: !19, identifier: "6dca3741075b06363ee00b19d2b2f8f5")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !90, file: !2, baseType: !6, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !90, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddrNotValid", scope: !14, file: !2, size: 64, align: 64, elements: !97, templateParams: !19, identifier: "9d0dc1ade4fda5f71e3472baef49ae79")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !2, baseType: !18, size: 64, align: 64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !102, vtableHolder: !107, templateParams: !19, identifier: "81153a0f9bf217145dbdf23eed97303")
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !101, file: !2, baseType: !6, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !101, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !108, file: !2, size: 384, align: 64, elements: !109, templateParams: !19, identifier: "1c46a498dd7b956f4c3a670fdfba5262")
!108 = !DINamespace(name: "fmt", scope: !47)
!109 = !{!110, !122, !177}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !107, file: !2, baseType: !111, size: 128, align: 64, offset: 128)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !112, templateParams: !19, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!112 = !{!113, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !111, file: !2, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !116, templateParams: !19, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !115, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !107, file: !2, baseType: !123, size: 128, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !124, file: !2, size: 128, align: 64, elements: !125, templateParams: !19, identifier: "d25d924bb8d51dd413c49dbfa1f11f1")
!124 = !DINamespace(name: "option", scope: !47)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !127, templateParams: !19, identifier: "759788f84997b99f6bc91fe0c57058ba", discriminator: !176)
!127 = !{!128, !172}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !123, file: !2, size: 128, align: 64, elements: !19, templateParams: !130, identifier: "82efcd94523cf9c0b17ac37e82724639")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !133, templateParams: !19, identifier: "de3ba5e1dd56fab311eb54a28d6cb95f")
!133 = !{!134, !171}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !132, file: !2, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !137, file: !2, size: 448, align: 64, elements: !139, templateParams: !19, identifier: "9bee5132fe724679d94d9aaa78899300")
!137 = !DINamespace(name: "v1", scope: !138)
!138 = !DINamespace(name: "rt", scope: !108)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !136, file: !2, baseType: !142, size: 384, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !137, file: !2, size: 384, align: 64, elements: !143, templateParams: !19, identifier: "65fce75b527475dfcd89c81174c5b112")
!143 = !{!144, !146, !153, !154, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !142, file: !2, baseType: !145, size: 32, align: 32, offset: 288)
!145 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !142, file: !2, baseType: !147, size: 8, align: 8, offset: 320)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !2, baseType: !42, size: 32, align: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !142, file: !2, baseType: !155, size: 128, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !137, file: !2, size: 128, align: 64, elements: !156, templateParams: !19, identifier: "eb274483ac6a1a818973f8ef56806ce6")
!156 = !{!157}
!157 = !DICompositeType(tag: DW_TAG_variant_part, scope: !155, file: !2, size: 128, align: 64, elements: !158, templateParams: !19, identifier: "1383065eb0a1d3eb5559cfa60c22a70d", discriminator: !169)
!158 = !{!159, !163, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !157, file: !2, baseType: !160, size: 128, align: 64, extraData: i64 0)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !155, file: !2, size: 128, align: 64, elements: !161, templateParams: !19, identifier: "284bf6fbe777a447ca6ded9ea5417274")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !157, file: !2, baseType: !164, size: 128, align: 64, extraData: i64 1)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !155, file: !2, size: 128, align: 64, elements: !165, templateParams: !19, identifier: "47998f14b9dfef6b1e659ae3b3c1ad7f")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !157, file: !2, baseType: !168, size: 128, align: 64, extraData: i64 2)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !155, file: !2, size: 128, align: 64, elements: !19, identifier: "a9ac2edd79b7a2c052d84739de651359")
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !142, file: !2, baseType: !155, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !173, size: 128, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !123, file: !2, size: 128, align: 64, elements: !174, templateParams: !130, identifier: "ecb4a60835a68b86ac55d46be42b6cd5")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !173, file: !2, baseType: !132, size: 128, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !107, file: !2, baseType: !178, size: 128, align: 64, offset: 256)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !179, templateParams: !19, identifier: "1ef2a88983c14e17bd3824c1adc5cb")
!179 = !{!180, !242}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !2, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !108, file: !2, size: 128, align: 64, elements: !183, templateParams: !19, identifier: "4e3593181d4a3fd7c7588e4c93e285e5")
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !2, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !187, file: !2, align: 8, elements: !19, identifier: "9d957b9cbc95a5d52c57994d133a21d2")
!187 = !DINamespace(name: "{extern#0}", scope: !108)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !182, file: !2, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !185, !210}
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !193, file: !2, size: 8, align: 8, elements: !194, templateParams: !19, identifier: "b7fb26f737e54d12fa01aa3853cdbeae")
!193 = !DINamespace(name: "result", scope: !47)
!194 = !{!195}
!195 = !DICompositeType(tag: DW_TAG_variant_part, scope: !192, file: !2, size: 8, align: 8, elements: !196, templateParams: !19, identifier: "a92bdd2eb05472a8bda434c249c29302", discriminator: !209)
!196 = !{!197, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !195, file: !2, baseType: !198, size: 8, align: 8, extraData: i64 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !192, file: !2, size: 8, align: 8, elements: !199, templateParams: !201, identifier: "bb2249fac7fb973c2c787a4c375e7dc3")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !198, file: !2, baseType: !7, align: 8, offset: 8)
!201 = !{!202, !203}
!202 = !DITemplateTypeParameter(name: "T", type: !7)
!203 = !DITemplateTypeParameter(name: "E", type: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !108, file: !2, align: 8, elements: !19, identifier: "db1174efc0a2f975f4813d5134979630")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !195, file: !2, baseType: !206, size: 8, align: 8, extraData: i64 1)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !192, file: !2, size: 8, align: 8, elements: !207, templateParams: !201, identifier: "eb015aef3c84d8cf3918a665d11906a1")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !204, align: 8, offset: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagArtificial)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !108, file: !2, size: 512, align: 64, elements: !212, templateParams: !19, identifier: "4518b2a8833c3639e2a18f19d8d2d035")
!212 = !{!213, !214, !215, !216, !230, !231}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !211, file: !2, baseType: !42, size: 32, align: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !211, file: !2, baseType: !145, size: 32, align: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !211, file: !2, baseType: !147, size: 8, align: 8, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 128)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !124, file: !2, size: 128, align: 64, elements: !218, templateParams: !19, identifier: "e509e62aca398ad985d4d7108c999fce")
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_variant_part, scope: !217, file: !2, size: 128, align: 64, elements: !220, templateParams: !19, identifier: "b800028c0f41e5f65055b3206ca16e40", discriminator: !229)
!220 = !{!221, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !219, file: !2, baseType: !222, size: 128, align: 64, extraData: i64 0)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !217, file: !2, size: 128, align: 64, elements: !19, templateParams: !223, identifier: "c64b01d4e9024c6089607fba201241ac")
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !9)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !219, file: !2, baseType: !226, size: 128, align: 64, extraData: i64 1)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !217, file: !2, size: 128, align: 64, elements: !227, templateParams: !223, identifier: "d909f9aede69ded5e6a3f34da3cb5ef3")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !226, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !217, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !211, file: !2, baseType: !217, size: 128, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !211, file: !2, baseType: !232, size: 128, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !233, templateParams: !19, identifier: "f9270966a9fda351195f72d6edc0f59a")
!233 = !{!234, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !232, file: !2, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !19, identifier: "26797fbb1ceb902d1b523adeae52178")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !232, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 3, lowerBound: 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !246, vtableHolder: !34, templateParams: !19, identifier: "3914ec840925ffb88d79f3c7d20c2078")
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !245, file: !2, baseType: !6, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !245, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !245, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !254, vtableHolder: !259, templateParams: !19, identifier: "a7e80060bf927b29b5c1c7e31e0bd75b")
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !253, file: !2, baseType: !6, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !253, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !15, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !268, vtableHolder: !37, templateParams: !19, identifier: "9e049d21d1292dd6a28e1cc5f7357fcc")
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !267, file: !2, baseType: !6, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !267, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !276, vtableHolder: !13, templateParams: !19, identifier: "3f9902d8a7860f966260004d8acef77c")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !275, file: !2, baseType: !6, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !275, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !284, vtableHolder: !18, templateParams: !19, identifier: "c754d1de9801452d1e4a757ed9fefd9")
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !283, file: !2, baseType: !6, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !283, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !292, vtableHolder: !297, templateParams: !19, identifier: "49cfb9c55ab8bb2ca49f4b8961debcdd")
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !291, file: !2, baseType: !6, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !291, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hex", scope: !298, file: !2, size: 64, align: 64, elements: !300, templateParams: !19, identifier: "6777718c51ad2ef1dee2eda482ed144e")
!298 = !DINamespace(name: "fmt", scope: !299)
!299 = !DINamespace(name: "{impl#11}", scope: !30)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !2, baseType: !18, size: 64, align: 64)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !305, vtableHolder: !310, templateParams: !19, identifier: "54d2a8d44f5c82ae1dec8428b06d8176")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !304, file: !2, baseType: !6, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !304, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!310 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !314, vtableHolder: !319, templateParams: !19, identifier: "5a7ae56bda139665fd0fd34842301b52")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !313, file: !2, baseType: !6, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !313, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DescriptorTable", scope: !30, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIEnumerator(name: "Gdt", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "Idt", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "Ldt", value: 2, isUnsigned: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_ASSERT_OBJECT_SAFE", linkageName: "_ZN6x86_6410structures6paging6mapper19_ASSERT_OBJECT_SAFE17hc1f9d6666d0b3c60E", scope: !326, file: !327, line: 486, type: !328, isLocal: true, isDefinition: true, align: 64)
!326 = !DINamespace(name: "mapper", scope: !85)
!327 = !DIFile(filename: "src/structures/paging/mapper/mod.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10", checksumkind: CSK_MD5, checksum: "0dd5f33c2cee14124470d88449502bc1")
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)>", scope: !124, file: !2, size: 128, align: 64, elements: !329, templateParams: !19, identifier: "798b34ebead859ce69e9d03c9b35a225")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !2, size: 128, align: 64, elements: !331, templateParams: !19, identifier: "9a1d717f346257b95013a7172794ce60", discriminator: !346)
!331 = !{!332, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !330, file: !2, baseType: !333, size: 128, align: 64, extraData: i64 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !328, file: !2, size: 128, align: 64, elements: !19, templateParams: !334, identifier: "3a1635ea2ae46dd17ad763afe55cb8e1")
!334 = !{!335}
!335 = !DITemplateTypeParameter(name: "T", type: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !337, templateParams: !19, identifier: "58cbc34fef4d5a10568547eb7d1bbfb1")
!337 = !{!338, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !2, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, align: 8, elements: !19, identifier: "927406dbf656657021f6081694371db0")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !336, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !330, file: !2, baseType: !343, size: 128, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !328, file: !2, size: 128, align: 64, elements: !344, templateParams: !334, identifier: "a9c997888cab8cdcb0fb96e252194950")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !336, size: 128, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !350, vtableHolder: !355, templateParams: !19, identifier: "4cefc037a00e1aab9f27a4ab381d3d67")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !349, file: !2, baseType: !6, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !349, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !349, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysAddr", scope: !14, file: !2, size: 64, align: 64, elements: !356, templateParams: !19, identifier: "743169f5828f83ec316b720d9a641914")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !2, baseType: !18, size: 64, align: 64)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !361, vtableHolder: !366, templateParams: !19, identifier: "7631cce8785ffe69d7cd2744fe72436a")
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !360, file: !2, baseType: !6, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !360, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !360, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableFlags", scope: !84, file: !2, size: 64, align: 64, elements: !367, templateParams: !19, identifier: "108bcafb31c255dd6c7493337f86e061")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !366, file: !2, baseType: !18, size: 64, align: 64)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !372, vtableHolder: !377, templateParams: !19, identifier: "fed6c2083bc785487dc57aeeca481272")
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !371, file: !2, baseType: !6, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !371, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !381, vtableHolder: !386, templateParams: !19, identifier: "f17f4bf4536dcb5e406e9a4e00b11c6b")
!381 = !{!382, !383, !384, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !380, file: !2, baseType: !6, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !380, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !380, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::instructions::tlb::Pcid", baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pcid", scope: !388, file: !2, size: 16, align: 16, elements: !390, templateParams: !19, identifier: "cc9fe00c2493e435c78a975b895c68d")
!388 = !DINamespace(name: "tlb", scope: !389)
!389 = !DINamespace(name: "instructions", scope: !15)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !387, file: !2, baseType: !34, size: 16, align: 16)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "<&u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !395, vtableHolder: !400, templateParams: !19, identifier: "397d38cdfa7b3ee9e5ca0ad30c176f92")
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !394, file: !2, baseType: !6, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !394, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !394, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !404, vtableHolder: !409, templateParams: !19, identifier: "70c3db0d87e68f786e30133d4eed2ad4")
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !403, file: !2, baseType: !6, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !403, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !403, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "<[u64; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[u64; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !413, vtableHolder: !418, templateParams: !19, identifier: "a95378254495c099d6574febdb23663c")
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !412, file: !2, baseType: !6, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !412, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, align: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 8, lowerBound: 0)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !424, vtableHolder: !429, templateParams: !19, identifier: "64008b1f854be91a226c6688c563b8d0")
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !423, file: !2, baseType: !6, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !423, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !433, vtableHolder: !29, templateParams: !19, identifier: "f91da450698107ee6783cd304bca60ab")
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !432, file: !2, baseType: !6, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !432, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !441, vtableHolder: !446, templateParams: !19, identifier: "c16630cb0939471fe4a747680872925a")
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !440, file: !2, baseType: !6, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !440, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !30, file: !2, size: 128, align: 32, elements: !447, templateParams: !462, identifier: "d9acc2e6ff6af56abec6b1c817727694")
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !446, file: !2, baseType: !34, size: 16, align: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !446, file: !2, baseType: !34, size: 16, align: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !446, file: !2, baseType: !37, size: 16, align: 16, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !446, file: !2, baseType: !34, size: 16, align: 16, offset: 48)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !446, file: !2, baseType: !42, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !446, file: !2, baseType: !42, size: 32, align: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !446, file: !2, baseType: !455, align: 8, offset: 128)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !456, identifier: "fe9756dbc95afe505e41fd48acaf6a13")
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !53, !18}
!461 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "F", type: !458)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !467, vtableHolder: !472, templateParams: !19, identifier: "6c5f5397b41e92a575524937bfa1255c")
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !466, file: !2, baseType: !6, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !466, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !466, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !30, file: !2, size: 128, align: 32, elements: !473, templateParams: !487, identifier: "8806b7410cebb0e93823fc777cb017ef")
!473 = !{!474, !475, !476, !477, !478, !479, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !472, file: !2, baseType: !34, size: 16, align: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !472, file: !2, baseType: !34, size: 16, align: 16, offset: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !472, file: !2, baseType: !37, size: 16, align: 16, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !472, file: !2, baseType: !34, size: 16, align: 16, offset: 48)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !472, file: !2, baseType: !42, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !472, file: !2, baseType: !42, size: 32, align: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !472, file: !2, baseType: !481, align: 8, offset: 128)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !482, identifier: "75f191a8d44c41fe54d9bf5245f5ca0f")
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "T", type: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !53, !18}
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "F", type: !484)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !492, vtableHolder: !497, templateParams: !19, identifier: "702ab358b3ebaee4e2e9b9a96172dca5")
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !491, file: !2, baseType: !6, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !491, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !30, file: !2, size: 128, align: 32, elements: !498, templateParams: !515, identifier: "cd2785b24348350097d0d22522b319f9")
!498 = !{!499, !500, !501, !502, !503, !504, !505}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !497, file: !2, baseType: !34, size: 16, align: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !497, file: !2, baseType: !34, size: 16, align: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !497, file: !2, baseType: !37, size: 16, align: 16, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !497, file: !2, baseType: !34, size: 16, align: 16, offset: 48)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !497, file: !2, baseType: !42, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !497, file: !2, baseType: !42, size: 32, align: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !497, file: !2, baseType: !506, align: 8, offset: 128)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !507, identifier: "ab8cc3d871ce2efb97f4572c01acde0e")
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !53, !512}
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !30, file: !2, size: 64, align: 64, elements: !513, templateParams: !19, identifier: "1f7163a5c8fee47d681395106ba20e8")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !512, file: !2, baseType: !18, size: 64, align: 64)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "F", type: !509)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !520, vtableHolder: !525, templateParams: !19, identifier: "79e0d6da5d975b362e0424001aca6df3")
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !519, file: !2, baseType: !6, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !519, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !519, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !30, file: !2, size: 128, align: 32, elements: !526, templateParams: !540, identifier: "e604d9220661f66fbfbfa943e39d5a87")
!526 = !{!527, !528, !529, !530, !531, !532, !533}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !525, file: !2, baseType: !34, size: 16, align: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !525, file: !2, baseType: !34, size: 16, align: 16, offset: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !525, file: !2, baseType: !37, size: 16, align: 16, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !525, file: !2, baseType: !34, size: 16, align: 16, offset: 48)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !525, file: !2, baseType: !42, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !525, file: !2, baseType: !42, size: 32, align: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !525, file: !2, baseType: !534, align: 8, offset: 128)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !535, identifier: "1d5be208feb5edc1dfb4723fa48d209c")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !538, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!461, !53}
!540 = !{!541}
!541 = !DITemplateTypeParameter(name: "F", type: !537)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !545, vtableHolder: !550, templateParams: !19, identifier: "eba3fe1bb4feddade23d6e9d3ec94a85")
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !544, file: !2, baseType: !6, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !544, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, align: 32, elements: !419)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !554, vtableHolder: !559, templateParams: !19, identifier: "5b7b7013f1befd4bd652c2850dc34cdc")
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !553, file: !2, baseType: !6, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224]", baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 28672, align: 32, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 224, lowerBound: 0)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !566, vtableHolder: !571, templateParams: !19, identifier: "6d944e8dc8b297ba6f374dcaad47a8d0")
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !565, file: !2, baseType: !6, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !565, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 64, align: 64, elements: !573, templateParams: !579, identifier: "e71ace4e0104b25fd59f9864856d87fc")
!572 = !DINamespace(name: "mapped_page_table", scope: !326)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_frame_mapping", scope: !571, file: !2, baseType: !575, size: 64, align: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysOffset", scope: !576, file: !2, size: 64, align: 64, elements: !577, templateParams: !19, identifier: "cc7bf5e03df2765519dc3f0b5029cfbb")
!576 = !DINamespace(name: "offset_page_table", scope: !326)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !575, file: !2, baseType: !13, size: 64, align: 64)
!579 = !{!580}
!580 = !DITemplateTypeParameter(name: "P", type: !575)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !584, vtableHolder: !589, templateParams: !19, identifier: "faf2b3367e84c0b4ef04c4f6b96922cf")
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !583, file: !2, baseType: !6, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !583, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !583, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut x86_64::structures::paging::page_table::PageTable", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::paging::page_table::PageTable", baseType: !591, size: 64, align: 64, dwarfAddressSpace: 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTable", scope: !84, file: !2, size: 32768, align: 32768, elements: !592, templateParams: !19, identifier: "8d23d5b607089f2254ae09744fd87597")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !591, file: !2, baseType: !594, size: 32768, align: 64)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32768, align: 64, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 512, lowerBound: 0)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !599, isLocal: true, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !600, vtableHolder: !605, templateParams: !19, identifier: "78402760c3ecd19083d969842f4609ac")
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !599, file: !2, baseType: !6, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !599, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::offset_page_table::PhysOffset", baseType: !575, size: 64, align: 64, dwarfAddressSpace: 0)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !609, vtableHolder: !614, templateParams: !19, identifier: "22508ea621467012ba9b4ccd8392d10a")
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !608, file: !2, baseType: !6, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !608, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !608, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !572, file: !2, size: 128, align: 64, elements: !616, templateParams: !579, identifier: "b36c8bd194e3f48668129ce58e8c5c69")
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_walker", scope: !615, file: !2, baseType: !571, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "level_4_table", scope: !615, file: !2, baseType: !590, size: 64, align: 64, offset: 64)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !622, vtableHolder: !590, templateParams: !19, identifier: "16a04b1fd023440380c38104a8412bdf")
!622 = !{!623, !624, !625, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !621, file: !2, baseType: !6, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !621, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !621, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !630, vtableHolder: !635, templateParams: !19, identifier: "b7845d12e37ab2c64647b0329893cef8")
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !629, file: !2, baseType: !6, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !629, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableIndex", baseType: !636, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableIndex", scope: !84, file: !2, size: 16, align: 16, elements: !637, templateParams: !19, identifier: "459c0342dd87f078f40eec3f7be4427e")
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !34, size: 16, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !642, vtableHolder: !647, templateParams: !19, identifier: "c356191f0cd06d23fd36f4bca2de7939")
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !641, file: !2, baseType: !6, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !641, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !641, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::PhysAddr", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !650, isLocal: true, isDefinition: true)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !651, vtableHolder: !656, templateParams: !19, identifier: "14c029713013486188b16d95fc783e0")
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !650, file: !2, baseType: !6, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !650, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !650, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedFrame", scope: !326, file: !2, size: 128, align: 64, elements: !657, templateParams: !19, identifier: "9cc7b5993ce65841500e6a01106862e0")
!657 = !{!658}
!658 = !DICompositeType(tag: DW_TAG_variant_part, scope: !656, file: !2, size: 128, align: 64, elements: !659, templateParams: !19, identifier: "d2deec9b8a8f2608e1996a686822e5b7", discriminator: !710)
!659 = !{!660, !678, !694}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Size4KiB", scope: !658, file: !2, baseType: !661, size: 128, align: 64, extraData: i64 0)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !656, file: !2, size: 128, align: 64, elements: !662, templateParams: !19, identifier: "c6b174452268350a29efe9c3bb5bc3c5")
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !661, file: !2, baseType: !664, size: 64, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size4KiB>", scope: !665, file: !2, size: 64, align: 64, elements: !666, templateParams: !676, identifier: "138d6ec5280917407ee4bd0990ae290b")
!665 = !DINamespace(name: "frame", scope: !85)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !664, file: !2, baseType: !355, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !2, baseType: !669, align: 8, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size4KiB>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !670, identifier: "267d4da4bf087dfc6b320c81ab0a781d")
!670 = !{!671}
!671 = !DITemplateTypeParameter(name: "T", type: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !673, file: !2, align: 8, elements: !674, templateParams: !19, identifier: "66850623fc6be4a0e728f04b4e2d5884")
!673 = !DINamespace(name: "page", scope: !85)
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_variant_part, scope: !672, file: !2, align: 8, elements: !19, identifier: "47bbb7356bf56c9717acd1922f19d6a2")
!676 = !{!677}
!677 = !DITemplateTypeParameter(name: "S", type: !672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Size2MiB", scope: !658, file: !2, baseType: !679, size: 128, align: 64, extraData: i64 1)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !656, file: !2, size: 128, align: 64, elements: !680, templateParams: !19, identifier: "173799d37bceaa70e0af56935696836c")
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !682, size: 64, align: 64, offset: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size2MiB>", scope: !665, file: !2, size: 64, align: 64, elements: !683, templateParams: !692, identifier: "ea56b13cca44a629aa3ed9bdc0e76637")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !682, file: !2, baseType: !355, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !682, file: !2, baseType: !686, align: 8, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size2MiB>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !687, identifier: "2e0b8d999b3a73d0a1ca19b18a9c69")
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !673, file: !2, align: 8, elements: !690, templateParams: !19, identifier: "91f23119f737cb4de3edf0a0457e2b6b")
!690 = !{!691}
!691 = !DICompositeType(tag: DW_TAG_variant_part, scope: !689, file: !2, align: 8, elements: !19, identifier: "f06b6152d03d963a8964eff6452efb23")
!692 = !{!693}
!693 = !DITemplateTypeParameter(name: "S", type: !689)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Size1GiB", scope: !658, file: !2, baseType: !695, size: 128, align: 64, extraData: i64 2)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !656, file: !2, size: 128, align: 64, elements: !696, templateParams: !19, identifier: "2a828d9438d9282a3b966d8a4e02bf10")
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !695, file: !2, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size1GiB>", scope: !665, file: !2, size: 64, align: 64, elements: !699, templateParams: !708, identifier: "51e668af65891013498306c50ab7d88a")
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !698, file: !2, baseType: !355, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !2, baseType: !702, align: 8, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size1GiB>", scope: !46, file: !2, align: 8, elements: !19, templateParams: !703, identifier: "7ea452aa5f9408789b9d5a1428cd2c28")
!703 = !{!704}
!704 = !DITemplateTypeParameter(name: "T", type: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !673, file: !2, align: 8, elements: !706, templateParams: !19, identifier: "c8f0986bb4edf6836081da36f2cf9aa8")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_variant_part, scope: !705, file: !2, align: 8, elements: !19, identifier: "bc412779b8393a10de3995e470450336")
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "S", type: !705)
!710 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !2, baseType: !18, size: 64, align: 64, flags: DIFlagArtificial)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !714, vtableHolder: !719, templateParams: !19, identifier: "3adb4c861d32a39f3c3f6745a858440a")
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !713, file: !2, baseType: !6, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableFlags", baseType: !366, size: 64, align: 64, dwarfAddressSpace: 0)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !722, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !723, vtableHolder: !728, templateParams: !19, identifier: "84c9d537d7e16d45ef7ea88916411c4c")
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !722, file: !2, baseType: !6, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !722, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !732, vtableHolder: !737, templateParams: !19, identifier: "d6ce32f069c0dd649b07d79a6e63af73")
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !731, file: !2, baseType: !6, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !731, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>", baseType: !682, size: 64, align: 64, dwarfAddressSpace: 0)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !741, vtableHolder: !746, templateParams: !19, identifier: "4f81b8fe9fd8aabfa8c8bc904b93f01e")
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !740, file: !2, baseType: !6, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>", baseType: !664, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !750, vtableHolder: !42, templateParams: !19, identifier: "d1f8935a8f2857bb21ea95c8e69fee2b")
!750 = !{!751, !752, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !749, file: !2, baseType: !6, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !749, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !758, vtableHolder: !763, templateParams: !19, identifier: "f902a52af721b2a6d12e9df515832b16")
!758 = !{!759, !760, !761, !762}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !757, file: !2, baseType: !6, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !757, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !757, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, align: 64, elements: !240)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !767, vtableHolder: !772, templateParams: !19, identifier: "b63f250d6ae17638922803fa90301f40")
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !766, file: !2, baseType: !6, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !766, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !766, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 448, align: 64, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 7, lowerBound: 0)
!775 = !{i32 8, !"PIC Level", i32 2}
!776 = !{i32 2, !"Dwarf Version", i32 4}
!777 = !{i32 2, !"Debug Info Version", i32 3}
!778 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !779, producer: "clang LLVM (rustc version 1.71.0-nightly (39c6804b9 2023-04-19))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, globals: !853, splitDebugInlining: false)
!779 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/lib.rs/@/x86_64.154f1444927f86fa-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10")
!780 = !{!147, !259, !319, !781, !789, !795, !799, !805, !809, !814, !820, !845, !849}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointSize", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !784)
!782 = !DINamespace(name: "debug", scope: !783)
!783 = !DINamespace(name: "registers", scope: !15)
!784 = !{!785, !786, !787, !788}
!785 = !DIEnumerator(name: "Length1B", value: 0, isUnsigned: true)
!786 = !DIEnumerator(name: "Length2B", value: 1, isUnsigned: true)
!787 = !DIEnumerator(name: "Length8B", value: 2, isUnsigned: true)
!788 = !DIEnumerator(name: "Length4B", value: 3, isUnsigned: true)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointCondition", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIEnumerator(name: "InstructionExecution", value: 0, isUnsigned: true)
!792 = !DIEnumerator(name: "DataWrites", value: 1, isUnsigned: true)
!793 = !DIEnumerator(name: "IoReadsWrites", value: 2, isUnsigned: true)
!794 = !DIEnumerator(name: "DataReadsWrites", value: 3, isUnsigned: true)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameError", scope: !84, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !796)
!796 = !{!797, !798}
!797 = !DIEnumerator(name: "FrameNotPresent", value: 0, isUnsigned: true)
!798 = !DIEnumerator(name: "HugeFrame", value: 1, isUnsigned: true)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAddressRegisterNumber", scope: !782, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIEnumerator(name: "Dr0", value: 0, isUnsigned: true)
!802 = !DIEnumerator(name: "Dr1", value: 1, isUnsigned: true)
!803 = !DIEnumerator(name: "Dr2", value: 2, isUnsigned: true)
!804 = !DIEnumerator(name: "Dr3", value: 3, isUnsigned: true)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlagUpdateError", scope: !326, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !806)
!806 = !{!807, !808}
!807 = !DIEnumerator(name: "PageNotMapped", value: 0, isUnsigned: true)
!808 = !DIEnumerator(name: "ParentEntryHugePage", value: 1, isUnsigned: true)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InvalidPageTable", scope: !810, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !811)
!810 = !DINamespace(name: "recursive_page_table", scope: !326)
!811 = !{!812, !813}
!812 = !DIEnumerator(name: "NotRecursive", value: 0, isUnsigned: true)
!813 = !DIEnumerator(name: "NotActive", value: 1, isUnsigned: true)
