; ModuleID = 'x86_64.dab99c68691af0d2-cgu.0'
source_filename = "x86_64.dab99c68691af0d2-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-obuasi-unknown-none"

%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size1GiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size1GiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }
%"core::result::Result<(structures::paging::frame::PhysFrame<structures::paging::page::Size2MiB>, structures::paging::mapper::MapperFlush<structures::paging::page::Size2MiB>), structures::paging::mapper::UnmapError>::Err" = type { [1 x i64], { i64, i64 } }
%"core::result::Result<(structures::paging::frame::PhysFrame, structures::paging::mapper::MapperFlush<structures::paging::page::Size4KiB>), structures::paging::mapper::UnmapError>" = type { i64, [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !25, identifier: "bbbbf50846a21e3dff98769fbbd30d61")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !14, file: !2, size: 128, align: 32, elements: !17, templateParams: !54, identifier: "171e9df7499988aaf6e9da18ef844b5b")
!14 = !DINamespace(name: "idt", scope: !15)
!15 = !DINamespace(name: "structures", scope: !16)
!16 = !DINamespace(name: "x86_64", scope: null)
!17 = !{!18, !20, !21, !26, !27, !29, !30}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !13, file: !2, baseType: !19, size: 16, align: 16)
!19 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !13, file: !2, baseType: !19, size: 16, align: 16, offset: 16)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !13, file: !2, baseType: !22, size: 16, align: 16, offset: 32)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "EntryOptions", scope: !14, file: !2, size: 16, align: 16, elements: !23, templateParams: !25, identifier: "5592dfd2062be2d91f128b0f03b8b90d")
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !19, size: 16, align: 16)
!25 = !{}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !13, file: !2, baseType: !19, size: 16, align: 16, offset: 48)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !13, file: !2, baseType: !28, size: 32, align: 32, offset: 64)
!28 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !13, file: !2, baseType: !28, size: 32, align: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !13, file: !2, baseType: !31, align: 8, offset: 128)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !34, identifier: "340f5ae25e8187e2f86520a9bb878fe")
!32 = !DINamespace(name: "marker", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DITemplateTypeParameter(name: "T", type: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39}
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrame", scope: !14, file: !2, size: 320, align: 64, elements: !40, templateParams: !25, identifier: "5f280c6ac0e6eab8884f6b975a6d0f0e")
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !39, file: !2, baseType: !42, size: 320, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "InterruptStackFrameValue", scope: !14, file: !2, size: 320, align: 64, elements: !43, templateParams: !25, identifier: "3be99d543e6592ca6704e6cc7362b9fa")
!43 = !{!44, !50, !51, !52, !53}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "instruction_pointer", scope: !42, file: !2, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddr", scope: !46, file: !2, size: 64, align: 64, elements: !47, templateParams: !25, identifier: "a865f6ef71f9ef435bb28424bd43a85d")
!46 = !DINamespace(name: "addr", scope: !16)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !45, file: !2, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "code_segment", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_flags", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !42, file: !2, baseType: !45, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "stack_segment", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 256)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "F", type: !36)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !59, vtableHolder: !64, templateParams: !25, identifier: "7ca76dbbb7fbeb4ab3ca0e9f64a8044a")
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !58, file: !2, baseType: !6, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !58, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::VirtAddr", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableEntry as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !68, vtableHolder: !73, templateParams: !25, identifier: "2a00c5337363f958468227aaceb88009")
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !67, file: !2, baseType: !6, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !67, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !67, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !67, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableEntry", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableEntry", scope: !75, file: !2, size: 64, align: 64, elements: !77, templateParams: !25, identifier: "538c9aadd268247d9910ac6c0d61a41d")
!75 = !DINamespace(name: "page_table", scope: !76)
!76 = !DINamespace(name: "paging", scope: !15)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !74, file: !2, baseType: !49, size: 64, align: 64)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !82, vtableHolder: !87, templateParams: !25, identifier: "5c9b642d090cea89cc0aa5549e7c7ec1")
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !81, file: !2, baseType: !6, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !81, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddrNotValid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !91, vtableHolder: !96, templateParams: !25, identifier: "b6964dd881415f13f04bed68e8c75357")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !90, file: !2, baseType: !6, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !90, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtAddrNotValid", scope: !46, file: !2, size: 64, align: 64, elements: !97, templateParams: !25, identifier: "515c6726eeee08cd55a3677226e6b1fc")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !2, baseType: !49, size: 64, align: 64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !102, vtableHolder: !107, templateParams: !25, identifier: "b6439f1b9ca184e396849aac27b75f54")
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !101, file: !2, baseType: !6, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !101, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !101, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !108, file: !2, size: 384, align: 64, elements: !109, templateParams: !25, identifier: "84f4de322c722d4ecf7f26fdd881a12a")
!108 = !DINamespace(name: "fmt", scope: !33)
!109 = !{!110, !122, !173}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !107, file: !2, baseType: !111, size: 128, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !112, templateParams: !25, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!112 = !{!113, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !111, file: !2, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !116, templateParams: !25, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !115, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !107, file: !2, baseType: !123, size: 128, align: 64, offset: 256)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !124, file: !2, size: 128, align: 64, elements: !125, templateParams: !25, identifier: "45e7676749e8833fc9f6788a752fa233")
!124 = !DINamespace(name: "option", scope: !33)
!125 = !{!126}
!126 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 128, align: 64, elements: !127, templateParams: !25, identifier: "78fc5675d20b0b054937c9b243721b04", discriminator: !172)
!127 = !{!128, !168}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !126, file: !2, baseType: !129, size: 128, align: 64, extraData: i64 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !123, file: !2, size: 128, align: 64, elements: !25, templateParams: !130, identifier: "7d6e0642c5fd326d5dedec8db5f1b626")
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !133, templateParams: !25, identifier: "2bdd0a1d249b9615818490cbe02637d0")
!133 = !{!134, !167}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !132, file: !2, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !137, file: !2, size: 448, align: 64, elements: !138, templateParams: !25, identifier: "60d1cd8e27ed5e572e6b6b32ddcefdd4")
!137 = !DINamespace(name: "rt", scope: !108)
!138 = !{!139, !140, !142, !149, !150, !166}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !136, file: !2, baseType: !141, size: 32, align: 32, offset: 320)
!141 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !136, file: !2, baseType: !143, size: 8, align: 8, offset: 384)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !137, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !2, baseType: !28, size: 32, align: 32, offset: 352)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !136, file: !2, baseType: !151, size: 128, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !137, file: !2, size: 128, align: 64, elements: !152, templateParams: !25, identifier: "8e436bf796d1bd1040afe66a54932e93")
!152 = !{!153}
!153 = !DICompositeType(tag: DW_TAG_variant_part, scope: !151, file: !2, size: 128, align: 64, elements: !154, templateParams: !25, identifier: "a16b1bf0ef6abe7338d550f54b3197c9", discriminator: !165)
!154 = !{!155, !159, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !153, file: !2, baseType: !156, size: 128, align: 64, extraData: i64 0)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !151, file: !2, size: 128, align: 64, elements: !157, templateParams: !25, identifier: "bb2788de63ecf655614eae44833a9683")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !156, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !153, file: !2, baseType: !160, size: 128, align: 64, extraData: i64 1)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !151, file: !2, size: 128, align: 64, elements: !161, templateParams: !25, identifier: "45b8dfec94a90db1ad28af7e19954195")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !153, file: !2, baseType: !164, size: 128, align: 64, extraData: i64 2)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !151, file: !2, size: 128, align: 64, elements: !25, identifier: "b2dd58a70f39c2d6f76f6e2aef3afc0e")
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagArtificial)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !136, file: !2, baseType: !151, size: 128, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !126, file: !2, baseType: !169, size: 128, align: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !123, file: !2, size: 128, align: 64, elements: !170, templateParams: !130, identifier: "17825c15133f27503bca321877d808b")
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !169, file: !2, baseType: !132, size: 128, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagArtificial)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !107, file: !2, baseType: !174, size: 128, align: 64, offset: 128)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !175, templateParams: !25, identifier: "b8c00ffcd99aa185b2b067e76efe6873")
!175 = !{!176, !238}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !174, file: !2, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !137, file: !2, size: 128, align: 64, elements: !179, templateParams: !25, identifier: "92df9959c1cdfbcdd7133c99bcf5419")
!179 = !{!180, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !178, file: !2, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !183, file: !2, align: 8, elements: !25, identifier: "9b221ef387fa4c24dae3649531e7392e")
!183 = !DINamespace(name: "{extern#0}", scope: !137)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !178, file: !2, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !181, !206}
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !189, file: !2, size: 8, align: 8, elements: !190, templateParams: !25, identifier: "c7c3ce2bbdc31e3d58704c1a88c0824e")
!189 = !DINamespace(name: "result", scope: !33)
!190 = !{!191}
!191 = !DICompositeType(tag: DW_TAG_variant_part, scope: !188, file: !2, size: 8, align: 8, elements: !192, templateParams: !25, identifier: "74931662ea2e848975e6c7d35e314c42", discriminator: !205)
!192 = !{!193, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !191, file: !2, baseType: !194, size: 8, align: 8, extraData: i64 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !188, file: !2, size: 8, align: 8, elements: !195, templateParams: !197, identifier: "d91e207f895b5ed21304fa16506e0f28")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !2, baseType: !7, align: 8, offset: 8)
!197 = !{!198, !199}
!198 = !DITemplateTypeParameter(name: "T", type: !7)
!199 = !DITemplateTypeParameter(name: "E", type: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !108, file: !2, align: 8, elements: !25, identifier: "e283c74b9cbd588272e9778de24cf5a7")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !191, file: !2, baseType: !202, size: 8, align: 8, extraData: i64 1)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !188, file: !2, size: 8, align: 8, elements: !203, templateParams: !197, identifier: "d8a7c61bfdd1bc42e5e7ca612a3d7525")
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !202, file: !2, baseType: !200, align: 8, offset: 8)
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !188, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagArtificial)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !108, file: !2, size: 512, align: 64, elements: !208, templateParams: !25, identifier: "bc7f0caae71140a04b17743f5a695b51")
!208 = !{!209, !210, !211, !212, !226, !227}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !2, baseType: !28, size: 32, align: 32, offset: 416)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !207, file: !2, baseType: !141, size: 32, align: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !207, file: !2, baseType: !143, size: 8, align: 8, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !207, file: !2, baseType: !213, size: 128, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !124, file: !2, size: 128, align: 64, elements: !214, templateParams: !25, identifier: "8ea6b5cb0daf623655668c8afb3a46")
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_variant_part, scope: !213, file: !2, size: 128, align: 64, elements: !216, templateParams: !25, identifier: "7e31bac4b704be2591b521f49ce53126", discriminator: !225)
!216 = !{!217, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !215, file: !2, baseType: !218, size: 128, align: 64, extraData: i64 0)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !213, file: !2, size: 128, align: 64, elements: !25, templateParams: !219, identifier: "728f4cb196695ca2ab2ce43263435122")
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "T", type: !9)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !215, file: !2, baseType: !222, size: 128, align: 64, extraData: i64 1)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !213, file: !2, size: 128, align: 64, elements: !223, templateParams: !219, identifier: "2b2f9f3a1d6e4246fb431560905aff2f")
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !222, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !213, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagArtificial)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !207, file: !2, baseType: !213, size: 128, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !207, file: !2, baseType: !228, size: 128, align: 64, offset: 256)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !229, templateParams: !25, identifier: "2cf87fbd87715f36bd216baa1303cbf0")
!229 = !{!230, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !228, file: !2, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64, dwarfAddressSpace: 0)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !25, identifier: "a80c365aa420df7c35abe384a2fa122f")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !228, file: !2, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !235, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 3, lowerBound: 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !242, vtableHolder: !19, templateParams: !25, identifier: "12af6e2defad22563f8ef1f1b4db6125")
!242 = !{!243, !244, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !241, file: !2, baseType: !6, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !241, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !241, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !241, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::PrivilegeLevel as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !250, vtableHolder: !255, templateParams: !25, identifier: "abbd156a94897490cd858e7048d38410")
!250 = !{!251, !252, !253, !254}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !249, file: !2, baseType: !6, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !249, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !249, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !249, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PrivilegeLevel", scope: !16, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIEnumerator(name: "Ring0", value: 0, isUnsigned: true)
!258 = !DIEnumerator(name: "Ring1", value: 1, isUnsigned: true)
!259 = !DIEnumerator(name: "Ring2", value: 2, isUnsigned: true)
!260 = !DIEnumerator(name: "Ring3", value: 3, isUnsigned: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::EntryOptions as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !264, vtableHolder: !22, templateParams: !25, identifier: "167d23d63a8e2be9a6ece7f4ac46a950")
!264 = !{!265, !266, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !263, file: !2, baseType: !6, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !263, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !263, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !263, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::VirtAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !272, vtableHolder: !45, templateParams: !25, identifier: "9473a4c94b93f39d26b021afbfc2763a")
!272 = !{!273, !274, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !271, file: !2, baseType: !6, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !271, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !271, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !280, vtableHolder: !49, templateParams: !25, identifier: "526a65e0a0b6e4762937133201e80178")
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !279, file: !2, baseType: !6, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !279, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !279, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !279, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::{impl#11}::fmt::Hex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !288, vtableHolder: !293, templateParams: !25, identifier: "a6d0cdc80aa1c39152b1bdb50be115b3")
!288 = !{!289, !290, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !287, file: !2, baseType: !6, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !287, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !287, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !287, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hex", scope: !294, file: !2, size: 64, align: 64, elements: !296, templateParams: !25, identifier: "f965e9658a8a477c41a8be69545f8ac7")
!294 = !DINamespace(name: "fmt", scope: !295)
!295 = !DINamespace(name: "{impl#11}", scope: !14)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !293, file: !2, baseType: !49, size: 64, align: 64)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !301, vtableHolder: !306, templateParams: !25, identifier: "b40b152e9971b32bdc56ea76d81ae47b")
!301 = !{!302, !303, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !300, file: !2, baseType: !6, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !300, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !300, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !300, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!306 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::DescriptorTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !310, vtableHolder: !315, templateParams: !25, identifier: "2cbc6460efb07554faaf7b449894a99d")
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !309, file: !2, baseType: !6, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !309, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !309, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !309, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DescriptorTable", scope: !14, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIEnumerator(name: "Gdt", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "Idt", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "Ldt", value: 2, isUnsigned: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_ASSERT_OBJECT_SAFE", linkageName: "_ZN6x86_6410structures6paging6mapper19_ASSERT_OBJECT_SAFE17h14506dcac3f86777E", scope: !322, file: !323, line: 486, type: !324, isLocal: true, isDefinition: true, align: 64)
!322 = !DINamespace(name: "mapper", scope: !76)
!323 = !DIFile(filename: "src/structures/paging/mapper/mod.rs", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10", checksumkind: CSK_MD5, checksum: "0dd5f33c2cee14124470d88449502bc1")
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)>", scope: !124, file: !2, size: 128, align: 64, elements: !325, templateParams: !25, identifier: "9d58fbabba9d5e904bc403b744926b52")
!325 = !{!326}
!326 = !DICompositeType(tag: DW_TAG_variant_part, scope: !324, file: !2, size: 128, align: 64, elements: !327, templateParams: !25, identifier: "c8e73b1c7d4be87ed41c3ec2d53c957d", discriminator: !342)
!327 = !{!328, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !326, file: !2, baseType: !329, size: 128, align: 64, extraData: i64 0)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !324, file: !2, size: 128, align: 64, elements: !25, templateParams: !330, identifier: "604d95245499e8f29dd059500fa142e1")
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !333, templateParams: !25, identifier: "54b300dcefc0a530e5485d417a1f4978")
!333 = !{!334, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !332, file: !2, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn x86_64::structures::paging::mapper::Translate + core::marker::Sync)", file: !2, align: 8, elements: !25, identifier: "e66cb93ede455dc72a379fb8bb5eb6c3")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !332, file: !2, baseType: !234, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !326, file: !2, baseType: !339, size: 128, align: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !324, file: !2, size: 128, align: 64, elements: !340, templateParams: !330, identifier: "5e7fea68f7b9e58782c422a9f6c56369")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !339, file: !2, baseType: !332, size: 128, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !324, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagArtificial)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !346, vtableHolder: !351, templateParams: !25, identifier: "c4b79f09c348020adeecf474fe363b41")
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !345, file: !2, baseType: !6, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !345, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !345, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysAddr", scope: !46, file: !2, size: 64, align: 64, elements: !352, templateParams: !25, identifier: "454d649b171e0eb34ca7cf6217a2981")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !2, baseType: !49, size: 64, align: 64)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !357, vtableHolder: !362, templateParams: !25, identifier: "78080effe77aa5cdb383cdefe2f639d1")
!357 = !{!358, !359, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !356, file: !2, baseType: !6, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !356, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !356, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !356, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableFlags", scope: !75, file: !2, size: 64, align: 64, elements: !363, templateParams: !25, identifier: "a876c41038f39bad182144114dab9b0")
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !362, file: !2, baseType: !49, size: 64, align: 64)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !368, vtableHolder: !373, templateParams: !25, identifier: "3797886b1181472f24dee80adf5f122a")
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !367, file: !2, baseType: !6, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !367, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !367, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !367, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::instructions::tlb::Pcid as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !377, vtableHolder: !382, templateParams: !25, identifier: "f6629843a7f782b06f121839bb2964e9")
!377 = !{!378, !379, !380, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !376, file: !2, baseType: !6, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !376, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !376, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::instructions::tlb::Pcid", baseType: !383, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pcid", scope: !384, file: !2, size: 16, align: 16, elements: !386, templateParams: !25, identifier: "de510763ce6846c9d4404f5d57c3b25b")
!384 = !DINamespace(name: "tlb", scope: !385)
!385 = !DINamespace(name: "instructions", scope: !16)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !2, baseType: !19, size: 16, align: 16)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "<&u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !391, vtableHolder: !396, templateParams: !25, identifier: "db5993be187303fad0258d1c414877ab")
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !390, file: !2, baseType: !6, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !390, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !390, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !400, vtableHolder: !405, templateParams: !25, identifier: "b3aa151398ffbe642710d5f6e4b07370")
!400 = !{!401, !402, !403, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !399, file: !2, baseType: !6, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !399, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !399, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "<[u64; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[u64; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !409, vtableHolder: !414, templateParams: !25, identifier: "a03343e3c0755dd5fbc75a98e3e0cd1c")
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !408, file: !2, baseType: !6, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !408, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !408, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !408, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 512, align: 64, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 8, lowerBound: 0)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !420, vtableHolder: !425, templateParams: !25, identifier: "da32a52a413c99a1fb5b3d5369da51b1")
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !419, file: !2, baseType: !6, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !419, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !419, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !419, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !429, vtableHolder: !13, templateParams: !25, identifier: "7bcc731109e2ee721dfec76c29c78be7")
!429 = !{!430, !431, !432, !433}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !428, file: !2, baseType: !6, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !428, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !428, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !437, vtableHolder: !442, templateParams: !25, identifier: "f29765d1647125fcf8cf6caca9fcd38d")
!437 = !{!438, !439, !440, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !436, file: !2, baseType: !6, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !436, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !14, file: !2, size: 128, align: 32, elements: !443, templateParams: !458, identifier: "51f347da4eecc639ef6fd69f32008155")
!443 = !{!444, !445, !446, !447, !448, !449, !450}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !442, file: !2, baseType: !19, size: 16, align: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !442, file: !2, baseType: !19, size: 16, align: 16, offset: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !442, file: !2, baseType: !22, size: 16, align: 16, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !442, file: !2, baseType: !19, size: 16, align: 16, offset: 48)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !442, file: !2, baseType: !28, size: 32, align: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !442, file: !2, baseType: !28, size: 32, align: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !442, file: !2, baseType: !451, align: 8, offset: 128)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !452, identifier: "24d5549e54850ac7895116688834bdee")
!452 = !{!453}
!453 = !DITemplateTypeParameter(name: "T", type: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64) -> !", baseType: !455, size: 64, align: 64, dwarfAddressSpace: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !39, !49}
!457 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!458 = !{!459}
!459 = !DITemplateTypeParameter(name: "F", type: !454)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !463, vtableHolder: !468, templateParams: !25, identifier: "4293b4ac38a13436272cca3b69985bb")
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !462, file: !2, baseType: !6, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !462, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !462, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !462, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !14, file: !2, size: 128, align: 32, elements: !469, templateParams: !483, identifier: "59b60b7a6bd44ba18158e502162579d9")
!469 = !{!470, !471, !472, !473, !474, !475, !476}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !468, file: !2, baseType: !19, size: 16, align: 16)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !468, file: !2, baseType: !19, size: 16, align: 16, offset: 16)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !468, file: !2, baseType: !22, size: 16, align: 16, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !468, file: !2, baseType: !19, size: 16, align: 16, offset: 48)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !468, file: !2, baseType: !28, size: 32, align: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !468, file: !2, baseType: !28, size: 32, align: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !468, file: !2, baseType: !477, align: 8, offset: 128)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !478, identifier: "a98ca8f12ccf5761c7f937b6204bdeb")
!478 = !{!479}
!479 = !DITemplateTypeParameter(name: "T", type: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, u64)", baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !39, !49}
!483 = !{!484}
!484 = !DITemplateTypeParameter(name: "F", type: !480)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !488, vtableHolder: !493, templateParams: !25, identifier: "fc37f4b967aa35d1da3854c4847affb3")
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !487, file: !2, baseType: !6, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !487, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !487, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !14, file: !2, size: 128, align: 32, elements: !494, templateParams: !511, identifier: "ad1c5e7ae5b81c3ef7527e8bb8e85829")
!494 = !{!495, !496, !497, !498, !499, !500, !501}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !493, file: !2, baseType: !19, size: 16, align: 16)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !493, file: !2, baseType: !19, size: 16, align: 16, offset: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !493, file: !2, baseType: !22, size: 16, align: 16, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !493, file: !2, baseType: !19, size: 16, align: 16, offset: 48)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !493, file: !2, baseType: !28, size: 32, align: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !493, file: !2, baseType: !28, size: 32, align: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !493, file: !2, baseType: !502, align: 8, offset: 128)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !503, identifier: "10bc7c5552fdac59ec9e652fa21135ea")
!503 = !{!504}
!504 = !DITemplateTypeParameter(name: "T", type: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame, x86_64::structures::idt::PageFaultErrorCode)", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !39, !508}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageFaultErrorCode", scope: !14, file: !2, size: 64, align: 64, elements: !509, templateParams: !25, identifier: "8f3e882a1793521be61f54c4c3fa8e16")
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !508, file: !2, baseType: !49, size: 64, align: 64)
!511 = !{!512}
!512 = !DITemplateTypeParameter(name: "F", type: !505)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !516, vtableHolder: !521, templateParams: !25, identifier: "9e156287f2b5e28c3f0a5a1117ee77f8")
!516 = !{!517, !518, !519, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !515, file: !2, baseType: !6, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !515, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !515, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !14, file: !2, size: 128, align: 32, elements: !522, templateParams: !536, identifier: "7556d76a724377cfdaaa0b923fb77692")
!522 = !{!523, !524, !525, !526, !527, !528, !529}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_low", scope: !521, file: !2, baseType: !19, size: 16, align: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gdt_selector", scope: !521, file: !2, baseType: !19, size: 16, align: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !521, file: !2, baseType: !22, size: 16, align: 16, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_middle", scope: !521, file: !2, baseType: !19, size: 16, align: 16, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_high", scope: !521, file: !2, baseType: !28, size: 32, align: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !521, file: !2, baseType: !28, size: 32, align: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !521, file: !2, baseType: !530, align: 8, offset: 128)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !531, identifier: "1833a67908d8e4a5d5e5542ce2fdb")
!531 = !{!532}
!532 = !DITemplateTypeParameter(name: "T", type: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame) -> !", baseType: !534, size: 64, align: 64, dwarfAddressSpace: 0)
!534 = !DISubroutineType(types: !535)
!535 = !{!457, !39}
!536 = !{!537}
!537 = !DITemplateTypeParameter(name: "F", type: !533)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 8] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !541, vtableHolder: !546, templateParams: !25, identifier: "312c688c4040207e7a66e5dfaf3bac8a")
!541 = !{!542, !543, !544, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !540, file: !2, baseType: !6, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !540, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !540, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !540, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, align: 32, elements: !415)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !550, vtableHolder: !555, templateParams: !25, identifier: "5810995805993853cd9be5a231b3e8b8")
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !549, file: !2, baseType: !6, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !549, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !549, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !549, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[x86_64::structures::idt::Entry<extern \22x86-interrupt\22 fn(x86_64::structures::idt::InterruptStackFrame)>; 224]", baseType: !556, size: 64, align: 64, dwarfAddressSpace: 0)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 28672, align: 32, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 224, lowerBound: 0)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::mapped_page_table::PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !562, vtableHolder: !567, templateParams: !25, identifier: "da6baaf3ba4a8a66494e664d642d2ccc")
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !561, file: !2, baseType: !6, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !561, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !561, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !561, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableWalker<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !568, file: !2, size: 64, align: 64, elements: !569, templateParams: !575, identifier: "f1d25a98b324e6ad145fcaffb6dcc91")
!568 = !DINamespace(name: "mapped_page_table", scope: !322)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_frame_mapping", scope: !567, file: !2, baseType: !571, size: 64, align: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysOffset", scope: !572, file: !2, size: 64, align: 64, elements: !573, templateParams: !25, identifier: "5580cd497ad5ed6cec97a514ef38926b")
!572 = !DINamespace(name: "offset_page_table", scope: !322)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !571, file: !2, baseType: !45, size: 64, align: 64)
!575 = !{!576}
!576 = !DITemplateTypeParameter(name: "P", type: !571)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !580, vtableHolder: !585, templateParams: !25, identifier: "3dd0d33726ab8abe8c83faef6556141")
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !579, file: !2, baseType: !6, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !579, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !579, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&mut x86_64::structures::paging::page_table::PageTable", baseType: !586, size: 64, align: 64, dwarfAddressSpace: 0)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut x86_64::structures::paging::page_table::PageTable", baseType: !587, size: 64, align: 64, dwarfAddressSpace: 0)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTable", scope: !75, file: !2, size: 32768, align: 32768, elements: !588, templateParams: !25, identifier: "283f128080391e9c8a369b6a3876c49c")
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !587, file: !2, baseType: !590, size: 32768, align: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32768, align: 64, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 512, lowerBound: 0)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::offset_page_table::PhysOffset as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !596, vtableHolder: !601, templateParams: !25, identifier: "3c952e9ac49e6c8d26c4eff6848390c5")
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !595, file: !2, baseType: !6, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !595, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !595, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !595, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::offset_page_table::PhysOffset", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !605, vtableHolder: !610, templateParams: !25, identifier: "880bd356a5242f966704922fc81f9cf")
!605 = !{!606, !607, !608, !609}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !604, file: !2, baseType: !6, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !604, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !604, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::mapper::mapped_page_table::MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", baseType: !611, size: 64, align: 64, dwarfAddressSpace: 0)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedPageTable<x86_64::structures::paging::mapper::offset_page_table::PhysOffset>", scope: !568, file: !2, size: 128, align: 64, elements: !612, templateParams: !575, identifier: "ae4b1ae721e0a1d49079979424a791db")
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_walker", scope: !611, file: !2, baseType: !567, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "level_4_table", scope: !611, file: !2, baseType: !586, size: 64, align: 64)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut x86_64::structures::paging::page_table::PageTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !618, vtableHolder: !586, templateParams: !25, identifier: "75cf40bc03b4bf727563216d777796af")
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !617, file: !2, baseType: !6, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !617, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !617, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableIndex as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !626, vtableHolder: !631, templateParams: !25, identifier: "ba2c83d698dd69a84a0a9d74a770917")
!626 = !{!627, !628, !629, !630}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !625, file: !2, baseType: !6, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !625, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !625, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableIndex", baseType: !632, size: 64, align: 64, dwarfAddressSpace: 0)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "PageTableIndex", scope: !75, file: !2, size: 16, align: 16, elements: !633, templateParams: !25, identifier: "66546fd119d4d07867e955cf6507d1c0")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !632, file: !2, baseType: !19, size: 16, align: 16)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::addr::PhysAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !638, vtableHolder: !643, templateParams: !25, identifier: "da4011955e57e3a96df83afa098e3a36")
!638 = !{!639, !640, !641, !642}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !637, file: !2, baseType: !6, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !637, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !637, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::addr::PhysAddr", baseType: !351, size: 64, align: 64, dwarfAddressSpace: 0)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "<x86_64::structures::paging::mapper::MappedFrame as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !647, vtableHolder: !652, templateParams: !25, identifier: "dff1cfdcdd53c1335df0bc771c7acff5")
!647 = !{!648, !649, !650, !651}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !646, file: !2, baseType: !6, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !646, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !646, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MappedFrame", scope: !322, file: !2, size: 128, align: 64, elements: !653, templateParams: !25, identifier: "e931aa28c85c9a0b4dd75989482a6ed7")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_variant_part, scope: !652, file: !2, size: 128, align: 64, elements: !655, templateParams: !25, identifier: "c6fd7de27f15254df06f83e2429ca27a", discriminator: !706)
!655 = !{!656, !674, !690}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Size4KiB", scope: !654, file: !2, baseType: !657, size: 128, align: 64, extraData: i64 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !652, file: !2, size: 128, align: 64, elements: !658, templateParams: !25, identifier: "3d59f7ee9d489ed8e52561af1af96e25")
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !657, file: !2, baseType: !660, size: 64, align: 64, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size4KiB>", scope: !661, file: !2, size: 64, align: 64, elements: !662, templateParams: !672, identifier: "3592c90fa4b0becd7a57e5cfb32a1878")
!661 = !DINamespace(name: "frame", scope: !76)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !660, file: !2, baseType: !351, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !2, baseType: !665, align: 8, offset: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size4KiB>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !666, identifier: "dac299b5d0e019ce752106fdab9f6143")
!666 = !{!667}
!667 = !DITemplateTypeParameter(name: "T", type: !668)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size4KiB", scope: !669, file: !2, align: 8, elements: !670, templateParams: !25, identifier: "9f1fdb20be7cae47dbf5403d24ff84c")
!669 = !DINamespace(name: "page", scope: !76)
!670 = !{!671}
!671 = !DICompositeType(tag: DW_TAG_variant_part, scope: !668, file: !2, align: 8, elements: !25, identifier: "34ea8f89d8956a268d0e74aed478f1e")
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "S", type: !668)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Size2MiB", scope: !654, file: !2, baseType: !675, size: 128, align: 64, extraData: i64 1)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !652, file: !2, size: 128, align: 64, elements: !676, templateParams: !25, identifier: "131fe13274ba3251853da10916b3536")
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !675, file: !2, baseType: !678, size: 64, align: 64, offset: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size2MiB>", scope: !661, file: !2, size: 64, align: 64, elements: !679, templateParams: !688, identifier: "e085e797019db6df41e84e9fb8b98325")
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !678, file: !2, baseType: !351, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !678, file: !2, baseType: !682, align: 8, offset: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size2MiB>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !683, identifier: "b547655f46ea5588e9bf7ebde765ccbf")
!683 = !{!684}
!684 = !DITemplateTypeParameter(name: "T", type: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size2MiB", scope: !669, file: !2, align: 8, elements: !686, templateParams: !25, identifier: "d644ec73c87f7e31f033a1760c5319f9")
!686 = !{!687}
!687 = !DICompositeType(tag: DW_TAG_variant_part, scope: !685, file: !2, align: 8, elements: !25, identifier: "87b04f1014311581a926e0e5abb97243")
!688 = !{!689}
!689 = !DITemplateTypeParameter(name: "S", type: !685)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Size1GiB", scope: !654, file: !2, baseType: !691, size: 128, align: 64, extraData: i64 2)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !652, file: !2, size: 128, align: 64, elements: !692, templateParams: !25, identifier: "df02cbefac43d15359a36aab7075f429")
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !691, file: !2, baseType: !694, size: 64, align: 64, offset: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhysFrame<x86_64::structures::paging::page::Size1GiB>", scope: !661, file: !2, size: 64, align: 64, elements: !695, templateParams: !704, identifier: "fd5acf1643dacacf54164de32f2d6a17")
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !694, file: !2, baseType: !351, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !694, file: !2, baseType: !698, align: 8, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<x86_64::structures::paging::page::Size1GiB>", scope: !32, file: !2, align: 8, elements: !25, templateParams: !699, identifier: "3f123f63a36076244938718d0cf2acdd")
!699 = !{!700}
!700 = !DITemplateTypeParameter(name: "T", type: !701)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Size1GiB", scope: !669, file: !2, align: 8, elements: !702, templateParams: !25, identifier: "9a6b19e77550cfa9f802d4ad407e75aa")
!702 = !{!703}
!703 = !DICompositeType(tag: DW_TAG_variant_part, scope: !701, file: !2, align: 8, elements: !25, identifier: "92d9f83d03bac71b3b5430b7d4ed9359")
!704 = !{!705}
!705 = !DITemplateTypeParameter(name: "S", type: !701)
!706 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagArtificial)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::page_table::PageTableFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !710, vtableHolder: !715, templateParams: !25, identifier: "4e3568de5139473624d3c533577f04aa")
!710 = !{!711, !712, !713, !714}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !709, file: !2, baseType: !6, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !709, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !709, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !709, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::page_table::PageTableFlags", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !719, vtableHolder: !724, templateParams: !25, identifier: "9363dbf85bc80b39b3beddd5ed4d6f5e")
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !718, file: !2, baseType: !6, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !718, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !718, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size1GiB>", baseType: !694, size: 64, align: 64, dwarfAddressSpace: 0)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !728, vtableHolder: !733, templateParams: !25, identifier: "9c820dafa0f83729ceb7786382e02c36")
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !727, file: !2, baseType: !6, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !727, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !727, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !727, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size2MiB>", baseType: !678, size: 64, align: 64, dwarfAddressSpace: 0)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !737, vtableHolder: !742, templateParams: !25, identifier: "aaff67a2e8a3a6a0963a8d258073903f")
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !736, file: !2, baseType: !6, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !736, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !736, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !736, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&x86_64::structures::paging::frame::PhysFrame<x86_64::structures::paging::page::Size4KiB>", baseType: !660, size: 64, align: 64, dwarfAddressSpace: 0)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !746, vtableHolder: !28, templateParams: !25, identifier: "ef74019fc63f729ffd8c4847060dda43")
!746 = !{!747, !748, !749, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !745, file: !2, baseType: !6, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !745, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !745, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 3] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !754, vtableHolder: !759, templateParams: !25, identifier: "33e13d175a4eb2fea8e1290e36a848e")
!754 = !{!755, !756, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !753, file: !2, baseType: !6, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !753, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !753, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 192, align: 64, elements: !236)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "<[x86_64::addr::VirtAddr; 7] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !763, vtableHolder: !768, templateParams: !25, identifier: "953c27b2c3c8c89214b392576fbfdad")
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !762, file: !2, baseType: !6, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !762, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !762, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 448, align: 64, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 7, lowerBound: 0)
!771 = !{i32 8, !"PIC Level", i32 2}
!772 = !{i32 2, !"Dwarf Version", i32 4}
!773 = !{i32 2, !"Debug Info Version", i32 3}
!774 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !775, producer: "clang LLVM (rustc version 1.71.0-nightly (dbba59457 2023-05-01))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, globals: !849, splitDebugInlining: false)
!775 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10/src/lib.rs/@/x86_64.dab99c68691af0d2-cgu.0", directory: "/Users/yaw/.cargo/registry/src/index.crates.io-6f17d22bba15001f/x86_64-0.14.10")
!776 = !{!143, !255, !315, !777, !785, !791, !795, !801, !805, !810, !816, !841, !845}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointSize", scope: !778, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !780)
!778 = !DINamespace(name: "debug", scope: !779)
!779 = !DINamespace(name: "registers", scope: !16)
!780 = !{!781, !782, !783, !784}
!781 = !DIEnumerator(name: "Length1B", value: 0, isUnsigned: true)
!782 = !DIEnumerator(name: "Length2B", value: 1, isUnsigned: true)
!783 = !DIEnumerator(name: "Length8B", value: 2, isUnsigned: true)
!784 = !DIEnumerator(name: "Length4B", value: 3, isUnsigned: true)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BreakpointCondition", scope: !778, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIEnumerator(name: "InstructionExecution", value: 0, isUnsigned: true)
!788 = !DIEnumerator(name: "DataWrites", value: 1, isUnsigned: true)
!789 = !DIEnumerator(name: "IoReadsWrites", value: 2, isUnsigned: true)
!790 = !DIEnumerator(name: "DataReadsWrites", value: 3, isUnsigned: true)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameError", scope: !75, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !792)
!792 = !{!793, !794}
!793 = !DIEnumerator(name: "FrameNotPresent", value: 0, isUnsigned: true)
!794 = !DIEnumerator(name: "HugeFrame", value: 1, isUnsigned: true)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAddressRegisterNumber", scope: !778, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !796)
!796 = !{!797, !798, !799, !800}
!797 = !DIEnumerator(name: "Dr0", value: 0, isUnsigned: true)
!798 = !DIEnumerator(name: "Dr1", value: 1, isUnsigned: true)
!799 = !DIEnumerator(name: "Dr2", value: 2, isUnsigned: true)
!800 = !DIEnumerator(name: "Dr3", value: 3, isUnsigned: true)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlagUpdateError", scope: !322, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !802)
!802 = !{!803, !804}
!803 = !DIEnumerator(name: "PageNotMapped", value: 0, isUnsigned: true)
!804 = !DIEnumerator(name: "ParentEntryHugePage", value: 1, isUnsigned: true)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InvalidPageTable", scope: !806, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !807)
!806 = !DINamespace(name: "recursive_page_table", scope: !322)
!807 = !{!808, !809}
!808 = !DIEnumerator(name: "NotRecursive", value: 0, isUnsigned: true)
!809 = !DIEnumerator(name: "NotActive", value: 1, isUnsigned: true)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PageTableLevel", scope: !75, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !811)
!811 = !{!812, !813, !814, !815}
!812 = !DIEnumerator(name: "One", value: 1, isUnsigned: true)
!813 = !DIEnumerator(name: "Two", value: 2, isUnsigned: true)
