; ModuleID = 'bootloader.8d891909-cgu.0'
source_filename = "bootloader.8d891909-cgu.0"
target datalayout = "e-S128-m:e-i64:64-f128:128-n8:16:32:64"
target triple = "x86_64-jemima-unknown-none"

%"bootinfo::memory_map::MemoryRegion" = type { { i64, i64 }, i32, [1 x i32] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" = type { [3 x i64] }
%"core::mem::manually_drop::ManuallyDrop<bootinfo::memory_map::MemoryRegion>" = type { %"bootinfo::memory_map::MemoryRegion" }
%"core::mem::manually_drop::ManuallyDrop<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { %"core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>" }
%"core::mem::maybe_uninit::MaybeUninit<core::mem::maybe_uninit::MaybeUninit<bootinfo::memory_map::MemoryRegion>>" = type { [3 x i64] }
%"core::ptr::metadata::PtrComponents<bootinfo::memory_map::MemoryRegion>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<bootinfo::memory_map::MemoryRegion>" = type { [1 x i64] }
%"core::ptr::metadata::PtrRepr<[bootinfo::memory_map::MemoryRegion]>" = type { [2 x i64] }
%"[closure@/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/bootinfo/memory_map.rs:40:39: 40:47]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegion as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "dda2c9f76db699377452f402fbc689fa")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryRegion", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !24, identifier: "6e216fa4c038a0a7c6413e6fb78fe23a")
!14 = !DINamespace(name: "memory_map", scope: !15)
!15 = !DINamespace(name: "bootinfo", scope: !16)
!16 = !DINamespace(name: "bootloader", scope: null)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !2, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameRange", scope: !14, file: !2, size: 128, align: 64, elements: !20, templateParams: !24, identifier: "51dcabe670a08fb32fba8ba60e93c0ec")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame_number", scope: !19, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !13, file: !2, baseType: !26, size: 32, align: 32, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MemoryRegionType", scope: !14, file: !2, baseType: !27, size: 32, align: 32, flags: DIFlagEnumClass, elements: !28)
!27 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!29 = !DIEnumerator(name: "Usable", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "InUse", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "Reserved", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "AcpiReclaimable", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "AcpiNvs", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "BadMemory", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "Kernel", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "KernelStack", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PageTable", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "Bootloader", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "FrameZero", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "Empty", value: 11, isUnsigned: true)
!41 = !DIEnumerator(name: "BootInfo", value: 12, isUnsigned: true)
!42 = !DIEnumerator(name: "Package", value: 13, isUnsigned: true)
!43 = !DIEnumerator(name: "NonExhaustive", value: 14, isUnsigned: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::FrameRange as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !52, templateParams: !24, identifier: "64b88a28fc5bac49fe21861c56a697ed")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::FrameRange", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryRegionType as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !56, vtableHolder: !61, templateParams: !24, identifier: "696dfaeb63813b0d8d206e724c8e09d9")
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !55, file: !2, baseType: !6, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !55, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !55, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !65, vtableHolder: !70, templateParams: !24, identifier: "7271b4fbeaa282447cb049b7f4648ec8")
!65 = !{!66, !67, !68, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !64, file: !2, baseType: !6, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !64, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !64, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !64, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !74, vtableHolder: !79, templateParams: !24, identifier: "4fdf593f52a7dc291ad8f58511b9fde2")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !73, file: !2, baseType: !6, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !73, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::memory_map::MemoryMap as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !83, vtableHolder: !88, templateParams: !24, identifier: "e323dbece03e4494617c54c691cd6616")
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !82, file: !2, baseType: !6, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !82, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !82, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::memory_map::MemoryMap", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemoryMap", scope: !14, file: !2, size: 12352, align: 64, elements: !90, templateParams: !24, identifier: "8ae605d4d3d3c6db66a79c0ddaef29")
!90 = !{!91, !95}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !89, file: !2, baseType: !92, size: 12288, align: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, align: 64, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 64, lowerBound: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next_entry_index", scope: !89, file: !2, baseType: !22, size: 64, align: 64, offset: 12288)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "<&bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&bootloader::bootinfo::TlsTemplate as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !99, vtableHolder: !104, templateParams: !24, identifier: "bcd2325166169a51d8c231d9c48d9cf8")
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !98, file: !2, baseType: !6, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !98, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !98, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bootloader::bootinfo::TlsTemplate", baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "TlsTemplate", scope: !15, file: !2, size: 192, align: 64, elements: !106, templateParams: !24, identifier: "fba497a637c15b2aa4b2f4358ce5d0e8")
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "start_addr", scope: !105, file: !2, baseType: !22, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !105, file: !2, baseType: !22, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !105, file: !2, baseType: !22, size: 64, align: 64, offset: 128)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !113, vtableHolder: !118, templateParams: !24, identifier: "c33d0ef2f2119f0ef23d2c83b0a6062a")
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !112, file: !2, baseType: !6, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !112, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !112, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !112, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!120 = !{i32 7, !"PIC Level", i32 2}
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !124, producer: "clang LLVM (rustc version 1.68.0-nightly (0442fbabe 2023-01-10))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !125, globals: !149)
!124 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23/src/lib.rs/@/bootloader.8d891909-cgu.0", directory: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/bootloader-0.9.23")
!125 = !{!26, !126, !136, !143}
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !127, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !131)
!127 = !DINamespace(name: "v1", scope: !128)
!128 = !DINamespace(name: "rt", scope: !129)
!129 = !DINamespace(name: "fmt", scope: !130)
!130 = !DINamespace(name: "core", scope: null)
!131 = !{!132, !133, !134, !135}
!132 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !137, file: !2, baseType: !138, size: 8, align: 8, flags: DIFlagEnumClass, elements: !139)
!137 = !DINamespace(name: "cmp", scope: !130)
!138 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!139 = !{!140, !141, !142}
!140 = !DIEnumerator(name: "Less", value: -1)
!141 = !DIEnumerator(name: "Equal", value: 0)
!142 = !DIEnumerator(name: "Greater", value: 1)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !144, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagEnumClass, elements: !145)
!144 = !DINamespace(name: "panicking", scope: !130)
!145 = !{!146, !147, !148}
!146 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!147 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!149 = !{!0, !44, !53, !62, !71, !80, !96, !110}
!150 = distinct !DISubprogram(name: "get_unchecked<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17he3cd4da4e0f3e971E", scope: !152, file: !151, line: 373, type: !155, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !170)
!151 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "afd2e83bc7b2acdd8fe6c036dd45a95e")
!152 = !DINamespace(name: "{impl#4}", scope: !153)
!153 = !DINamespace(name: "index", scope: !154)
!154 = !DINamespace(name: "slice", scope: !130)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !162, !157}
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !158, templateParams: !24, identifier: "2fe2bbc97c72540656cfe297d28e4008")
!158 = !{!159, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !157, file: !2, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !157, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !163, file: !2, size: 128, align: 64, elements: !165, templateParams: !168, identifier: "e39c38a85347887296976186f871415e")
!163 = !DINamespace(name: "range", scope: !164)
!164 = !DINamespace(name: "ops", scope: !130)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !162, file: !2, baseType: !9, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !162, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "Idx", type: !9)
!170 = !{!171, !172, !173}
!171 = !DILocalVariable(name: "self", arg: 1, scope: !150, file: !151, line: 373, type: !162)
!172 = !DILocalVariable(name: "slice", arg: 2, scope: !150, file: !151, line: 373, type: !157)
!173 = !DILocalVariable(name: "this", scope: !174, file: !151, line: 374, type: !162, align: 8)
!174 = distinct !DILexicalBlock(scope: !150, file: !151, line: 374, column: 9)
!175 = !{!176}
!176 = !DITemplateTypeParameter(name: "T", type: !13)
!177 = !DILocation(line: 373, column: 29, scope: !150)
!178 = !DILocation(line: 373, column: 35, scope: !150)
!179 = !DILocation(line: 374, column: 13, scope: !174)
!180 = !DILocation(line: 374, column: 20, scope: !150)
!181 = !DILocation(line: 381, column: 13, scope: !174)
!182 = !DILocalVariable(name: "this", arg: 1, scope: !183, file: !184, line: 2220, type: !162)
!183 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked7runtime17heb39397e088dad10E", scope: !185, file: !184, line: 2220, type: !186, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !188)
!184 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "4abbeae67c6fb4d14cc68e0d4aa02635")
!185 = !DINamespace(name: "get_unchecked", scope: !152)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !162, !157}
!188 = !{!182, !189}
!189 = !DILocalVariable(name: "slice", arg: 2, scope: !183, file: !184, line: 2220, type: !157)
!190 = !DILocation(line: 2220, column: 39, scope: !183, inlinedAt: !191)
!191 = distinct !DILocation(line: 381, column: 13, scope: !174)
!192 = !DILocation(line: 384, column: 17, scope: !193, inlinedAt: !191)
!193 = !DILexicalBlockFile(scope: !183, file: !151, discriminator: 0)
!194 = !DILocation(line: 384, column: 55, scope: !193, inlinedAt: !191)
!195 = !DILocation(line: 384, column: 43, scope: !193, inlinedAt: !191)
!196 = !DILocation(line: 2221, column: 20, scope: !183, inlinedAt: !191)
!197 = !{i8 0, i8 2}
!198 = !DILocation(line: 2223, column: 21, scope: !183, inlinedAt: !191)
!199 = !DILocation(line: 386, column: 39, scope: !174)
!200 = !DILocalVariable(name: "self", arg: 1, scope: !201, file: !202, line: 939, type: !208)
!201 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hf360333bcb02b644E", scope: !203, file: !202, line: 939, type: !206, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !209)
!202 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d28838f1d3900a938f9a4e5afeddc45")
!203 = !DINamespace(name: "{impl#0}", scope: !204)
!204 = !DINamespace(name: "const_ptr", scope: !205)
!205 = !DINamespace(name: "ptr", scope: !130)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !208, !9}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !{!200, !210}
!210 = !DILocalVariable(name: "count", arg: 2, scope: !201, file: !202, line: 939, type: !9)
!211 = !DILocation(line: 939, column: 29, scope: !201, inlinedAt: !212)
!212 = distinct !DILocation(line: 386, column: 39, scope: !174)
!213 = !DILocation(line: 939, column: 35, scope: !201, inlinedAt: !212)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !215, file: !202, line: 480, type: !208)
!215 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17hcad7539fa5e84332E", scope: !203, file: !202, line: 480, type: !216, scopeLine: 480, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !219)
!216 = !DISubroutineType(types: !217)
!217 = !{!208, !208, !218}
!218 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!219 = !{!214, !220}
!220 = !DILocalVariable(name: "count", arg: 2, scope: !215, file: !202, line: 480, type: !218)
!221 = !DILocation(line: 480, column: 32, scope: !215, inlinedAt: !222)
!222 = distinct !DILocation(line: 944, column: 18, scope: !201, inlinedAt: !212)
!223 = !DILocation(line: 480, column: 38, scope: !215, inlinedAt: !222)
!224 = !DILocation(line: 485, column: 18, scope: !215, inlinedAt: !222)
!225 = !DILocation(line: 386, column: 71, scope: !174)
!226 = !DILocation(line: 386, column: 13, scope: !174)
!227 = !DILocation(line: 388, column: 6, scope: !150)
!228 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h3bf15b66805e5830E", scope: !152, file: !151, line: 391, type: !229, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !235)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !162, !231}
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !232, templateParams: !24, identifier: "29c289c37cb012a848cae95b8058e0f")
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !231, file: !2, baseType: !160, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !231, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!235 = !{!236, !237, !238}
!236 = !DILocalVariable(name: "self", arg: 1, scope: !228, file: !151, line: 391, type: !162)
!237 = !DILocalVariable(name: "slice", arg: 2, scope: !228, file: !151, line: 391, type: !231)
!238 = !DILocalVariable(name: "this", scope: !239, file: !151, line: 392, type: !162, align: 8)
!239 = distinct !DILexicalBlock(scope: !228, file: !151, line: 392, column: 9)
!240 = !DILocation(line: 391, column: 33, scope: !228)
!241 = !DILocation(line: 391, column: 39, scope: !228)
!242 = !DILocation(line: 392, column: 13, scope: !239)
!243 = !DILocation(line: 392, column: 20, scope: !228)
!244 = !DILocation(line: 395, column: 13, scope: !239)
!245 = !DILocalVariable(name: "this", arg: 1, scope: !246, file: !184, line: 2220, type: !162)
!246 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut7runtime17h08521c0a71c03fb3E", scope: !247, file: !184, line: 2220, type: !248, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !250)
!247 = !DINamespace(name: "get_unchecked_mut", scope: !152)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !162, !231}
!250 = !{!245, !251}
!251 = !DILocalVariable(name: "slice", arg: 2, scope: !246, file: !184, line: 2220, type: !231)
!252 = !DILocation(line: 2220, column: 39, scope: !246, inlinedAt: !253)
!253 = distinct !DILocation(line: 395, column: 13, scope: !239)
!254 = !DILocation(line: 398, column: 17, scope: !255, inlinedAt: !253)
!255 = !DILexicalBlockFile(scope: !246, file: !151, discriminator: 0)
!256 = !DILocalVariable(name: "self", arg: 1, scope: !257, file: !258, line: 1912, type: !231)
!257 = distinct !DISubprogram(name: "len<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$3len17h7c2fcf013434675bE", scope: !259, file: !258, line: 1912, type: !261, scopeLine: 1912, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !263)
!258 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6116bf171703fb225258c70bc056efbd")
!259 = !DINamespace(name: "{impl#1}", scope: !260)
!260 = !DINamespace(name: "mut_ptr", scope: !205)
!261 = !DISubroutineType(types: !262)
!262 = !{!9, !231}
!263 = !{!256}
!264 = !DILocation(line: 1912, column: 22, scope: !257, inlinedAt: !265)
!265 = distinct !DILocation(line: 398, column: 55, scope: !255, inlinedAt: !253)
!266 = !DILocation(line: 1913, column: 9, scope: !257, inlinedAt: !265)
!267 = !DILocation(line: 398, column: 43, scope: !255, inlinedAt: !253)
!268 = !DILocation(line: 2221, column: 20, scope: !246, inlinedAt: !253)
!269 = !DILocation(line: 2223, column: 21, scope: !246, inlinedAt: !253)
!270 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !258, line: 2048, type: !231)
!271 = distinct !DISubprogram(name: "as_mut_ptr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h9520e52ed42ba947E", scope: !259, file: !258, line: 2048, type: !272, scopeLine: 2048, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !231}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !{!270}
!276 = !DILocation(line: 2048, column: 29, scope: !271, inlinedAt: !277)
!277 = distinct !DILocation(line: 400, column: 43, scope: !239)
!278 = !DILocalVariable(name: "self", arg: 1, scope: !279, file: !258, line: 1041, type: !274)
!279 = distinct !DISubprogram(name: "add<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h69265ab23b23a0abE", scope: !280, file: !258, line: 1041, type: !281, scopeLine: 1041, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !283)
!280 = !DINamespace(name: "{impl#0}", scope: !260)
!281 = !DISubroutineType(types: !282)
!282 = !{!274, !274, !9}
!283 = !{!278, !284}
!284 = !DILocalVariable(name: "count", arg: 2, scope: !279, file: !258, line: 1041, type: !9)
!285 = !DILocation(line: 1041, column: 29, scope: !279, inlinedAt: !286)
!286 = distinct !DILocation(line: 400, column: 43, scope: !239)
!287 = !DILocation(line: 1041, column: 35, scope: !279, inlinedAt: !286)
!288 = !DILocalVariable(name: "self", arg: 1, scope: !289, file: !258, line: 492, type: !274)
!289 = distinct !DISubprogram(name: "offset<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17hf7d9cb46691c87eeE", scope: !280, file: !258, line: 492, type: !290, scopeLine: 492, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{!274, !274, !218}
!292 = !{!288, !293}
!293 = !DILocalVariable(name: "count", arg: 2, scope: !289, file: !258, line: 492, type: !218)
!294 = !DILocation(line: 492, column: 32, scope: !289, inlinedAt: !295)
!295 = distinct !DILocation(line: 1046, column: 18, scope: !279, inlinedAt: !286)
!296 = !DILocation(line: 492, column: 38, scope: !289, inlinedAt: !295)
!297 = !DILocation(line: 499, column: 18, scope: !289, inlinedAt: !295)
!298 = !DILocation(line: 400, column: 79, scope: !239)
!299 = !DILocation(line: 400, column: 13, scope: !239)
!300 = !DILocation(line: 402, column: 6, scope: !228)
!301 = distinct !DISubprogram(name: "index<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h50c7ccbb4e5cc2b5E", scope: !152, file: !151, line: 405, type: !302, scopeLine: 405, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !321)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !162, !304, !308}
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !305, templateParams: !24, identifier: "293077aef2d373bb7f3b6b34114ae20e")
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !304, file: !2, baseType: !160, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !304, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !310, file: !2, size: 192, align: 64, elements: !312, templateParams: !24, identifier: "2183b1f45fb9a8831f25b6cfbd605d2")
!310 = !DINamespace(name: "location", scope: !311)
!311 = !DINamespace(name: "panic", scope: !130)
!312 = !{!313, !319, !320}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !309, file: !2, baseType: !314, size: 128, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !315, templateParams: !24, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !314, file: !2, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !314, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !309, file: !2, baseType: !27, size: 32, align: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !309, file: !2, baseType: !27, size: 32, align: 32, offset: 160)
!321 = !{!322, !323}
!322 = !DILocalVariable(name: "self", arg: 1, scope: !301, file: !151, line: 405, type: !162)
!323 = !DILocalVariable(name: "slice", arg: 2, scope: !301, file: !151, line: 405, type: !304)
!324 = !DILocation(line: 405, column: 14, scope: !301)
!325 = !DILocation(line: 405, column: 20, scope: !301)
!326 = !DILocation(line: 406, column: 12, scope: !301)
!327 = !DILocation(line: 408, column: 19, scope: !301)
!328 = !DILocation(line: 407, column: 13, scope: !301)
!329 = !DILocation(line: 412, column: 20, scope: !301)
!330 = !DILocation(line: 413, column: 6, scope: !301)
!331 = !DILocation(line: 409, column: 13, scope: !301)
!332 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h1e037c7a26aa55bfE", scope: !152, file: !151, line: 416, type: !333, scopeLine: 416, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !339)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !162, !335, !308}
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [bootloader::bootinfo::memory_map::MemoryRegion]", file: !2, size: 128, align: 64, elements: !336, templateParams: !24, identifier: "adf87b300e5dec1f9168c1ea9352cf41")
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !335, file: !2, baseType: !160, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !335, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!339 = !{!340, !341}
!340 = !DILocalVariable(name: "self", arg: 1, scope: !332, file: !151, line: 416, type: !162)
!341 = !DILocalVariable(name: "slice", arg: 2, scope: !332, file: !151, line: 416, type: !335)
!342 = !DILocation(line: 416, column: 18, scope: !332)
!343 = !DILocation(line: 416, column: 24, scope: !332)
!344 = !DILocation(line: 417, column: 12, scope: !332)
!345 = !DILocation(line: 419, column: 19, scope: !332)
!346 = !DILocation(line: 418, column: 13, scope: !332)
!347 = !DILocation(line: 423, column: 24, scope: !332)
!348 = !DILocation(line: 424, column: 6, scope: !332)
!349 = !DILocation(line: 420, column: 13, scope: !332)
!350 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17ha382f3f9149a23daE", scope: !351, file: !151, line: 460, type: !352, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !357)
!351 = !DINamespace(name: "{impl#5}", scope: !153)
!352 = !DISubroutineType(types: !353)
!353 = !{!335, !354, !335, !308}
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !163, file: !2, size: 64, align: 64, elements: !355, templateParams: !168, identifier: "b3bcde04970b5b7c5a8d0a63b78790d6")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !354, file: !2, baseType: !9, size: 64, align: 64)
!357 = !{!358, !359}
!358 = !DILocalVariable(name: "self", arg: 1, scope: !350, file: !151, line: 460, type: !354)
!359 = !DILocalVariable(name: "slice", arg: 2, scope: !350, file: !151, line: 460, type: !335)
!360 = !DILocation(line: 460, column: 18, scope: !350)
!361 = !DILocation(line: 460, column: 24, scope: !350)
!362 = !DILocation(line: 461, column: 9, scope: !350)
!363 = !DILocation(line: 462, column: 6, scope: !350)
!364 = distinct !DISubprogram(name: "get_unchecked_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h71d4f949c7adf5fdE", scope: !365, file: !151, line: 487, type: !366, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !371)
!365 = !DINamespace(name: "{impl#6}", scope: !153)
!366 = !DISubroutineType(types: !367)
!367 = !{!231, !368, !231}
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !163, file: !2, size: 64, align: 64, elements: !369, templateParams: !168, identifier: "a050f29aa4293c414496cbc54442b79a")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !368, file: !2, baseType: !9, size: 64, align: 64)
!371 = !{!372, !373}
!372 = !DILocalVariable(name: "self", arg: 1, scope: !364, file: !151, line: 487, type: !368)
!373 = !DILocalVariable(name: "slice", arg: 2, scope: !364, file: !151, line: 487, type: !231)
!374 = !DILocation(line: 487, column: 33, scope: !364)
!375 = !DILocation(line: 487, column: 39, scope: !364)
!376 = !DILocation(line: 1912, column: 22, scope: !257, inlinedAt: !377)
!377 = distinct !DILocation(line: 489, column: 31, scope: !364)
!378 = !DILocation(line: 1913, column: 9, scope: !257, inlinedAt: !377)
!379 = !DILocation(line: 489, column: 18, scope: !364)
!380 = !DILocation(line: 490, column: 6, scope: !364)
!381 = distinct !DISubprogram(name: "index_mut<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h0daf0291228c8cd2E", scope: !365, file: !151, line: 502, type: !382, scopeLine: 502, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{!335, !368, !335, !308}
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "self", arg: 1, scope: !381, file: !151, line: 502, type: !368)
!386 = !DILocalVariable(name: "slice", arg: 2, scope: !381, file: !151, line: 502, type: !335)
!387 = !DILocation(line: 502, column: 18, scope: !381)
!388 = !DILocation(line: 502, column: 24, scope: !381)
!389 = !DILocation(line: 503, column: 12, scope: !381)
!390 = !DILocation(line: 507, column: 24, scope: !381)
!391 = !DILocation(line: 508, column: 6, scope: !381)
!392 = !DILocation(line: 504, column: 13, scope: !381)
!393 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::FrameRange>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h191c94026f662477E", scope: !395, file: !394, line: 2372, type: !396, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !454, retainedNodes: !451)
!394 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1922c92fc1c52c1aaa242780ad5ab5eb")
!395 = !DINamespace(name: "{impl#59}", scope: !129)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !416, !417}
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !399, file: !2, size: 8, align: 8, elements: !400, templateParams: !24, identifier: "4c95ba1445c8749be964fed87063fa1a")
!399 = !DINamespace(name: "result", scope: !130)
!400 = !{!401}
!401 = !DICompositeType(tag: DW_TAG_variant_part, scope: !398, file: !2, size: 8, align: 8, elements: !402, templateParams: !24, identifier: "1481463a02733c1d81f5d0db4517da03", discriminator: !415)
!402 = !{!403, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !401, file: !2, baseType: !404, size: 8, align: 8, extraData: i64 0)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !398, file: !2, size: 8, align: 8, elements: !405, templateParams: !407, identifier: "6a288024f16a7eea3a84e465d8c39c10")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !404, file: !2, baseType: !7, align: 8, offset: 8)
!407 = !{!408, !409}
!408 = !DITemplateTypeParameter(name: "T", type: !7)
!409 = !DITemplateTypeParameter(name: "E", type: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !129, file: !2, align: 8, elements: !24, identifier: "3c92434e0ee530bed77dbdff4f2052fd")
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !401, file: !2, baseType: !412, size: 8, align: 8, extraData: i64 1)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !398, file: !2, size: 8, align: 8, elements: !413, templateParams: !407, identifier: "88e99fb8b05017cacaf7404ae5198389")
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !412, file: !2, baseType: !410, align: 8, offset: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !2, baseType: !119, size: 8, align: 8, flags: DIFlagArtificial)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::FrameRange", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !418, size: 64, align: 64, dwarfAddressSpace: 0)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !129, file: !2, size: 512, align: 64, elements: !419, templateParams: !24, identifier: "8df43b92d7abc7827433e87766d6ad15")
!419 = !{!420, !421, !423, !424, !439, !440}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !418, file: !2, baseType: !27, size: 32, align: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !418, file: !2, baseType: !422, size: 32, align: 32, offset: 416)
!422 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !418, file: !2, baseType: !126, size: 8, align: 8, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !418, file: !2, baseType: !425, size: 128, align: 64, offset: 128)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !426, file: !2, size: 128, align: 64, elements: !427, templateParams: !24, identifier: "5ea95f167c8a3208bf89a1e7847a2b39")
!426 = !DINamespace(name: "option", scope: !130)
!427 = !{!428}
!428 = !DICompositeType(tag: DW_TAG_variant_part, scope: !425, file: !2, size: 128, align: 64, elements: !429, templateParams: !24, identifier: "28c32283e20226d8665ec7b7d900b7af", discriminator: !438)
!429 = !{!430, !434}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !428, file: !2, baseType: !431, size: 128, align: 64, extraData: i64 0)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !425, file: !2, size: 128, align: 64, elements: !24, templateParams: !432, identifier: "8447cfb4e1834c48c85dbd0f8edf7c6e")
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !9)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !428, file: !2, baseType: !435, size: 128, align: 64, extraData: i64 1)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !425, file: !2, size: 128, align: 64, elements: !436, templateParams: !432, identifier: "983026280ee321fd282b1d92b3927a3")
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !435, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !425, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !418, file: !2, baseType: !425, size: 128, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !418, file: !2, baseType: !441, size: 128, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !442, templateParams: !24, identifier: "303a00edefbc81bcddaeb2720dbd365e")
!442 = !{!443, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !441, file: !2, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64, dwarfAddressSpace: 0)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "c85ba49beb4df03e7184fab315d9d3b8")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !441, file: !2, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !448, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 3, lowerBound: 0)
!451 = !{!452, !453}
!452 = !DILocalVariable(name: "self", arg: 1, scope: !393, file: !394, line: 2372, type: !416)
!453 = !DILocalVariable(name: "f", arg: 2, scope: !393, file: !394, line: 2372, type: !417)
!454 = !{!455}
!455 = !DITemplateTypeParameter(name: "T", type: !19)
!456 = !DILocation(line: 2372, column: 20, scope: !393)
!457 = !DILocation(line: 2372, column: 27, scope: !393)
!458 = !DILocation(line: 2372, column: 71, scope: !393)
!459 = !{i64 8}
!460 = !DILocation(line: 2372, column: 62, scope: !393)
!461 = !DILocation(line: 2372, column: 84, scope: !393)
!462 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::TlsTemplate>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3302d08790677e6eE", scope: !395, file: !394, line: 2372, type: !463, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !469, retainedNodes: !466)
!463 = !DISubroutineType(types: !464)
!464 = !{!398, !465, !417}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::TlsTemplate", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !{!467, !468}
!467 = !DILocalVariable(name: "self", arg: 1, scope: !462, file: !394, line: 2372, type: !465)
!468 = !DILocalVariable(name: "f", arg: 2, scope: !462, file: !394, line: 2372, type: !417)
!469 = !{!470}
!470 = !DITemplateTypeParameter(name: "T", type: !105)
!471 = !DILocation(line: 2372, column: 20, scope: !462)
!472 = !DILocation(line: 2372, column: 27, scope: !462)
!473 = !DILocation(line: 2372, column: 71, scope: !462)
!474 = !DILocation(line: 2372, column: 62, scope: !462)
!475 = !DILocation(line: 2372, column: 84, scope: !462)
!476 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3f9f3e7c123821d9E", scope: !395, file: !394, line: 2372, type: !477, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !480)
!477 = !DISubroutineType(types: !478)
!478 = !{!398, !479, !417}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegion", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!480 = !{!481, !482}
!481 = !DILocalVariable(name: "self", arg: 1, scope: !476, file: !394, line: 2372, type: !479)
!482 = !DILocalVariable(name: "f", arg: 2, scope: !476, file: !394, line: 2372, type: !417)
!483 = !DILocation(line: 2372, column: 20, scope: !476)
!484 = !DILocation(line: 2372, column: 27, scope: !476)
!485 = !DILocation(line: 2372, column: 71, scope: !476)
!486 = !DILocation(line: 2372, column: 62, scope: !476)
!487 = !DILocation(line: 2372, column: 84, scope: !476)
!488 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryMap>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6d0a934c028c7de0E", scope: !395, file: !394, line: 2372, type: !489, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !495, retainedNodes: !492)
!489 = !DISubroutineType(types: !490)
!490 = !{!398, !491, !417}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryMap", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!492 = !{!493, !494}
!493 = !DILocalVariable(name: "self", arg: 1, scope: !488, file: !394, line: 2372, type: !491)
!494 = !DILocalVariable(name: "f", arg: 2, scope: !488, file: !394, line: 2372, type: !417)
!495 = !{!496}
!496 = !DITemplateTypeParameter(name: "T", type: !89)
!497 = !DILocation(line: 2372, column: 20, scope: !488)
!498 = !DILocation(line: 2372, column: 27, scope: !488)
!499 = !DILocation(line: 2372, column: 71, scope: !488)
!500 = !DILocation(line: 2372, column: 62, scope: !488)
!501 = !DILocation(line: 2372, column: 84, scope: !488)
!502 = distinct !DISubprogram(name: "fmt<bootloader::bootinfo::memory_map::MemoryRegionType>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9308fe0ec8ba9eb4E", scope: !395, file: !394, line: 2372, type: !503, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !509, retainedNodes: !506)
!503 = !DISubroutineType(types: !504)
!504 = !{!398, !505, !417}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&bootloader::bootinfo::memory_map::MemoryRegionType", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !{!507, !508}
!507 = !DILocalVariable(name: "self", arg: 1, scope: !502, file: !394, line: 2372, type: !505)
!508 = !DILocalVariable(name: "f", arg: 2, scope: !502, file: !394, line: 2372, type: !417)
!509 = !{!510}
!510 = !DITemplateTypeParameter(name: "T", type: !26)
!511 = !DILocation(line: 2372, column: 20, scope: !502)
!512 = !DILocation(line: 2372, column: 27, scope: !502)
!513 = !DILocation(line: 2372, column: 71, scope: !502)
!514 = !{i64 4}
!515 = !DILocation(line: 2372, column: 62, scope: !502)
!516 = !DILocation(line: 2372, column: 84, scope: !502)
!517 = distinct !DISubprogram(name: "is_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics17is_nonoverlapping17h2bf53ab67e1db900E", scope: !518, file: !184, line: 2255, type: !519, scopeLine: 2255, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !522)
!518 = !DINamespace(name: "intrinsics", scope: !130)
!519 = !DISubroutineType(types: !520)
!520 = !{!521, !208, !208, !9}
!521 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!522 = !{!523, !524, !525, !526, !528, !530, !532}
!523 = !DILocalVariable(name: "src", arg: 1, scope: !517, file: !184, line: 2255, type: !208)
!524 = !DILocalVariable(name: "dst", arg: 2, scope: !517, file: !184, line: 2255, type: !208)
!525 = !DILocalVariable(name: "count", arg: 3, scope: !517, file: !184, line: 2255, type: !9)
!526 = !DILocalVariable(name: "src_usize", scope: !527, file: !184, line: 2256, type: !9, align: 8)
!527 = distinct !DILexicalBlock(scope: !517, file: !184, line: 2256, column: 5)
!528 = !DILocalVariable(name: "dst_usize", scope: !529, file: !184, line: 2257, type: !9, align: 8)
!529 = distinct !DILexicalBlock(scope: !527, file: !184, line: 2257, column: 5)
!530 = !DILocalVariable(name: "size", scope: !531, file: !184, line: 2258, type: !9, align: 8)
!531 = distinct !DILexicalBlock(scope: !529, file: !184, line: 2258, column: 5)
!532 = !DILocalVariable(name: "diff", scope: !533, file: !184, line: 2259, type: !9, align: 8)
!533 = distinct !DILexicalBlock(scope: !531, file: !184, line: 2259, column: 5)
!534 = !DILocation(line: 2255, column: 36, scope: !517)
!535 = !DILocation(line: 2255, column: 51, scope: !517)
!536 = !DILocation(line: 2255, column: 66, scope: !517)
!537 = !DILocation(line: 2259, column: 9, scope: !533)
!538 = !DILocalVariable(name: "self", arg: 1, scope: !539, file: !202, line: 205, type: !208)
!539 = distinct !DISubprogram(name: "addr<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4addr17h3463928fbac480d1E", scope: !203, file: !202, line: 205, type: !540, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!9, !208}
!542 = !{!538}
!543 = !DILocation(line: 205, column: 17, scope: !539, inlinedAt: !544)
!544 = distinct !DILocation(line: 2256, column: 21, scope: !517)
!545 = !DILocation(line: 212, column: 18, scope: !539, inlinedAt: !544)
!546 = !DILocation(line: 2256, column: 21, scope: !517)
!547 = !DILocation(line: 2256, column: 9, scope: !527)
!548 = !DILocation(line: 205, column: 17, scope: !539, inlinedAt: !549)
!549 = distinct !DILocation(line: 2257, column: 21, scope: !527)
!550 = !DILocation(line: 212, column: 18, scope: !539, inlinedAt: !549)
!551 = !DILocation(line: 2257, column: 21, scope: !527)
!552 = !DILocation(line: 2257, column: 9, scope: !529)
!553 = !DILocation(line: 2258, column: 16, scope: !529)
!554 = !DILocation(line: 2258, column: 9, scope: !531)
!555 = !DILocation(line: 2259, column: 19, scope: !531)
!556 = !DILocation(line: 2259, column: 74, scope: !531)
!557 = !DILocation(line: 2259, column: 43, scope: !531)
!558 = !DILocation(line: 2259, column: 16, scope: !531)
!559 = !DILocation(line: 2262, column: 5, scope: !533)
!560 = !DILocation(line: 2263, column: 2, scope: !517)
!561 = distinct !DISubprogram(name: "copy_nonoverlapping<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h5b68f14a857bbe6aE", scope: !518, file: !184, line: 2355, type: !562, scopeLine: 2355, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !208, !274, !9}
!564 = !{!565, !566, !567}
!565 = !DILocalVariable(name: "src", arg: 1, scope: !561, file: !184, line: 2355, type: !208)
!566 = !DILocalVariable(name: "dst", arg: 2, scope: !561, file: !184, line: 2355, type: !274)
!567 = !DILocalVariable(name: "count", arg: 3, scope: !561, file: !184, line: 2355, type: !9)
!568 = !DILocation(line: 2355, column: 44, scope: !561)
!569 = !DILocation(line: 2355, column: 59, scope: !561)
!570 = !DILocation(line: 2355, column: 72, scope: !561)
!571 = !DILocation(line: 2364, column: 9, scope: !561)
!572 = !DILocalVariable(name: "src", arg: 1, scope: !573, file: !184, line: 2220, type: !208)
!573 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17h6c9c5a17abb99a21E", scope: !574, file: !184, line: 2220, type: !562, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !575)
!574 = !DINamespace(name: "copy_nonoverlapping", scope: !518)
!575 = !{!572, !576, !577}
!576 = !DILocalVariable(name: "dst", arg: 2, scope: !573, file: !184, line: 2220, type: !274)
!577 = !DILocalVariable(name: "count", arg: 3, scope: !573, file: !184, line: 2220, type: !9)
!578 = !DILocation(line: 2220, column: 39, scope: !573, inlinedAt: !579)
!579 = distinct !DILocation(line: 2364, column: 9, scope: !561)
!580 = !DILocation(line: 2368, column: 13, scope: !573, inlinedAt: !579)
!581 = !DILocation(line: 2369, column: 20, scope: !573, inlinedAt: !579)
!582 = !DILocation(line: 2370, column: 20, scope: !573, inlinedAt: !579)
!583 = !DILocation(line: 2221, column: 20, scope: !573, inlinedAt: !579)
!584 = !DILocation(line: 2223, column: 21, scope: !573, inlinedAt: !579)
!585 = !DILocation(line: 2372, column: 9, scope: !561)
!586 = !DILocation(line: 2374, column: 2, scope: !561)
!587 = distinct !DISubprogram(name: "copy_nonoverlapping<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17hbf460b23e3b7f8e7E", scope: !518, file: !184, line: 2355, type: !588, scopeLine: 2355, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !432, retainedNodes: !592)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !590, !591, !9}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!592 = !{!593, !594, !595}
!593 = !DILocalVariable(name: "src", arg: 1, scope: !587, file: !184, line: 2355, type: !590)
!594 = !DILocalVariable(name: "dst", arg: 2, scope: !587, file: !184, line: 2355, type: !591)
!595 = !DILocalVariable(name: "count", arg: 3, scope: !587, file: !184, line: 2355, type: !9)
!596 = !DILocation(line: 2355, column: 44, scope: !587)
!597 = !DILocation(line: 2355, column: 59, scope: !587)
!598 = !DILocation(line: 2355, column: 72, scope: !587)
!599 = !DILocation(line: 2364, column: 9, scope: !587)
!600 = !DILocalVariable(name: "src", arg: 1, scope: !601, file: !184, line: 2220, type: !590)
!601 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping7runtime17hca755d401947a51aE", scope: !574, file: !184, line: 2220, type: !588, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !432, retainedNodes: !602)
!602 = !{!600, !603, !604}
!603 = !DILocalVariable(name: "dst", arg: 2, scope: !601, file: !184, line: 2220, type: !591)
!604 = !DILocalVariable(name: "count", arg: 3, scope: !601, file: !184, line: 2220, type: !9)
!605 = !DILocation(line: 2220, column: 39, scope: !601, inlinedAt: !606)
!606 = distinct !DILocation(line: 2364, column: 9, scope: !587)
!607 = !DILocation(line: 2368, column: 13, scope: !601, inlinedAt: !606)
!608 = !DILocation(line: 2369, column: 20, scope: !601, inlinedAt: !606)
!609 = !DILocation(line: 2370, column: 20, scope: !601, inlinedAt: !606)
!610 = !DILocation(line: 2221, column: 20, scope: !601, inlinedAt: !606)
!611 = !DILocation(line: 2223, column: 21, scope: !601, inlinedAt: !606)
!612 = !DILocation(line: 2372, column: 9, scope: !587)
!613 = !DILocation(line: 2374, column: 2, scope: !587)
!614 = distinct !DISubprogram(name: "is_aligned_and_not_null<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h191fc7491f4eaf64E", scope: !518, file: !184, line: 2239, type: !615, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{!521, !208}
!617 = !{!618}
!618 = !DILocalVariable(name: "ptr", arg: 1, scope: !614, file: !184, line: 2239, type: !208)
!619 = !DILocation(line: 2239, column: 42, scope: !614)
!620 = !DILocation(line: 2240, column: 6, scope: !614)
!621 = !DILocation(line: 2240, column: 5, scope: !614)
!622 = !DILocation(line: 2240, column: 23, scope: !614)
!623 = !DILocation(line: 2241, column: 2, scope: !614)
!624 = distinct !DISubprogram(name: "is_aligned_and_not_null<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core10intrinsics23is_aligned_and_not_null17h3ae8b15e74e9fc8bE", scope: !518, file: !184, line: 2239, type: !625, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !640, retainedNodes: !638)
!625 = !DISubroutineType(types: !626)
!626 = !{!521, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !629, file: !2, size: 192, align: 64, elements: !631, templateParams: !175, identifier: "cace2e75f72d253871af41fbe3d8ac20")
!629 = !DINamespace(name: "maybe_uninit", scope: !630)
!630 = !DINamespace(name: "mem", scope: !130)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !628, file: !2, baseType: !7, align: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !628, file: !2, baseType: !634, size: 192, align: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !635, file: !2, size: 192, align: 64, elements: !636, templateParams: !175, identifier: "1486a72cbf824888bb2a04de83bdcc3f")
!635 = !DINamespace(name: "manually_drop", scope: !630)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !634, file: !2, baseType: !13, size: 192, align: 64)
!638 = !{!639}
!639 = !DILocalVariable(name: "ptr", arg: 1, scope: !624, file: !184, line: 2239, type: !627)
!640 = !{!641}
!641 = !DITemplateTypeParameter(name: "T", type: !628)
!642 = !DILocation(line: 2239, column: 42, scope: !624)
!643 = !DILocation(line: 2240, column: 6, scope: !624)
!644 = !DILocation(line: 2240, column: 5, scope: !624)
!645 = !DILocation(line: 2240, column: 23, scope: !624)
!646 = !DILocation(line: 2241, column: 2, scope: !624)
!647 = distinct !DISubprogram(name: "is_valid_allocation_size<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics24is_valid_allocation_size17he3e7a21271b492f4E", scope: !518, file: !184, line: 2245, type: !648, scopeLine: 2245, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !650)
!648 = !DISubroutineType(types: !649)
!649 = !{!521, !9}
!650 = !{!651, !652}
!651 = !DILocalVariable(name: "len", arg: 1, scope: !647, file: !184, line: 2245, type: !9)
!652 = !DILocalVariable(name: "max_len", scope: !653, file: !184, line: 2246, type: !9, align: 8)
!653 = distinct !DILexicalBlock(scope: !647, file: !184, line: 2246, column: 5)
!654 = !DILocation(line: 2245, column: 43, scope: !647)
!655 = !DILocation(line: 2246, column: 19, scope: !647)
!656 = !DILocation(line: 2246, column: 9, scope: !653)
!657 = !DILocation(line: 2250, column: 5, scope: !653)
!658 = !DILocation(line: 2251, column: 2, scope: !647)
!659 = distinct !DISubprogram(name: "copy<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy17h2367f2f1a6a57e90E", scope: !518, file: !184, line: 2445, type: !562, scopeLine: 2445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !660)
!660 = !{!661, !662, !663}
!661 = !DILocalVariable(name: "src", arg: 1, scope: !659, file: !184, line: 2445, type: !208)
!662 = !DILocalVariable(name: "dst", arg: 2, scope: !659, file: !184, line: 2445, type: !274)
!663 = !DILocalVariable(name: "count", arg: 3, scope: !659, file: !184, line: 2445, type: !9)
!664 = !DILocation(line: 2445, column: 29, scope: !659)
!665 = !DILocation(line: 2445, column: 44, scope: !659)
!666 = !DILocation(line: 2445, column: 57, scope: !659)
!667 = !DILocation(line: 2453, column: 9, scope: !659)
!668 = !DILocalVariable(name: "src", arg: 1, scope: !669, file: !184, line: 2220, type: !208)
!669 = distinct !DISubprogram(name: "runtime<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core10intrinsics4copy7runtime17h67399965b8406bbeE", scope: !670, file: !184, line: 2220, type: !671, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !673)
!670 = !DINamespace(name: "copy", scope: !518)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !208, !274}
!673 = !{!668, !674}
!674 = !DILocalVariable(name: "dst", arg: 2, scope: !669, file: !184, line: 2220, type: !274)
!675 = !DILocation(line: 2220, column: 39, scope: !669, inlinedAt: !676)
!676 = distinct !DILocation(line: 2453, column: 9, scope: !659)
!677 = !DILocation(line: 2456, column: 13, scope: !669, inlinedAt: !676)
!678 = !DILocation(line: 2456, column: 45, scope: !669, inlinedAt: !676)
!679 = !DILocation(line: 2221, column: 20, scope: !669, inlinedAt: !676)
!680 = !DILocation(line: 2223, column: 21, scope: !669, inlinedAt: !676)
!681 = !DILocation(line: 2458, column: 9, scope: !659)
!682 = !DILocation(line: 2460, column: 2, scope: !659)
!683 = distinct !DISubprogram(name: "copy<usize>", linkageName: "_ZN4core10intrinsics4copy17ha94ac2453a8a0b73E", scope: !518, file: !184, line: 2445, type: !588, scopeLine: 2445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !432, retainedNodes: !684)
!684 = !{!685, !686, !687}
!685 = !DILocalVariable(name: "src", arg: 1, scope: !683, file: !184, line: 2445, type: !590)
!686 = !DILocalVariable(name: "dst", arg: 2, scope: !683, file: !184, line: 2445, type: !591)
!687 = !DILocalVariable(name: "count", arg: 3, scope: !683, file: !184, line: 2445, type: !9)
!688 = !DILocation(line: 2445, column: 29, scope: !683)
!689 = !DILocation(line: 2445, column: 44, scope: !683)
!690 = !DILocation(line: 2445, column: 57, scope: !683)
!691 = !DILocation(line: 2453, column: 9, scope: !683)
!692 = !DILocalVariable(name: "src", arg: 1, scope: !693, file: !184, line: 2220, type: !590)
!693 = distinct !DISubprogram(name: "runtime<usize>", linkageName: "_ZN4core10intrinsics4copy7runtime17h40621b13e6da214eE", scope: !670, file: !184, line: 2220, type: !694, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !432, retainedNodes: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !590, !591}
!696 = !{!692, !697}
!697 = !DILocalVariable(name: "dst", arg: 2, scope: !693, file: !184, line: 2220, type: !591)
!698 = !DILocation(line: 2220, column: 39, scope: !693, inlinedAt: !699)
!699 = distinct !DILocation(line: 2453, column: 9, scope: !683)
!700 = !DILocation(line: 2456, column: 13, scope: !693, inlinedAt: !699)
!701 = !DILocation(line: 2456, column: 45, scope: !693, inlinedAt: !699)
!702 = !DILocation(line: 2221, column: 20, scope: !693, inlinedAt: !699)
!703 = !DILocation(line: 2223, column: 21, scope: !693, inlinedAt: !699)
!704 = !DILocation(line: 2458, column: 9, scope: !683)
!705 = !DILocation(line: 2460, column: 2, scope: !683)
!706 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls48_$LT$impl$u20$core..cmp..Ord$u20$for$u20$u64$GT$3cmp17hb3e5181ebc2e2481E", scope: !708, file: !707, line: 1448, type: !710, scopeLine: 1448, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !712)
!707 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "9d823ae75a5b7169eaf27a73b06b88d2")
!708 = !DINamespace(name: "{impl#63}", scope: !709)
!709 = !DINamespace(name: "impls", scope: !137)
!710 = !DISubroutineType(types: !711)
!711 = !{!136, !70, !70}
!712 = !{!713, !714}
!713 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !707, line: 1448, type: !70)
!714 = !DILocalVariable(name: "other", arg: 2, scope: !706, file: !707, line: 1448, type: !70)
!715 = !DILocation(line: 1448, column: 24, scope: !706)
!716 = !DILocation(line: 1448, column: 31, scope: !706)
!717 = !DILocation(line: 1451, column: 24, scope: !706)
!718 = !DILocation(line: 1451, column: 32, scope: !706)
!719 = !DILocation(line: 1452, column: 29, scope: !706)
!720 = !DILocation(line: 1452, column: 38, scope: !706)
!721 = !DILocation(line: 1451, column: 41, scope: !706)
!722 = !DILocation(line: 1451, column: 21, scope: !706)
!723 = !DILocation(line: 1454, column: 18, scope: !706)
!724 = !{i8 -1, i8 2}
!725 = !DILocation(line: 1453, column: 28, scope: !706)
!726 = !DILocation(line: 1452, column: 26, scope: !706)
!727 = !DILocation(line: 1452, column: 47, scope: !706)
!728 = distinct !DISubprogram(name: "new_lower_hex<u64>", linkageName: "_ZN4core3fmt10ArgumentV113new_lower_hex17h3d7db7619fde135dE", scope: !729, file: !394, line: 322, type: !739, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !743, retainedNodes: !741)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !129, file: !2, size: 128, align: 64, elements: !730, templateParams: !24, identifier: "33436db152b82e5fceeb5b23d420e0c")
!730 = !{!731, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !729, file: !2, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !733, size: 64, align: 64, dwarfAddressSpace: 0)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !734, file: !2, align: 8, elements: !24, identifier: "e4a76201e64240d38c1c72aa4d4b02f4")
!734 = !DINamespace(name: "{extern#0}", scope: !129)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !729, file: !2, baseType: !736, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !737, size: 64, align: 64, dwarfAddressSpace: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!398, !732, !417}
!739 = !DISubroutineType(types: !740)
!740 = !{!729, !70}
!741 = !{!742}
!742 = !DILocalVariable(name: "x", arg: 1, scope: !728, file: !394, line: 322, type: !70)
!743 = !{!744}
!744 = !DITemplateTypeParameter(name: "T", type: !22)
!745 = !DILocation(line: 322, column: 30, scope: !728)
!746 = !DILocation(line: 323, column: 13, scope: !728)
!747 = !DILocation(line: 324, column: 10, scope: !728)
!748 = distinct !DISubprogram(name: "entries<&bootloader::bootinfo::memory_map::MemoryRegion, core::slice::iter::Iter<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hfb75d8868b1a8362E", scope: !750, file: !749, line: 627, type: !759, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !783, retainedNodes: !776)
!749 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a909d1cde985fb0d953605fd1b0e0e2")
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !751, file: !2, size: 128, align: 64, elements: !752, templateParams: !24, identifier: "8324c3fc5deaccc99fd3ad4046a95f13")
!751 = !DINamespace(name: "builders", scope: !129)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !750, file: !2, baseType: !754, size: 128, align: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !751, file: !2, size: 128, align: 64, elements: !755, templateParams: !24, identifier: "8fc218936a72650f64c4b1f1aec0863c")
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !754, file: !2, baseType: !417, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !754, file: !2, baseType: !398, size: 8, align: 8, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !754, file: !2, baseType: !521, size: 8, align: 8, offset: 72)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !761, !762}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !750, size: 64, align: 64, dwarfAddressSpace: 0)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !763, file: !2, size: 128, align: 64, elements: !764, templateParams: !175, identifier: "fff60c4a79d622fed94ff6ecc4373494")
!763 = !DINamespace(name: "iter", scope: !154)
!764 = !{!765, !770, !771}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !762, file: !2, baseType: !766, size: 64, align: 64, offset: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bootloader::bootinfo::memory_map::MemoryRegion>", scope: !767, file: !2, size: 64, align: 64, elements: !768, templateParams: !175, identifier: "4c0f5a059cfaee916deb2f093c022d5d")
!767 = !DINamespace(name: "non_null", scope: !205)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !766, file: !2, baseType: !208, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !762, file: !2, baseType: !208, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !762, file: !2, baseType: !772, align: 8)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bootloader::bootinfo::memory_map::MemoryRegion>", scope: !773, file: !2, align: 8, elements: !24, templateParams: !774, identifier: "1a50bba3d91c1cffe8ce01a3b4331243")
!773 = !DINamespace(name: "marker", scope: !130)
!774 = !{!775}
!775 = !DITemplateTypeParameter(name: "T", type: !12)
!776 = !{!777, !778, !779, !781}
!777 = !DILocalVariable(name: "self", arg: 1, scope: !748, file: !749, line: 627, type: !761)
!778 = !DILocalVariable(name: "entries", arg: 2, scope: !748, file: !749, line: 627, type: !762)
!779 = !DILocalVariable(name: "iter", scope: !780, file: !749, line: 632, type: !762, align: 8)
!780 = distinct !DILexicalBlock(scope: !748, file: !749, line: 632, column: 9)
!781 = !DILocalVariable(name: "entry", scope: !782, file: !749, line: 632, type: !12, align: 8)
!782 = distinct !DILexicalBlock(scope: !780, file: !749, line: 632, column: 30)
!783 = !{!784, !785}
!784 = !DITemplateTypeParameter(name: "D", type: !12)
!785 = !DITemplateTypeParameter(name: "I", type: !762)
!786 = !DILocation(line: 627, column: 26, scope: !748)
!787 = !DILocation(line: 627, column: 37, scope: !748)
!788 = !DILocation(line: 632, column: 22, scope: !780)
!789 = !DILocation(line: 632, column: 13, scope: !782)
!790 = !DILocation(line: 632, column: 22, scope: !748)
!791 = !DILocation(line: 632, column: 9, scope: !780)
!792 = !DILocation(line: 636, column: 6, scope: !748)
!793 = !DILocation(line: 632, column: 13, scope: !780)
!794 = !DILocation(line: 633, column: 13, scope: !782)
!795 = !DILocation(line: 634, column: 9, scope: !780)
!796 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h79e185dadb0b1171E", scope: !797, file: !394, line: 414, type: !856, scopeLine: 414, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !861)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !129, file: !2, size: 384, align: 64, elements: !798, templateParams: !24, identifier: "edb1851fc747cef83eb18ad3e64b6598")
!798 = !{!799, !805, !850}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !797, file: !2, baseType: !800, size: 128, align: 64, offset: 128)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !801, templateParams: !24, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!801 = !{!802, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !800, file: !2, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64, dwarfAddressSpace: 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !800, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !797, file: !2, baseType: !806, size: 128, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !426, file: !2, size: 128, align: 64, elements: !807, templateParams: !24, identifier: "842e9084c696c648f9d7d66c601e78c")
!807 = !{!808}
!808 = !DICompositeType(tag: DW_TAG_variant_part, scope: !806, file: !2, size: 128, align: 64, elements: !809, templateParams: !24, identifier: "eb4b44296be1d4f33b7130dc47bbdc", discriminator: !849)
!809 = !{!810, !845}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !808, file: !2, baseType: !811, size: 128, align: 64, extraData: i64 0)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !806, file: !2, size: 128, align: 64, elements: !24, templateParams: !812, identifier: "f8ea1aa01bd89cbb857a75f3da2a43ce")
!812 = !{!813}
!813 = !DITemplateTypeParameter(name: "T", type: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !815, templateParams: !24, identifier: "6dc2a74510b72237c2315ef26cb777cf")
!815 = !{!816, !844}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !814, file: !2, baseType: !817, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !127, file: !2, size: 448, align: 64, elements: !819, templateParams: !24, identifier: "4bbdcd222659ca2617678dcc6ad04958")
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !818, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !818, file: !2, baseType: !822, size: 384, align: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !127, file: !2, size: 384, align: 64, elements: !823, templateParams: !24, identifier: "8821451886939f0c147abcb02c81012e")
!823 = !{!824, !825, !826, !827, !843}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !822, file: !2, baseType: !422, size: 32, align: 32, offset: 288)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !822, file: !2, baseType: !126, size: 8, align: 8, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !822, file: !2, baseType: !27, size: 32, align: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !822, file: !2, baseType: !828, size: 128, align: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !127, file: !2, size: 128, align: 64, elements: !829, templateParams: !24, identifier: "920ef6d54605e6b7a9557e1df16c211b")
!829 = !{!830}
!830 = !DICompositeType(tag: DW_TAG_variant_part, scope: !828, file: !2, size: 128, align: 64, elements: !831, templateParams: !24, identifier: "96ed5a652dd811e692bde8aafa2136dd", discriminator: !842)
!831 = !{!832, !836, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !830, file: !2, baseType: !833, size: 128, align: 64, extraData: i64 0)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !828, file: !2, size: 128, align: 64, elements: !834, templateParams: !24, identifier: "b7baf6299bb3801984e8a8c2fd827b1f")
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !833, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !830, file: !2, baseType: !837, size: 128, align: 64, extraData: i64 1)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !828, file: !2, size: 128, align: 64, elements: !838, templateParams: !24, identifier: "68d2d5308a205350fa3862a17eb67e5a")
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !837, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !830, file: !2, baseType: !841, size: 128, align: 64, extraData: i64 2)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !828, file: !2, size: 128, align: 64, elements: !24, identifier: "939fae32b28d1ee163eef0cac74d4ac0")
!842 = !DIDerivedType(tag: DW_TAG_member, scope: !828, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !822, file: !2, baseType: !828, size: 128, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !814, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !808, file: !2, baseType: !846, size: 128, align: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !806, file: !2, size: 128, align: 64, elements: !847, templateParams: !812, identifier: "a1ce7459cae7c3fd2d712a4e7a034927")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !814, size: 128, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, scope: !806, file: !2, baseType: !22, size: 64, align: 64, flags: DIFlagArtificial)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !797, file: !2, baseType: !851, size: 128, align: 64, offset: 256)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !852, templateParams: !24, identifier: "795733086a9ffc9e0ce50376fd9375")
!852 = !{!853, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !851, file: !2, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64, dwarfAddressSpace: 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !851, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!797, !800, !851, !814, !858}
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !129, file: !2, align: 8, elements: !859, templateParams: !24, identifier: "331d42bb12cc882e565f2c83020a10cc")
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !858, file: !2, baseType: !7, align: 8)
!861 = !{!862, !863, !864, !865}
!862 = !DILocalVariable(name: "pieces", arg: 1, scope: !796, file: !394, line: 415, type: !800)
!863 = !DILocalVariable(name: "args", arg: 2, scope: !796, file: !394, line: 416, type: !851)
!864 = !DILocalVariable(name: "fmt", arg: 3, scope: !796, file: !394, line: 417, type: !814)
!865 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !796, file: !394, line: 418, type: !858)
!866 = !DILocation(line: 415, column: 9, scope: !796)
!867 = !DILocation(line: 416, column: 9, scope: !796)
!868 = !DILocation(line: 417, column: 9, scope: !796)
!869 = !DILocation(line: 418, column: 9, scope: !796)
!870 = !DILocation(line: 420, column: 34, scope: !796)
!871 = !DILocation(line: 420, column: 9, scope: !796)
!872 = !DILocation(line: 421, column: 6, scope: !796)
!873 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117he0ff5f68815cdf51E", scope: !797, file: !394, line: 394, type: !874, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !876)
!874 = !DISubroutineType(types: !875)
!875 = !{!797, !800, !851}
!876 = !{!877, !878}
!877 = !DILocalVariable(name: "pieces", arg: 1, scope: !873, file: !394, line: 394, type: !800)
!878 = !DILocalVariable(name: "args", arg: 2, scope: !873, file: !394, line: 394, type: !851)
!879 = !DILocation(line: 394, column: 25, scope: !873)
!880 = !DILocation(line: 394, column: 53, scope: !873)
!881 = !DILocation(line: 395, column: 12, scope: !873)
!882 = !DILocation(line: 395, column: 56, scope: !873)
!883 = !DILocation(line: 395, column: 41, scope: !873)
!884 = !DILocation(line: 398, column: 34, scope: !873)
!885 = !DILocation(line: 398, column: 9, scope: !873)
!886 = !DILocation(line: 399, column: 6, scope: !873)
!887 = !DILocation(line: 396, column: 13, scope: !873)
!888 = distinct !DISubprogram(name: "swap_simple<core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>>", linkageName: "_ZN4core3mem11swap_simple17h3ba34396ece90482E", scope: !630, file: !889, line: 757, type: !890, scopeLine: 757, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !640, retainedNodes: !893)
!889 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7de2de7be7920819122830908bff06a5")
!890 = !DISubroutineType(types: !891)
!891 = !{null, !892, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<bootloader::bootinfo::memory_map::MemoryRegion>", baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!893 = !{!894, !895, !896, !898}
!894 = !DILocalVariable(name: "x", arg: 1, scope: !888, file: !889, line: 757, type: !892)
!895 = !DILocalVariable(name: "y", arg: 2, scope: !888, file: !889, line: 757, type: !892)
!896 = !DILocalVariable(name: "a", scope: !897, file: !889, line: 774, type: !628, align: 8)
!897 = distinct !DILexicalBlock(scope: !888, file: !889, line: 774, column: 9)
!898 = !DILocalVariable(name: "b", scope: !899, file: !889, line: 775, type: !628, align: 8)
!899 = distinct !DILexicalBlock(scope: !897, file: !889, line: 775, column: 9)
!900 = !DILocation(line: 757, column: 36, scope: !888)
!901 = !DILocation(line: 757, column: 47, scope: !888)
!902 = !DILocation(line: 774, column: 13, scope: !897)
!903 = !DILocation(line: 775, column: 13, scope: !899)
!904 = !DILocation(line: 774, column: 17, scope: !888)
!905 = !DILocation(line: 775, column: 17, scope: !897)
!906 = !DILocation(line: 776, column: 23, scope: !899)
!907 = !DILocation(line: 776, column: 9, scope: !899)
!908 = !DILocation(line: 777, column: 23, scope: !899)
!909 = !DILocation(line: 777, column: 9, scope: !899)
!910 = !DILocation(line: 779, column: 2, scope: !888)
!911 = distinct !DISubprogram(name: "swap_simple<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem11swap_simple17h94de7e7e42965459E", scope: !630, file: !889, line: 757, type: !912, scopeLine: 757, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !915)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !914, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut bootloader::bootinfo::memory_map::MemoryRegion", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!915 = !{!916, !917, !918, !920}
!916 = !DILocalVariable(name: "x", arg: 1, scope: !911, file: !889, line: 757, type: !914)
!917 = !DILocalVariable(name: "y", arg: 2, scope: !911, file: !889, line: 757, type: !914)
!918 = !DILocalVariable(name: "a", scope: !919, file: !889, line: 774, type: !13, align: 8)
!919 = distinct !DILexicalBlock(scope: !911, file: !889, line: 774, column: 9)
!920 = !DILocalVariable(name: "b", scope: !921, file: !889, line: 775, type: !13, align: 8)
!921 = distinct !DILexicalBlock(scope: !919, file: !889, line: 775, column: 9)
!922 = !DILocation(line: 757, column: 36, scope: !911)
!923 = !DILocation(line: 757, column: 47, scope: !911)
!924 = !DILocation(line: 774, column: 13, scope: !919)
!925 = !DILocation(line: 775, column: 13, scope: !921)
!926 = !DILocation(line: 774, column: 17, scope: !911)
!927 = !DILocation(line: 775, column: 17, scope: !919)
!928 = !DILocation(line: 776, column: 23, scope: !921)
!929 = !DILocation(line: 776, column: 9, scope: !921)
!930 = !DILocation(line: 777, column: 23, scope: !921)
!931 = !DILocation(line: 777, column: 9, scope: !921)
!932 = !DILocation(line: 779, column: 2, scope: !911)
!933 = distinct !DISubprogram(name: "swap<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem4swap17h28f0b8b076779fceE", scope: !630, file: !889, line: 720, type: !912, scopeLine: 720, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !934)
!934 = !{!935, !936}
!935 = !DILocalVariable(name: "x", arg: 1, scope: !933, file: !889, line: 720, type: !914)
!936 = !DILocalVariable(name: "y", arg: 2, scope: !933, file: !889, line: 720, type: !914)
!937 = !DILocation(line: 720, column: 22, scope: !933)
!938 = !DILocation(line: 720, column: 33, scope: !933)
!939 = !DILocation(line: 735, column: 12, scope: !933)
!940 = !DILocation(line: 749, column: 5, scope: !933)
!941 = !DILocation(line: 738, column: 29, scope: !933)
!942 = !DILocation(line: 750, column: 2, scope: !933)
!943 = distinct !DISubprogram(name: "forget<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem6forget17h9cbfbef7b5a8326fE", scope: !630, file: !889, line: 148, type: !944, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !946)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !13}
!946 = !{!947}
!947 = !DILocalVariable(name: "t", arg: 1, scope: !943, file: !889, line: 148, type: !13)
!948 = !DILocation(line: 148, column: 24, scope: !943)
!949 = !DILocation(line: 149, column: 31, scope: !943)
!950 = !DILocalVariable(name: "value", arg: 1, scope: !951, file: !952, line: 70, type: !13)
!951 = distinct !DISubprogram(name: "new<bootloader::bootinfo::memory_map::MemoryRegion>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$3new17h1bfe675fda0190f8E", scope: !634, file: !952, line: 70, type: !953, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !175, retainedNodes: !955)
!952 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!953 = !DISubroutineType(types: !954)
!954 = !{!634, !13}
!955 = !{!950}
!956 = !DILocation(line: 70, column: 22, scope: !951, inlinedAt: !957)
!957 = distinct !DILocation(line: 149, column: 13, scope: !943)
!958 = !DILocation(line: 71, column: 24, scope: !951, inlinedAt: !957)
!959 = !DILocation(line: 71, column: 9, scope: !951, inlinedAt: !957)
!960 = !DILocation(line: 150, column: 2, scope: !943)
!961 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17haed30c9c91ec44cfE", scope: !963, file: !962, line: 558, type: !965, scopeLine: 558, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !967)
!962 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "262dcd21c0bc42a6f0502eabf004a344")
!963 = !DINamespace(name: "{impl#12}", scope: !964)
!964 = !DINamespace(name: "num", scope: !130)
!965 = !DISubroutineType(types: !966)
!966 = !{!425, !9, !9}
!967 = !{!968, !969, !970, !972}
!968 = !DILocalVariable(name: "self", arg: 1, scope: !961, file: !962, line: 558, type: !9)
!969 = !DILocalVariable(name: "rhs", arg: 2, scope: !961, file: !962, line: 558, type: !9)
!970 = !DILocalVariable(name: "a", scope: !971, file: !962, line: 559, type: !9, align: 8)
!971 = distinct !DILexicalBlock(scope: !961, file: !962, line: 559, column: 13)
!972 = !DILocalVariable(name: "b", scope: !971, file: !962, line: 559, type: !521, align: 1)
!973 = !DILocation(line: 558, column: 34, scope: !961)
!974 = !DILocation(line: 558, column: 40, scope: !961)
!975 = !DILocalVariable(name: "self", arg: 1, scope: !976, file: !962, line: 1676, type: !9)
!976 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17h78df7da8903caab4E", scope: !963, file: !962, line: 1676, type: !977, scopeLine: 1676, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !983)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !9, !9}
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !980, templateParams: !24, identifier: "23309350ccb628a7900e37caa17b1249")
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !979, file: !2, baseType: !9, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !979, file: !2, baseType: !521, size: 8, align: 8, offset: 64)
!983 = !{!975, !984, !985, !987}
!984 = !DILocalVariable(name: "rhs", arg: 2, scope: !976, file: !962, line: 1676, type: !9)
!985 = !DILocalVariable(name: "a", scope: !986, file: !962, line: 1677, type: !22, align: 8)
!986 = distinct !DILexicalBlock(scope: !976, file: !962, line: 1677, column: 13)
!987 = !DILocalVariable(name: "b", scope: !986, file: !962, line: 1677, type: !521, align: 1)
!988 = !DILocation(line: 1676, column: 38, scope: !976, inlinedAt: !989)
!989 = distinct !DILocation(line: 559, column: 26, scope: !961)
!990 = !DILocation(line: 1676, column: 44, scope: !976, inlinedAt: !989)
!991 = !DILocation(line: 1677, column: 26, scope: !976, inlinedAt: !989)
!992 = !DILocation(line: 1677, column: 18, scope: !976, inlinedAt: !989)
!993 = !DILocation(line: 1677, column: 18, scope: !986, inlinedAt: !989)
!994 = !DILocation(line: 1677, column: 21, scope: !976, inlinedAt: !989)
!995 = !DILocation(line: 1677, column: 21, scope: !986, inlinedAt: !989)
!996 = !DILocation(line: 1678, column: 13, scope: !986, inlinedAt: !989)
!997 = !DILocation(line: 1679, column: 10, scope: !976, inlinedAt: !989)
!998 = !DILocation(line: 559, column: 26, scope: !961)
!999 = !DILocation(line: 559, column: 18, scope: !961)
!1000 = !DILocation(line: 559, column: 18, scope: !971)
!1001 = !DILocation(line: 559, column: 21, scope: !961)
!1002 = !DILocation(line: 559, column: 21, scope: !971)
!1003 = !DILocation(line: 560, column: 16, scope: !971)
!1004 = !DILocation(line: 560, column: 42, scope: !971)
!1005 = !DILocation(line: 560, column: 13, scope: !971)
!1006 = !DILocation(line: 560, column: 30, scope: !971)
!1007 = !DILocation(line: 561, column: 10, scope: !961)
!1008 = !{i64 0, i64 2}
!1009 = distinct !DISubprogram(name: "next_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$17next_power_of_two17hf3ad0a10eaa256e8E", scope: !963, file: !962, line: 2190, type: !1010, scopeLine: 2190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!9, !9}
!1012 = !{!1013}
!1013 = !DILocalVariable(name: "self", arg: 1, scope: !1009, file: !962, line: 2190, type: !9)
!1014 = !DILocation(line: 2190, column: 40, scope: !1009)
!1015 = !DILocation(line: 2191, column: 13, scope: !1009)
!1016 = !DILocation(line: 2192, column: 10, scope: !1009)
!1017 = distinct !DISubprogram(name: "one_less_than_next_power_of_two", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$31one_less_than_next_power_of_two17hb9699c0152bfb33aE", scope: !963, file: !962, line: 2158, type: !1010, scopeLine: 2158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !24, retainedNodes: !1018)
!1018 = !{!1019, !1020, !1022}
!1019 = !DILocalVariable(name: "self", arg: 1, scope: !1017, file: !962, line: 2158, type: !9)
!1020 = !DILocalVariable(name: "p", scope: !1021, file: !962, line: 2161, type: !9, align: 8)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !962, line: 2161, column: 13)
!1022 = !DILocalVariable(name: "z", scope: !1023, file: !962, line: 2166, type: !9, align: 8)
!1023 = distinct !DILexicalBlock(scope: !1021, file: !962, line: 2166, column: 13)
!1024 = !DILocation(line: 2158, column: 50, scope: !1017)
!1025 = !DILocation(line: 2159, column: 16, scope: !1017)
!1026 = !DILocation(line: 2161, column: 21, scope: !1017)
!1027 = !DILocation(line: 2159, column: 35, scope: !1017)
!1028 = !DILocation(line: 2168, column: 10, scope: !1017)
!1029 = !DILocation(line: 2161, column: 17, scope: !1021)
!1030 = !DILocation(line: 2166, column: 30, scope: !1021)
!1031 = !DILocation(line: 2166, column: 17, scope: !1023)
!1032 = !DILocation(line: 2167, column: 13, scope: !1023)
!1033 = distinct !DISubprogram(name: "call_mut<(&bootloader::bootinfo::memory_map::MemoryRegion, &bootloader::bootinfo::memory_map::MemoryRegion), core::slice::{impl#0}::sort_unstable_by::{closure_env#0}<bootloader::bootinfo::memory_map::MemoryRegion, bootloader::bootinfo::memory_map::{impl#0}::sort::{closure_env#0}>>", linkageName: "_ZN4core3ops8function5impls79_$LT$impl$u20$core..ops..function..FnMut$LT$A$GT$$u20$for$u20$$RF$mut$u20$F$GT$8call_mut17hde824f27709ad546E", scope: !1035, file: !1034, line: 297, type: !1038, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !123, templateParams: !1058, retainedNodes: !1051)
!1034 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!1035 = !DINamespace(name: "{impl#3}", scope: !1036)
!1036 = !DINamespace(name: "impls", scope: !1037)
!1037 = !DINamespace(name: "function", scope: !164)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!521, !1040, !12, !12}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &mut core::slice::{impl#0}::sort_unstable_by::{closure_env#0}<bootloader::bootinfo::memory_map::MemoryRegion, bootloader::bootinfo::memory_map::{impl#0}::sort::{closure_env#0}>", baseType: !1041, size: 64, align: 64, dwarfAddressSpace: 0)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::slice::{impl#0}::sort_unstable_by::{closure_env#0}<bootloader::bootinfo::memory_map::MemoryRegion, bootloader::bootinfo::memory_map::{impl#0}::sort::{closure_env#0}>", baseType: !1042, size: 64, align: 64, dwarfAddressSpace: 0)
