; ModuleID = 'vtes1s7smf5m8jk'
source_filename = "vtes1s7smf5m8jk"
target datalayout = "e-S128-m:e-i64:64-f128:128-n8:16:32:64"
target triple = "x86_64-jemima-unknown-none"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::fmt::UnsafeArg" = type { {} }
%"spin::mutex::Mutex<vga::Screen>" = type { %"spin::mutex::spin::SpinMutex<vga::Screen>" }
%"spin::mutex::spin::SpinMutex<vga::Screen>" = type { %"core::marker::PhantomData<spin::relax::Spin>", %"core::sync::atomic::AtomicBool", [7 x i8], %"core::cell::UnsafeCell<vga::Screen>" }
%"core::marker::PhantomData<spin::relax::Spin>" = type {}
%"core::sync::atomic::AtomicBool" = type { i8 }
%"core::cell::UnsafeCell<vga::Screen>" = type { %"vga::Screen" }
%"vga::Screen" = type { [80 x { i8, i8 }], { i64, i64 }, { i64, i64 }, i64, ptr, i8, [7 x i8] }
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>::Some" = type { [1 x i64], %"spin::mutex::Mutex<vga::Screen>" }
%"core::fmt::Error" = type {}
%"core::option::Option<spin::mutex::Mutex<vga::Screen>>" = type { i64, [28 x i64] }
%"spin::once::Once<spin::mutex::Mutex<vga::Screen>>" = type { %"core::sync::atomic::AtomicUsize", %"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::cell::UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen>>>" = type { %"core::option::Option<spin::mutex::Mutex<vga::Screen>>" }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&mut vga::Screen as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut vga::Screen as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !27, identifier: "88702f1322798c323c28a4e021ef2dd2")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Screen", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", scope: !16, file: !2, size: 1728, align: 64, elements: !17, templateParams: !27, identifier: "b5c5b139a02220bb6ed371891a4c915f")
!16 = !DINamespace(name: "vga", scope: null)
!17 = !{!18, !19, !28, !29, !48, !53}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "water_level", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 1536)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !2, baseType: !20, size: 128, align: 64, offset: 1280)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cursor", scope: !16, file: !2, size: 128, align: 64, elements: !21, templateParams: !27, identifier: "da3dc16789603dfb77508b6bbd34e54f")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !2, baseType: !23, size: 128, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dot", scope: !16, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "663c84e2bf7feefbfe4eb7fef201d8ae")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !2, baseType: !9, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !15, file: !2, baseType: !23, size: 128, align: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !2, baseType: !30, size: 64, align: 64, offset: 1600)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut vga::Buffer", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !16, file: !2, size: 32000, align: 8, elements: !32, templateParams: !27, identifier: "3acd1f65c809da68f6b7e121582d0363")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !31, file: !2, baseType: !34, size: 32000, align: 8)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32000, align: 8, elements: !46)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1280, align: 8, elements: !44)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScreenChar", scope: !16, file: !2, size: 16, align: 8, elements: !37, templateParams: !27, identifier: "3134113e62977db84cdd11b0efef81d5")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "char", scope: !36, file: !2, baseType: !39, size: 8, align: 8)
!39 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "color_code", scope: !36, file: !2, baseType: !41, size: 8, align: 8, offset: 8)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorCode", scope: !16, file: !2, size: 8, align: 8, elements: !42, templateParams: !27, identifier: "b1b4591e3005c789b477114f8a3c6b2f")
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !41, file: !2, baseType: !39, size: 8, align: 8)
!44 = !{!45}
!45 = !DISubrange(count: 80, lowerBound: 0)
!46 = !{!47}
!47 = !DISubrange(count: 25, lowerBound: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tfd", scope: !15, file: !2, baseType: !49, size: 8, align: 8, offset: 1664)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TextFlowDirection", scope: !16, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "TopDown", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BottomUp", value: 1, isUnsigned: true)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blank_row", scope: !15, file: !2, baseType: !35, size: 1280, align: 8)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !57, vtableHolder: !62, templateParams: !27, identifier: "7b18749b349baebe8d88cdae2bbf074e")
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !56, file: !2, baseType: !6, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !56, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !56, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !63, file: !2, align: 8, elements: !27, identifier: "3c92434e0ee530bed77dbdff4f2052fd")
!63 = !DINamespace(name: "fmt", scope: !64)
!64 = !DINamespace(name: "core", scope: null)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "VGA_DISPLAY_IN__TEXT_MODE", linkageName: "_ZN4theo11peripherals25VGA_DISPLAY_IN__TEXT_MODE17h5c68b2b3295ef762E", scope: !67, file: !69, line: 161, type: !70, isLocal: true, isDefinition: true, align: 8)
!67 = !DINamespace(name: "peripherals", scope: !68)
!68 = !DINamespace(name: "theo", scope: null)
!69 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "d828b01b82ac8e868e6840a22ef5c8cc")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "VGA_DISPLAY_IN__TEXT_MODE", scope: !67, file: !2, align: 8, elements: !71, templateParams: !27, identifier: "ef84407c5994aa7f81050cd48c239308")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__private_field", scope: !70, file: !2, baseType: !7, align: 8)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "LAZY", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref11__stability4LAZY17h5116c51db72d5a15E", scope: !75, file: !78, line: 29, type: !79, isLocal: true, isDefinition: true, align: 64)
!75 = !DINamespace(name: "__stability", scope: !76)
!76 = !DINamespace(name: "deref", scope: !77)
!77 = !DINamespace(name: "{impl#0}", scope: !67)
!78 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/lazy_static-1.4.0/src/core_lazy.rs", directory: "", checksumkind: CSK_MD5, checksum: "a4d7117b86ca8c26c0d1ecaf6e9b6f2c")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !80, file: !2, size: 1920, align: 64, elements: !82, templateParams: !111, identifier: "3df970602bd9b9522ae704ad7720747a")
!80 = !DINamespace(name: "lazy", scope: !81)
!81 = !DINamespace(name: "lazy_static", scope: null)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !79, file: !2, baseType: !84, size: 1920, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !85, file: !2, size: 1920, align: 64, elements: !87, templateParams: !111, identifier: "b52c899b804cc266ca437ca15d68d622")
!85 = !DINamespace(name: "once", scope: !86)
!86 = !DINamespace(name: "spin", scope: null)
!87 = !{!88, !100}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !2, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !90, file: !2, size: 64, align: 64, elements: !92, templateParams: !27, identifier: "d4fa36d81e99a0d757da06ec0361b554")
!90 = !DINamespace(name: "atomic", scope: !91)
!91 = !DINamespace(name: "sync", scope: !64)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !89, file: !2, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !95, file: !2, size: 64, align: 64, elements: !96, templateParams: !98, identifier: "488c301f24017483f34a84b5413e7f6")
!95 = !DINamespace(name: "cell", scope: !64)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !94, file: !2, baseType: !9, size: 64, align: 64)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "T", type: !9)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !2, baseType: !101, size: 1856, align: 64, offset: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>>", scope: !95, file: !2, size: 1856, align: 64, elements: !102, templateParams: !150, identifier: "399b3c8934663f14bb5f000ce1de48b5")
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !2, baseType: !104, size: 1856, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !105, file: !2, size: 1856, align: 64, elements: !106, templateParams: !27, identifier: "4fceb5fd34c1e0e7119d7548577c8a19")
!105 = !DINamespace(name: "option", scope: !64)
!106 = !{!107}
!107 = !DICompositeType(tag: DW_TAG_variant_part, scope: !104, file: !2, size: 1856, align: 64, elements: !108, templateParams: !27, identifier: "a3c2645f42f7fc87a7d53f7c1b8286ff", discriminator: !148)
!108 = !{!109, !144}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !107, file: !2, baseType: !110, size: 1856, align: 64, extraData: i64 0)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !104, file: !2, size: 1856, align: 64, elements: !27, templateParams: !111, identifier: "8969ef023f5312db5187c2ddff0f585a")
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "T", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<vga::Screen, spin::relax::Spin>", scope: !114, file: !2, size: 1792, align: 64, elements: !115, templateParams: !142, identifier: "64f47fc9891b83ea7787336d949d1c87")
!114 = !DINamespace(name: "mutex", scope: !86)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !113, file: !2, baseType: !117, size: 1792, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutex<vga::Screen, spin::relax::Spin>", scope: !118, file: !2, size: 1792, align: 64, elements: !119, templateParams: !142, identifier: "b9d82448a10ae465a42627fe4e534fb3")
!118 = !DINamespace(name: "spin", scope: !114)
!119 = !{!120, !127, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !117, file: !2, baseType: !121, align: 8)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<spin::relax::Spin>", scope: !122, file: !2, align: 8, elements: !27, templateParams: !123, identifier: "286dea31a5a48a614f93659c73215162")
!122 = !DINamespace(name: "marker", scope: !64)
!123 = !{!124}
!124 = !DITemplateTypeParameter(name: "T", type: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spin", scope: !126, file: !2, align: 8, elements: !27, identifier: "721632c8ee693f49ea620e97fb3735ef")
!126 = !DINamespace(name: "relax", scope: !86)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !117, file: !2, baseType: !128, size: 8, align: 8)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !90, file: !2, size: 8, align: 8, elements: !129, templateParams: !27, identifier: "40fb6d86dc23fb888e63db4d8e0ccf")
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !128, file: !2, baseType: !131, size: 8, align: 8)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !95, file: !2, size: 8, align: 8, elements: !132, templateParams: !134, identifier: "de7fbb88ce19c4fc39ebb556fce44094")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !2, baseType: !39, size: 8, align: 8)
!134 = !{!135}
!135 = !DITemplateTypeParameter(name: "T", type: !39)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !2, baseType: !137, size: 1728, align: 64, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<vga::Screen>", scope: !95, file: !2, size: 1728, align: 64, elements: !138, templateParams: !140, identifier: "3ebd54ceb41de93f46046aa08f5b19b0")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !137, file: !2, baseType: !15, size: 1728, align: 64)
!140 = !{!141}
!141 = !DITemplateTypeParameter(name: "T", type: !15)
!142 = !{!141, !143}
!143 = !DITemplateTypeParameter(name: "R", type: !125)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !107, file: !2, baseType: !145, size: 1856, align: 64, extraData: i64 1)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !104, file: !2, size: 1856, align: 64, elements: !146, templateParams: !111, identifier: "c0e386b28492a067fa21d5821764da5a")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !145, file: !2, baseType: !113, size: 1792, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, scope: !104, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!149 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!150 = !{!151}
!151 = !DITemplateTypeParameter(name: "T", type: !104)
!152 = !{i32 7, !"PIC Level", i32 2}
!153 = !{i32 7, !"PIE Level", i32 2}
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !157, producer: "clang LLVM (rustc version 1.68.0-nightly (0442fbabe 2023-01-10))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !158, globals: !174)
!157 = !DIFile(filename: "src/main.rs/@/vtes1s7smf5m8jk", directory: "/Users/yaw/self/theo")
!158 = !{!49, !159, !167}
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !160, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !162)
!160 = !DINamespace(name: "v1", scope: !161)
!161 = !DINamespace(name: "rt", scope: !63)
!162 = !{!163, !164, !165, !166}
!163 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!164 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!165 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!166 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !90, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !168)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!170 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!171 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!172 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!173 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!174 = !{!0, !54, !65, !73}
!175 = distinct !DISubprogram(name: "fmt<core::panic::panic_info::PanicInfo>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hfb1a39fdd5040fefE", scope: !177, file: !176, line: 2372, type: !178, scopeLine: 2372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !344, retainedNodes: !341)
!176 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "1922c92fc1c52c1aaa242780ad5ab5eb")
!177 = !DINamespace(name: "{impl#59}", scope: !63)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !197, !299}
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !181, file: !2, size: 8, align: 8, elements: !182, templateParams: !27, identifier: "4c95ba1445c8749be964fed87063fa1a")
!181 = !DINamespace(name: "result", scope: !64)
!182 = !{!183}
!183 = !DICompositeType(tag: DW_TAG_variant_part, scope: !180, file: !2, size: 8, align: 8, elements: !184, templateParams: !27, identifier: "1481463a02733c1d81f5d0db4517da03", discriminator: !196)
!184 = !{!185, !192}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !183, file: !2, baseType: !186, size: 8, align: 8, extraData: i64 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !180, file: !2, size: 8, align: 8, elements: !187, templateParams: !189, identifier: "6a288024f16a7eea3a84e465d8c39c10")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !186, file: !2, baseType: !7, align: 8, offset: 8)
!189 = !{!190, !191}
!190 = !DITemplateTypeParameter(name: "T", type: !7)
!191 = !DITemplateTypeParameter(name: "E", type: !62)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !183, file: !2, baseType: !193, size: 8, align: 8, extraData: i64 1)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !180, file: !2, size: 8, align: 8, elements: !194, templateParams: !189, identifier: "88e99fb8b05017cacaf7404ae5198389")
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !193, file: !2, baseType: !62, align: 8, offset: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::panic::panic_info::PanicInfo", baseType: !198, size: 64, align: 64, dwarfAddressSpace: 0)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !199, size: 64, align: 64, dwarfAddressSpace: 0)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !200, file: !2, size: 320, align: 64, elements: !202, templateParams: !27, identifier: "51b5171f3c6886416f7c17e5c02981d2")
!200 = !DINamespace(name: "panic_info", scope: !201)
!201 = !DINamespace(name: "panic", scope: !64)
!202 = !{!203, !214, !331, !339}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !199, file: !2, baseType: !204, size: 128, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !205, templateParams: !27, identifier: "45ad49cd756f67d6addca22884eb6ef8")
!205 = !{!206, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !204, file: !2, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "88a7966264d8d1051db6d3ef2f0c55d0")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !204, file: !2, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 3, lowerBound: 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !199, file: !2, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&core::fmt::Arguments>", scope: !105, file: !2, size: 64, align: 64, elements: !216, templateParams: !27, identifier: "ef2485f985c7061cc236ceccd18ccfce")
!216 = !{!217}
!217 = !DICompositeType(tag: DW_TAG_variant_part, scope: !215, file: !2, size: 64, align: 64, elements: !218, templateParams: !27, identifier: "b5267e4237013abdd4567c32131ffbf", discriminator: !330)
!218 = !{!219, !326}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !217, file: !2, baseType: !220, size: 64, align: 64, extraData: i64 0)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !215, file: !2, size: 64, align: 64, elements: !27, templateParams: !221, identifier: "889946298fdc48fdb368de8e93b26d01")
!221 = !{!222}
!222 = !DITemplateTypeParameter(name: "T", type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !224, size: 64, align: 64, dwarfAddressSpace: 0)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !63, file: !2, size: 384, align: 64, elements: !225, templateParams: !27, identifier: "edb1851fc747cef83eb18ad3e64b6598")
!225 = !{!226, !237, !284}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !224, file: !2, baseType: !227, size: 128, align: 64, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !228, templateParams: !27, identifier: "1bd0df68c6cb6036a2bb36aa5621bbdb")
!228 = !{!229, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !227, file: !2, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64, dwarfAddressSpace: 0)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !232, templateParams: !27, identifier: "c67d244f92c53ee233f4a290be1c6ff8")
!232 = !{!233, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !231, file: !2, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !231, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !227, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !224, file: !2, baseType: !238, size: 128, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !105, file: !2, size: 128, align: 64, elements: !239, templateParams: !27, identifier: "842e9084c696c648f9d7d66c601e78c")
!239 = !{!240}
!240 = !DICompositeType(tag: DW_TAG_variant_part, scope: !238, file: !2, size: 128, align: 64, elements: !241, templateParams: !27, identifier: "eb4b44296be1d4f33b7130dc47bbdc", discriminator: !283)
!241 = !{!242, !279}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !240, file: !2, baseType: !243, size: 128, align: 64, extraData: i64 0)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !238, file: !2, size: 128, align: 64, elements: !27, templateParams: !244, identifier: "f8ea1aa01bd89cbb857a75f3da2a43ce")
!244 = !{!245}
!245 = !DITemplateTypeParameter(name: "T", type: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !247, templateParams: !27, identifier: "6dc2a74510b72237c2315ef26cb777cf")
!247 = !{!248, !278}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !246, file: !2, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !160, file: !2, size: 448, align: 64, elements: !251, templateParams: !27, identifier: "4bbdcd222659ca2617678dcc6ad04958")
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !250, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !2, baseType: !254, size: 384, align: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !160, file: !2, size: 384, align: 64, elements: !255, templateParams: !27, identifier: "8821451886939f0c147abcb02c81012e")
!255 = !{!256, !258, !259, !261, !277}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !254, file: !2, baseType: !257, size: 32, align: 32, offset: 288)
!257 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !254, file: !2, baseType: !159, size: 8, align: 8, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !2, baseType: !260, size: 32, align: 32, offset: 256)
!260 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !254, file: !2, baseType: !262, size: 128, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !160, file: !2, size: 128, align: 64, elements: !263, templateParams: !27, identifier: "920ef6d54605e6b7a9557e1df16c211b")
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_variant_part, scope: !262, file: !2, size: 128, align: 64, elements: !265, templateParams: !27, identifier: "96ed5a652dd811e692bde8aafa2136dd", discriminator: !276)
!265 = !{!266, !270, !274}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !264, file: !2, baseType: !267, size: 128, align: 64, extraData: i64 0)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !262, file: !2, size: 128, align: 64, elements: !268, templateParams: !27, identifier: "b7baf6299bb3801984e8a8c2fd827b1f")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !264, file: !2, baseType: !271, size: 128, align: 64, extraData: i64 1)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !262, file: !2, size: 128, align: 64, elements: !272, templateParams: !27, identifier: "68d2d5308a205350fa3862a17eb67e5a")
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !271, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !264, file: !2, baseType: !275, size: 128, align: 64, extraData: i64 2)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !262, file: !2, size: 128, align: 64, elements: !27, identifier: "939fae32b28d1ee163eef0cac74d4ac0")
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !262, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !254, file: !2, baseType: !262, size: 128, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !240, file: !2, baseType: !280, size: 128, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !238, file: !2, size: 128, align: 64, elements: !281, templateParams: !244, identifier: "a1ce7459cae7c3fd2d712a4e7a034927")
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !280, file: !2, baseType: !246, size: 128, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !224, file: !2, baseType: !285, size: 128, align: 64, offset: 256)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !286, templateParams: !27, identifier: "795733086a9ffc9e0ce50376fd9375")
!286 = !{!287, !325}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !285, file: !2, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64, dwarfAddressSpace: 0)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !63, file: !2, size: 128, align: 64, elements: !290, templateParams: !27, identifier: "33436db152b82e5fceeb5b23d420e0c")
!290 = !{!291, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !289, file: !2, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !293, size: 64, align: 64, dwarfAddressSpace: 0)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !294, file: !2, align: 8, elements: !27, identifier: "e4a76201e64240d38c1c72aa4d4b02f4")
!294 = !DINamespace(name: "{extern#0}", scope: !63)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !289, file: !2, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !297, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{!180, !292, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !300, size: 64, align: 64, dwarfAddressSpace: 0)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !63, file: !2, size: 512, align: 64, elements: !301, templateParams: !27, identifier: "8df43b92d7abc7827433e87766d6ad15")
!301 = !{!302, !303, !304, !305, !317, !318}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !2, baseType: !260, size: 32, align: 32, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !300, file: !2, baseType: !257, size: 32, align: 32, offset: 416)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !300, file: !2, baseType: !159, size: 8, align: 8, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !300, file: !2, baseType: !306, size: 128, align: 64, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !105, file: !2, size: 128, align: 64, elements: !307, templateParams: !27, identifier: "5ea95f167c8a3208bf89a1e7847a2b39")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_variant_part, scope: !306, file: !2, size: 128, align: 64, elements: !309, templateParams: !27, identifier: "28c32283e20226d8665ec7b7d900b7af", discriminator: !316)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !308, file: !2, baseType: !311, size: 128, align: 64, extraData: i64 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !306, file: !2, size: 128, align: 64, elements: !27, templateParams: !98, identifier: "8447cfb4e1834c48c85dbd0f8edf7c6e")
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !308, file: !2, baseType: !313, size: 128, align: 64, extraData: i64 1)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !306, file: !2, size: 128, align: 64, elements: !314, templateParams: !98, identifier: "983026280ee321fd282b1d92b3927a3")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, scope: !306, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !300, file: !2, baseType: !306, size: 128, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !300, file: !2, baseType: !319, size: 128, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !320, templateParams: !27, identifier: "303a00edefbc81bcddaeb2720dbd365e")
!320 = !{!321, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !319, file: !2, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "c85ba49beb4df03e7184fab315d9d3b8")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !319, file: !2, baseType: !210, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !285, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !217, file: !2, baseType: !327, size: 64, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !215, file: !2, size: 64, align: 64, elements: !328, templateParams: !221, identifier: "90b2a98ddac11a7ad49a73c35dc563ba")
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !327, file: !2, baseType: !223, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !215, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !199, file: !2, baseType: !332, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !333, size: 64, align: 64, dwarfAddressSpace: 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !334, file: !2, size: 192, align: 64, elements: !335, templateParams: !27, identifier: "2183b1f45fb9a8831f25b6cfbd605d2")
!334 = !DINamespace(name: "location", scope: !201)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !333, file: !2, baseType: !231, size: 128, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !333, file: !2, baseType: !260, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !333, file: !2, baseType: !260, size: 32, align: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !199, file: !2, baseType: !340, size: 8, align: 8, offset: 256)
!340 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!341 = !{!342, !343}
!342 = !DILocalVariable(name: "self", arg: 1, scope: !175, file: !176, line: 2372, type: !197)
!343 = !DILocalVariable(name: "f", arg: 2, scope: !175, file: !176, line: 2372, type: !299)
!344 = !{!345}
!345 = !DITemplateTypeParameter(name: "T", type: !199)
!346 = !DILocation(line: 2372, column: 20, scope: !175)
!347 = !DILocation(line: 2372, column: 27, scope: !175)
!348 = !DILocation(line: 2372, column: 71, scope: !175)
!349 = !{i64 8}
!350 = !DILocation(line: 2372, column: 62, scope: !175)
!351 = !DILocation(line: 2372, column: 84, scope: !175)
!352 = distinct !DISubprogram(name: "new<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV13new17h7971672254bae7d5E", scope: !289, file: !176, line: 333, type: !353, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !359, retainedNodes: !356)
!353 = !DISubroutineType(types: !354)
!354 = !{!289, !197, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&core::panic::panic_info::PanicInfo, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!356 = !{!357, !358}
!357 = !DILocalVariable(name: "x", arg: 1, scope: !352, file: !176, line: 333, type: !197)
!358 = !DILocalVariable(name: "f", arg: 2, scope: !352, file: !176, line: 333, type: !355)
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !198)
!361 = !DILocation(line: 333, column: 23, scope: !352)
!362 = !DILocation(line: 333, column: 33, scope: !352)
!363 = !DILocation(line: 342, column: 42, scope: !352)
!364 = !DILocation(line: 342, column: 68, scope: !352)
!365 = !{i64 1}
!366 = !DILocation(line: 342, column: 18, scope: !352)
!367 = !DILocation(line: 343, column: 6, scope: !352)
!368 = distinct !DISubprogram(name: "new_debug<&core::panic::panic_info::PanicInfo>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h1d765539ba45cce0E", scope: !289, file: !176, line: 322, type: !369, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !359, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!289, !197}
!371 = !{!372}
!372 = !DILocalVariable(name: "x", arg: 1, scope: !368, file: !176, line: 322, type: !197)
!373 = !DILocation(line: 322, column: 30, scope: !368)
!374 = !DILocation(line: 323, column: 13, scope: !368)
!375 = !DILocation(line: 324, column: 10, scope: !368)
!376 = distinct !DISubprogram(name: "write_char<vga::Screen>", linkageName: "_ZN4core3fmt5Write10write_char17h0d453d9fe2e2be7cE", scope: !377, file: !176, line: 168, type: !378, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !383, retainedNodes: !380)
!377 = !DINamespace(name: "Write", scope: !63)
!378 = !DISubroutineType(types: !379)
!379 = !{!180, !14, !257}
!380 = !{!381, !382}
!381 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !176, line: 168, type: !14)
!382 = !DILocalVariable(name: "c", arg: 2, scope: !376, file: !176, line: 168, type: !257)
!383 = !{!384}
!384 = !DITemplateTypeParameter(name: "Self", type: !15)
!385 = !DILocation(line: 168, column: 19, scope: !376)
!386 = !DILocation(line: 168, column: 30, scope: !376)
!387 = !DILocation(line: 169, column: 43, scope: !376)
!388 = !DILocation(line: 169, column: 24, scope: !376)
!389 = !DILocation(line: 169, column: 9, scope: !376)
!390 = !DILocation(line: 170, column: 6, scope: !376)
!391 = distinct !DISubprogram(name: "write_fmt<vga::Screen>", linkageName: "_ZN4core3fmt5Write9write_fmt17h4d01437720068d10E", scope: !377, file: !176, line: 191, type: !392, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !383, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!180, !14, !224}
!394 = !{!395, !396}
!395 = !DILocalVariable(name: "self", arg: 1, scope: !391, file: !176, line: 191, type: !14)
!396 = !DILocalVariable(name: "args", arg: 2, scope: !391, file: !176, line: 191, type: !224)
!397 = !DILocation(line: 191, column: 18, scope: !391)
!398 = !DILocation(line: 191, column: 39, scope: !391)
!399 = !DILocation(line: 192, column: 26, scope: !391)
!400 = !DILocation(line: 192, column: 9, scope: !391)
!401 = !DILocation(line: 193, column: 6, scope: !391)
!402 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h363b2e32a48a5144E", scope: !224, file: !176, line: 414, type: !403, scopeLine: 414, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !408)
!403 = !DISubroutineType(types: !404)
!404 = !{!224, !227, !285, !246, !405}
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !63, file: !2, align: 8, elements: !406, templateParams: !27, identifier: "331d42bb12cc882e565f2c83020a10cc")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !405, file: !2, baseType: !7, align: 8)
!408 = !{!409, !410, !411, !412}
!409 = !DILocalVariable(name: "pieces", arg: 1, scope: !402, file: !176, line: 415, type: !227)
!410 = !DILocalVariable(name: "args", arg: 2, scope: !402, file: !176, line: 416, type: !285)
!411 = !DILocalVariable(name: "fmt", arg: 3, scope: !402, file: !176, line: 417, type: !246)
!412 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !402, file: !176, line: 418, type: !405)
!413 = !DILocation(line: 415, column: 9, scope: !402)
!414 = !DILocation(line: 416, column: 9, scope: !402)
!415 = !DILocation(line: 417, column: 9, scope: !402)
!416 = !DILocation(line: 418, column: 9, scope: !402)
!417 = !DILocation(line: 420, column: 34, scope: !402)
!418 = !DILocation(line: 420, column: 9, scope: !402)
!419 = !DILocation(line: 421, column: 6, scope: !402)
!420 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h590733a120dd3502E", scope: !224, file: !176, line: 394, type: !421, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!224, !227, !285}
!423 = !{!424, !425}
!424 = !DILocalVariable(name: "pieces", arg: 1, scope: !420, file: !176, line: 394, type: !227)
!425 = !DILocalVariable(name: "args", arg: 2, scope: !420, file: !176, line: 394, type: !285)
!426 = !DILocation(line: 394, column: 25, scope: !420)
!427 = !DILocation(line: 394, column: 53, scope: !420)
!428 = !DILocation(line: 395, column: 12, scope: !420)
!429 = !DILocation(line: 395, column: 56, scope: !420)
!430 = !{i8 0, i8 2}
!431 = !DILocation(line: 395, column: 41, scope: !420)
!432 = !DILocation(line: 398, column: 34, scope: !420)
!433 = !DILocation(line: 398, column: 9, scope: !420)
!434 = !DILocation(line: 399, column: 6, scope: !420)
!435 = !DILocation(line: 396, column: 13, scope: !420)
!436 = distinct !DISubprogram(name: "call_once<fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h520b7e6ae877b5b2E", scope: !438, file: !437, line: 250, type: !441, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !449, retainedNodes: !446)
!437 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "56fb008eac3df8d06ce524ffb023f0b6")
!438 = !DINamespace(name: "FnOnce", scope: !439)
!439 = !DINamespace(name: "function", scope: !440)
!440 = !DINamespace(name: "ops", scope: !64)
!441 = !DISubroutineType(types: !442)
!442 = !{!113, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> spin::mutex::Mutex<vga::Screen, spin::relax::Spin>", baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!113}
!446 = !{!447, !448}
!447 = !DILocalVariable(arg: 1, scope: !436, file: !437, line: 250, type: !443)
!448 = !DILocalVariable(arg: 2, scope: !436, file: !437, line: 250, type: !7)
!449 = !{!450, !451}
!450 = !DITemplateTypeParameter(name: "Self", type: !443)
!451 = !DITemplateTypeParameter(name: "Args", type: !7)
!452 = !DILocation(line: 250, column: 5, scope: !436)
!453 = !DILocation(line: 8, column: 32, scope: !454, inlinedAt: !457)
!454 = !DILexicalBlockFile(scope: !456, file: !455, discriminator: 0)
!455 = !DIFile(filename: "src/peripherals.rs", directory: "/Users/yaw/self/theo", checksumkind: CSK_MD5, checksum: "a9f733008b5882d285bb953998165fcd")
!456 = distinct !DISubprogram(name: "__static_ref_initialize", linkageName: "_ZN88_$LT$theo..peripherals..VGA_DISPLAY_IN__TEXT_MODE$u20$as$u20$core..ops..deref..Deref$GT$5deref23__static_ref_initialize17h2bf9ab975323de93E", scope: !76, file: !69, line: 137, type: !444, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !27)
!457 = distinct !DILocation(line: 250, column: 5, scope: !436)
!458 = !DILocation(line: 8, column: 20, scope: !454, inlinedAt: !457)
!459 = !DILocalVariable(name: "value", arg: 1, scope: !460, file: !461, line: 134, type: !15)
!460 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex18Mutex$LT$T$C$R$GT$3new17hfcaa058c55dcac0fE", scope: !113, file: !461, line: 134, type: !462, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !142, retainedNodes: !464)
!461 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c58534ad96d8dc14eb87ebe3c1afa1b")
!462 = !DISubroutineType(types: !463)
!463 = !{!113, !15}
!464 = !{!459}
!465 = !DILocation(line: 134, column: 22, scope: !460, inlinedAt: !466)
!466 = distinct !DILocation(line: 8, column: 9, scope: !454, inlinedAt: !457)
!467 = !DILocation(line: 135, column: 39, scope: !460, inlinedAt: !466)
!468 = !DILocalVariable(name: "data", arg: 1, scope: !469, file: !470, line: 99, type: !15)
!469 = distinct !DISubprogram(name: "new<vga::Screen, spin::relax::Spin>", linkageName: "_ZN4spin5mutex4spin22SpinMutex$LT$T$C$R$GT$3new17hf70c7daf28501937E", scope: !117, file: !470, line: 99, type: !471, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !142, retainedNodes: !473)
!470 = !DIFile(filename: "/Users/yaw/.cargo/registry/src/github.com-1ecc6299db9ec823/spin-0.9.4/src/mutex/spin.rs", directory: "", checksumkind: CSK_MD5, checksum: "1c66351a136ee4537f9723cd15dd8f9b")
!471 = !DISubroutineType(types: !472)
!472 = !{!117, !15}
!473 = !{!468}
!474 = !DILocation(line: 99, column: 22, scope: !469, inlinedAt: !475)
!475 = distinct !DILocation(line: 135, column: 23, scope: !460, inlinedAt: !466)
!476 = !DILocation(line: 101, column: 19, scope: !469, inlinedAt: !475)
!477 = !DILocation(line: 102, column: 35, scope: !469, inlinedAt: !475)
!478 = !DILocalVariable(name: "value", arg: 1, scope: !479, file: !480, line: 1952, type: !15)
!479 = distinct !DISubprogram(name: "new<vga::Screen>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17hbe3fa88f1a5f7089E", scope: !137, file: !480, line: 1952, type: !481, scopeLine: 1952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !140, retainedNodes: !483)
!480 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "c77a20717fb0f261aaf17712622547d0")
!481 = !DISubroutineType(types: !482)
!482 = !{!137, !15}
!483 = !{!478}
!484 = !DILocation(line: 1952, column: 22, scope: !479, inlinedAt: !485)
!485 = distinct !DILocation(line: 102, column: 19, scope: !469, inlinedAt: !475)
!486 = !DILocation(line: 1953, column: 22, scope: !479, inlinedAt: !485)
!487 = !DILocation(line: 1953, column: 9, scope: !479, inlinedAt: !485)
!488 = !DILocation(line: 100, column: 9, scope: !469, inlinedAt: !475)
!489 = !DILocation(line: 135, column: 9, scope: !460, inlinedAt: !466)
!490 = distinct !DISubprogram(name: "drop_in_place<core::fmt::Error>", linkageName: "_ZN4core3ptr37drop_in_place$LT$core..fmt..Error$GT$17h69fdee9d43ade00cE", scope: !492, file: !491, line: 490, type: !493, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !498, retainedNodes: !496)
!491 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5053a683de81885484ecdfafcccc282c")
!492 = !DINamespace(name: "ptr", scope: !64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::fmt::Error", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!496 = !{!497}
!497 = !DILocalVariable(arg: 1, scope: !490, file: !491, line: 490, type: !495)
!498 = !{!499}
!499 = !DITemplateTypeParameter(name: "T", type: !62)
!500 = !DILocation(line: 490, column: 1, scope: !490)
!501 = distinct !DISubprogram(name: "drop_in_place<spin::once::Finish>", linkageName: "_ZN4core3ptr39drop_in_place$LT$spin..once..Finish$GT$17h85318610e37773e6E", scope: !492, file: !491, line: 490, type: !502, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !512, retainedNodes: !510)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::once::Finish", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish", scope: !85, file: !2, size: 128, align: 64, elements: !506, templateParams: !27, identifier: "f0eb84dc576eac4a6971c8e10936e314")
!506 = !{!507, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !505, file: !2, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !505, file: !2, baseType: !340, size: 8, align: 8, offset: 64)
!510 = !{!511}
!511 = !DILocalVariable(arg: 1, scope: !501, file: !491, line: 490, type: !504)
!512 = !{!513}
!513 = !DITemplateTypeParameter(name: "T", type: !505)
!514 = !DILocation(line: 490, column: 1, scope: !501)
!515 = distinct !DISubprogram(name: "drop_in_place<&mut vga::Screen>", linkageName: "_ZN4core3ptr44drop_in_place$LT$$RF$mut$u20$vga..Screen$GT$17h5552da9f6242d9fcE", scope: !492, file: !491, line: 490, type: !516, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !521, retainedNodes: !519)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut vga::Screen", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!519 = !{!520}
!520 = !DILocalVariable(arg: 1, scope: !515, file: !491, line: 490, type: !518)
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !14)
!523 = !DILocation(line: 490, column: 1, scope: !515)
!524 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::MutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$spin..mutex..MutexGuard$LT$vga..Screen$GT$$GT$17h3f835099d8432bb2E", scope: !492, file: !491, line: 490, type: !525, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !538, retainedNodes: !536)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::MutexGuard<vga::Screen>", baseType: !528, size: 64, align: 64, dwarfAddressSpace: 0)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<vga::Screen>", scope: !114, file: !2, size: 128, align: 64, elements: !529, templateParams: !140, identifier: "193bfbde087bcac2f3af01b8cc9ad2ef")
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !528, file: !2, baseType: !531, size: 128, align: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpinMutexGuard<vga::Screen>", scope: !118, file: !2, size: 128, align: 64, elements: !532, templateParams: !140, identifier: "f01f6df70e48e8ec50aed3b0c2068496")
!532 = !{!533, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !531, file: !2, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !531, file: !2, baseType: !14, size: 64, align: 64, offset: 64)
!536 = !{!537}
!537 = !DILocalVariable(arg: 1, scope: !524, file: !491, line: 490, type: !527)
!538 = !{!539}
!539 = !DITemplateTypeParameter(name: "T", type: !528)
!540 = !DILocation(line: 490, column: 1, scope: !524)
!541 = distinct !DISubprogram(name: "drop_in_place<spin::mutex::spin::SpinMutexGuard<vga::Screen>>", linkageName: "_ZN4core3ptr73drop_in_place$LT$spin..mutex..spin..SpinMutexGuard$LT$vga..Screen$GT$$GT$17h23ca5ffa771a2dbdE", scope: !492, file: !491, line: 490, type: !542, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !547, retainedNodes: !545)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spin::mutex::spin::SpinMutexGuard<vga::Screen>", baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !{!546}
!546 = !DILocalVariable(arg: 1, scope: !541, file: !491, line: 490, type: !544)
!547 = !{!548}
!548 = !DITemplateTypeParameter(name: "T", type: !531)
!549 = !DILocation(line: 490, column: 1, scope: !541)
!550 = distinct !DISubprogram(name: "from_utf8_unchecked_mut", linkageName: "_ZN4core3str8converts23from_utf8_unchecked_mut17h2a952c4ee421750bE", scope: !552, file: !551, line: 197, type: !554, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !564)
!551 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "197638d8a57725d685b49f7f7ce80004")
!552 = !DINamespace(name: "converts", scope: !553)
!553 = !DINamespace(name: "str", scope: !64)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !560}
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut str", file: !2, size: 128, align: 64, elements: !557, templateParams: !27, identifier: "5a9563f597f3707a3b1d983c8a782f1")
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !556, file: !2, baseType: !234, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !556, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !561, templateParams: !27, identifier: "76f368a1641a25f5ea1dd03aa07d17c8")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !560, file: !2, baseType: !234, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !560, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!564 = !{!565}
!565 = !DILocalVariable(name: "v", arg: 1, scope: !550, file: !551, line: 197, type: !560)
!566 = !DILocation(line: 197, column: 45, scope: !550)
!567 = !DILocation(line: 203, column: 2, scope: !550)
!568 = distinct !DISubprogram(name: "encode_utf8_raw", linkageName: "_ZN4core4char7methods15encode_utf8_raw17h57519eacf759cf31E", scope: !570, file: !569, line: 1729, type: !572, scopeLine: 1729, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !574)
!569 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/char/methods.rs", directory: "", checksumkind: CSK_MD5, checksum: "14b8c28ed746ac62c9e91186459995aa")
!570 = !DINamespace(name: "methods", scope: !571)
!571 = !DINamespace(name: "char", scope: !64)
!572 = !DISubroutineType(types: !573)
!573 = !{!560, !260, !560}
!574 = !{!575, !576, !577, !579, !582, !584, !585, !587, !588, !589, !591, !592, !593}
!575 = !DILocalVariable(name: "code", arg: 1, scope: !568, file: !569, line: 1729, type: !260)
!576 = !DILocalVariable(name: "dst", arg: 2, scope: !568, file: !569, line: 1729, type: !560)
!577 = !DILocalVariable(name: "len", scope: !578, file: !569, line: 1730, type: !9, align: 8)
!578 = distinct !DILexicalBlock(scope: !568, file: !569, line: 1730, column: 5)
!579 = !DILocalVariable(name: "a", scope: !580, file: !569, line: 1732, type: !581, align: 8)
!580 = distinct !DILexicalBlock(scope: !578, file: !569, line: 1732, column: 9)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!582 = !DILocalVariable(name: "a", scope: !583, file: !569, line: 1735, type: !581, align: 8)
!583 = distinct !DILexicalBlock(scope: !578, file: !569, line: 1735, column: 9)
!584 = !DILocalVariable(name: "b", scope: !583, file: !569, line: 1735, type: !581, align: 8)
!585 = !DILocalVariable(name: "a", scope: !586, file: !569, line: 1739, type: !581, align: 8)
!586 = distinct !DILexicalBlock(scope: !578, file: !569, line: 1739, column: 9)
!587 = !DILocalVariable(name: "b", scope: !586, file: !569, line: 1739, type: !581, align: 8)
!588 = !DILocalVariable(name: "c", scope: !586, file: !569, line: 1739, type: !581, align: 8)
!589 = !DILocalVariable(name: "a", scope: !590, file: !569, line: 1744, type: !581, align: 8)
!590 = distinct !DILexicalBlock(scope: !578, file: !569, line: 1744, column: 9)
!591 = !DILocalVariable(name: "b", scope: !590, file: !569, line: 1744, type: !581, align: 8)
!592 = !DILocalVariable(name: "c", scope: !590, file: !569, line: 1744, type: !581, align: 8)
!593 = !DILocalVariable(name: "d", scope: !590, file: !569, line: 1744, type: !581, align: 8)
!594 = !DILocation(line: 1729, column: 24, scope: !568)
!595 = !DILocation(line: 1729, column: 35, scope: !568)
!596 = !DILocation(line: 1730, column: 9, scope: !578)
!597 = !DILocation(line: 1730, column: 24, scope: !568)
!598 = !DILocation(line: 1730, column: 15, scope: !568)
!599 = !DILocation(line: 1731, column: 12, scope: !578)
!600 = !DILocation(line: 1731, column: 22, scope: !578)
!601 = !DILocation(line: 1731, column: 11, scope: !578)
!602 = !DILocation(line: 1731, column: 5, scope: !578)
!603 = !DILocation(line: 1750, column: 14, scope: !578)
!604 = !DILocation(line: 1754, column: 13, scope: !578)
!605 = !DILocation(line: 1732, column: 13, scope: !578)
!606 = !DILocation(line: 1735, column: 13, scope: !578)
!607 = !DILocation(line: 1739, column: 13, scope: !578)
!608 = !DILocation(line: 1744, column: 13, scope: !578)
!609 = !DILocation(line: 1744, column: 14, scope: !578)
!610 = !DILocation(line: 1744, column: 14, scope: !590)
!611 = !DILocation(line: 1744, column: 17, scope: !578)
!612 = !DILocation(line: 1744, column: 17, scope: !590)
!613 = !DILocation(line: 1744, column: 20, scope: !578)
!614 = !DILocation(line: 1744, column: 20, scope: !590)
!615 = !DILocation(line: 1744, column: 23, scope: !578)
!616 = !DILocation(line: 1744, column: 23, scope: !590)
!617 = !DILocation(line: 1745, column: 19, scope: !590)
!618 = !DILocation(line: 1745, column: 18, scope: !590)
!619 = !DILocation(line: 1745, column: 13, scope: !590)
!620 = !DILocation(line: 1746, column: 19, scope: !590)
!621 = !DILocation(line: 1746, column: 18, scope: !590)
!622 = !DILocation(line: 1746, column: 13, scope: !590)
!623 = !DILocation(line: 1747, column: 19, scope: !590)
!624 = !DILocation(line: 1747, column: 18, scope: !590)
!625 = !DILocation(line: 1747, column: 13, scope: !590)
!626 = !DILocation(line: 1748, column: 19, scope: !590)
!627 = !DILocation(line: 1748, column: 18, scope: !590)
!628 = !DILocation(line: 1748, column: 13, scope: !590)
!629 = !DILocation(line: 1749, column: 9, scope: !578)
!630 = !DILocation(line: 1757, column: 16, scope: !578)
!631 = !DILocation(line: 1757, column: 14, scope: !578)
!632 = !DILocation(line: 1757, column: 10, scope: !578)
!633 = !DILocation(line: 1758, column: 2, scope: !568)
!634 = !DILocation(line: 1739, column: 14, scope: !578)
!635 = !DILocation(line: 1739, column: 14, scope: !586)
!636 = !DILocation(line: 1739, column: 17, scope: !578)
!637 = !DILocation(line: 1739, column: 17, scope: !586)
!638 = !DILocation(line: 1739, column: 20, scope: !578)
!639 = !DILocation(line: 1739, column: 20, scope: !586)
!640 = !DILocation(line: 1740, column: 19, scope: !586)
!641 = !DILocation(line: 1740, column: 18, scope: !586)
!642 = !DILocation(line: 1740, column: 13, scope: !586)
!643 = !DILocation(line: 1741, column: 19, scope: !586)
!644 = !DILocation(line: 1741, column: 18, scope: !586)
!645 = !DILocation(line: 1741, column: 13, scope: !586)
!646 = !DILocation(line: 1742, column: 19, scope: !586)
!647 = !DILocation(line: 1742, column: 18, scope: !586)
!648 = !DILocation(line: 1742, column: 13, scope: !586)
!649 = !DILocation(line: 1743, column: 9, scope: !578)
!650 = !DILocation(line: 1735, column: 14, scope: !578)
!651 = !DILocation(line: 1735, column: 14, scope: !583)
!652 = !DILocation(line: 1735, column: 17, scope: !578)
!653 = !DILocation(line: 1735, column: 17, scope: !583)
!654 = !DILocation(line: 1736, column: 19, scope: !583)
!655 = !DILocation(line: 1736, column: 18, scope: !583)
!656 = !DILocation(line: 1736, column: 13, scope: !583)
!657 = !DILocation(line: 1737, column: 19, scope: !583)
!658 = !DILocation(line: 1737, column: 18, scope: !583)
!659 = !DILocation(line: 1737, column: 13, scope: !583)
!660 = !DILocation(line: 1738, column: 9, scope: !578)
!661 = !DILocation(line: 1732, column: 14, scope: !578)
!662 = !DILocation(line: 1732, column: 14, scope: !580)
!663 = !DILocation(line: 1733, column: 18, scope: !580)
!664 = !DILocation(line: 1733, column: 13, scope: !580)
!665 = !DILocation(line: 1734, column: 9, scope: !578)
!666 = distinct !DISubprogram(name: "encode_utf8", linkageName: "_ZN4core4char7methods22_$LT$impl$u20$char$GT$11encode_utf817hcde5c94024c8f405E", scope: !667, file: !569, line: 661, type: !668, scopeLine: 661, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !670)
!667 = !DINamespace(name: "{impl#0}", scope: !570)
!668 = !DISubroutineType(types: !669)
!669 = !{!556, !257, !560}
!670 = !{!671, !672}
!671 = !DILocalVariable(name: "self", arg: 1, scope: !666, file: !569, line: 661, type: !257)
!672 = !DILocalVariable(name: "dst", arg: 2, scope: !666, file: !569, line: 661, type: !560)
!673 = !DILocation(line: 661, column: 24, scope: !666)
!674 = !DILocation(line: 661, column: 30, scope: !666)
!675 = !DILocation(line: 663, column: 42, scope: !666)
!676 = !DILocation(line: 663, column: 18, scope: !666)
!677 = !DILocation(line: 664, column: 6, scope: !666)
!678 = distinct !DISubprogram(name: "len_utf8", linkageName: "_ZN4core4char7methods8len_utf817h829742c7934bf82bE", scope: !570, file: !569, line: 1701, type: !679, scopeLine: 1701, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{!9, !260}
!681 = !{!682}
!682 = !DILocalVariable(name: "code", arg: 1, scope: !678, file: !569, line: 1701, type: !260)
!683 = !DILocation(line: 1701, column: 19, scope: !678)
!684 = !DILocation(line: 1702, column: 8, scope: !678)
!685 = !DILocation(line: 1704, column: 15, scope: !678)
!686 = !DILocation(line: 1703, column: 9, scope: !678)
!687 = !DILocation(line: 1702, column: 5, scope: !678)
!688 = !DILocation(line: 1711, column: 2, scope: !678)
!689 = !DILocation(line: 1706, column: 15, scope: !678)
!690 = !DILocation(line: 1705, column: 9, scope: !678)
!691 = !DILocation(line: 1704, column: 12, scope: !678)
!692 = !DILocation(line: 1709, column: 9, scope: !678)
!693 = !DILocation(line: 1706, column: 12, scope: !678)
!694 = !DILocation(line: 1707, column: 9, scope: !678)
!695 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17hde1f94bbcc9d1b51E", scope: !697, file: !696, line: 100, type: !698, scopeLine: 100, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !27)
!696 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "919d4dd3c27345ba2df03215cc05853a")
!697 = !DINamespace(name: "hint", scope: !64)
!698 = !DISubroutineType(types: !699)
!699 = !{null}
!700 = !DILocation(line: 2223, column: 21, scope: !701, inlinedAt: !704)
!701 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core4hint21unreachable_unchecked7runtime17h61f697895d18f193E", scope: !703, file: !702, line: 2220, type: !698, scopeLine: 2220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !27)
!702 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "4abbeae67c6fb4d14cc68e0d4aa02635")
!703 = !DINamespace(name: "unreachable_unchecked", scope: !697)
!704 = distinct !DILocation(line: 104, column: 9, scope: !695)
!705 = !DILocation(line: 105, column: 9, scope: !695)
!706 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic10AtomicBool21compare_exchange_weak17hcf465741eaf380f0E", scope: !128, file: !707, line: 673, type: !708, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !726)
!707 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "4581c9e17d1d7345538dbdcedb267df1")
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !534, !340, !340, !167, !167}
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<bool, bool>", scope: !181, file: !2, size: 16, align: 8, elements: !711, templateParams: !27, identifier: "5c17ff4c893e4aa01d7e1c4fbc1b2495")
!711 = !{!712}
!712 = !DICompositeType(tag: DW_TAG_variant_part, scope: !710, file: !2, size: 16, align: 8, elements: !713, templateParams: !27, identifier: "753372ca75133c9d6442448a947a50fc", discriminator: !725)
!713 = !{!714, !721}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !712, file: !2, baseType: !715, size: 16, align: 8, extraData: i64 0)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !710, file: !2, size: 16, align: 8, elements: !716, templateParams: !718, identifier: "7e7335b6fb191dd741c3b738f02c79a6")
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !715, file: !2, baseType: !340, size: 8, align: 8, offset: 8)
!718 = !{!719, !720}
!719 = !DITemplateTypeParameter(name: "T", type: !340)
!720 = !DITemplateTypeParameter(name: "E", type: !340)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !712, file: !2, baseType: !722, size: 16, align: 8, extraData: i64 1)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !710, file: !2, size: 16, align: 8, elements: !723, templateParams: !718, identifier: "c2f66bbe6b64669c00c1e23abd84b0e")
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !722, file: !2, baseType: !340, size: 8, align: 8, offset: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!726 = !{!727, !728, !729, !730, !731, !732, !734}
!727 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !707, line: 674, type: !534)
!728 = !DILocalVariable(name: "current", arg: 2, scope: !706, file: !707, line: 675, type: !340)
!729 = !DILocalVariable(name: "new", arg: 3, scope: !706, file: !707, line: 676, type: !340)
!730 = !DILocalVariable(name: "success", arg: 4, scope: !706, file: !707, line: 677, type: !167)
!731 = !DILocalVariable(name: "failure", arg: 5, scope: !706, file: !707, line: 678, type: !167)
!732 = !DILocalVariable(name: "x", scope: !733, file: !707, line: 684, type: !39, align: 1)
!733 = distinct !DILexicalBlock(scope: !706, file: !707, line: 684, column: 13)
!734 = !DILocalVariable(name: "x", scope: !735, file: !707, line: 685, type: !39, align: 1)
!735 = distinct !DILexicalBlock(scope: !706, file: !707, line: 685, column: 13)
!736 = !DILocation(line: 674, column: 9, scope: !706)
!737 = !DILocation(line: 675, column: 9, scope: !706)
!738 = !DILocation(line: 676, column: 9, scope: !706)
!739 = !DILocation(line: 677, column: 9, scope: !706)
!740 = !DILocation(line: 678, column: 9, scope: !706)
!741 = !DILocalVariable(name: "self", arg: 1, scope: !742, file: !480, line: 1995, type: !746)
!742 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17he702c007a3a142c3E", scope: !131, file: !480, line: 1995, type: !743, scopeLine: 1995, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !134, retainedNodes: !747)
!743 = !DISubroutineType(types: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u8>", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !{!741}
!748 = !DILocation(line: 1995, column: 22, scope: !742, inlinedAt: !749)
!749 = distinct !DILocation(line: 682, column: 42, scope: !706)
!750 = !DILocation(line: 682, column: 56, scope: !706)
!751 = !DILocation(line: 682, column: 71, scope: !706)
!752 = !DILocation(line: 682, column: 13, scope: !706)
!753 = !DILocation(line: 681, column: 15, scope: !706)
!754 = !DILocation(line: 681, column: 9, scope: !706)
!755 = !DILocation(line: 684, column: 16, scope: !706)
!756 = !DILocation(line: 684, column: 16, scope: !733)
!757 = !DILocation(line: 684, column: 25, scope: !733)
!758 = !DILocation(line: 684, column: 22, scope: !733)
!759 = !DILocation(line: 684, column: 31, scope: !706)
!760 = !DILocation(line: 685, column: 17, scope: !706)
!761 = !DILocation(line: 685, column: 17, scope: !735)
!762 = !DILocation(line: 685, column: 27, scope: !735)
!763 = !DILocation(line: 685, column: 23, scope: !735)
!764 = !DILocation(line: 685, column: 33, scope: !706)
!765 = !DILocation(line: 687, column: 6, scope: !706)
!766 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core4sync6atomic10AtomicBool3new17hf61e16bd24bf9627E", scope: !128, file: !707, line: 304, type: !767, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!128, !340}
!769 = !{!770}
!770 = !DILocalVariable(name: "v", arg: 1, scope: !766, file: !707, line: 304, type: !340)
!771 = !DILocation(line: 304, column: 22, scope: !766)
!772 = !DILocation(line: 305, column: 41, scope: !766)
!773 = !DILocalVariable(name: "value", arg: 1, scope: !774, file: !480, line: 1952, type: !39)
!774 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h8e457dd5fab5c506E", scope: !131, file: !480, line: 1952, type: !775, scopeLine: 1952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !134, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!131, !39}
!777 = !{!773}
!778 = !DILocation(line: 1952, column: 22, scope: !774, inlinedAt: !779)
!779 = distinct !DILocation(line: 305, column: 25, scope: !766)
!780 = !DILocation(line: 1953, column: 9, scope: !774, inlinedAt: !779)
!781 = !DILocation(line: 1954, column: 6, scope: !774, inlinedAt: !779)
!782 = !DILocation(line: 305, column: 9, scope: !766)
!783 = !DILocation(line: 306, column: 6, scope: !766)
!784 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic10AtomicBool4load17he86f8e42ce9009b9E", scope: !128, file: !707, line: 453, type: !785, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!340, !534, !167}
!787 = !{!788, !789}
!788 = !DILocalVariable(name: "self", arg: 1, scope: !784, file: !707, line: 453, type: !534)
!789 = !DILocalVariable(name: "order", arg: 2, scope: !784, file: !707, line: 453, type: !167)
!790 = !DILocation(line: 453, column: 17, scope: !784)
!791 = !DILocation(line: 453, column: 24, scope: !784)
!792 = !DILocation(line: 1995, column: 22, scope: !742, inlinedAt: !793)
!793 = distinct !DILocation(line: 456, column: 30, scope: !784)
!794 = !DILocation(line: 456, column: 18, scope: !784)
!795 = !DILocation(line: 457, column: 6, scope: !784)
!796 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h81191b8fc76e9d7dE", scope: !128, file: !707, line: 481, type: !797, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !534, !340, !167}
!799 = !{!800, !801, !802}
!800 = !DILocalVariable(name: "self", arg: 1, scope: !796, file: !707, line: 481, type: !534)
!801 = !DILocalVariable(name: "val", arg: 2, scope: !796, file: !707, line: 481, type: !340)
!802 = !DILocalVariable(name: "order", arg: 3, scope: !796, file: !707, line: 481, type: !167)
!803 = !DILocation(line: 481, column: 18, scope: !796)
!804 = !DILocation(line: 481, column: 25, scope: !796)
!805 = !DILocation(line: 481, column: 36, scope: !796)
!806 = !DILocation(line: 1995, column: 22, scope: !742, inlinedAt: !807)
!807 = distinct !DILocation(line: 485, column: 26, scope: !796)
!808 = !DILocation(line: 485, column: 40, scope: !796)
!809 = !DILocation(line: 485, column: 13, scope: !796)
!810 = !DILocation(line: 487, column: 6, scope: !796)
!811 = distinct !DISubprogram(name: "compare_and_swap", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_and_swap17h7f20da80c3a46bfdE", scope: !89, file: !707, line: 2202, type: !812, scopeLine: 2202, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!9, !508, !9, !9, !167}
!814 = !{!815, !816, !817, !818, !819, !821}
!815 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !707, line: 2202, type: !508)
!816 = !DILocalVariable(name: "current", arg: 2, scope: !811, file: !707, line: 2203, type: !9)
!817 = !DILocalVariable(name: "new", arg: 3, scope: !811, file: !707, line: 2204, type: !9)
!818 = !DILocalVariable(name: "order", arg: 4, scope: !811, file: !707, line: 2205, type: !167)
!819 = !DILocalVariable(name: "x", scope: !820, file: !707, line: 2210, type: !9, align: 8)
!820 = distinct !DILexicalBlock(scope: !811, file: !707, line: 2210, column: 21)
!821 = !DILocalVariable(name: "x", scope: !822, file: !707, line: 2211, type: !9, align: 8)
!822 = distinct !DILexicalBlock(scope: !811, file: !707, line: 2211, column: 21)
!823 = !DILocation(line: 2202, column: 37, scope: !811)
!824 = !DILocation(line: 2203, column: 37, scope: !811)
!825 = !DILocation(line: 2204, column: 37, scope: !811)
!826 = !DILocation(line: 2205, column: 37, scope: !811)
!827 = !DILocation(line: 2209, column: 45, scope: !811)
!828 = !{i8 0, i8 5}
!829 = !DILocation(line: 2206, column: 23, scope: !811)
!830 = !{i64 0, i64 2}
!831 = !DILocation(line: 2206, column: 17, scope: !811)
!832 = !DILocation(line: 2210, column: 24, scope: !811)
!833 = !DILocation(line: 2210, column: 24, scope: !820)
!834 = !DILocation(line: 2210, column: 30, scope: !820)
!835 = !DILocation(line: 2210, column: 30, scope: !811)
!836 = !DILocation(line: 2211, column: 25, scope: !811)
!837 = !DILocation(line: 2211, column: 25, scope: !822)
!838 = !DILocation(line: 2211, column: 31, scope: !822)
!839 = !DILocation(line: 2211, column: 31, scope: !811)
!840 = !DILocation(line: 2213, column: 14, scope: !811)
!841 = distinct !DISubprogram(name: "compare_exchange", linkageName: "_ZN4core4sync6atomic11AtomicUsize16compare_exchange17hf41df64d564f85fdE", scope: !89, file: !707, line: 2256, type: !842, scopeLine: 2256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !859)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !508, !9, !9, !167, !167}
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, usize>", scope: !181, file: !2, size: 128, align: 64, elements: !845, templateParams: !27, identifier: "cf147ba0c2ae56626a70d76b1573ad95")
!845 = !{!846}
!846 = !DICompositeType(tag: DW_TAG_variant_part, scope: !844, file: !2, size: 128, align: 64, elements: !847, templateParams: !27, identifier: "21385a4ca356d31378898d7cc0fffba0", discriminator: !858)
!847 = !{!848, !854}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !846, file: !2, baseType: !849, size: 128, align: 64, extraData: i64 0)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !844, file: !2, size: 128, align: 64, elements: !850, templateParams: !852, identifier: "d99b3372d68eb04e80063459a1117c6a")
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !849, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!852 = !{!99, !853}
!853 = !DITemplateTypeParameter(name: "E", type: !9)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !846, file: !2, baseType: !855, size: 128, align: 64, extraData: i64 1)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !844, file: !2, size: 128, align: 64, elements: !856, templateParams: !852, identifier: "b63fdaeacfc80664da1a511d21d5d5c1")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, scope: !844, file: !2, baseType: !149, size: 64, align: 64, flags: DIFlagArtificial)
!859 = !{!860, !861, !862, !863, !864}
!860 = !DILocalVariable(name: "self", arg: 1, scope: !841, file: !707, line: 2256, type: !508)
!861 = !DILocalVariable(name: "current", arg: 2, scope: !841, file: !707, line: 2257, type: !9)
!862 = !DILocalVariable(name: "new", arg: 3, scope: !841, file: !707, line: 2258, type: !9)
!863 = !DILocalVariable(name: "success", arg: 4, scope: !841, file: !707, line: 2259, type: !167)
!864 = !DILocalVariable(name: "failure", arg: 5, scope: !841, file: !707, line: 2260, type: !167)
!865 = !DILocation(line: 2256, column: 37, scope: !841)
!866 = !DILocation(line: 2257, column: 37, scope: !841)
!867 = !DILocation(line: 2258, column: 37, scope: !841)
!868 = !DILocation(line: 2259, column: 37, scope: !841)
!869 = !DILocation(line: 2260, column: 37, scope: !841)
!870 = !DILocalVariable(name: "self", arg: 1, scope: !871, file: !480, line: 1995, type: !875)
!871 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h865cb914548ff74fE", scope: !94, file: !480, line: 1995, type: !872, scopeLine: 1995, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !98, retainedNodes: !876)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!876 = !{!870}
!877 = !DILocation(line: 1995, column: 22, scope: !871, inlinedAt: !878)
!878 = distinct !DILocation(line: 2262, column: 50, scope: !841)
!879 = !DILocation(line: 2262, column: 26, scope: !841)
!880 = !DILocation(line: 2263, column: 14, scope: !841)
!881 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hf96beb8d6d83bd19E", scope: !89, file: !707, line: 2089, type: !882, scopeLine: 2089, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!9, !508, !167}
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "self", arg: 1, scope: !881, file: !707, line: 2089, type: !508)
!886 = !DILocalVariable(name: "order", arg: 2, scope: !881, file: !707, line: 2089, type: !167)
!887 = !DILocation(line: 2089, column: 25, scope: !881)
!888 = !DILocation(line: 2089, column: 32, scope: !881)
!889 = !DILocation(line: 1995, column: 22, scope: !871, inlinedAt: !890)
!890 = distinct !DILocation(line: 2091, column: 38, scope: !881)
!891 = !DILocation(line: 2091, column: 26, scope: !881)
!892 = !DILocation(line: 2092, column: 14, scope: !881)
!893 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h1e308e6890caa30dE", scope: !89, file: !707, line: 2116, type: !894, scopeLine: 2116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !508, !9, !167}
!896 = !{!897, !898, !899}
!897 = !DILocalVariable(name: "self", arg: 1, scope: !893, file: !707, line: 2116, type: !508)
!898 = !DILocalVariable(name: "val", arg: 2, scope: !893, file: !707, line: 2116, type: !9)
!899 = !DILocalVariable(name: "order", arg: 3, scope: !893, file: !707, line: 2116, type: !167)
!900 = !DILocation(line: 2116, column: 26, scope: !893)
!901 = !DILocation(line: 2116, column: 33, scope: !893)
!902 = !DILocation(line: 2116, column: 49, scope: !893)
!903 = !DILocation(line: 1995, column: 22, scope: !871, inlinedAt: !904)
!904 = distinct !DILocation(line: 2118, column: 39, scope: !893)
!905 = !DILocation(line: 2118, column: 26, scope: !893)
!906 = !DILocation(line: 2119, column: 14, scope: !893)
!907 = distinct !DISubprogram(name: "spin_loop_hint", linkageName: "_ZN4core4sync6atomic14spin_loop_hint17he5cfb009716766abE", scope: !90, file: !707, line: 3454, type: !698, scopeLine: 3454, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !27)
!908 = !DILocation(line: 175, column: 18, scope: !909, inlinedAt: !910)
!909 = distinct !DISubprogram(name: "spin_loop", linkageName: "_ZN4core4hint9spin_loop17h68bdd19d340776c6E", scope: !697, file: !696, line: 165, type: !698, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !27)
!910 = distinct !DILocation(line: 3455, column: 5, scope: !907)
!911 = !DILocation(line: 3456, column: 2, scope: !907)
!912 = distinct !DISubprogram(name: "atomic_compare_exchange<usize>", linkageName: "_ZN4core4sync6atomic23atomic_compare_exchange17h76a48fb2c47bcba6E", scope: !90, file: !707, line: 3049, type: !913, scopeLine: 3049, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !98, retainedNodes: !915)
!913 = !DISubroutineType(types: !914)
!914 = !{!844, !874, !9, !9, !167, !167}
!915 = !{!916, !917, !918, !919, !920, !921, !923}
!916 = !DILocalVariable(name: "dst", arg: 1, scope: !912, file: !707, line: 3050, type: !874)
!917 = !DILocalVariable(name: "old", arg: 2, scope: !912, file: !707, line: 3051, type: !9)
!918 = !DILocalVariable(name: "new", arg: 3, scope: !912, file: !707, line: 3052, type: !9)
!919 = !DILocalVariable(name: "success", arg: 4, scope: !912, file: !707, line: 3053, type: !167)
!920 = !DILocalVariable(name: "failure", arg: 5, scope: !912, file: !707, line: 3054, type: !167)
!921 = !DILocalVariable(name: "val", scope: !922, file: !707, line: 3057, type: !9, align: 8)
!922 = distinct !DILexicalBlock(scope: !912, file: !707, line: 3057, column: 5)
!923 = !DILocalVariable(name: "ok", scope: !922, file: !707, line: 3057, type: !340, align: 1)
!924 = !DILocation(line: 3050, column: 5, scope: !912)
!925 = !DILocation(line: 3051, column: 5, scope: !912)
!926 = !DILocation(line: 3052, column: 5, scope: !912)
!927 = !DILocation(line: 3053, column: 5, scope: !912)
!928 = !DILocation(line: 3054, column: 5, scope: !912)
!929 = !DILocation(line: 3058, column: 15, scope: !912)
!930 = !DILocation(line: 3058, column: 9, scope: !912)
!931 = !DILocation(line: 3071, column: 34, scope: !912)
!932 = !DILocation(line: 3072, column: 34, scope: !912)
!933 = !DILocation(line: 3073, column: 33, scope: !912)
!934 = !DILocation(line: 3057, column: 10, scope: !912)
!935 = !DILocation(line: 3057, column: 10, scope: !922)
!936 = !DILocation(line: 3057, column: 15, scope: !912)
!937 = !DILocation(line: 3057, column: 15, scope: !922)
!938 = !DILocation(line: 3078, column: 8, scope: !922)
!939 = !DILocation(line: 3068, column: 34, scope: !912)
!940 = !DILocation(line: 3069, column: 34, scope: !912)
!941 = !DILocation(line: 3070, column: 33, scope: !912)
!942 = !DILocation(line: 3062, column: 35, scope: !912)
!943 = !DILocation(line: 3063, column: 35, scope: !912)
!944 = !DILocation(line: 3064, column: 34, scope: !912)
!945 = !DILocation(line: 3065, column: 35, scope: !912)
!946 = !DILocation(line: 3066, column: 35, scope: !912)
!947 = !DILocation(line: 3067, column: 34, scope: !912)
!948 = !DILocation(line: 3059, column: 35, scope: !912)
!949 = !DILocation(line: 3060, column: 35, scope: !912)
!950 = !DILocation(line: 3061, column: 34, scope: !912)
!951 = !DILocation(line: 3075, column: 29, scope: !912)
!952 = !DILocation(line: 3074, column: 28, scope: !912)
!953 = !DILocation(line: 3078, column: 30, scope: !922)
!954 = !DILocation(line: 3078, column: 5, scope: !922)
!955 = !DILocation(line: 3078, column: 13, scope: !922)
!956 = !DILocation(line: 3079, column: 2, scope: !912)
!957 = distinct !DISubprogram(name: "strongest_failure_ordering", linkageName: "_ZN4core4sync6atomic26strongest_failure_ordering17h587eb964c9b13b91E", scope: !90, file: !707, line: 2956, type: !958, scopeLine: 2956, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !27, retainedNodes: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{!167, !167}
!960 = !{!961}
!961 = !DILocalVariable(name: "order", arg: 1, scope: !957, file: !707, line: 2956, type: !167)
!962 = !DILocation(line: 2956, column: 31, scope: !957)
!963 = !DILocation(line: 2957, column: 11, scope: !957)
!964 = !DILocation(line: 2957, column: 5, scope: !957)
!965 = !DILocation(line: 2959, column: 20, scope: !957)
!966 = !DILocation(line: 2958, column: 20, scope: !957)
!967 = !DILocation(line: 2961, column: 20, scope: !957)
!968 = !DILocation(line: 2962, column: 19, scope: !957)
!969 = !DILocation(line: 2960, column: 19, scope: !957)
!970 = !DILocation(line: 2964, column: 2, scope: !957)
!971 = distinct !DISubprogram(name: "atomic_compare_exchange_weak<u8>", linkageName: "_ZN4core4sync6atomic28atomic_compare_exchange_weak17ha929636b3622b90bE", scope: !90, file: !707, line: 3084, type: !972, scopeLine: 3084, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !134, retainedNodes: !989)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !745, !39, !39, !167, !167}
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u8, u8>", scope: !181, file: !2, size: 16, align: 8, elements: !975, templateParams: !27, identifier: "bed445696496916385148423b579811f")
!975 = !{!976}
!976 = !DICompositeType(tag: DW_TAG_variant_part, scope: !974, file: !2, size: 16, align: 8, elements: !977, templateParams: !27, identifier: "a2f2dd738d8658495b2e96b201028946", discriminator: !988)
!977 = !{!978, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !976, file: !2, baseType: !979, size: 16, align: 8, extraData: i64 0)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !974, file: !2, size: 16, align: 8, elements: !980, templateParams: !982, identifier: "70a7e5850289b875350ca1c14cc4dd0c")
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !979, file: !2, baseType: !39, size: 8, align: 8, offset: 8)
!982 = !{!135, !983}
!983 = !DITemplateTypeParameter(name: "E", type: !39)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !976, file: !2, baseType: !985, size: 16, align: 8, extraData: i64 1)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !974, file: !2, size: 16, align: 8, elements: !986, templateParams: !982, identifier: "84365fcea0217b96e5113c3c58288269")
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !985, file: !2, baseType: !39, size: 8, align: 8, offset: 8)
!988 = !DIDerivedType(tag: DW_TAG_member, scope: !974, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagArtificial)
!989 = !{!990, !991, !992, !993, !994, !995, !997}
!990 = !DILocalVariable(name: "dst", arg: 1, scope: !971, file: !707, line: 3085, type: !745)
!991 = !DILocalVariable(name: "old", arg: 2, scope: !971, file: !707, line: 3086, type: !39)
!992 = !DILocalVariable(name: "new", arg: 3, scope: !971, file: !707, line: 3087, type: !39)
!993 = !DILocalVariable(name: "success", arg: 4, scope: !971, file: !707, line: 3088, type: !167)
!994 = !DILocalVariable(name: "failure", arg: 5, scope: !971, file: !707, line: 3089, type: !167)
!995 = !DILocalVariable(name: "val", scope: !996, file: !707, line: 3092, type: !39, align: 1)
!996 = distinct !DILexicalBlock(scope: !971, file: !707, line: 3092, column: 5)
!997 = !DILocalVariable(name: "ok", scope: !996, file: !707, line: 3092, type: !340, align: 1)
!998 = !DILocation(line: 3085, column: 5, scope: !971)
!999 = !DILocation(line: 3086, column: 5, scope: !971)
!1000 = !DILocation(line: 3087, column: 5, scope: !971)
!1001 = !DILocation(line: 3088, column: 5, scope: !971)
!1002 = !DILocation(line: 3089, column: 5, scope: !971)
!1003 = !DILocation(line: 3093, column: 15, scope: !971)
!1004 = !DILocation(line: 3093, column: 9, scope: !971)
!1005 = !DILocation(line: 3106, column: 34, scope: !971)
!1006 = !DILocation(line: 3107, column: 34, scope: !971)
!1007 = !DILocation(line: 3108, column: 33, scope: !971)
!1008 = !DILocation(line: 3092, column: 10, scope: !971)
!1009 = !DILocation(line: 3092, column: 10, scope: !996)
!1010 = !DILocation(line: 3092, column: 15, scope: !971)
!1011 = !DILocation(line: 3092, column: 15, scope: !996)
!1012 = !DILocation(line: 3113, column: 8, scope: !996)
!1013 = !DILocation(line: 3103, column: 34, scope: !971)
!1014 = !DILocation(line: 3104, column: 34, scope: !971)
!1015 = !DILocation(line: 3105, column: 33, scope: !971)
!1016 = !DILocation(line: 3097, column: 35, scope: !971)
!1017 = !DILocation(line: 3098, column: 35, scope: !971)
!1018 = !DILocation(line: 3099, column: 34, scope: !971)
!1019 = !DILocation(line: 3100, column: 35, scope: !971)
!1020 = !DILocation(line: 3101, column: 35, scope: !971)
!1021 = !DILocation(line: 3102, column: 34, scope: !971)
!1022 = !DILocation(line: 3094, column: 35, scope: !971)
!1023 = !DILocation(line: 3095, column: 35, scope: !971)
!1024 = !DILocation(line: 3096, column: 34, scope: !971)
!1025 = !DILocation(line: 3110, column: 29, scope: !971)
!1026 = !DILocation(line: 3109, column: 28, scope: !971)
!1027 = !DILocation(line: 3113, column: 30, scope: !996)
!1028 = !DILocation(line: 3113, column: 5, scope: !996)
!1029 = !DILocation(line: 3113, column: 13, scope: !996)
!1030 = !DILocation(line: 3114, column: 2, scope: !971)
!1031 = distinct !DISubprogram(name: "as_ref<spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17hd26b5ba12a2dce85E", scope: !104, file: !1032, line: 673, type: !1033, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !156, templateParams: !111, retainedNodes: !1050)
!1032 = !DIFile(filename: "/Users/yaw/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfd297b9c6b096408864871383128e79")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035, !1049}
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&spin::mutex::Mutex<vga::Screen, spin::relax::Spin>>", scope: !105, file: !2, size: 64, align: 64, elements: !1036, templateParams: !27, identifier: "e32b1f3c2a1c1dfdc6e4f1c01d41f2ea")
!1036 = !{!1037}
